#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBIngameSub_MovementGRN

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_AJBIngameSub_MovementGRN.ABP_AJBInGameSub_MovementGRN_C.ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN
// 0x0030 (0x0030 - 0x0000)
struct ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBOverGrowSkill_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN) == 0x000008, "Wrong alignment on ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN");
static_assert(sizeof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN) == 0x000030, "Wrong size on ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, EntryPoint) == 0x000000, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ABP_AJBInGameSub_MovementGRN_C_ExecuteUbergraph_ABP_AJBInGameSub_MovementGRN::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_AJBIngameSub_MovementGRN.ABP_AJBInGameSub_MovementGRN_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBInGameSub_MovementGRN_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

