#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DDWLeg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_DDWLeg.ABP_DDWLeg_C
// 0x0178 (0x04D0 - 0x0358)
class UABP_DDWLeg_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_976F71D0443E7D3A6F09FABF16E9F6D1; // 0x0368(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_148EA8404A7847867ADFE9951256A06B; // 0x03B0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0D2D19B340C0072230A566B09CCC7FAA; // 0x0460(0x0070)()

public:
	void ExecuteUbergraph_ABP_DDWLeg(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_DDWLeg_C">();
	}
	static class UABP_DDWLeg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_DDWLeg_C>();
	}
};
static_assert(alignof(UABP_DDWLeg_C) == 0x000008, "Wrong alignment on UABP_DDWLeg_C");
static_assert(sizeof(UABP_DDWLeg_C) == 0x0004D0, "Wrong size on UABP_DDWLeg_C");
static_assert(offsetof(UABP_DDWLeg_C, UberGraphFrame) == 0x000360, "Member 'UABP_DDWLeg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_DDWLeg_C, AnimGraphNode_Root_976F71D0443E7D3A6F09FABF16E9F6D1) == 0x000368, "Member 'UABP_DDWLeg_C::AnimGraphNode_Root_976F71D0443E7D3A6F09FABF16E9F6D1' has a wrong offset!");
static_assert(offsetof(UABP_DDWLeg_C, AnimGraphNode_SequencePlayer_148EA8404A7847867ADFE9951256A06B) == 0x0003B0, "Member 'UABP_DDWLeg_C::AnimGraphNode_SequencePlayer_148EA8404A7847867ADFE9951256A06B' has a wrong offset!");
static_assert(offsetof(UABP_DDWLeg_C, AnimGraphNode_Slot_0D2D19B340C0072230A566B09CCC7FAA) == 0x000460, "Member 'UABP_DDWLeg_C::AnimGraphNode_Slot_0D2D19B340C0072230A566B09CCC7FAA' has a wrong offset!");

}

