#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_CSR

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_CSR.ABP_AJBPostProcessHuman_RBControlled_CSR_C
// 0x0708 (0x0A60 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_CSR_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2EAC6D0F4B5EE5D02457B7BFCD516F72; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_46277D9246CF3C7CDDEBFB9853D73F05; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C76AE0014483CE217D3AF59443D22C9A; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_030998C345B84C73D771D79F3DF66523; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_EB8D951E453AC2B56F5529BA23DCD920; // 0x09E0(0x0068)()
	bool                                          bDisableRigidBodyByJump;                           // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByChangeWalkingState;             // 0x0A49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByCrouch;                         // 0x0A4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByDirection;                      // 0x0A4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RigidBodyAlpha;                                    // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigidBodyAlpha_InterpSpeed;                        // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableRigidBodyByEmote;                          // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCompletedBind;                                    // 0x0A55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_CSR(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_CSR_AnimGraphNode_RigidBody_46277D9246CF3C7CDDEBFB9853D73F05();
	void OnJump();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBPostProcessHuman_RBControlled_CSR_C">();
	}
	static class UABP_AJBPostProcessHuman_RBControlled_CSR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_CSR_C>();
	}
};
static_assert(alignof(UABP_AJBPostProcessHuman_RBControlled_CSR_C) == 0x000010, "Wrong alignment on UABP_AJBPostProcessHuman_RBControlled_CSR_C");
static_assert(sizeof(UABP_AJBPostProcessHuman_RBControlled_CSR_C) == 0x000A60, "Wrong size on UABP_AJBPostProcessHuman_RBControlled_CSR_C");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, AnimGraphNode_Root_2EAC6D0F4B5EE5D02457B7BFCD516F72) == 0x000368, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::AnimGraphNode_Root_2EAC6D0F4B5EE5D02457B7BFCD516F72' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, AnimGraphNode_RigidBody_46277D9246CF3C7CDDEBFB9853D73F05) == 0x0003B0, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::AnimGraphNode_RigidBody_46277D9246CF3C7CDDEBFB9853D73F05' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, AnimGraphNode_ComponentToLocalSpace_C76AE0014483CE217D3AF59443D22C9A) == 0x000950, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::AnimGraphNode_ComponentToLocalSpace_C76AE0014483CE217D3AF59443D22C9A' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, AnimGraphNode_LocalToComponentSpace_030998C345B84C73D771D79F3DF66523) == 0x000998, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::AnimGraphNode_LocalToComponentSpace_030998C345B84C73D771D79F3DF66523' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, AnimGraphNode_SubInput_EB8D951E453AC2B56F5529BA23DCD920) == 0x0009E0, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::AnimGraphNode_SubInput_EB8D951E453AC2B56F5529BA23DCD920' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bDisableRigidBodyByJump) == 0x000A48, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bDisableRigidBodyByJump' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bDisableRigidBodyByChangeWalkingState) == 0x000A49, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bDisableRigidBodyByChangeWalkingState' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bDisableRigidBodyByCrouch) == 0x000A4A, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bDisableRigidBodyByCrouch' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bDisableRigidBodyByDirection) == 0x000A4B, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bDisableRigidBodyByDirection' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, RigidBodyAlpha) == 0x000A4C, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::RigidBodyAlpha' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, RigidBodyAlpha_InterpSpeed) == 0x000A50, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::RigidBodyAlpha_InterpSpeed' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bDisableRigidBodyByEmote) == 0x000A54, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bDisableRigidBodyByEmote' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_CSR_C, bCompletedBind) == 0x000A55, "Member 'UABP_AJBPostProcessHuman_RBControlled_CSR_C::bCompletedBind' has a wrong offset!");

}

