#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_ABD

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function ABP_AJBPostProcessHuman_RBControlled_ABD.ABP_AJBPostProcessHuman_RBControlled_ABD_C.ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD
// 0x0048 (0x0048 - 0x0000)
struct ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWalkingState                                 Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWalkingState                                 Temp_byte_Variable1;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveBehavior_bRetValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD) == 0x000008, "Wrong alignment on ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD");
static_assert(sizeof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD) == 0x000048, "Wrong size on ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, EntryPoint) == 0x000000, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable) == 0x000004, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable1) == 0x000005, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable2) == 0x000006, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable3) == 0x000007, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable4) == 0x000008, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable5) == 0x000009, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_byte_Variable) == 0x00000A, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable6) == 0x00000B, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable7) == 0x00000C, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable8) == 0x00000D, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable9) == 0x00000E, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_bool_Variable10) == 0x00000F, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_byte_Variable1) == 0x000010, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x00002A, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_CheckActiveBehavior_bRetValue) == 0x00002C, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_CheckActiveBehavior_bRetValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_Not_PreBool_ReturnValue1) == 0x00002D, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_Select_Default) == 0x00002F, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanAND_ReturnValue1) == 0x000030, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_Select1_Default) == 0x000031, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_float_Variable) == 0x000034, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanAND_ReturnValue2) == 0x000039, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, Temp_float_Variable1) == 0x00003C, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanOR_ReturnValue1) == 0x000040, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, CallFunc_BooleanOR_ReturnValue2) == 0x000041, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD, K2Node_Select2_Default) == 0x000044, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD::K2Node_Select2_Default' has a wrong offset!");

// Function ABP_AJBPostProcessHuman_RBControlled_ABD.ABP_AJBPostProcessHuman_RBControlled_ABD_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBPostProcessHuman_RBControlled_ABD_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

