#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_DOH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_DOH.ABP_AJBInGameCharacter_DOH_C
// 0x0838 (0x0B90 - 0x0358)
class UABP_AJBInGameCharacter_DOH_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_F1C3A5A947FBF89C665013999D318D64; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_F1C3A5A947FBF89C665013999D318D64; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_F1C3A5A947FBF89C665013999D318D64; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_F1C3A5A947FBF89C665013999D318D64; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_F1C3A5A947FBF89C665013999D318D64; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_SPCIdle_F1C3A5A947FBF89C665013999D318D64; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_SPIdle_F1C3A5A947FBF89C665013999D318D64; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_F1C3A5A947FBF89C665013999D318D64; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_F1C3A5A947FBF89C665013999D318D64; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_F1C3A5A947FBF89C665013999D318D64; // 0x03B0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1577C222423BD8960C48CAB848DD695E; // 0x0478(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_613740874A8BBE132335C38D5051AC93; // 0x04C0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_AA70C0F145B9CB5AFE500795DE7326C7; // 0x0530(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_934BB1C24BD6E43661513186FF4EEAD6; // 0x0610(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21CB6ACD49C15153B694C8878BD1C7DD; // 0x06F0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54CF5E2D46B2CD09D698E59205307AFD; // 0x0740(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_1C1388434B1D3AB7735BB59B7AFA6B8E; // 0x0790(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_820CC7BB466EF88A3A5966BB7C493935; // 0x0858(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7E5786244C4BB468DA2730A5A23234A8; // 0x0928(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49E4D0F244F7D64DF0D65DA18B14C073; // 0x0A08(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_530C15B149E9C17AD8D6778672189BBA; // 0x0A58(0x0050)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_25C2E5BE40AB29BBDDC346A63C7D2F7B; // 0x0AA8(0x00E0)()
	bool                                          bUseMeshRotationOnRoadRoller;                      // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B89[0x3];                                      // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RoadRollerYaw;                                     // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_DOH(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_DOH_AnimGraphNode_BlendListByBool_820CC7BB466EF88A3A5966BB7C493935();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_DOH_AnimGraphNode_RotateRootBone_25C2E5BE40AB29BBDDC346A63C7D2F7B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameCharacter_DOH_C">();
	}
	static class UABP_AJBInGameCharacter_DOH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_DOH_C>();
	}
};
static_assert(alignof(UABP_AJBInGameCharacter_DOH_C) == 0x000008, "Wrong alignment on UABP_AJBInGameCharacter_DOH_C");
static_assert(sizeof(UABP_AJBInGameCharacter_DOH_C) == 0x000B90, "Wrong size on UABP_AJBInGameCharacter_DOH_C");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameCharacter_DOH_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_DeathLoop_F1C3A5A947FBF89C665013999D318D64) == 0x000368, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_DeathLoop_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_Dash_F1C3A5A947FBF89C665013999D318D64) == 0x000370, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_Dash_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_BS_Run_F1C3A5A947FBF89C665013999D318D64) == 0x000378, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_BS_Run_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_BS_CWalk_F1C3A5A947FBF89C665013999D318D64) == 0x000380, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_BS_CWalk_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_BS_Walk_F1C3A5A947FBF89C665013999D318D64) == 0x000388, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_BS_Walk_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_SPCIdle_F1C3A5A947FBF89C665013999D318D64) == 0x000390, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_SPCIdle_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_SPIdle_F1C3A5A947FBF89C665013999D318D64) == 0x000398, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_SPIdle_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_CIdle_F1C3A5A947FBF89C665013999D318D64) == 0x0003A0, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_CIdle_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, __SUBINSTANCE_AS_Idle_F1C3A5A947FBF89C665013999D318D64) == 0x0003A8, "Member 'UABP_AJBInGameCharacter_DOH_C::__SUBINSTANCE_AS_Idle_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_SubInstance_F1C3A5A947FBF89C665013999D318D64) == 0x0003B0, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_SubInstance_F1C3A5A947FBF89C665013999D318D64' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_Root_1577C222423BD8960C48CAB848DD695E) == 0x000478, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_Root_1577C222423BD8960C48CAB848DD695E' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_Slot_613740874A8BBE132335C38D5051AC93) == 0x0004C0, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_Slot_613740874A8BBE132335C38D5051AC93' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_LayeredBoneBlend_AA70C0F145B9CB5AFE500795DE7326C7) == 0x000530, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_LayeredBoneBlend_AA70C0F145B9CB5AFE500795DE7326C7' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_SaveCachedPose_934BB1C24BD6E43661513186FF4EEAD6) == 0x000610, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_SaveCachedPose_934BB1C24BD6E43661513186FF4EEAD6' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_UseCachedPose_21CB6ACD49C15153B694C8878BD1C7DD) == 0x0006F0, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_UseCachedPose_21CB6ACD49C15153B694C8878BD1C7DD' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_UseCachedPose_54CF5E2D46B2CD09D698E59205307AFD) == 0x000740, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_UseCachedPose_54CF5E2D46B2CD09D698E59205307AFD' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_SubInstance_1C1388434B1D3AB7735BB59B7AFA6B8E) == 0x000790, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_SubInstance_1C1388434B1D3AB7735BB59B7AFA6B8E' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_BlendListByBool_820CC7BB466EF88A3A5966BB7C493935) == 0x000858, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_BlendListByBool_820CC7BB466EF88A3A5966BB7C493935' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_SaveCachedPose_7E5786244C4BB468DA2730A5A23234A8) == 0x000928, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_SaveCachedPose_7E5786244C4BB468DA2730A5A23234A8' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_UseCachedPose_49E4D0F244F7D64DF0D65DA18B14C073) == 0x000A08, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_UseCachedPose_49E4D0F244F7D64DF0D65DA18B14C073' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_UseCachedPose_530C15B149E9C17AD8D6778672189BBA) == 0x000A58, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_UseCachedPose_530C15B149E9C17AD8D6778672189BBA' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, AnimGraphNode_RotateRootBone_25C2E5BE40AB29BBDDC346A63C7D2F7B) == 0x000AA8, "Member 'UABP_AJBInGameCharacter_DOH_C::AnimGraphNode_RotateRootBone_25C2E5BE40AB29BBDDC346A63C7D2F7B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, bUseMeshRotationOnRoadRoller) == 0x000B88, "Member 'UABP_AJBInGameCharacter_DOH_C::bUseMeshRotationOnRoadRoller' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_DOH_C, RoadRollerYaw) == 0x000B8C, "Member 'UABP_AJBInGameCharacter_DOH_C::RoadRollerYaw' has a wrong offset!");

}

