#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_ABC

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_ABC.ABP_AJBPostProcessHuman_RBControlled_ABC_C
// 0x0708 (0x0A60 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_ABC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_32ADF5FB4D1BEEA44D589AAF92F07E02; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_74947F6F4B563AB5E150C98399475A7C; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23F5F00C4464FB0AB9BFA8A81F432ED5; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2CAD23F1441E5268279285A325281916; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_4F0BA32A46EC88CC7F0073B54B322ED2; // 0x09E0(0x0068)()
	bool                                          bDisableRigidBodyByJump;                           // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByChangeWalkingState;             // 0x0A49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByCrouch;                         // 0x0A4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByDirection;                      // 0x0A4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RigidBodyAlpha;                                    // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigidBodyAlpha_InterpSpeed;                        // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableRigidBodyByEmote;                           // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABC(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABC_AnimGraphNode_RigidBody_74947F6F4B563AB5E150C98399475A7C();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBPostProcessHuman_RBControlled_ABC_C">();
	}
	static class UABP_AJBPostProcessHuman_RBControlled_ABC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_ABC_C>();
	}
};
static_assert(alignof(UABP_AJBPostProcessHuman_RBControlled_ABC_C) == 0x000010, "Wrong alignment on UABP_AJBPostProcessHuman_RBControlled_ABC_C");
static_assert(sizeof(UABP_AJBPostProcessHuman_RBControlled_ABC_C) == 0x000A60, "Wrong size on UABP_AJBPostProcessHuman_RBControlled_ABC_C");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, AnimGraphNode_Root_32ADF5FB4D1BEEA44D589AAF92F07E02) == 0x000368, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::AnimGraphNode_Root_32ADF5FB4D1BEEA44D589AAF92F07E02' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, AnimGraphNode_RigidBody_74947F6F4B563AB5E150C98399475A7C) == 0x0003B0, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::AnimGraphNode_RigidBody_74947F6F4B563AB5E150C98399475A7C' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, AnimGraphNode_ComponentToLocalSpace_23F5F00C4464FB0AB9BFA8A81F432ED5) == 0x000950, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::AnimGraphNode_ComponentToLocalSpace_23F5F00C4464FB0AB9BFA8A81F432ED5' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, AnimGraphNode_LocalToComponentSpace_2CAD23F1441E5268279285A325281916) == 0x000998, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::AnimGraphNode_LocalToComponentSpace_2CAD23F1441E5268279285A325281916' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, AnimGraphNode_SubInput_4F0BA32A46EC88CC7F0073B54B322ED2) == 0x0009E0, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::AnimGraphNode_SubInput_4F0BA32A46EC88CC7F0073B54B322ED2' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, bDisableRigidBodyByJump) == 0x000A48, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::bDisableRigidBodyByJump' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, bDisableRigidBodyByChangeWalkingState) == 0x000A49, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::bDisableRigidBodyByChangeWalkingState' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, bDisableRigidBodyByCrouch) == 0x000A4A, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::bDisableRigidBodyByCrouch' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, bDisableRigidBodyByDirection) == 0x000A4B, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::bDisableRigidBodyByDirection' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, RigidBodyAlpha) == 0x000A4C, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::RigidBodyAlpha' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, RigidBodyAlpha_InterpSpeed) == 0x000A50, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::RigidBodyAlpha_InterpSpeed' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_ABC_C, bEnableRigidBodyByEmote) == 0x000A54, "Member 'UABP_AJBPostProcessHuman_RBControlled_ABC_C::bEnableRigidBodyByEmote' has a wrong offset!");

}

