#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BF_InGameEffect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ST_ParticleEffectInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"


namespace SDK::Params
{

// Function BF_InGameEffect.BF_InGameEffect_C.RequestGion
// 0x0098 (0x0098 - 0x0000)
struct BF_InGameEffect_C_RequestGion final
{
public:
	struct FGameplayTag                           EffectType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpawnedSpaceInOwnersEnv;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpawnedSpaceInNotOwnersEnv;                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldLocation;                                     // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalOnly;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           WwiseEventTag;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bWwiseAutoPost;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWwiseAutoDestroy;                                 // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponentToAttachWwise;                       // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGionDryRun;                                       // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWwiseDryRun;                                      // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkComponent__LocalOnly_;                           // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFullfilDisplayCond_LocalOnly_;                    // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameEffectPoolManager*            UseEffectPoolManager;                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGionEffect_AkComponent_LocalOnly_; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGionEffect_bFullfilDisplayCond_LocalOnly_; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_RequestGion) == 0x000008, "Wrong alignment on BF_InGameEffect_C_RequestGion");
static_assert(sizeof(BF_InGameEffect_C_RequestGion) == 0x000098, "Wrong size on BF_InGameEffect_C_RequestGion");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, EffectType) == 0x000000, "Member 'BF_InGameEffect_C_RequestGion::EffectType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, Owner) == 0x000008, "Member 'BF_InGameEffect_C_RequestGion::Owner' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, SpawnedSpaceInOwnersEnv) == 0x000010, "Member 'BF_InGameEffect_C_RequestGion::SpawnedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, SpawnedSpaceInNotOwnersEnv) == 0x000011, "Member 'BF_InGameEffect_C_RequestGion::SpawnedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, WorldLocation) == 0x000014, "Member 'BF_InGameEffect_C_RequestGion::WorldLocation' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, IsLocalOnly) == 0x000020, "Member 'BF_InGameEffect_C_RequestGion::IsLocalOnly' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, WwiseEventTag) == 0x000028, "Member 'BF_InGameEffect_C_RequestGion::WwiseEventTag' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, bWwiseAutoPost) == 0x000030, "Member 'BF_InGameEffect_C_RequestGion::bWwiseAutoPost' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, bWwiseAutoDestroy) == 0x000031, "Member 'BF_InGameEffect_C_RequestGion::bWwiseAutoDestroy' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, SceneComponentToAttachWwise) == 0x000038, "Member 'BF_InGameEffect_C_RequestGion::SceneComponentToAttachWwise' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, bGionDryRun) == 0x000040, "Member 'BF_InGameEffect_C_RequestGion::bGionDryRun' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, bWwiseDryRun) == 0x000041, "Member 'BF_InGameEffect_C_RequestGion::bWwiseDryRun' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, __WorldContext) == 0x000048, "Member 'BF_InGameEffect_C_RequestGion::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, AkComponent__LocalOnly_) == 0x000050, "Member 'BF_InGameEffect_C_RequestGion::AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, bFullfilDisplayCond_LocalOnly_) == 0x000058, "Member 'BF_InGameEffect_C_RequestGion::bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, UseEffectPoolManager) == 0x000060, "Member 'BF_InGameEffect_C_RequestGion::UseEffectPoolManager' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000068, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_Array_Get_Item) == 0x000078, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000080, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_RequestGionEffect_AkComponent_LocalOnly_) == 0x000088, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_RequestGionEffect_AkComponent_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestGion, CallFunc_RequestGionEffect_bFullfilDisplayCond_LocalOnly_) == 0x000090, "Member 'BF_InGameEffect_C_RequestGion::CallFunc_RequestGionEffect_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.RequestParticleEffectOnLocal
// 0x0068 (0x0068 - 0x0000)
struct BF_InGameEffect_C_RequestParticleEffectOnLocal final
{
public:
	struct FGameplayTag                           ParticleType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ParticleEffect;                                    // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_EmitParticleEffect_ParticleEffect;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_RequestParticleEffectOnLocal) == 0x000008, "Wrong alignment on BF_InGameEffect_C_RequestParticleEffectOnLocal");
static_assert(sizeof(BF_InGameEffect_C_RequestParticleEffectOnLocal) == 0x000068, "Wrong size on BF_InGameEffect_C_RequestParticleEffectOnLocal");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, ParticleType) == 0x000000, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::ParticleType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, Location) == 0x000008, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::Location' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, Rotation) == 0x000014, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::Rotation' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, __WorldContext) == 0x000020, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, ParticleEffect) == 0x000028, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::ParticleEffect' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000030, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_IsDedicatedServer_ReturnValue) == 0x000040, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_Array_Get_Item) == 0x000048, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_EmitParticleEffect_ParticleEffect) == 0x000058, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_EmitParticleEffect_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnLocal, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000061, "Member 'BF_InGameEffect_C_RequestParticleEffectOnLocal::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.RequestParticleEffectOnAll
// 0x0050 (0x0050 - 0x0000)
struct BF_InGameEffect_C_RequestParticleEffectOnAll final
{
public:
	struct FGameplayTag                           ParticleType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_RequestParticleEffectOnAll) == 0x000008, "Wrong alignment on BF_InGameEffect_C_RequestParticleEffectOnAll");
static_assert(sizeof(BF_InGameEffect_C_RequestParticleEffectOnAll) == 0x000050, "Wrong size on BF_InGameEffect_C_RequestParticleEffectOnAll");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, ParticleType) == 0x000000, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::ParticleType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, Location) == 0x000008, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::Location' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, Rotation) == 0x000014, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::Rotation' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, __WorldContext) == 0x000020, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000028, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, CallFunc_Array_Get_Item) == 0x000040, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectOnAll, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BF_InGameEffect_C_RequestParticleEffectOnAll::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.RequestParticleEffectAttachedOnLocal
// 0x0078 (0x0078 - 0x0000)
struct BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal final
{
public:
	struct FGameplayTag                           ParticleType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class USceneComponent*                        SceneComponentToAttach;                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ParticleEffect;                                    // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_EmitParticleEffectAttached_ParticleEffect; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal) == 0x000008, "Wrong alignment on BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal");
static_assert(sizeof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal) == 0x000078, "Wrong size on BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, ParticleType) == 0x000000, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::ParticleType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, Location) == 0x000008, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::Location' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, Rotation) == 0x000014, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::Rotation' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, SceneComponentToAttach) == 0x000020, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::SceneComponentToAttach' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, SocketName) == 0x000028, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::SocketName' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, __WorldContext) == 0x000030, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, ParticleEffect) == 0x000038, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::ParticleEffect' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000040, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_Array_Get_Item) == 0x000058, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_EmitParticleEffectAttached_ParticleEffect) == 0x000068, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_EmitParticleEffectAttached_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000071, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnLocal::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.RequestParticleEffectAttachedOnAll
// 0x0060 (0x0060 - 0x0000)
struct BF_InGameEffect_C_RequestParticleEffectAttachedOnAll final
{
public:
	struct FGameplayTag                           ParticleType;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class USceneComponent*                        SceneComponentToAttach;                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll) == 0x000008, "Wrong alignment on BF_InGameEffect_C_RequestParticleEffectAttachedOnAll");
static_assert(sizeof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll) == 0x000060, "Wrong size on BF_InGameEffect_C_RequestParticleEffectAttachedOnAll");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, ParticleType) == 0x000000, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::ParticleType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, Location) == 0x000008, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::Location' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, Rotation) == 0x000014, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::Rotation' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, SceneComponentToAttach) == 0x000020, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::SceneComponentToAttach' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, SocketName) == 0x000028, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::SocketName' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, __WorldContext) == 0x000030, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000038, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, CallFunc_Array_Get_Item) == 0x000050, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_RequestParticleEffectAttachedOnAll, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BF_InGameEffect_C_RequestParticleEffectAttachedOnAll::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.CanRequestEffect
// 0x0028 (0x0028 - 0x0000)
struct BF_InGameEffect_C_CanRequestEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_CanRequestEffect) == 0x000008, "Wrong alignment on BF_InGameEffect_C_CanRequestEffect");
static_assert(sizeof(BF_InGameEffect_C_CanRequestEffect) == 0x000028, "Wrong size on BF_InGameEffect_C_CanRequestEffect");
static_assert(offsetof(BF_InGameEffect_C_CanRequestEffect, __WorldContext) == 0x000000, "Member 'BF_InGameEffect_C_CanRequestEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_CanRequestEffect, ReturnValue) == 0x000008, "Member 'BF_InGameEffect_C_CanRequestEffect::ReturnValue' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_CanRequestEffect, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x000010, "Member 'BF_InGameEffect_C_CanRequestEffect::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_CanRequestEffect, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'BF_InGameEffect_C_CanRequestEffect::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BF_InGameEffect.BF_InGameEffect_C.GetParticleEffectByGameplayTag
// 0x0060 (0x0060 - 0x0000)
struct BF_InGameEffect_C_GetParticleEffectByGameplayTag final
{
public:
	struct FGameplayTag                           PerticleType;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Effect;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ParticleEffectInfo                 CallFunc_Map_Find_Value;                           // 0x0048(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BF_InGameEffect_C_GetParticleEffectByGameplayTag) == 0x000008, "Wrong alignment on BF_InGameEffect_C_GetParticleEffectByGameplayTag");
static_assert(sizeof(BF_InGameEffect_C_GetParticleEffectByGameplayTag) == 0x000060, "Wrong size on BF_InGameEffect_C_GetParticleEffectByGameplayTag");
static_assert(offsetof(BF_InGameEffect_C_GetParticleEffectByGameplayTag, PerticleType) == 0x000000, "Member 'BF_InGameEffect_C_GetParticleEffectByGameplayTag::PerticleType' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_GetParticleEffectByGameplayTag, __WorldContext) == 0x000008, "Member 'BF_InGameEffect_C_GetParticleEffectByGameplayTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BF_InGameEffect_C_GetParticleEffectByGameplayTag, Effect) == 0x000010, "Member 'BF_InGameEffect_C_GetParticleEffectByGameplayTag::Effect' has a wrong offset!");
