#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBInGamePlayerController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BI_AJBInGamePlayerController.BI_AJBInGamePlayerController_C.IsLocalTransitionGameResult
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult final
{
public:
	bool                                          bTransition;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult) == 0x000001, "Wrong alignment on BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult");
static_assert(sizeof(BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult) == 0x000001, "Wrong size on BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult");
static_assert(offsetof(BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult, bTransition) == 0x000000, "Member 'BI_AJBInGamePlayerController_C_IsLocalTransitionGameResult::bTransition' has a wrong offset!");

// Function BI_AJBInGamePlayerController.BI_AJBInGamePlayerController_C.GetGameStartLocation
// 0x000C (0x000C - 0x0000)
struct BI_AJBInGamePlayerController_C_GetGameStartLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGamePlayerController_C_GetGameStartLocation) == 0x000004, "Wrong alignment on BI_AJBInGamePlayerController_C_GetGameStartLocation");
static_assert(sizeof(BI_AJBInGamePlayerController_C_GetGameStartLocation) == 0x00000C, "Wrong size on BI_AJBInGamePlayerController_C_GetGameStartLocation");
static_assert(offsetof(BI_AJBInGamePlayerController_C_GetGameStartLocation, Location) == 0x000000, "Member 'BI_AJBInGamePlayerController_C_GetGameStartLocation::Location' has a wrong offset!");

}

