#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_CO2ScanTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BI_CO2ScanTarget.BI_CO2ScanTarget_C.CheckTarget
// 0x0020 (0x0020 - 0x0000)
struct BI_CO2ScanTarget_C_CheckTarget final
{
public:
	class ABP_AJBInGameCharacter_C*               Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTarget;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_CO2ScanTarget_C_CheckTarget) == 0x000008, "Wrong alignment on BI_CO2ScanTarget_C_CheckTarget");
static_assert(sizeof(BI_CO2ScanTarget_C_CheckTarget) == 0x000020, "Wrong size on BI_CO2ScanTarget_C_CheckTarget");
static_assert(offsetof(BI_CO2ScanTarget_C_CheckTarget, Operator) == 0x000000, "Member 'BI_CO2ScanTarget_C_CheckTarget::Operator' has a wrong offset!");
static_assert(offsetof(BI_CO2ScanTarget_C_CheckTarget, Location) == 0x000008, "Member 'BI_CO2ScanTarget_C_CheckTarget::Location' has a wrong offset!");
static_assert(offsetof(BI_CO2ScanTarget_C_CheckTarget, Range) == 0x000014, "Member 'BI_CO2ScanTarget_C_CheckTarget::Range' has a wrong offset!");
static_assert(offsetof(BI_CO2ScanTarget_C_CheckTarget, bTarget) == 0x000018, "Member 'BI_CO2ScanTarget_C_CheckTarget::bTarget' has a wrong offset!");

// Function BI_CO2ScanTarget.BI_CO2ScanTarget_C.GetParticleLocation
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) BI_CO2ScanTarget_C_GetParticleLocation final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_CO2ScanTarget_C_GetParticleLocation) == 0x000008, "Wrong alignment on BI_CO2ScanTarget_C_GetParticleLocation");
static_assert(sizeof(BI_CO2ScanTarget_C_GetParticleLocation) == 0x000018, "Wrong size on BI_CO2ScanTarget_C_GetParticleLocation");
static_assert(offsetof(BI_CO2ScanTarget_C_GetParticleLocation, SocketName) == 0x000000, "Member 'BI_CO2ScanTarget_C_GetParticleLocation::SocketName' has a wrong offset!");
static_assert(offsetof(BI_CO2ScanTarget_C_GetParticleLocation, Location) == 0x000008, "Member 'BI_CO2ScanTarget_C_GetParticleLocation::Location' has a wrong offset!");

}

