#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCloudPointTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBComponentBase_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBCloudPointTarget.BP_AJBCloudPointTarget_C
// 0x0038 (0x0128 - 0x00F0)
class UBP_AJBCloudPointTarget_C final : public UBP_AJBComponentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	int32                                         CloudPoint;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudPointMax;                                     // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBCloudBarrierCloud_C*             CloudBarrierCloud;                                 // 0x0100(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudPointLocal;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeedIncrease;                               // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeedDecrease;                               // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIncreaseCloudPointLocal;                          // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDecreaseCloudPointLocal;                          // 0x0115(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentValueRate;                                  // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Causer;                                            // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCloudPointTarget(int32 EntryPoint);
	void OnPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void NotifyChangeFXVisibility(const struct FST_FXVisibilityInfo& PrevFXVisibility, const struct FST_FXVisibilityInfo& FXVisibility);
	void ChangeParticleVisibility(bool NewVisibility);
	void AddValue(int32 Point, class AActor* Causer_0);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnConsumed(int32 BeforeValue, int32 AfterValue);
	void Initialize();
	void SpawnCloudBarrierCloudServer();
	void CalcValueRate(float* ValueRate);
	void UpdateCloudPointLocal();
	void GetValue(int32* AAPValue);
	void GetValueMax(int32* AAPValueMax);
	void Consume(int32 Damage, int32* LeftDamage, int32* BeforeValue, int32* AfterValue);
	void GetParticleTagBlocked(struct FGameplayTag* ParticleTag);
	void GetSETagBlocked(struct FGameplayTag* SETag);
	void ConsumeSimulated(int32 Damage, int32* LeftDamage, int32* BeforeValue, int32* AfterValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBCloudPointTarget_C">();
	}
	static class UBP_AJBCloudPointTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBCloudPointTarget_C>();
	}
};
static_assert(alignof(UBP_AJBCloudPointTarget_C) == 0x000008, "Wrong alignment on UBP_AJBCloudPointTarget_C");
static_assert(sizeof(UBP_AJBCloudPointTarget_C) == 0x000128, "Wrong size on UBP_AJBCloudPointTarget_C");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBCloudPointTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, CloudPoint) == 0x0000F8, "Member 'UBP_AJBCloudPointTarget_C::CloudPoint' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, CloudPointMax) == 0x0000FC, "Member 'UBP_AJBCloudPointTarget_C::CloudPointMax' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, CloudBarrierCloud) == 0x000100, "Member 'UBP_AJBCloudPointTarget_C::CloudBarrierCloud' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, CloudPointLocal) == 0x000108, "Member 'UBP_AJBCloudPointTarget_C::CloudPointLocal' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, InterpSpeedIncrease) == 0x00010C, "Member 'UBP_AJBCloudPointTarget_C::InterpSpeedIncrease' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, InterpSpeedDecrease) == 0x000110, "Member 'UBP_AJBCloudPointTarget_C::InterpSpeedDecrease' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, bIncreaseCloudPointLocal) == 0x000114, "Member 'UBP_AJBCloudPointTarget_C::bIncreaseCloudPointLocal' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, bDecreaseCloudPointLocal) == 0x000115, "Member 'UBP_AJBCloudPointTarget_C::bDecreaseCloudPointLocal' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, CurrentValueRate) == 0x000118, "Member 'UBP_AJBCloudPointTarget_C::CurrentValueRate' has a wrong offset!");
static_assert(offsetof(UBP_AJBCloudPointTarget_C, Causer) == 0x000120, "Member 'UBP_AJBCloudPointTarget_C::Causer' has a wrong offset!");

}

