#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBubbleLensAffecter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBubbleLensAffecter.BP_AJBBubbleLensAffecter_C.ExecuteUbergraph_BP_AJBBubbleLensAffecter
// 0x0120 (0x0120 - 0x0000)
struct BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter) == 0x000008, "Wrong alignment on BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter");
static_assert(sizeof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter) == 0x000120, "Wrong size on BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, EntryPoint) == 0x000000, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000070, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000078, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_GetCharacterName_CharacterName) == 0x000080, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_Conv_NameToText_ReturnValue1) == 0x000088, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, K2Node_MakeStruct_FormatArgumentData1) == 0x0000A0, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter, CallFunc_Conv_StringToName_ReturnValue) == 0x000118, "Member 'BP_AJBBubbleLensAffecter_C_ExecuteUbergraph_BP_AJBBubbleLensAffecter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

