#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBuffSkill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBuffSkill.BP_AJBBuffSkill_C.ExecuteUbergraph_BP_AJBBuffSkill
// 0x02E8 (0x02E8 - 0x0000)
struct BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel3;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel2;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate1; // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel1;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel;                        // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue9;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag)> K2Node_CreateDelegate_OutputDelegate3; // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue10;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue11;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShoudUpdateLeftActiveTime;     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value;                                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition1;                  // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag2;                     // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue12;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x01E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag1;                     // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateSerialNumber_SerialNumber;        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue13;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue14;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue7;    // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue15;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue16;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue17;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue8;    // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue18;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBPassiveSkillBase_C*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0288(0x0008)(NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag;                      // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue19;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character10;    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3; // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill) == 0x000008, "Wrong alignment on BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill");
static_assert(sizeof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill) == 0x0002E8, "Wrong size on BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, EntryPoint) == 0x000000, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsSkillActive_ReturnValue) == 0x000019, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsSkillActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x00001A, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000020, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue1) == 0x000028, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000029, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_Operator) == 0x000030, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_Time) == 0x000038, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_Timing) == 0x00003C, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_bEnable) == 0x00003D, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_bOperatorIsEmpty) == 0x00003E, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000040, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000048, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue2) == 0x000049, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x00004A, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_bCancel3) == 0x000060, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_bCancel3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_bCancel2) == 0x000061, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_bCancel2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetValidValue_ReturnValue) == 0x000062, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000068, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue3) == 0x000070, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000072, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x000078, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000080, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000090, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess1) == 0x000098, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0000A0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess2) == 0x0000B0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000B8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000C0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess3) == 0x0000C8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_bCancel1) == 0x0000C9, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_bCancel1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_bCancel) == 0x0000CA, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_bCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x0000D0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue4) == 0x0000D8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x0000E0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue3) == 0x0000F0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue7) == 0x0000F8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000100, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess4) == 0x000108, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue8) == 0x000110, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x000118, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess5) == 0x000128, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue5) == 0x000129, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue4) == 0x00012A, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsServer_ReturnValue) == 0x00012B, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_MakeLiteralByte_ReturnValue1) == 0x00012C, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue9) == 0x000130, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000138, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue6) == 0x000148, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue5) == 0x000149, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue10) == 0x000150, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000158, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess6) == 0x000160, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue11) == 0x000168, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000170, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess7) == 0x000178, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2) == 0x000180, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess8) == 0x000190, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000191, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_DeltaSeconds) == 0x000194, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_bShoudUpdateLeftActiveTime) == 0x000198, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_bShoudUpdateLeftActiveTime' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x000199, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x0001A0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x0001A8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess9) == 0x0001B0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_Event_Value) == 0x0001B4, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_AddCondition1) == 0x0001B8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_AddCondition1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_SecondTag2) == 0x0001C0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_SecondTag2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue12) == 0x0001C8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0001D0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0001D8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess10) == 0x0001E0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_RemoveCondition) == 0x0001E8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_SecondTag1) == 0x0001F0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_SecondTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_CharacterBP) == 0x0001F8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GenerateSerialNumber_SerialNumber) == 0x000200, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GenerateSerialNumber_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x000204, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue13) == 0x000208, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue14) == 0x000210, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue7) == 0x000218, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue8) == 0x000219, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue6) == 0x00021A, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue7) == 0x00021B, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue15) == 0x000220, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x000228, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess11) == 0x000230, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue16) == 0x000238, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x000240, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess12) == 0x000248, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue17) == 0x000250, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Not_PreBool_ReturnValue2) == 0x000258, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsValid_ReturnValue9) == 0x000259, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_HasLocalSharedController_ReturnValue8) == 0x00025A, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_HasLocalSharedController_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue18) == 0x000260, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x000268, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess13) == 0x000270, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000271, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000278, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000280, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000288, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000290, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000291, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_AddCondition) == 0x000298, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_CustomEvent_SecondTag) == 0x0002A0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_CustomEvent_SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_MatchesTag_ReturnValue) == 0x0002A8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_GetOwnerCharacter_ReturnValue19) == 0x0002B0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_GetOwnerCharacter_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Not_PreBool_ReturnValue3) == 0x0002B8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character10) == 0x0002C0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character10' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess14) == 0x0002C8, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3) == 0x0002D0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, K2Node_DynamicCast_bSuccess15) == 0x0002E0, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill, CallFunc_Not_PreBool_ReturnValue4) == 0x0002E1, "Member 'BP_AJBBuffSkill_C_ExecuteUbergraph_BP_AJBBuffSkill::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");

// Function BP_AJBBuffSkill.BP_AJBBuffSkill_C.OnSkillProhibitionAdded
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBBuffSkill_C_OnSkillProhibitionAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBuffSkill_C_OnSkillProhibitionAdded) == 0x000008, "Wrong alignment on BP_AJBBuffSkill_C_OnSkillProhibitionAdded");
static_assert(sizeof(BP_AJBBuffSkill_C_OnSkillProhibitionAdded) == 0x000010, "Wrong size on BP_AJBBuffSkill_C_OnSkillProhibitionAdded");
static_assert(offsetof(BP_AJBBuffSkill_C_OnSkillProhibitionAdded, AddCondition) == 0x000000, "Member 'BP_AJBBuffSkill_C_OnSkillProhibitionAdded::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_OnSkillProhibitionAdded, SecondTag) == 0x000008, "Member 'BP_AJBBuffSkill_C_OnSkillProhibitionAdded::SecondTag' has a wrong offset!");

// Function BP_AJBBuffSkill.BP_AJBBuffSkill_C.OnPassiveRemoved
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBBuffSkill_C_OnPassiveRemoved final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBuffSkill_C_OnPassiveRemoved) == 0x000008, "Wrong alignment on BP_AJBBuffSkill_C_OnPassiveRemoved");
static_assert(sizeof(BP_AJBBuffSkill_C_OnPassiveRemoved) == 0x000018, "Wrong size on BP_AJBBuffSkill_C_OnPassiveRemoved");
static_assert(offsetof(BP_AJBBuffSkill_C_OnPassiveRemoved, RemoveCondition) == 0x000000, "Member 'BP_AJBBuffSkill_C_OnPassiveRemoved::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_OnPassiveRemoved, SecondTag) == 0x000008, "Member 'BP_AJBBuffSkill_C_OnPassiveRemoved::SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_OnPassiveRemoved, CharacterBP) == 0x000010, "Member 'BP_AJBBuffSkill_C_OnPassiveRemoved::CharacterBP' has a wrong offset!");

// Function BP_AJBBuffSkill.BP_AJBBuffSkill_C.OnPassiveAdded
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBBuffSkill_C_OnPassiveAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBuffSkill_C_OnPassiveAdded) == 0x000008, "Wrong alignment on BP_AJBBuffSkill_C_OnPassiveAdded");
static_assert(sizeof(BP_AJBBuffSkill_C_OnPassiveAdded) == 0x000010, "Wrong size on BP_AJBBuffSkill_C_OnPassiveAdded");
static_assert(offsetof(BP_AJBBuffSkill_C_OnPassiveAdded, AddCondition) == 0x000000, "Member 'BP_AJBBuffSkill_C_OnPassiveAdded::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBBuffSkill_C_OnPassiveAdded, SecondTag) == 0x000008, "Member 'BP_AJBBuffSkill_C_OnPassiveAdded::SecondTag' has a wrong offset!");

// Function BP_AJBBuffSkill.BP_AJBBuffSkill_C.ROS_AddPassive
// 0x0001 (0x0001 - 0x0000)
