#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBubbleLauncherSkill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.ExecuteUbergraph_BP_AJBBubbleLauncherSkill
// 0x0170 (0x0170 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Temp_wildcard_Variable;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetBubbleLauncherShotPointDummyComponents_ShotPointComponents; // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_Array_Get_Item1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_GionTag;                              // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item2;                          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetShotSETag_ShotSETag;                   // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill) == 0x000008, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill) == 0x000170, "Wrong size on BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, EntryPoint) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_float_Variable) == 0x000014, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000018, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_IsValid_ReturnValue1) == 0x000031, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_PlayCameraShake_ReturnValue) == 0x000038, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_float_Variable1) == 0x000040, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_bool_Variable) == 0x000044, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000048, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_wildcard_Variable) == 0x000050, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000058, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_bool_Variable1) == 0x000061, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR) == 0x000068, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x000080, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Array_Index_Variable1) == 0x000084, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000088, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000090, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000098, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_bSuccess3) == 0x0000A0, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR1) == 0x0000A8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_DynamicCast_bSuccess4) == 0x0000B0, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetBubbleLauncherShotPointDummyComponents_ShotPointComponents) == 0x0000B8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetBubbleLauncherShotPointDummyComponents_ShotPointComponents' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Length_ReturnValue1) == 0x0000D8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_Event_bEnable) == 0x0000DC, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Get_Item1) == 0x0000E0, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_Select_Default) == 0x0000E8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_IsValid_ReturnValue2) == 0x0000EC, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Length_ReturnValue2) == 0x0000F0, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_Event_Location) == 0x0000F8, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, K2Node_Event_GionTag) == 0x000108, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::K2Node_Event_GionTag' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000110, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Loop_Counter_Variable1) == 0x000114, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Less_IntInt_ReturnValue1) == 0x000119, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Add_IntInt_ReturnValue1) == 0x00011C, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Loop_Counter_Variable2) == 0x000120, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000128, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Less_IntInt_ReturnValue2) == 0x000130, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Add_IntInt_ReturnValue2) == 0x000134, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, Temp_int_Array_Index_Variable2) == 0x000138, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_Get_Item2) == 0x000140, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000148, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_Array_AddUnique_ReturnValue) == 0x000150, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_GetShotSETag_ShotSETag) == 0x000158, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_GetShotSETag_ShotSETag' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000160, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000168, "Member 'BP_AJBBubbleLauncherSkill_C_ExecuteUbergraph_BP_AJBBubbleLauncherSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.GetOwnerHamonStatus
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus final
{
public:
	bool                                          bIsHamonMode;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHamonMode_bIsHamonMode;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus) == 0x000008, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus) == 0x000040, "Wrong size on BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, bIsHamonMode) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::bIsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR) == 0x000020, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, CallFunc_IsHamonMode_bIsHamonMode) == 0x000038, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::CallFunc_IsHamonMode_bIsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_AJBBubbleLauncherSkill_C_GetOwnerHamonStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.GetShotSETag
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_GetShotSETag final
{
public:
	struct FGameplayTag                           ShotSETag_0;                                       // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOwnerHamonStatus_bIsHamonMode;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_GetShotSETag) == 0x000008, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_GetShotSETag");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_GetShotSETag) == 0x000010, "Wrong size on BP_AJBBubbleLauncherSkill_C_GetShotSETag");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetShotSETag, ShotSETag_0) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_GetShotSETag::ShotSETag_0' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetShotSETag, CallFunc_GetOwnerHamonStatus_bIsHamonMode) == 0x000008, "Member 'BP_AJBBubbleLauncherSkill_C_GetShotSETag::CallFunc_GetOwnerHamonStatus_bIsHamonMode' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.SpawnGion
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_SpawnGion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GionTag;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_SpawnGion) == 0x000008, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_SpawnGion");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_SpawnGion) == 0x000018, "Wrong size on BP_AJBBubbleLauncherSkill_C_SpawnGion");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnGion, Location) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnGion::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnGion, GionTag) == 0x000010, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnGion::GionTag' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.ChangeLaunchParticleDilation
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation) == 0x000001, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation) == 0x000001, "Wrong size on BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation, bEnable) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_ChangeLaunchParticleDilation::bEnable' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.SpawnProjectile
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_SpawnProjectile final
{
public:
	class ABP_AJBInGameCharacter_C*               OwnerCharacter;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          IsAttackBySeparatedStand;                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectile_C*              SpawnedProjectile;                                 // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOwnerHamonStatus_bIsHamonMode;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectile_C*              CallFunc_SpawnProjectile_SpawnedProjectile;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameProjectile_BubbleLauncher_C* K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile) == 0x000008, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_SpawnProjectile");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile) == 0x000050, "Wrong size on BP_AJBBubbleLauncherSkill_C_SpawnProjectile");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, OwnerCharacter) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, Location) == 0x000008, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, Rotation) == 0x000014, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, IsAttackBySeparatedStand) == 0x000020, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::IsAttackBySeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, SpawnedProjectile) == 0x000028, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, CallFunc_GetOwnerHamonStatus_bIsHamonMode) == 0x000030, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::CallFunc_GetOwnerHamonStatus_bIsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, CallFunc_SpawnProjectile_SpawnedProjectile) == 0x000038, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::CallFunc_SpawnProjectile_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher) == 0x000040, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_SpawnProjectile, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBBubbleLauncherSkill_C_SpawnProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.ShouldApplyHamonRateDirectly
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly final
{
public:
	bool                                          ShouldApplyDirectly;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong size on BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly, ShouldApplyDirectly) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_ShouldApplyHamonRateDirectly::ShouldApplyDirectly' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.IsHamonRateEnabledSkill
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong size on BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill, IsEnabled) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_IsHamonRateEnabledSkill::IsEnabled' has a wrong offset!");

// Function BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C.GetVampireDamageRate
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate final
{
public:
	float                                         VampireDamageRate;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate) == 0x000004, "Wrong alignment on BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate");
static_assert(sizeof(BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate) == 0x000004, "Wrong size on BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate");
static_assert(offsetof(BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate, VampireDamageRate) == 0x000000, "Member 'BP_AJBBubbleLauncherSkill_C_GetVampireDamageRate::VampireDamageRate' has a wrong offset!");

}

