#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_RST

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_RST.BP_AJBInGameCharacter_RST_C
// 0x00A0 (0x1850 - 0x17B0)
class ABP_AJBInGameCharacter_RST_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_RST_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBMagneticSuture_C*                BP_AJBMagneticSuture;                              // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle5;                                   // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle4;                                   // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle3;                                   // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle2;                                   // 0x17D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle1;                                   // 0x17D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet5;                                           // 0x17E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet4;                                           // 0x17E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet3;                                           // 0x17F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet2;                                           // 0x17F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet1;                                           // 0x1800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint5;                                        // 0x1808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint4;                                        // 0x1810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint3;                                        // 0x1818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint2;                                        // 0x1820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint1;                                        // 0x1828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInvasionOfMetallicaSkill_C*      BP_AJBInvasionOfMetallicaSkill;                    // 0x1830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBIronsandCamouflageSkill_C*       BP_AJBIronsandCamouflageSkill;                     // 0x1838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBBladeGenerationSkill_C*          BP_AJBBladeGenerationSkill;                        // 0x1840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAimRSTSkill_C*                   BP_AJBAimRSTSkill;                                 // 0x1848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_RST(int32 EntryPoint);
	void ChangeBladeVisibility(int32 Index_0, bool NewVisibility);
	void GetShotPointComponent(int32 Index_0, class USceneComponent** SceneComponent);
	void CheckActiveIronsandCamouflage(bool* bActive);
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void ReceiveTick(float DeltaSeconds);
	void PressedButton_ActiveSpecial();
	void ReleasedButton_ActiveBase();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void ReleasedButton_Ultimate();
	void PressedButton_Ultimate();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnLostSupportSkillServer();
	void OnGainSupportSkillServer();
	void UserConstructionScript();
	void OnBeforeInteract(bool* bShouldInteract);
	void CheckPossibleDash(bool* bPossible);
	void SetMeshRelatedThingsVisibility(bool bNewVisibility);
	void CheckAnySkillActiveOnTiltOneDash(bool* bAnySkillActive);
	void CheckPossibleDetection(bool* bPossibleDetection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_RST_C">();
	}
	static class ABP_AJBInGameCharacter_RST_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_RST_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_RST_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_RST_C");
static_assert(sizeof(ABP_AJBInGameCharacter_RST_C) == 0x001850, "Wrong size on ABP_AJBInGameCharacter_RST_C");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, UberGraphFrame_BP_AJBInGameCharacter_RST_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_RST_C::UberGraphFrame_BP_AJBInGameCharacter_RST_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BP_AJBMagneticSuture) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_RST_C::BP_AJBMagneticSuture' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BulletParticle5) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_RST_C::BulletParticle5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BulletParticle4) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_RST_C::BulletParticle4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BulletParticle3) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_RST_C::BulletParticle3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BulletParticle2) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_RST_C::BulletParticle2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BulletParticle1) == 0x0017D8, "Member 'ABP_AJBInGameCharacter_RST_C::BulletParticle1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, Bullet5) == 0x0017E0, "Member 'ABP_AJBInGameCharacter_RST_C::Bullet5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, Bullet4) == 0x0017E8, "Member 'ABP_AJBInGameCharacter_RST_C::Bullet4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, Bullet3) == 0x0017F0, "Member 'ABP_AJBInGameCharacter_RST_C::Bullet3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, Bullet2) == 0x0017F8, "Member 'ABP_AJBInGameCharacter_RST_C::Bullet2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, Bullet1) == 0x001800, "Member 'ABP_AJBInGameCharacter_RST_C::Bullet1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, ShotPoint5) == 0x001808, "Member 'ABP_AJBInGameCharacter_RST_C::ShotPoint5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, ShotPoint4) == 0x001810, "Member 'ABP_AJBInGameCharacter_RST_C::ShotPoint4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, ShotPoint3) == 0x001818, "Member 'ABP_AJBInGameCharacter_RST_C::ShotPoint3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, ShotPoint2) == 0x001820, "Member 'ABP_AJBInGameCharacter_RST_C::ShotPoint2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, ShotPoint1) == 0x001828, "Member 'ABP_AJBInGameCharacter_RST_C::ShotPoint1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BP_AJBInvasionOfMetallicaSkill) == 0x001830, "Member 'ABP_AJBInGameCharacter_RST_C::BP_AJBInvasionOfMetallicaSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BP_AJBIronsandCamouflageSkill) == 0x001838, "Member 'ABP_AJBInGameCharacter_RST_C::BP_AJBIronsandCamouflageSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BP_AJBBladeGenerationSkill) == 0x001840, "Member 'ABP_AJBInGameCharacter_RST_C::BP_AJBBladeGenerationSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_RST_C, BP_AJBAimRSTSkill) == 0x001848, "Member 'ABP_AJBInGameCharacter_RST_C::BP_AJBAimRSTSkill' has a wrong offset!");

}

