#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRescueBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBLongPressInteract_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBRescueBase.BP_AJBRescueBase_C
// 0x0018 (0x0238 - 0x0220)
class UBP_AJBRescueBase_C : public UBP_AJBLongPressInteract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRescueBase_C;                 // 0x0220(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           RevivalParticleTag;                                // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RevivalSETag;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRescueBase(int32 EntryPoint);
	void PlayLongInteractSE();
	void MC_OnLongPressInteractEnded(class ABP_AJBInGameCharacter_C* InteractCharacterBP);
	void CalcTimeToRevive(class ABP_AJBInGameCharacter_C* CharacterBP, float* TimeToRevive);
	void OnLongPressInteractEnded(bool bSuccess, bool bForceCancel, class AActor* InteractActor_0, bool bFlag01);
	void BeginInteract(bool* bSuccess);
	void GetTraceLength(float* TraceLength_0);
	void GetPriority(int32* Priority);
	void GetText(bool* bSuccess, class FText* Text);
	void CheckInteractable(class ABP_AJBInGameCharacter_C* OperatorCharacter, class AActor* TargetActor, float BaseTraceLength, bool* bInteractable);
	void GetDeltaSecondsRate(float* Rate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBRescueBase_C">();
	}
	static class UBP_AJBRescueBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBRescueBase_C>();
	}
};
static_assert(alignof(UBP_AJBRescueBase_C) == 0x000008, "Wrong alignment on UBP_AJBRescueBase_C");
static_assert(sizeof(UBP_AJBRescueBase_C) == 0x000238, "Wrong size on UBP_AJBRescueBase_C");
static_assert(offsetof(UBP_AJBRescueBase_C, UberGraphFrame_BP_AJBRescueBase_C) == 0x000220, "Member 'UBP_AJBRescueBase_C::UberGraphFrame_BP_AJBRescueBase_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBRescueBase_C, RevivalParticleTag) == 0x000228, "Member 'UBP_AJBRescueBase_C::RevivalParticleTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBRescueBase_C, RevivalSETag) == 0x000230, "Member 'UBP_AJBRescueBase_C::RevivalSETag' has a wrong offset!");

}

