#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCollectMdEmphasizeActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBEmphasizeActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBCollectMdEmphasizeActor.BP_AJBCollectMdEmphasizeActor_C
// 0x0030 (0x0388 - 0x0358)
class ABP_AJBCollectMdEmphasizeActor_C final : public ABP_AJBEmphasizeActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCollectMdEmphasizeActor_C;    // 0x0358(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender1;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          EmphasisParticlePillar;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowCollectMdInfo;                           // 0x0380(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBCollectMdEmphasizeActor(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TrySpawnParticle();
	void TryDestroyParticle();
	void ChangeVisibility(bool bNewVisibility);
	void UserConstructionScript();
	void SetInfoText(const class FText& Title, class UTextRenderComponent* TextRender_0, class ABP_AJBInGameParticleEffect_C* Particle);
	void ChangeParticleDilationEnable(bool bEnable);
	void CheckEffectActivate(bool* bActivate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBCollectMdEmphasizeActor_C">();
	}
	static class ABP_AJBCollectMdEmphasizeActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCollectMdEmphasizeActor_C>();
	}
};
static_assert(alignof(ABP_AJBCollectMdEmphasizeActor_C) == 0x000008, "Wrong alignment on ABP_AJBCollectMdEmphasizeActor_C");
static_assert(sizeof(ABP_AJBCollectMdEmphasizeActor_C) == 0x000388, "Wrong size on ABP_AJBCollectMdEmphasizeActor_C");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, UberGraphFrame_BP_AJBCollectMdEmphasizeActor_C) == 0x000358, "Member 'ABP_AJBCollectMdEmphasizeActor_C::UberGraphFrame_BP_AJBCollectMdEmphasizeActor_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, TextRender1) == 0x000360, "Member 'ABP_AJBCollectMdEmphasizeActor_C::TextRender1' has a wrong offset!");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, Arrow) == 0x000368, "Member 'ABP_AJBCollectMdEmphasizeActor_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, TextRender) == 0x000370, "Member 'ABP_AJBCollectMdEmphasizeActor_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, EmphasisParticlePillar) == 0x000378, "Member 'ABP_AJBCollectMdEmphasizeActor_C::EmphasisParticlePillar' has a wrong offset!");
static_assert(offsetof(ABP_AJBCollectMdEmphasizeActor_C, bDebugShowCollectMdInfo) == 0x000380, "Member 'ABP_AJBCollectMdEmphasizeActor_C::bDebugShowCollectMdInfo' has a wrong offset!");

}

