#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCollectMdEmphasizeActorOther

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCollectMdEmphasizeActorOther.BP_AJBCollectMdEmphasizeActorOther_C.ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bEnable;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewVisibility;                       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther) == 0x000004, "Wrong alignment on BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther");
static_assert(sizeof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther) == 0x000028, "Wrong size on BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, EntryPoint) == 0x000000, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsActive_ReturnValue) == 0x000009, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsValid_ReturnValue1) == 0x00000B, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsActive_ReturnValue1) == 0x00000C, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsActive_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, Temp_bool_Variable) == 0x00000D, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsValid_ReturnValue2) == 0x00000E, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, K2Node_Event_bEnable) == 0x00000F, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_Not_PreBool_ReturnValue1) == 0x000010, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, Temp_float_Variable) == 0x000014, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, CallFunc_IsValid_ReturnValue3) == 0x000018, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, Temp_float_Variable1) == 0x00001C, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, K2Node_Select_Default) == 0x000020, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther, K2Node_Event_bNewVisibility) == 0x000024, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ExecuteUbergraph_BP_AJBCollectMdEmphasizeActorOther::K2Node_Event_bNewVisibility' has a wrong offset!");

// Function BP_AJBCollectMdEmphasizeActorOther.BP_AJBCollectMdEmphasizeActorOther_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick");
static_assert(sizeof(BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBCollectMdEmphasizeActorOther.BP_AJBCollectMdEmphasizeActorOther_C.ChangeVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility) == 0x000001, "Wrong alignment on BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility");
static_assert(sizeof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility) == 0x000001, "Wrong size on BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility, bNewVisibility) == 0x000000, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ChangeVisibility::bNewVisibility' has a wrong offset!");

// Function BP_AJBCollectMdEmphasizeActorOther.BP_AJBCollectMdEmphasizeActorOther_C.ChangeParticleDilationEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable) == 0x000001, "Wrong alignment on BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable");
static_assert(sizeof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable) == 0x000001, "Wrong size on BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable, bEnable) == 0x000000, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_ChangeParticleDilationEnable::bEnable' has a wrong offset!");

// Function BP_AJBCollectMdEmphasizeActorOther.BP_AJBCollectMdEmphasizeActorOther_C.CheckEffectActivate
// 0x0080 (0x0080 - 0x0000)
struct BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTempActivate;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCollectMd_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEffectActivate_bActivate;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate) == 0x000008, "Wrong alignment on BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate");
static_assert(sizeof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate) == 0x000080, "Wrong size on BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, bActivate) == 0x000000, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, bTempActivate) == 0x000001, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::bTempActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_PlayModeEquals_bResult) == 0x000002, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000028, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000030, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000038, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetCurrentFlowState_FlowState) == 0x000040, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000048, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000050, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_MatchesAnyTags_ReturnValue) == 0x000051, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_IsValid_ReturnValue) == 0x000052, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_Not_PreBool_ReturnValue) == 0x000054, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_IsValid_ReturnValue1) == 0x000068, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000070, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_IsValid_ReturnValue2) == 0x000079, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_Less_IntInt_ReturnValue) == 0x00007A, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue1) == 0x00007B, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_CheckEffectActivate_bActivate) == 0x00007C, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_CheckEffectActivate_bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue2) == 0x00007D, "Member 'BP_AJBCollectMdEmphasizeActorOther_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

}

