#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossFireHurricaneSkill

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill
// 0x02F0 (0x02F0 - 0x0000)
struct BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPoliticConsumptionMP_ConsumptionMP;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBAccompanyMGRSkill_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSatisfiedMP_IsSatisfied;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_NewLocation;                          // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InScale;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InSerialNumber;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDelayTime;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_SpawnTransform;                       // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Owner;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ActiveTime;                           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBCrossfireHurricaneAffecter_C*    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         K2Node_Event_NextState;                            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillState_bMatch;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable1;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DuringTheWorld_Result;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorTimeDilation_ReturnValue;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0224(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue2;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x028C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0298(0x0010)(ZeroConstructor, ReferenceParm)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x02A8(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill) == 0x000010, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill) == 0x0002F0, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, EntryPoint) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetPoliticConsumptionMP_ConsumptionMP) == 0x000004, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetPoliticConsumptionMP_ConsumptionMP' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName) == 0x000008, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, Temp_name_Variable) == 0x000020, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName1) == 0x000028, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName2) == 0x000050, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Concat_StrStr_ReturnValue1) == 0x000068, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName9) == 0x000078, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000080, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000090, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0000A0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000A8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x0000B8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsSatisfiedMP_IsSatisfied) == 0x0000C0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsSatisfiedMP_IsSatisfied' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsSkillActive_ReturnValue) == 0x0000C1, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsSkillActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_NewLocation) == 0x0000C4, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_NewLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_InScale) == 0x0000D0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_InScale' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_InSerialNumber) == 0x0000D4, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_InSerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_InDelayTime) == 0x0000D8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_InDelayTime' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_BooleanAND_ReturnValue) == 0x0000DC, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_SpawnTransform) == 0x0000E0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_Owner) == 0x000110, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_SerialNumber) == 0x000118, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_ActiveTime) == 0x00011C, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_ActiveTime' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName3) == 0x000130, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName4) == 0x000138, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x000140, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_NextState) == 0x000150, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_NextState' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetValidValue_ReturnValue) == 0x000151, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_DeltaSeconds) == 0x000154, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_SwitchEnum_CmpSuccess) == 0x000158, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Add_FloatFloat_ReturnValue) == 0x00015C, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x000160, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x000170, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_CheckSkillState_bMatch) == 0x000171, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_CheckSkillState_bMatch' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, Temp_name_Variable1) == 0x000178, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName5) == 0x000180, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate6) == 0x000188, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000198, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_DeltaTime) == 0x00019C, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName6) == 0x0001A0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_DuringTheWorld_Result) == 0x0001A8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_DuringTheWorld_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName7) == 0x0001B0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate7) == 0x0001B8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001C8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0001D0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0001E0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_bSuccess1) == 0x0001E8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate8) == 0x0001F0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000200, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CustomEvent_NotifyName8) == 0x000208, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwner_ReturnValue) == 0x000210, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetActorTimeDilation_ReturnValue) == 0x000218, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetActorTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00021C, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsValid_ReturnValue1) == 0x000220, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000221, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_Event_Location) == 0x000224, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000230, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000238, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_bSuccess2) == 0x000240, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000248, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000250, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000258, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_bSuccess3) == 0x000260, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000268, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsValid_ReturnValue2) == 0x000270, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsValid_ReturnValue3) == 0x000271, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000272, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetOwnerStand_ReturnValue2) == 0x000278, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetOwnerStand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2) == 0x000280, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_DynamicCast_bSuccess4) == 0x000288, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetActorForwardVector_ReturnValue) == 0x00028C, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_GetComponentsByTag_ReturnValue) == 0x000298, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0002A8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_Array_Get_Item) == 0x0002B8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002C0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x0002D0, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill, K2Node_CreateDelegate_OutputDelegate9) == 0x0002D8, "Member 'BP_AJBCrossFireHurricaneSkill_C_ExecuteUbergraph_BP_AJBCrossFireHurricaneSkill::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.FakeTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCrossFireHurricaneSkill_C_FakeTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_FakeTick) == 0x000004, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_FakeTick");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_FakeTick) == 0x000004, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_FakeTick");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_FakeTick, DeltaTime) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_FakeTick::DeltaTime' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.None_Tick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCrossFireHurricaneSkill_C_None_Tick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_None_Tick) == 0x000004, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_None_Tick");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_None_Tick) == 0x000004, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_None_Tick");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_None_Tick, DeltaSeconds) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_None_Tick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.TrySpawnAffecterClass
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 Owner;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber_0;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveTime;                                        // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass) == 0x000010, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass) == 0x000040, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass, SpawnTransform) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass, Owner) == 0x000030, "Member 'BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass::Owner' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass, SerialNumber_0) == 0x000038, "Member 'BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass::SerialNumber_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass, ActiveTime) == 0x00003C, "Member 'BP_AJBCrossFireHurricaneSkill_C_TrySpawnAffecterClass::ActiveTime' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.AddToMultipleLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InScale;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSerialNumber;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InDelayTime;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation) == 0x000004, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation) == 0x000018, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation, NewLocation) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation::NewLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation, InScale) == 0x00000C, "Member 'BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation::InScale' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation, InSerialNumber) == 0x000010, "Member 'BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation::InSerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation, InDelayTime) == 0x000014, "Member 'BP_AJBCrossFireHurricaneSkill_C_AddToMultipleLocation::InDelayTime' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnCompleted_9C69F8C943F460AE0F1D87A52F2EFD6C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_9C69F8C943F460AE0F1D87A52F2EFD6C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_9C69F8C943F460AE0F1D87A52F2EFD6C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnNotifyBegin_9C69F8C943F460AE0F1D87A52F2EFD6C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnNotifyEnd_9C69F8C943F460AE0F1D87A52F2EFD6C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnCompleted_89C65F004CC5E6FC2E31A6BBC201311C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C");
static_assert(offsetof(BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C, NotifyName) == 0x000000, "Member 'BP_AJBCrossFireHurricaneSkill_C_OnBlendOut_89C65F004CC5E6FC2E31A6BBC201311C::NotifyName' has a wrong offset!");

// Function BP_AJBCrossFireHurricaneSkill.BP_AJBCrossFireHurricaneSkill_C.OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong alignment on BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C");
static_assert(sizeof(BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C) == 0x000008, "Wrong size on BP_AJBCrossFireHurricaneSkill_C_OnInterrupted_89C65F004CC5E6FC2E31A6BBC201311C");
