#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBGameInstance

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "ST_CharaSkinData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "AmwPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_AkBankSettings_structs.hpp"
#include "ST_CharaSkin_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBGameInstance.BP_AJBGameInstance_C.ExecuteUbergraph_BP_AJBGameInstance
// 0x09A0 (0x09A0 - 0x0000)
struct BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable1;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsSuccess;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGachaID                            K2Node_CustomEvent_GachaID;                        // 0x0050(0x0020)()
	TDelegate<void(bool bIsSuccess, const struct FAJBGachaID& GachaID)> K2Node_CreateDelegate_OutputDelegate1; // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FAJBGachaID                            Temp_struct_Variable;                              // 0x0080(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBCheckRewardLottery*                 CallFunc_CheckRewardLottery_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards)> K2Node_CreateDelegate_OutputDelegate2; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBRewardReceivingStatus                     K2Node_CustomEvent_ReceiveingStatus1;              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGetRewardsResponse                 K2Node_CustomEvent_GetRewards1;                    // 0x00C8(0x0010)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBRewardReceivingStatus                     K2Node_CustomEvent_ReceiveingStatus;               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGetRewardsResponse                 K2Node_CustomEvent_GetRewards;                     // 0x00E0(0x0010)()
	TDelegate<void(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards)> K2Node_CreateDelegate_OutputDelegate3; // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FAJBGetRewardsResponse                 Temp_struct_Variable1;                             // 0x0100(0x0010)()
	EAJBRewardReceivingStatus                     Temp_byte_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable1;                               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_CharaSkinData                      K2Node_MakeStruct_ST_CharaSkinData;                // 0x0148(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0170(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0180(0x0020)()
	class UObject*                                K2Node_CustomEvent_Loaded1;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreateSessionCallbackProxy*            CallFunc_CreateSession_ReturnValue;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate4; // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results1;                       // 0x01E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFindSessionsCallbackProxy*             CallFunc_FindSessions_ReturnValue;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate5; // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& SoundPath)> K2Node_CreateDelegate_OutputDelegate6;           // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ENetworkFailure                               K2Node_Event_FailureType1;                         // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsServer;                            // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETravelFailure                                K2Node_Event_FailureType;                          // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1; // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2; // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerIconManager_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDefaultCredit_ReturnValue;             // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableDebugDisplay_ReturnValue;         // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamRepos*                         CallFunc_GetParamRepos_ReturnValue;                // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue4;            // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue12;              // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_EmoneyIcons_C*                      CallFunc_SpawnObject_ReturnValue1;                 // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmwPluginEventListener*                CallFunc_GetEventListener_ReturnValue;             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SoundPath;                      // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue13;              // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue14;              // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue1;                     // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue15;              // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue16;              // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAmwPluginEventListener*                CallFunc_SpawnObject_ReturnValue2;                 // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamRepos*                         CallFunc_GetParamRepos_ReturnValue1;               // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0530(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0548(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0558(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FMatchingPlayerInfo>            K2Node_CustomEvent_MatchingPlayerInfo;             // 0x0568(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item1;                          // 0x0580(0x0088)()
	struct FST_AkBankSettings                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0608(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertToCharaNameTag_CharaName;          // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConvertToCharaNameTag_StandName;          // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue17;              // 0x0658(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue18;              // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue19;              // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue1;           // 0x0688(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue20;              // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue21;              // 0x06B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x06D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x06E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_RequestSkinName;                // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_CharaSkin                          CallFunc_GetDataTableRowFromName_OutRow1;          // 0x0700(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue1;     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Array_Get_Item2;                          // 0x0740(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x076D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchCompensationLoginUserDataID_ReturnValue; // 0x076E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76F[0x1];                                      // 0x076F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate11;            // 0x0770(0x0010)(ZeroConstructor, NoDestructor)
	class UNetHttp*                               CallFunc_Create_ReturnValue;                       // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI_ResultGetReward*             CallFunc_Request_ResultGetRewardCheckGachaID_ReturnValue; // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubPP_ReturnValue;                        // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792[0x6];                                      // 0x0792(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0798(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x07A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable2;                             // 0x07C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item3;                          // 0x07D0(0x00B8)()
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item4;                          // 0x0888(0x00B8)()
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue;                  // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x0948(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959[0x3];                                      // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAmwBuildType                                 CallFunc_AmwGetBuildType_ReturnValue;              // 0x0962(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_963[0x5];                                      // 0x0963(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue3; // 0x0968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x0978(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue22;              // 0x0988(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0998(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance) == 0x000008, "Wrong alignment on BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance");
static_assert(sizeof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance) == 0x0009A0, "Wrong size on BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, EntryPoint) == 0x000000, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_object_Variable) == 0x000018, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_DynamicCast_AsMaterial_Interface) == 0x000020, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_object_Variable1) == 0x000038, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000040, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_bIsSuccess) == 0x000049, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_bIsSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_GachaID) == 0x000050, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_GachaID' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate1) == 0x000070, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_struct_Variable) == 0x000080, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_bool_Variable) == 0x0000A0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_CheckRewardLottery_ReturnValue) == 0x0000A8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_CheckRewardLottery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Result1) == 0x0000C1, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_ReceiveingStatus1) == 0x0000C2, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_ReceiveingStatus1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_GetRewards1) == 0x0000C8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_GetRewards1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Result) == 0x0000D8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_ReceiveingStatus) == 0x0000D9, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_ReceiveingStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_GetRewards) == 0x0000E0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_GetRewards' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_struct_Variable1) == 0x000100, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_byte_Variable) == 0x000110, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000111, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000112, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000118, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_BooleanOR_ReturnValue) == 0x000128, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_byte_Variable1) == 0x000140, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_MakeStruct_ST_CharaSkinData) == 0x000148, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_MakeStruct_ST_CharaSkinData' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Array_Add_ReturnValue) == 0x000160, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_int_Variable) == 0x000164, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_int_Variable1) == 0x000168, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Results) == 0x000170, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetDebugTags_ReturnValue) == 0x000180, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Loaded1) == 0x0001A0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Loaded1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_HasTag_ReturnValue) == 0x0001A8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetPlayerController_ReturnValue) == 0x0001B0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_CreateSession_ReturnValue) == 0x0001B8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_CreateSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate4) == 0x0001C0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsValid_ReturnValue1) == 0x0001D0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_DestroySession_ReturnValue) == 0x0001D8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_DestroySession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsValid_ReturnValue2) == 0x0001E0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CustomEvent_Results1) == 0x0001E8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CustomEvent_Results1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetPlayerController_ReturnValue1) == 0x0001F8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetPlayerController_ReturnValue2) == 0x000200, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_FindSessions_ReturnValue) == 0x000208, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_FindSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsValid_ReturnValue3) == 0x000210, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate5) == 0x000218, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Conv_IntToString_ReturnValue) == 0x000228, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_int_Array_Index_Variable) == 0x000238, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_CreateDelegate_OutputDelegate6) == 0x000240, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetAJBGameInstance_bSuccess) == 0x000250, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000258, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Conv_IntToString_ReturnValue1) == 0x000260, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue1) == 0x000270, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000280, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue2) == 0x000288, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue3) == 0x000298, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_Event_FailureType1) == 0x0002A8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_Event_FailureType1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_Event_bIsServer) == 0x0002A9, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_Event_bIsServer' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_Event_FailureType) == 0x0002AA, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_Event_FailureType' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1) == 0x0002B0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2) == 0x0002C0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue4) == 0x0002D0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_string_Variable) == 0x0002E0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Conv_IntToString_ReturnValue2) == 0x0002F0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Conv_IntToString_ReturnValue3) == 0x000300, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue5) == 0x000310, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue6) == 0x000320, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue7) == 0x000330, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsDistribution_ReturnValue) == 0x000340, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Not_PreBool_ReturnValue) == 0x000341, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_SpawnObject_ReturnValue) == 0x000348, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetDefaultCredit_ReturnValue) == 0x000350, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetDefaultCredit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_BuildString_Int_ReturnValue) == 0x000358, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000368, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000370, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000378, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_string_Variable1) == 0x000380, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetPlayerController_ReturnValue3) == 0x000390, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsValid_ReturnValue4) == 0x000398, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, Temp_bool_Variable1) == 0x000399, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, K2Node_Select_Default) == 0x0003A0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_IsEnableDebugDisplay_ReturnValue) == 0x0003B0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_IsEnableDebugDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue8) == 0x0003B8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Not_PreBool_ReturnValue1) == 0x0003C8, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_Concat_StrStr_ReturnValue9) == 0x0003D0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance, CallFunc_GetAJBGameInstance_bSuccess1) == 0x0003E0, "Member 'BP_AJBGameInstance_C_ExecuteUbergraph_BP_AJBGameInstance::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
