#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDebugAINPCSpawnPreviewerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C
// 0x0028 (0x0260 - 0x0238)
class UBP_AJBDebugAINPCSpawnPreviewerComponent_C final : public USceneComponent
{
public:
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class AAJBInGameCharacterBase*                OwnerCharacter;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastFloorHitLocation;                              // 0x0250(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreviewActive;                                    // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ToggleIsPreviewActive();
	struct FVector GetPreviewedSpawnLocation();
	bool IsPreviewActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBDebugAINPCSpawnPreviewerComponent_C">();
	}
	static class UBP_AJBDebugAINPCSpawnPreviewerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBDebugAINPCSpawnPreviewerComponent_C>();
	}
};
static_assert(alignof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C) == 0x000008, "Wrong alignment on UBP_AJBDebugAINPCSpawnPreviewerComponent_C");
static_assert(sizeof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C) == 0x000260, "Wrong size on UBP_AJBDebugAINPCSpawnPreviewerComponent_C");
static_assert(offsetof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C, UberGraphFrame) == 0x000240, "Member 'UBP_AJBDebugAINPCSpawnPreviewerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C, OwnerCharacter) == 0x000248, "Member 'UBP_AJBDebugAINPCSpawnPreviewerComponent_C::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C, LastFloorHitLocation) == 0x000250, "Member 'UBP_AJBDebugAINPCSpawnPreviewerComponent_C::LastFloorHitLocation' has a wrong offset!");
static_assert(offsetof(UBP_AJBDebugAINPCSpawnPreviewerComponent_C, bPreviewActive) == 0x00025C, "Member 'UBP_AJBDebugAINPCSpawnPreviewerComponent_C::bPreviewActive' has a wrong offset!");

}

