#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_JLN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_JLN.BP_AJBInGameCharacter_JLN_C
// 0x0020 (0x17D0 - 0x17B0)
class ABP_AJBInGameCharacter_JLN_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_JLN_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBStoneOraRushSkill_C*             BP_AJBStoneOraRushSkill;                           // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBStringJailSkill_C*               BP_AJBStringJail;                                  // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBStoneHook_C*                     BP_AJBStoneHook;                                   // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanySTFSkill_C*             BP_AJBAccompanySTFSkill;                           // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_JLN(int32 EntryPoint);
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Ultimate();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void OnBeforeInteract(bool* bShouldInteract);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_JLN_C">();
	}
	static class ABP_AJBInGameCharacter_JLN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_JLN_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_JLN_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_JLN_C");
static_assert(sizeof(ABP_AJBInGameCharacter_JLN_C) == 0x0017D0, "Wrong size on ABP_AJBInGameCharacter_JLN_C");
static_assert(offsetof(ABP_AJBInGameCharacter_JLN_C, UberGraphFrame_BP_AJBInGameCharacter_JLN_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_JLN_C::UberGraphFrame_BP_AJBInGameCharacter_JLN_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JLN_C, BP_AJBStoneOraRushSkill) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_JLN_C::BP_AJBStoneOraRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JLN_C, BP_AJBStringJail) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_JLN_C::BP_AJBStringJail' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JLN_C, BP_AJBStoneHook) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_JLN_C::BP_AJBStoneHook' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JLN_C, BP_AJBAccompanySTFSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_JLN_C::BP_AJBAccompanySTFSkill' has a wrong offset!");

}

