#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRecording

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_RecordingTargetInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRecording.BP_AJBRecording_C.ExecuteUbergraph_BP_AJBRecording
// 0x0368 (0x0368 - 0x0000)
struct BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP1;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess1;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacterBP;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_UpdateLeftTime_RemoveIndexes;             // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base3;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRecordLimit_bLimit;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0154(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0160(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0040)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x01D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0200(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_CheckRemoveTarget_RemoveIndexes;          // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item1;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue1;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAllRemoveTarget_bShouldRemove;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDisplayRecordingUI_bShouldDisplay;  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base4;   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_RecordingReticleWidget_C*           CallFunc_Create_ReturnValue;                       // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_CustomEvent_TargetCharacter1;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetLocation1;                // 0x0270(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_CustomEvent_TargetCharacter;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetLocation;                 // 0x0288(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed; // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x02D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x02E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0338(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording) == 0x000008, "Wrong alignment on BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording");
static_assert(sizeof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording) == 0x000368, "Wrong size on BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, EntryPoint) == 0x000000, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue1) == 0x000010, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000018, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_HasLocalSharedController_ReturnValue) == 0x000031, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue2) == 0x000038, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000040, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000058, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000060, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetViewTarget_ReturnValue) == 0x000068, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetAJBCharacterFromActor_CharacterBP1) == 0x000070, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetAJBCharacterFromActor_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetAJBCharacterFromActor_bSuccess1) == 0x000078, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetAJBCharacterFromActor_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue3) == 0x000080, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000088, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess3) == 0x000090, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000091, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000092, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue4) == 0x000098, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x0000B0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess4) == 0x0000B8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_HasLocalSharedController_ReturnValue2) == 0x0000C8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_IsServer_ReturnValue) == 0x0000C9, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000CA, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_Operator) == 0x0000D0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_Time) == 0x0000D8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_Timing) == 0x0000DC, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_bEnable) == 0x0000DD, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_bOperatorIsEmpty) == 0x0000DE, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000DF, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CustomEvent_TargetCharacterBP) == 0x0000E0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CustomEvent_TargetCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_Event_DeltaSeconds) == 0x0000E8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, Temp_int_Array_Index_Variable) == 0x0000EC, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_UpdateLeftTime_RemoveIndexes) == 0x0000F0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_UpdateLeftTime_RemoveIndexes' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Subtract_IntInt_ReturnValue) == 0x000104, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Max_ReturnValue) == 0x000108, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue5) == 0x000110, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsAJBIn_Game_Character_Base3) == 0x000118, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsAJBIn_Game_Character_Base3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess5) == 0x000120, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_HasLocalSharedController_ReturnValue3) == 0x000121, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000128, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, Temp_int_Array_Index_Variable1) == 0x000130, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Array_Get_Item) == 0x000134, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, Temp_int_Loop_Counter_Variable) == 0x000138, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_IsServer_ReturnValue1) == 0x00013C, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000140, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000144, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_CheckRecordLimit_bLimit) == 0x000145, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_CheckRecordLimit_bLimit' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, Temp_int_Loop_Counter_Variable1) == 0x000148, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Subtract_IntInt_ReturnValue2) == 0x00014C, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x000150, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_MakeVector2D_ReturnValue) == 0x000154, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Conv_NameToText_ReturnValue) == 0x000160, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue6) == 0x000178, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_MakeStruct_FormatArgumentData) == 0x000180, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue7) == 0x0001D0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0001D8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x0001E8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x0001F0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue8) == 0x0001F8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000200, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_CheckRemoveTarget_RemoveIndexes) == 0x000210, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_CheckRemoveTarget_RemoveIndexes' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_RequestWwiseEventOnLocal_AkComponent2) == 0x000220, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_RequestWwiseEventOnLocal_AkComponent2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Array_Get_Item1) == 0x000228, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Array_Length_ReturnValue1) == 0x00022C, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Subtract_IntInt_ReturnValue3) == 0x000230, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Subtract_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Max_ReturnValue1) == 0x000234, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Max_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetObjectClass_ReturnValue) == 0x000238, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_ShouldAllRemoveTarget_bShouldRemove) == 0x000240, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_ShouldAllRemoveTarget_bShouldRemove' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_ShouldDisplayRecordingUI_bShouldDisplay) == 0x000241, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_ShouldDisplayRecordingUI_bShouldDisplay' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue9) == 0x000248, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsAJBIn_Game_Character_Base4) == 0x000250, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsAJBIn_Game_Character_Base4' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess6) == 0x000258, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_IsServer_ReturnValue2) == 0x000259, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_HasLocalSharedController_ReturnValue4) == 0x00025A, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Create_ReturnValue) == 0x000260, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CustomEvent_TargetCharacter1) == 0x000268, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CustomEvent_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CustomEvent_TargetLocation1) == 0x000270, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CustomEvent_TargetLocation1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CustomEvent_TargetCharacter) == 0x000280, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_CustomEvent_TargetLocation) == 0x000288, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_CustomEvent_TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetOwner_ReturnValue10) == 0x000298, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x0002A0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0002A8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_DynamicCast_bSuccess7) == 0x0002B0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed) == 0x0002B1, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor) == 0x0002B8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_GetCharacterName_CharacterName) == 0x0002C0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x0002C8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Conv_NameToText_ReturnValue1) == 0x0002D0, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_MakeStruct_FormatArgumentData1) == 0x0002E8, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, K2Node_MakeArray_Array) == 0x000328, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Format_ReturnValue) == 0x000338, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Conv_TextToString_ReturnValue) == 0x000350, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording, CallFunc_Conv_StringToName_ReturnValue) == 0x000360, "Member 'BP_AJBRecording_C_ExecuteUbergraph_BP_AJBRecording::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.MC_SyncAutoHitParam
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBRecording_C_MC_SyncAutoHitParam final
{
public:
	class AAJBInGameCharacterBase*                TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation_0;                                  // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_MC_SyncAutoHitParam) == 0x000008, "Wrong alignment on BP_AJBRecording_C_MC_SyncAutoHitParam");
static_assert(sizeof(BP_AJBRecording_C_MC_SyncAutoHitParam) == 0x000018, "Wrong size on BP_AJBRecording_C_MC_SyncAutoHitParam");
static_assert(offsetof(BP_AJBRecording_C_MC_SyncAutoHitParam, TargetCharacter_0) == 0x000000, "Member 'BP_AJBRecording_C_MC_SyncAutoHitParam::TargetCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_MC_SyncAutoHitParam, TargetLocation_0) == 0x000008, "Member 'BP_AJBRecording_C_MC_SyncAutoHitParam::TargetLocation_0' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.ROS_SyncAutoHitParam
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBRecording_C_ROS_SyncAutoHitParam final
{
public:
	class AAJBInGameCharacterBase*                TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation_0;                                  // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_ROS_SyncAutoHitParam) == 0x000008, "Wrong alignment on BP_AJBRecording_C_ROS_SyncAutoHitParam");
static_assert(sizeof(BP_AJBRecording_C_ROS_SyncAutoHitParam) == 0x000018, "Wrong size on BP_AJBRecording_C_ROS_SyncAutoHitParam");
static_assert(offsetof(BP_AJBRecording_C_ROS_SyncAutoHitParam, TargetCharacter_0) == 0x000000, "Member 'BP_AJBRecording_C_ROS_SyncAutoHitParam::TargetCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_ROS_SyncAutoHitParam, TargetLocation_0) == 0x000008, "Member 'BP_AJBRecording_C_ROS_SyncAutoHitParam::TargetLocation_0' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBRecording_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBRecording_C_ReceiveTick");
static_assert(sizeof(BP_AJBRecording_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBRecording_C_ReceiveTick");
static_assert(offsetof(BP_AJBRecording_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBRecording_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.AddRecordingTargetServer
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBRecording_C_AddRecordingTargetServer final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacterBP;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_AddRecordingTargetServer) == 0x000008, "Wrong alignment on BP_AJBRecording_C_AddRecordingTargetServer");
static_assert(sizeof(BP_AJBRecording_C_AddRecordingTargetServer) == 0x000008, "Wrong size on BP_AJBRecording_C_AddRecordingTargetServer");
static_assert(offsetof(BP_AJBRecording_C_AddRecordingTargetServer, TargetCharacterBP) == 0x000000, "Member 'BP_AJBRecording_C_AddRecordingTargetServer::TargetCharacterBP' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRecording_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecording_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBRecording_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBRecording_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBRecording_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBRecording_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBRecording_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBRecording_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBRecording_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBRecording_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBRecording_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.RemoveTargetByIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBRecording_C_RemoveTargetByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecording_C_RemoveTargetByIndex) == 0x000004, "Wrong alignment on BP_AJBRecording_C_RemoveTargetByIndex");
static_assert(sizeof(BP_AJBRecording_C_RemoveTargetByIndex) == 0x000008, "Wrong size on BP_AJBRecording_C_RemoveTargetByIndex");
static_assert(offsetof(BP_AJBRecording_C_RemoveTargetByIndex, Index_0) == 0x000000, "Member 'BP_AJBRecording_C_RemoveTargetByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_RemoveTargetByIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'BP_AJBRecording_C_RemoveTargetByIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_RemoveTargetByIndex, CallFunc_Array_IsValidIndex_ReturnValue1) == 0x000005, "Member 'BP_AJBRecording_C_RemoveTargetByIndex::CallFunc_Array_IsValidIndex_ReturnValue1' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.AddTargetByCharacterBase
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBRecording_C_AddTargetByCharacterBase final
{
public:
	class AAJBInGameCharacterBase*                TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecording_C_AddTargetByCharacterBase) == 0x000008, "Wrong alignment on BP_AJBRecording_C_AddTargetByCharacterBase");
static_assert(sizeof(BP_AJBRecording_C_AddTargetByCharacterBase) == 0x000040, "Wrong size on BP_AJBRecording_C_AddTargetByCharacterBase");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, TargetCharacter_0) == 0x000000, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::TargetCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, CallFunc_Concat_StrStr_ReturnValue1) == 0x000028, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecording_C_AddTargetByCharacterBase, CallFunc_Array_Add_ReturnValue1) == 0x00003C, "Member 'BP_AJBRecording_C_AddTargetByCharacterBase::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");

// Function BP_AJBRecording.BP_AJBRecording_C.UpdateLeftTime
// 0x0170 (0x0170 - 0x0000)
struct BP_AJBRecording_C_UpdateLeftTime final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RemoveIndexes;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<int32>                                 TempRemoveIndexes;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         TempIndex;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
