#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrazyHeal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBCrazyHeal.BP_AJBCrazyHeal_C.GetText
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBCrazyHeal_C_GetText final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_AJBCrazyHeal_C_GetText) == 0x000008, "Wrong alignment on BP_AJBCrazyHeal_C_GetText");
static_assert(sizeof(BP_AJBCrazyHeal_C_GetText) == 0x000020, "Wrong size on BP_AJBCrazyHeal_C_GetText");
static_assert(offsetof(BP_AJBCrazyHeal_C_GetText, bSuccess) == 0x000000, "Member 'BP_AJBCrazyHeal_C_GetText::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrazyHeal_C_GetText, Text) == 0x000008, "Member 'BP_AJBCrazyHeal_C_GetText::Text' has a wrong offset!");

// Function BP_AJBCrazyHeal.BP_AJBCrazyHeal_C.CheckInteractable
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBCrazyHeal_C_CheckInteractable final
{
public:
	class ABP_AJBInGameCharacter_C*               OperatorCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseTraceLength;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractable;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInteractable_bInteractable;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrazyHeal_C_CheckInteractable) == 0x000008, "Wrong alignment on BP_AJBCrazyHeal_C_CheckInteractable");
static_assert(sizeof(BP_AJBCrazyHeal_C_CheckInteractable) == 0x000018, "Wrong size on BP_AJBCrazyHeal_C_CheckInteractable");
static_assert(offsetof(BP_AJBCrazyHeal_C_CheckInteractable, OperatorCharacter) == 0x000000, "Member 'BP_AJBCrazyHeal_C_CheckInteractable::OperatorCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBCrazyHeal_C_CheckInteractable, TargetActor) == 0x000008, "Member 'BP_AJBCrazyHeal_C_CheckInteractable::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBCrazyHeal_C_CheckInteractable, BaseTraceLength) == 0x000010, "Member 'BP_AJBCrazyHeal_C_CheckInteractable::BaseTraceLength' has a wrong offset!");
static_assert(offsetof(BP_AJBCrazyHeal_C_CheckInteractable, bInteractable) == 0x000014, "Member 'BP_AJBCrazyHeal_C_CheckInteractable::bInteractable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrazyHeal_C_CheckInteractable, CallFunc_CheckInteractable_bInteractable) == 0x000015, "Member 'BP_AJBCrazyHeal_C_CheckInteractable::CallFunc_CheckInteractable_bInteractable' has a wrong offset!");

// Function BP_AJBCrazyHeal.BP_AJBCrazyHeal_C.GetPriority
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCrazyHeal_C_GetPriority final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrazyHeal_C_GetPriority) == 0x000004, "Wrong alignment on BP_AJBCrazyHeal_C_GetPriority");
static_assert(sizeof(BP_AJBCrazyHeal_C_GetPriority) == 0x000004, "Wrong size on BP_AJBCrazyHeal_C_GetPriority");
static_assert(offsetof(BP_AJBCrazyHeal_C_GetPriority, Priority) == 0x000000, "Member 'BP_AJBCrazyHeal_C_GetPriority::Priority' has a wrong offset!");

}

