#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameVictoryShotCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameVictoryShotCamera.BP_AJBInGameVictoryShotCamera_C
// 0x0070 (0x0800 - 0x0790)
class ABP_AJBInGameVictoryShotCamera_C final : public AAJBInGameCameraman
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ESeparateStandInputType                       InputType;                                         // 0x07A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A1[0x3];                                      // 0x07A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         XYSpeedRate;                                       // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZSpeedRate;                                        // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s_;                                                // 0x07AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__0;                                              // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpButtonPressing;                                 // 0x07B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDownButtonPressing;                               // 0x07B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bZoomInButtonPressing;                             // 0x07B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bZoomOutButtonPressing;                            // 0x07B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AAJBInGameCharacterBase*                OwningCharacter;                                   // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZoomSpeed;                                         // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFieldOfView;                                    // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxFieldOfView;                                    // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRollRightButtonPressing;                          // 0x07CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRollLeftButtonPressing;                           // 0x07CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE[0x2];                                      // 0x07CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         s__1;                                              // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentRoll;                                       // 0x07D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RollLimit;                                         // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DC[0x4];                                      // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               MatchingCharacterBP;                               // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShotSETagSelf;                                     // 0x07E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShotSETagOther;                                    // 0x07F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameVictoryShotCamera(int32 EntryPoint);
	void TakeShot();
	void ReceiveBeginPlay();
	void ROS_StopMovement();
	void StopMovement();
	void OnPressedJump();
	void ReceiveTick(float DeltaSeconds);
	void MoveForward(float Value);
	void ROC_PreparePossessed(class AAJBInGameCharacterBase* LastOwningCharacter);
	void OnPawnClientRestarted_();
	void OnPressedInteract();
	void OnReleasedL1();
	void OnPressedL1();
	void OnReleasedR1();
	void OnPressedR1();
	void OnPressedShoot();
	void OnReleasedL2();
	void OnPressedL2();
	void OnReleasedR2();
	void OnPressedR2();
	void LookupRate(float Value);
	void TurnRate(float Value);
	void MoveRight(float Value);
	void OnReleasedCrouch();
	void OnReleasedJump();
	void OnPressedCrouch();
	void UserConstructionScript();
	void CalcCameraConfigScale(float* UpDownScale, float* RightLeftScale);
	void RollCamera(bool bright);
	void CalcRollValue(bool bright, bool* bPossibleRoll, float* OutValue);
	void ResetCameraRoll();
	void RollCameraCore(float InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameVictoryShotCamera_C">();
	}
	static class ABP_AJBInGameVictoryShotCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameVictoryShotCamera_C>();
	}
};
static_assert(alignof(ABP_AJBInGameVictoryShotCamera_C) == 0x000010, "Wrong alignment on ABP_AJBInGameVictoryShotCamera_C");
static_assert(sizeof(ABP_AJBInGameVictoryShotCamera_C) == 0x000800, "Wrong size on ABP_AJBInGameVictoryShotCamera_C");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, UberGraphFrame) == 0x000790, "Member 'ABP_AJBInGameVictoryShotCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, Camera) == 0x000798, "Member 'ABP_AJBInGameVictoryShotCamera_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, InputType) == 0x0007A0, "Member 'ABP_AJBInGameVictoryShotCamera_C::InputType' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, XYSpeedRate) == 0x0007A4, "Member 'ABP_AJBInGameVictoryShotCamera_C::XYSpeedRate' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, ZSpeedRate) == 0x0007A8, "Member 'ABP_AJBInGameVictoryShotCamera_C::ZSpeedRate' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, s_) == 0x0007AC, "Member 'ABP_AJBInGameVictoryShotCamera_C::s_' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, s__0) == 0x0007B0, "Member 'ABP_AJBInGameVictoryShotCamera_C::s__0' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bUpButtonPressing) == 0x0007B4, "Member 'ABP_AJBInGameVictoryShotCamera_C::bUpButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bDownButtonPressing) == 0x0007B5, "Member 'ABP_AJBInGameVictoryShotCamera_C::bDownButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bZoomInButtonPressing) == 0x0007B6, "Member 'ABP_AJBInGameVictoryShotCamera_C::bZoomInButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bZoomOutButtonPressing) == 0x0007B7, "Member 'ABP_AJBInGameVictoryShotCamera_C::bZoomOutButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, OwningCharacter) == 0x0007B8, "Member 'ABP_AJBInGameVictoryShotCamera_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, ZoomSpeed) == 0x0007C0, "Member 'ABP_AJBInGameVictoryShotCamera_C::ZoomSpeed' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, MinFieldOfView) == 0x0007C4, "Member 'ABP_AJBInGameVictoryShotCamera_C::MinFieldOfView' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, MaxFieldOfView) == 0x0007C8, "Member 'ABP_AJBInGameVictoryShotCamera_C::MaxFieldOfView' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bRollRightButtonPressing) == 0x0007CC, "Member 'ABP_AJBInGameVictoryShotCamera_C::bRollRightButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, bRollLeftButtonPressing) == 0x0007CD, "Member 'ABP_AJBInGameVictoryShotCamera_C::bRollLeftButtonPressing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, s__1) == 0x0007D0, "Member 'ABP_AJBInGameVictoryShotCamera_C::s__1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, CurrentRoll) == 0x0007D4, "Member 'ABP_AJBInGameVictoryShotCamera_C::CurrentRoll' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, RollLimit) == 0x0007D8, "Member 'ABP_AJBInGameVictoryShotCamera_C::RollLimit' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, MatchingCharacterBP) == 0x0007E0, "Member 'ABP_AJBInGameVictoryShotCamera_C::MatchingCharacterBP' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, ShotSETagSelf) == 0x0007E8, "Member 'ABP_AJBInGameVictoryShotCamera_C::ShotSETagSelf' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameVictoryShotCamera_C, ShotSETagOther) == 0x0007F0, "Member 'ABP_AJBInGameVictoryShotCamera_C::ShotSETagOther' has a wrong offset!");

}

