#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPlacementSkill

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.ExecuteUbergraph_BP_AJBPlacementSkill
// 0x0340 (0x0340 - 0x0000)
struct BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCancel3;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel2;                       // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel1;                       // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel;                        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActionStateEnd_bActionStateEnd;      // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHidePreviewGuide;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform2;                     // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_TargetActor2;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckArriveLimit_bArriveLimit;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform1;                     // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_TargetActor1;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementBase_C*                 CallFunc_SpawnObjectCore_SpawnObject;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementBase_C*                 K2Node_CustomEvent_SelfObject;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_CalcMostOldestObject_Object;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnPreviewObjectCore_SpawnObject;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Num3;                                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Num2;                                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview;             // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview1;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TraceObjectTransform_bPossiblePlacement;  // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TraceObjectTransform_Transform;           // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_TraceObjectTransform_TargetActor;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPlacement1;                    // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue7;    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue8;    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPlacement;                     // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue9;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue9;    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue10;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue1;               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue10;   // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_Num1;                                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_AJBPlacementBase_C* SelfObject)> K2Node_CreateDelegate_OutputDelegate5; // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_Num;                                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x033E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill) == 0x000010, "Wrong alignment on BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill");
static_assert(sizeof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill) == 0x000340, "Wrong size on BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, EntryPoint) == 0x000000, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Transform) == 0x000010, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_TargetActor) == 0x000040, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000048, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000051, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetValidValue_ReturnValue) == 0x000069, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00006A, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_SwitchEnum_CmpSuccess) == 0x00006B, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x00006C, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue2) == 0x00006D, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue1) == 0x00006F, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess) == 0x000070, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000078, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel3) == 0x000080, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue) == 0x000081, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel2) == 0x000082, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel1) == 0x000083, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel) == 0x000084, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName4) == 0x000088, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000090, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000098, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue1) == 0x0000A0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_DeltaSeconds) == 0x0000A4, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_DeltaSeconds1) == 0x0000A8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_DeltaSeconds1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0000B0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName3) == 0x0000B8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue1) == 0x0000C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0000C1, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsServer_ReturnValue) == 0x0000C2, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CheckActionStateEnd_bActionStateEnd) == 0x0000C3, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CheckActionStateEnd_bActionStateEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0000C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue2) == 0x0000D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x0000D1, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_DeltaSeconds) == 0x0000D4, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bHidePreviewGuide) == 0x0000D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bHidePreviewGuide' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Transform2) == 0x0000E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Transform2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_TargetActor2) == 0x000110, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_TargetActor2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000118, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CheckArriveLimit_bArriveLimit) == 0x000128, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CheckArriveLimit_bArriveLimit' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Transform1) == 0x000130, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Transform1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_TargetActor1) == 0x000160, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_TargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_SpawnObjectCore_SpawnObject) == 0x000168, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_SpawnObjectCore_SpawnObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_SelfObject) == 0x000170, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_SelfObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000178, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000180, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000190, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001A0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001A8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue3) == 0x0001A9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x0001B0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue4) == 0x0001B8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue3) == 0x0001B9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName2) == 0x0001C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CalcMostOldestObject_Object) == 0x0001C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CalcMostOldestObject_Object' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_SpawnPreviewObjectCore_SpawnObject) == 0x0001D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_SpawnPreviewObjectCore_SpawnObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num3) == 0x0001D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num2) == 0x0001DC, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0001E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue5) == 0x0001E8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue4) == 0x0001E9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsWB_Skill_Preview) == 0x0001F0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsWB_Skill_Preview' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess1) == 0x0001F8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsWB_Skill_Preview1) == 0x000200, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsWB_Skill_Preview1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess2) == 0x000208, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x000210, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue6) == 0x000218, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue5) == 0x000219, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_bPossiblePlacement) == 0x00021A, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_Transform) == 0x000220, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_TargetActor) == 0x000250, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x000258, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000260, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue7) == 0x000270, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue6) == 0x000271, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bPlacement1) == 0x000272, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bPlacement1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Target) == 0x000278, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName1) == 0x000280, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000288, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000290, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess3) == 0x000298, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Array_Find_ReturnValue) == 0x00029C, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002A0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x0002A8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002B8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0002B9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0002C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue2) == 0x0002C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue3) == 0x0002C9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue7) == 0x0002D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue8) == 0x0002D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue7) == 0x0002D9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName) == 0x0002E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue8) == 0x0002E8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue9) == 0x0002F0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue8) == 0x0002F1, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bPlacement) == 0x0002F2, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Actor) == 0x0002F8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue9) == 0x000300, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue10) == 0x000308, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue9) == 0x000309, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, Temp_name_Variable) == 0x000310, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue10) == 0x000318, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetValidValue_ReturnValue1) == 0x000320, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetValidValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue11) == 0x000321, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000322, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue10) == 0x000323, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num1) == 0x000324, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x000328, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num) == 0x000338, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x00033C, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue1) == 0x00033D, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue2) == 0x00033E, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.OnCheckSpawnObjectServer
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 TargetActor;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer) == 0x000010, "Wrong alignment on BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer");
static_assert(sizeof(BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer) == 0x000040, "Wrong size on BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer, Transform) == 0x000000, "Member 'BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer::Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer, TargetActor) == 0x000030, "Member 'BP_AJBPlacementSkill_C_OnCheckSpawnObjectServer::TargetActor' has a wrong offset!");

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.OnSpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBPlacementSkill_C_OnSpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_OnSpawnObject) == 0x000008, "Wrong alignment on BP_AJBPlacementSkill_C_OnSpawnObject");
static_assert(sizeof(BP_AJBPlacementSkill_C_OnSpawnObject) == 0x000010, "Wrong size on BP_AJBPlacementSkill_C_OnSpawnObject");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnSpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBPlacementSkill_C_OnSpawnObject::bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnSpawnObject, Actor) == 0x000008, "Member 'BP_AJBPlacementSkill_C_OnSpawnObject::Actor' has a wrong offset!");

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.MC_SpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBPlacementSkill_C_MC_SpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_MC_SpawnObject) == 0x000008, "Wrong alignment on BP_AJBPlacementSkill_C_MC_SpawnObject");
static_assert(sizeof(BP_AJBPlacementSkill_C_MC_SpawnObject) == 0x000010, "Wrong size on BP_AJBPlacementSkill_C_MC_SpawnObject");
static_assert(offsetof(BP_AJBPlacementSkill_C_MC_SpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBPlacementSkill_C_MC_SpawnObject::bPlacement' has a wrong offset!");
