#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBringItOn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBBringItOn.BP_AJBBringItOn_C
// 0x0028 (0x0238 - 0x0210)
class UBP_AJBBringItOn_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBBringItOn_C;                  // 0x0210(0x0008)(Transient, DuplicateTransient)
	float                                         HealingMPSpeedScale;                               // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack___;                                         // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Defence___;                                        // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EndParticleTag;                                    // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackRate;                                     // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBBringItOn(int32 EntryPoint);
	void ActiveBringItOnUI();
	void SpawnEndEffect();
	void ChangeBringItOnStatus(bool bEnable);
	void OnContinuedParticleActivated();
	void ReceiveBeginPlay();
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBBringItOn_C">();
	}
	static class UBP_AJBBringItOn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBBringItOn_C>();
	}
};
static_assert(alignof(UBP_AJBBringItOn_C) == 0x000008, "Wrong alignment on UBP_AJBBringItOn_C");
static_assert(sizeof(UBP_AJBBringItOn_C) == 0x000238, "Wrong size on UBP_AJBBringItOn_C");
static_assert(offsetof(UBP_AJBBringItOn_C, UberGraphFrame_BP_AJBBringItOn_C) == 0x000210, "Member 'UBP_AJBBringItOn_C::UberGraphFrame_BP_AJBBringItOn_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, HealingMPSpeedScale) == 0x000218, "Member 'UBP_AJBBringItOn_C::HealingMPSpeedScale' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, Attack___) == 0x00021C, "Member 'UBP_AJBBringItOn_C::Attack___' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, Defence___) == 0x000220, "Member 'UBP_AJBBringItOn_C::Defence___' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, EndParticleTag) == 0x000228, "Member 'UBP_AJBBringItOn_C::EndParticleTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, KnockbackRate) == 0x000230, "Member 'UBP_AJBBringItOn_C::KnockbackRate' has a wrong offset!");

}

