#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIObjectPoolGionSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C
// 0x0038 (0x0360 - 0x0328)
class ABP_AJBAIObjectPoolGionSource_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBAIGionSource_C*>          UnusedObjects;                                     // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_AJBAIGionSource_C*>          AllObjects;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         InitialObjectCount;                                // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAIObjectPoolGionSource(int32 EntryPoint);
	void OnAIGionSourceLifeTimeElapsed(class ABP_AJBAIGionSource_C* AI_GionSource);
	void AddNewObject(bool bInitialAddition);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class ABP_AJBAIGionSource_C* GetUnusedObject();
	int32 GetTotalObjectCount();
	int32 GetUnusedObjectCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBAIObjectPoolGionSource_C">();
	}
	static class ABP_AJBAIObjectPoolGionSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBAIObjectPoolGionSource_C>();
	}
};
static_assert(alignof(ABP_AJBAIObjectPoolGionSource_C) == 0x000008, "Wrong alignment on ABP_AJBAIObjectPoolGionSource_C");
static_assert(sizeof(ABP_AJBAIObjectPoolGionSource_C) == 0x000360, "Wrong size on ABP_AJBAIObjectPoolGionSource_C");
static_assert(offsetof(ABP_AJBAIObjectPoolGionSource_C, UberGraphFrame) == 0x000328, "Member 'ABP_AJBAIObjectPoolGionSource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBAIObjectPoolGionSource_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_AJBAIObjectPoolGionSource_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBAIObjectPoolGionSource_C, UnusedObjects) == 0x000338, "Member 'ABP_AJBAIObjectPoolGionSource_C::UnusedObjects' has a wrong offset!");
static_assert(offsetof(ABP_AJBAIObjectPoolGionSource_C, AllObjects) == 0x000348, "Member 'ABP_AJBAIObjectPoolGionSource_C::AllObjects' has a wrong offset!");
static_assert(offsetof(ABP_AJBAIObjectPoolGionSource_C, InitialObjectCount) == 0x000358, "Member 'ABP_AJBAIObjectPoolGionSource_C::InitialObjectCount' has a wrong offset!");

}

