#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileSHA

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.ExecuteUbergraph_BP_AJBInGameProjectileSHA
// 0x0138 (0x0138 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bResetGravityScale;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComponent;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromSweep;                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_SweepResult;                          // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bHeadShot;                            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrate;                           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFirstHit;                            // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_KIR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_KIR;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeadShot1;                           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrate1;                          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFirstHit1;                           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CuttingRate;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bReflect;                             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_ReflectRotation;                      // 0x0114(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlocking;                            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ReflectSkillTag;                      // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAvoidSkill;                          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA) == 0x000138, "Wrong size on BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, EntryPoint) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bResetGravityScale) == 0x000004, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bResetGravityScale' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_OverlappedComponent) == 0x000008, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_OtherActor) == 0x000010, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_OtherComp) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_OtherBodyIndex) == 0x000020, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_FromSweep) == 0x000024, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_FromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_SweepResult) == 0x000028, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bHeadShot) == 0x0000B0, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bPenetrate) == 0x0000B1, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bPenetrate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bFirstHit) == 0x0000B2, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bFirstHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000C0, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, CallFunc_GetObjectClass_ReturnValue) == 0x0000D0, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_KIR) == 0x0000D8, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_KIR' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_DynamicCast_bSuccess1) == 0x0000E0, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, CallFunc_ClassIsChildOf_ReturnValue) == 0x0000E1, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, CallFunc_Not_PreBool_ReturnValue) == 0x0000E2, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_HitActor) == 0x0000E8, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_HitLocation) == 0x0000F0, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_HitNormal) == 0x0000FC, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bHeadShot1) == 0x000108, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bHeadShot1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bPenetrate1) == 0x000109, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bPenetrate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bFirstHit1) == 0x00010A, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bFirstHit1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_CuttingRate) == 0x00010C, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bDisableDamage) == 0x000110, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bReflect) == 0x000111, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bReflect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_ReflectRotation) == 0x000114, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_ReflectRotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bBlocking) == 0x000120, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bBlocking' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_ReflectSkillTag) == 0x000128, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_ReflectSkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA, K2Node_Event_bAvoidSkill) == 0x000130, "Member 'BP_AJBInGameProjectileSHA_C_ExecuteUbergraph_BP_AJBInGameProjectileSHA::K2Node_Event_bAvoidSkill' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.AddGravityScale
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_AddGravityScale final
{
public:
	bool                                          bResetGravityScale;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_AddGravityScale) == 0x000001, "Wrong alignment on BP_AJBInGameProjectileSHA_C_AddGravityScale");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_AddGravityScale) == 0x000001, "Wrong size on BP_AJBInGameProjectileSHA_C_AddGravityScale");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_AddGravityScale, bResetGravityScale) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_AddGravityScale::bResetGravityScale' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.ShowTrySpawnSHAInfo
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo final
{
public:
	struct FVector                                HitLocation_0;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustLocation;                                    // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHeight;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadius;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x002C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo) == 0x000004, "Wrong alignment on BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo) == 0x000050, "Wrong size on BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, HitLocation_0) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, HitNormal_0) == 0x00000C, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::HitNormal_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, AdjustLocation) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::AdjustLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, CapsuleHeight) == 0x000024, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::CapsuleHeight' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, CapsuleRadius) == 0x000028, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::CapsuleRadius' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, Rotation) == 0x00002C, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo, CallFunc_Add_VectorVector_ReturnValue) == 0x000044, "Member 'BP_AJBInGameProjectileSHA_C_ShowTrySpawnSHAInfo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.ShowSHAPositioningInfo
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo final
{
public:
	EPositioningSafeLocationResult                Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo) == 0x000068, "Wrong size on BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, Result) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_Concat_StrStr_ReturnValue1) == 0x000028, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_Concat_StrStr_ReturnValue2) == 0x000038, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_Concat_StrStr_ReturnValue3) == 0x000048, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo, CallFunc_Concat_StrStr_ReturnValue4) == 0x000058, "Member 'BP_AJBInGameProjectileSHA_C_ShowSHAPositioningInfo::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.TrySpawnSHA
// 0x0190 (0x0190 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_TrySpawnSHA final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array1;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable1;                             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00A4(0x000C)(IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D4(0x000C)(IsPlainOldData, NoDestructor)
	class UAJBParamContent*                       CallFunc_GetParamDefaultContent_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitDeadPlayer_bHit;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select1_Default;                            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EPositioningSafeLocationResult                CallFunc_PositioningSafeLocation_Result;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PositioningSafeLocation_SafeLocation;     // 0x013C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_PositioningSafeLocation_FirstHitActor;    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA) == 0x000010, "Wrong alignment on BP_AJBInGameProjectileSHA_C_TrySpawnSHA");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA) == 0x000190, "Wrong size on BP_AJBInGameProjectileSHA_C_TrySpawnSHA");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Location) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Normal) == 0x00000C, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Normal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_MakeArray_Array1) == 0x000030, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000040, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetActorForwardVector_ReturnValue) == 0x000044, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Temp_bool_Variable) == 0x000050, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakVector_X) == 0x000054, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakVector_Z) == 0x00005C, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Temp_string_Variable) == 0x000060, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Temp_string_Variable1) == 0x000080, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000098, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000A4, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetGameMode_ReturnValue) == 0x0000B0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode) == 0x0000C8, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_DynamicCast_bSuccess1) == 0x0000D0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_MakeRotator_ReturnValue) == 0x0000D4, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetParamDefaultContent_ReturnValue) == 0x0000E0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetParamDefaultContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, Temp_bool_Variable1) == 0x0000E8, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetFloatValue_ReturnValue) == 0x0000EC, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_GetFloatValue_ReturnValue1) == 0x0000F0, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_GetFloatValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_FMax_ReturnValue) == 0x0000F4, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000FC, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_CheckHitDeadPlayer_bHit) == 0x000114, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_CheckHitDeadPlayer_bHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_Select_Default) == 0x000118, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, K2Node_Select1_Default) == 0x000128, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_PositioningSafeLocation_Result) == 0x000138, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_PositioningSafeLocation_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_PositioningSafeLocation_SafeLocation) == 0x00013C, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_PositioningSafeLocation_SafeLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_PositioningSafeLocation_FirstHitActor) == 0x000148, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_PositioningSafeLocation_FirstHitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_TrySpawnSHA, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_AJBInGameProjectileSHA_C_TrySpawnSHA::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.CheckHitDeadPlayer
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HalfHeight;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmallAmount;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHit;                                              // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array1;                           // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_AJBCapsuleTraceForObjectsOnePlace_bReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_AJBCapsuleTraceForObjectsOnePlace_HitActor; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer) == 0x000068, "Wrong size on BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, Location) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, Direction) == 0x00000C, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::Direction' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, Radius) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::Radius' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, HalfHeight) == 0x00001C, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::HalfHeight' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, SmallAmount) == 0x000020, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::SmallAmount' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, bHit) == 0x000024, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::bHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, K2Node_MakeArray_Array1) == 0x000038, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, CallFunc_AJBCapsuleTraceForObjectsOnePlace_bReturnValue) == 0x000048, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::CallFunc_AJBCapsuleTraceForObjectsOnePlace_bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, CallFunc_AJBCapsuleTraceForObjectsOnePlace_HitActor) == 0x000050, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::CallFunc_AJBCapsuleTraceForObjectsOnePlace_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000058, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000061, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'BP_AJBInGameProjectileSHA_C_CheckHitDeadPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.OnProjectileHit
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_OnProjectileHit final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bHeadShot;                                         // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPenetrate_0;                                      // 0x00A9(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstHit;                                         // 0x00AA(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_OnProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileSHA_C_OnProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_OnProjectileHit) == 0x0000B0, "Wrong size on BP_AJBInGameProjectileSHA_C_OnProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, OverlappedComponent) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, OtherActor) == 0x000008, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, OtherComp) == 0x000010, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, OtherBodyIndex) == 0x000018, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, FromSweep) == 0x00001C, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::FromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, SweepResult) == 0x000020, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, bHeadShot) == 0x0000A8, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, bPenetrate_0) == 0x0000A9, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::bPenetrate_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnProjectileHit, bFirstHit) == 0x0000AA, "Member 'BP_AJBInGameProjectileSHA_C_OnProjectileHit::bFirstHit' has a wrong offset!");

// Function BP_AJBInGameProjectileSHA.BP_AJBInGameProjectileSHA_C.OnROS_ProjectileHit
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeadShot;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPenetrate_0;                                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstHit;                                         // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CuttingRate;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableDamage;                                    // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReflect;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReflectRotation;                                   // 0x002C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          bBlocking;                                         // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReflectSkillTag_0;                                 // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bAvoidSkill;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit) == 0x000050, "Wrong size on BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit, HitActor) == 0x000000, "Member 'BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit::HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit, HitLocation_0) == 0x000008, "Member 'BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit, HitNormal_0) == 0x000014, "Member 'BP_AJBInGameProjectileSHA_C_OnROS_ProjectileHit::HitNormal_0' has a wrong offset!");
