#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRollerPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRoadRollerPreview.BP_AJBRoadRollerPreview_C.ExecuteUbergraph_BP_AJBRoadRollerPreview
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview) == 0x000008, "Wrong alignment on BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview");
static_assert(sizeof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview) == 0x000018, "Wrong size on BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, EntryPoint) == 0x000000, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, CallFunc_IsValid_ReturnValue1) == 0x000006, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, K2Node_CustomEvent_bEnable) == 0x000010, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_AJBRoadRollerPreview_C_ExecuteUbergraph_BP_AJBRoadRollerPreview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AJBRoadRollerPreview.BP_AJBRoadRollerPreview_C.ChangeRoadRollerVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility) == 0x000001, "Wrong alignment on BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility");
static_assert(sizeof(BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility) == 0x000001, "Wrong size on BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility, bEnable) == 0x000000, "Member 'BP_AJBRoadRollerPreview_C_ChangeRoadRollerVisibility::bEnable' has a wrong offset!");

// Function BP_AJBRoadRollerPreview.BP_AJBRoadRollerPreview_C.SetDecalParameter
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBRoadRollerPreview_C_SetDecalParameter final
{
public:
	float                                         TempInnerCircleDistance;                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempOuterCircleDistance;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamContent*                       CallFunc_GetParamContentMap_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamContent*                       CallFunc_GetParamContentMap_ReturnValue1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRoadRollerPreview_C_SetDecalParameter) == 0x000008, "Wrong alignment on BP_AJBRoadRollerPreview_C_SetDecalParameter");
static_assert(sizeof(BP_AJBRoadRollerPreview_C_SetDecalParameter) == 0x000050, "Wrong size on BP_AJBRoadRollerPreview_C_SetDecalParameter");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, TempInnerCircleDistance) == 0x000000, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::TempInnerCircleDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, TempOuterCircleDistance) == 0x000004, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::TempOuterCircleDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_MakeVector_ReturnValue1) == 0x000018, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_MakeVector_ReturnValue2) == 0x000024, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_GetParamContentMap_ReturnValue) == 0x000030, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_GetParamContentMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_GetParamContentMap_ReturnValue1) == 0x000038, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_GetParamContentMap_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_IsValid_ReturnValue1) == 0x000041, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_GetFloatValue_ReturnValue) == 0x000044, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerPreview_C_SetDecalParameter, CallFunc_GetFloatValue_ReturnValue1) == 0x000048, "Member 'BP_AJBRoadRollerPreview_C_SetDecalParameter::CallFunc_GetFloatValue_ReturnValue1' has a wrong offset!");

}

