#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBVolumeDetectionComponentBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBVolumeDetectionComponentBase.BP_AJBVolumeDetectionComponentBase_C.ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase
// 0x0148 (0x0148 - 0x0000)
struct BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBVolumeDetection_C> K2Node_DynamicCast_AsBI_AJBVolume_Detection;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent1;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor1;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp1;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex1;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0090(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue1;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBVolumeDetection_C> K2Node_DynamicCast_AsBI_AJBVolume_Detection1;   // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase) == 0x000008, "Wrong alignment on BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase");
static_assert(sizeof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase) == 0x000148, "Wrong size on BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, EntryPoint) == 0x000000, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CreateDelegate_OutputDelegate1) == 0x000020, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OverlappedComponent) == 0x000030, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherActor) == 0x000038, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherComp) == 0x000040, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherBodyIndex) == 0x000048, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_DynamicCast_AsBI_AJBVolume_Detection) == 0x000058, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_DynamicCast_AsBI_AJBVolume_Detection' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValid_ReturnValue1) == 0x000069, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OverlappedComponent1) == 0x000070, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OverlappedComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherActor1) == 0x000078, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherComp1) == 0x000080, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherComp1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_OtherBodyIndex1) == 0x000088, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_OtherBodyIndex1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_bFromSweep) == 0x00008C, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_CustomEvent_SweepResult) == 0x000090, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValid_ReturnValue2) == 0x000118, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_GetComponentByClass_ReturnValue1) == 0x000120, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValidClass_ReturnValue1) == 0x000128, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValidClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_DynamicCast_AsBI_AJBVolume_Detection1) == 0x000130, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_DynamicCast_AsBI_AJBVolume_Detection1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, K2Node_DynamicCast_bSuccess1) == 0x000140, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase, CallFunc_IsValid_ReturnValue3) == 0x000141, "Member 'BP_AJBVolumeDetectionComponentBase_C_ExecuteUbergraph_BP_AJBVolumeDetectionComponentBase::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function BP_AJBVolumeDetectionComponentBase.BP_AJBVolumeDetectionComponentBase_C.OnComponentEndOverlap_Event
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event) == 0x000008, "Wrong alignment on BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event");
static_assert(sizeof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event) == 0x000020, "Wrong size on BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event, OverlappedComponent) == 0x000000, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event, OtherActor) == 0x000008, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event, OtherComp) == 0x000010, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event, OtherBodyIndex) == 0x000018, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentEndOverlap_Event::OtherBodyIndex' has a wrong offset!");

// Function BP_AJBVolumeDetectionComponentBase.BP_AJBVolumeDetectionComponentBase_C.OnComponentBeginOverlap_Event
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event) == 0x000008, "Wrong alignment on BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event");
static_assert(sizeof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event) == 0x0000A8, "Wrong size on BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, OverlappedComponent) == 0x000000, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, OtherActor) == 0x000008, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, OtherComp) == 0x000010, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, OtherBodyIndex) == 0x000018, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, bFromSweep) == 0x00001C, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event, SweepResult) == 0x000020, "Member 'BP_AJBVolumeDetectionComponentBase_C_OnComponentBeginOverlap_Event::SweepResult' has a wrong offset!");

}

