#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDiverShootSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDiverShootSkill.BP_AJBDiverShootSkill_C.ExecuteUbergraph_BP_AJBDiverShootSkill
// 0x0460 (0x0460 - 0x0000)
struct BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool bWithSeparatedStandAttack, bool bHitEnemysSeparatedStand, bool bFirstBlood, int32 UltimateSkillSerialNumberIfInEffect, float ElapsedTime, int32 DeadPlayerId, bool bIsLastDefeated, bool bPlayerKill, bool bSpecialKill, bool bSelfKill)> K2Node_CreateDelegate_OutputDelegate; // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable1;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bCancel;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRestore;                             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue2;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DuringTheWorld_Result;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue3;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Event_RepeatCount;                          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRedash;                              // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 K2Node_CustomEvent_SkillType;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_HittedCharacterCount;           // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_BlockedCharacterCount;          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InvalidatedCharacterCount;      // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBSkillType SkillType, int32 HittedCharacterCount, int32 BlockedCharacterCount, int32 InvalidatedCharacterCount)> K2Node_CreateDelegate_OutputDelegate11; // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag;                       // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SerialNumber;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AttackDistance;                 // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_KilledCharacterId;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWithSeparatedStandAttack;      // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bHitEnemysSeparatedStand;       // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFirstBlood;                    // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_UltimateSkillSerialNumberIfInEffect; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DeadPlayerId;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsLastDefeated;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPlayerKill;                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSpecialKill;                   // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSelfKill;                      // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue4;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3;         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x0370(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0384(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Normal;                               // 0x0390(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCharacter;                           // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DamageDecal_DiverShoot_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_Event_HitComponent;                         // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x03F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0404(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CuttingRate;                          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_SurfaceType;                          // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInvincible;                          // 0x0416(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPenetration;                       // 0x0417(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlockedByAAP;                        // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHeadShot;                            // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAvoidSkill;                          // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate16;            // 0x0430(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill) == 0x000010, "Wrong alignment on BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill");
static_assert(sizeof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill) == 0x000460, "Wrong size on BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, EntryPoint) == 0x000000, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000020, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000029, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName10) == 0x000030, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_name_Variable) == 0x000038, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue1) == 0x000040, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000058, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000060, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000070, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName11) == 0x000078, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000080, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue2) == 0x000090, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000098, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue3) == 0x0000A0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue4) == 0x0000B0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000B1, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0000B8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000C0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_bSuccess1) == 0x0000C8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName12) == 0x0000D0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_float_Variable) == 0x0000D8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0000DC, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_Operator) == 0x0000E0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_Time) == 0x0000E8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_Timing) == 0x0000EC, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_bEnable) == 0x0000ED, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_bOperatorIsEmpty) == 0x0000EE, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_float_Variable1) == 0x0000F0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_bool_Variable) == 0x0000F4, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_name_Variable1) == 0x0000F8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Select_Default) == 0x000100, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetValidValue_ReturnValue) == 0x000104, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_DeltaSeconds) == 0x000108, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_SwitchEnum_CmpSuccess) == 0x00010C, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_DeltaSeconds) == 0x000110, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000114, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_Add_FloatFloat_ReturnValue) == 0x000118, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName) == 0x000120, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000128, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_int_Variable) == 0x000138, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName1) == 0x000140, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x000148, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000158, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x000160, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_bCancel) == 0x000170, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_bCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_bRestore) == 0x000171, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_bRestore' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000172, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_BooleanOR_ReturnValue) == 0x000173, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000178, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000188, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_bSuccess2) == 0x000190, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000198, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue5) == 0x0001A1, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x0001A2, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName2) == 0x0001A8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate6) == 0x0001B0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName3) == 0x0001C0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName13) == 0x0001C8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerStand_ReturnValue2) == 0x0001D0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerStand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x0001D8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_bSuccess3) == 0x0001E0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate7) == 0x0001E8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x0001F8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_DuringTheWorld_Result) == 0x000200, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_DuringTheWorld_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName4) == 0x000208, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerStand_ReturnValue3) == 0x000210, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerStand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2) == 0x000218, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_DynamicCast_bSuccess4) == 0x000220, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate8) == 0x000228, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000238, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_IsValid_ReturnValue6) == 0x000240, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_RepeatCount) == 0x000241, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_RepeatCount' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_Event_bRedash) == 0x000242, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_Event_bRedash' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000248, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, Temp_name_Variable2) == 0x000260, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate9) == 0x000268, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName5) == 0x000278, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName14) == 0x000280, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName14' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CreateDelegate_OutputDelegate10) == 0x000288, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000298, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x0002A0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_NotifyName6) == 0x0002A8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_SkillType) == 0x0002B0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_SkillType' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_HittedCharacterCount) == 0x0002B4, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_HittedCharacterCount' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_BlockedCharacterCount) == 0x0002B8, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_BlockedCharacterCount' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, K2Node_CustomEvent_InvalidatedCharacterCount) == 0x0002BC, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::K2Node_CustomEvent_InvalidatedCharacterCount' has a wrong offset!");
static_assert(offsetof(BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill, CallFunc_Add_IntInt_ReturnValue) == 0x0002C0, "Member 'BP_AJBDiverShootSkill_C_ExecuteUbergraph_BP_AJBDiverShootSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
