#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOverdrive

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBOverdrive.BP_AJBOverdrive_C.ExecuteUbergraph_BP_AJBOverdrive
// 0x03E0 (0x03E0 - 0x0000)
struct BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0018)()
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x00C8(0x0018)()
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2; // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3; // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self_CastInput; // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self1_CastInput; // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self2_CastInput; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self3_CastInput; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self4_CastInput; // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5; // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface6; // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface7; // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface8; // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface9; // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface10; // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface11; // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess19;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface12; // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess20;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue1;         // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Passive_Overdrive_C*                K2Node_DynamicCast_AsWB_Passive_Overdrive;         // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess21;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess22;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive) == 0x000008, "Wrong alignment on BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive");
static_assert(sizeof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive) == 0x0003E0, "Wrong size on BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, EntryPoint) == 0x000000, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000004, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_Event_bTriggeredByStand) == 0x000078, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_Event_bTriggeredByStand1) == 0x000079, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00007A, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000080, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000088, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue1) == 0x000090, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000098, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess1) == 0x0000A0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue2) == 0x0000A8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetCharacterName_CharacterName) == 0x0000B0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0000B8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_Conv_NameToText_ReturnValue1) == 0x0000C8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_HasLocalSharedController_ReturnValue) == 0x0000E0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_MakeStruct_FormatArgumentData1) == 0x0000E8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue3) == 0x000138, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_Format_ReturnValue) == 0x000140, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000158, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess3) == 0x000160, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_Conv_TextToString_ReturnValue) == 0x000168, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_Conv_StringToName_ReturnValue) == 0x000178, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue4) == 0x000180, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000188, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000190, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess4) == 0x000198, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000199, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue5) == 0x0001A0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue6) == 0x0001A8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x0001B0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess5) == 0x0001B8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x0001C0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess6) == 0x0001C8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0001D0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess7) == 0x0001E0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x0001E8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess8) == 0x0001F8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2) == 0x000200, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess9) == 0x000210, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3) == 0x000218, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess10) == 0x000228, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RemoveGameplayTag_self_CastInput) == 0x000230, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RemoveGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetComponentByClass_ReturnValue) == 0x000240, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RemoveGameplayTag_self1_CastInput) == 0x000248, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RemoveGameplayTag_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsValid_ReturnValue) == 0x000258, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RemoveGameplayTag_self2_CastInput) == 0x000260, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RemoveGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RemoveGameplayTag_self3_CastInput) == 0x000270, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RemoveGameplayTag_self3_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RemoveGameplayTag_self4_CastInput) == 0x000280, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RemoveGameplayTag_self4_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue7) == 0x000290, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsValid_ReturnValue1) == 0x000298, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x0002A0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess11) == 0x0002A8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4) == 0x0002B0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess12) == 0x0002C0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5) == 0x0002C8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess13) == 0x0002D8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface6) == 0x0002E0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface6' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess14) == 0x0002F0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface7) == 0x0002F8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface7' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess15) == 0x000308, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface8) == 0x000310, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface8' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess16) == 0x000320, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface9) == 0x000328, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface9' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess17) == 0x000338, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface10) == 0x000340, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface10' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess18) == 0x000350, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess18' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface11) == 0x000358, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface11' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess19) == 0x000368, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess19' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface12) == 0x000370, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface12' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess20) == 0x000380, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess20' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetComponentByClass_ReturnValue1) == 0x000388, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsWB_Passive_Overdrive) == 0x000390, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsWB_Passive_Overdrive' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess21) == 0x000398, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess21' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsValid_ReturnValue2) == 0x000399, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetOwner_ReturnValue8) == 0x0003A0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0003A8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, K2Node_DynamicCast_bSuccess22) == 0x0003B0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::K2Node_DynamicCast_bSuccess22' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003B8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_GetObjectClass_ReturnValue) == 0x0003C0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x0003C8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x0003D0, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0003D8, "Member 'BP_AJBOverdrive_C_ExecuteUbergraph_BP_AJBOverdrive::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");

// Function BP_AJBOverdrive.BP_AJBOverdrive_C.OnActionInactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOverdrive_C_OnActionInactivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOverdrive_C_OnActionInactivate) == 0x000001, "Wrong alignment on BP_AJBOverdrive_C_OnActionInactivate");
static_assert(sizeof(BP_AJBOverdrive_C_OnActionInactivate) == 0x000001, "Wrong size on BP_AJBOverdrive_C_OnActionInactivate");
static_assert(offsetof(BP_AJBOverdrive_C_OnActionInactivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBOverdrive_C_OnActionInactivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBOverdrive.BP_AJBOverdrive_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOverdrive_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOverdrive_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBOverdrive_C_OnActionActivate");
static_assert(sizeof(BP_AJBOverdrive_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBOverdrive_C_OnActionActivate");
static_assert(offsetof(BP_AJBOverdrive_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBOverdrive_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

}

