#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRoller

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRoadRoller.BP_AJBRoadRoller_C.ExecuteUbergraph_BP_AJBRoadRoller
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller) == 0x000008, "Wrong alignment on BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller");
static_assert(sizeof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller) == 0x000040, "Wrong size on BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, EntryPoint) == 0x000000, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000004, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_BreakVector_X) == 0x000014, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_BreakVector_Z) == 0x00001C, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller, CallFunc_IsValid_ReturnValue1) == 0x000038, "Member 'BP_AJBRoadRoller_C_ExecuteUbergraph_BP_AJBRoadRoller::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

}

