#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrimsonDimensionAffecter

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCrimsonDimensionAffecter.BP_AJBCrimsonDimensionAffecter_C.ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter
// 0x03A0 (0x03A0 - 0x0000)
struct BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEnableDamage_bEnabled;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveState_bActiveState;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveState_bActiveState1;           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Character;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_AJBInGameCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate; // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue2;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_CustomEvent_NotOwnerCharacters1;            // 0x0108(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_CustomEvent_NotOwnerCharacters;             // 0x0118(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue6;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue7;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue8;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue9;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue10;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCrimsonDimensionSkill_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue11;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCrimsonDimensionSkill_C*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCapsuleRadius_CapsuleRadius;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight;   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDamageDetectionCD_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters; // 0x0250(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters1; // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item1;                          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_DVL_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_DVL;  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue12;          // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue13;          // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue14;          // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0297(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue15;          // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x02A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue16;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue17;          // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x02D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag1;                     // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag;                      // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate1; // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag)> K2Node_CreateDelegate_OutputDelegate2; // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor2;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor3;      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters2; // 0x0390(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter) == 0x000010, "Wrong alignment on BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter");
static_assert(sizeof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter) == 0x0003A0, "Wrong size on BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, EntryPoint) == 0x000000, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_CheckEnableDamage_bEnabled) == 0x000004, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_CheckEnableDamage_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_delegate_Variable) == 0x000008, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_bool_Variable) == 0x00001C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Operator) == 0x000020, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Time) == 0x000028, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Timing) == 0x00002C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_bEnable) == 0x00002D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_bOperatorIsEmpty) == 0x00002E, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue) == 0x00002F, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_CharacterBP1) == 0x000038, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_RemoveItem_ReturnValue) == 0x000040, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue) == 0x000041, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000044, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000050, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_CheckActiveState_bActiveState) == 0x000059, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_CheckActiveState_bActiveState' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_CheckActiveState_bActiveState1) == 0x00005A, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_CheckActiveState_bActiveState1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_Character) == 0x000060, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetGameMode_ReturnValue) == 0x000068, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode) == 0x000070, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000079, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue1) == 0x00007A, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00007B, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_float_Variable) == 0x00007C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000080, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_float_Variable1) == 0x000084, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Select_Default) == 0x000088, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue4) == 0x00008C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue2) == 0x00008D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue5) == 0x0000A0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000A8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager) == 0x0000B0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue1) == 0x0000C0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1) == 0x0000C8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess3) == 0x0000D0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue2) == 0x0000D8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue1) == 0x0000E0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2) == 0x0000E8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess4) == 0x0000F0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000F8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess5) == 0x000100, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_NotOwnerCharacters1) == 0x000108, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_NotOwnerCharacters1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_NotOwnerCharacters) == 0x000118, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_NotOwnerCharacters' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue6) == 0x000128, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue2) == 0x000130, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue7) == 0x000138, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000140, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess6) == 0x000148, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_HasLocalSharedController_ReturnValue) == 0x000149, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue8) == 0x00014A, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue3) == 0x000150, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000158, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess7) == 0x000160, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000161, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue9) == 0x000162, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000168, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000170, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue1) == 0x000178, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue10) == 0x000179, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue4) == 0x000180, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue2) == 0x000188, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000190, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess8) == 0x000198, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetComponentByClass_ReturnValue) == 0x0001A0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue3) == 0x0001A8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue11) == 0x0001A9, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue5) == 0x0001B0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x0001B8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess9) == 0x0001C0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetComponentByClass_ReturnValue1) == 0x0001C8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue4) == 0x0001D0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_int_Array_Index_Variable) == 0x0001D4, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue6) == 0x0001E0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_int_Array_Index_Variable1) == 0x0001E8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x0001F0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess10) == 0x0001F8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetTransform_ReturnValue) == 0x000200, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetCapsuleRadius_CapsuleRadius) == 0x000230, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetCapsuleRadius_CapsuleRadius' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000238, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight) == 0x000240, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_FinishSpawningActor_ReturnValue) == 0x000248, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetNotOwnerCharacters_NowOwnerCharacters) == 0x000250, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetNotOwnerCharacters_NowOwnerCharacters' has a wrong offset!");
