#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_JTR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_JTR.BP_AJBInGameCharacter_JTR_C
// 0x0030 (0x17E0 - 0x17B0)
class ABP_AJBInGameCharacter_JTR_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_JTR_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBAccompanySTPSkill_C*             BP_AJBAccompanySTPSkill;                           // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBTheWorldSTPSkill_C*              BP_AJBTheWorldSTPSkill;                            // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBBlockingRushSTPSkill_C*          BP_AJBBlockingRushSTPSkill;                        // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBOraRushSkill_C*                  BP_AJBOraRushSkill;                                // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BlockingBox;                                       // 0x17D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_JTR(int32 EntryPoint);
	void OnBlocking(const struct FVector& BlockingLocation, bool Reflect, bool bIsPairAttack, bool bImpulseDamage, class AActor* DamageOwner, bool bSeparateStandAttack);
	void CheckBlockingValid(class AActor* DamageActor, bool* bBlockingValid);
	void CheckBlockingComponent(class UPrimitiveComponent* Component, bool* bBlockingComponent);
	void IgnoreGivePassive(class UPrimitiveComponent* Component, bool* bIgnore);
	void BlockPenetrate(class AActor* CauserActor, bool* bBlock);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void GetDummyShotLocation(struct FVector* Location);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Ultimate();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_JTR_C">();
	}
	static class ABP_AJBInGameCharacter_JTR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_JTR_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_JTR_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_JTR_C");
static_assert(sizeof(ABP_AJBInGameCharacter_JTR_C) == 0x0017E0, "Wrong size on ABP_AJBInGameCharacter_JTR_C");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, UberGraphFrame_BP_AJBInGameCharacter_JTR_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_JTR_C::UberGraphFrame_BP_AJBInGameCharacter_JTR_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, BP_AJBAccompanySTPSkill) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_JTR_C::BP_AJBAccompanySTPSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, BP_AJBTheWorldSTPSkill) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_JTR_C::BP_AJBTheWorldSTPSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, BP_AJBBlockingRushSTPSkill) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_JTR_C::BP_AJBBlockingRushSTPSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, BP_AJBOraRushSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_JTR_C::BP_AJBOraRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_JTR_C, BlockingBox) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_JTR_C::BlockingBox' has a wrong offset!");

}

