#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBVirusInfection

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBVirusInfection.BP_AJBVirusInfection_C.ExecuteUbergraph_BP_AJBVirusInfection
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_IsAlive;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckQueuedVoiceTag_bQueued;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckQueuedVoiceTag_QueuedNum;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_Causer;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_PassiveSkillAffecterInterface_C> K2Node_DynamicCast_AsBI_Passive_Skill_Affecter_Interface; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetCauserOwnerCharacterBP_CharacterBP;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue1;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection) == 0x000008, "Wrong alignment on BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection");
static_assert(sizeof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection) == 0x0000B8, "Wrong size on BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, EntryPoint) == 0x000000, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_GetOwner_ReturnValue1) == 0x000010, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000028, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_IsAlive_IsAlive) == 0x000031, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_IsAlive_IsAlive' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_IsPlayerController_ReturnValue) == 0x000033, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_HasLocalSharedController_ReturnValue) == 0x000034, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_IsServer_ReturnValue) == 0x000035, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_Event_bTriggeredByStand1) == 0x00003C, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x00003D, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00003E, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, Temp_bool_True_if_break_was_hit_Variable) == 0x000050, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_CheckQueuedVoiceTag_bQueued) == 0x000051, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_CheckQueuedVoiceTag_bQueued' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_CheckQueuedVoiceTag_QueuedNum) == 0x000054, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_CheckQueuedVoiceTag_QueuedNum' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Not_PreBool_ReturnValue1) == 0x000058, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Not_PreBool_ReturnValue2) == 0x000068, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_IsDedicatedServer_ReturnValue) == 0x000070, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Less_IntInt_ReturnValue) == 0x000071, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_BooleanAND_ReturnValue1) == 0x000078, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_Event_Causer) == 0x000080, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_Event_bTriggeredByStand) == 0x000088, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_AsBI_Passive_Skill_Affecter_Interface) == 0x000090, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_AsBI_Passive_Skill_Affecter_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, K2Node_DynamicCast_bSuccess2) == 0x0000A0, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_GetCauserOwnerCharacterBP_CharacterBP) == 0x0000A8, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_GetCauserOwnerCharacterBP_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0000B0, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection, CallFunc_IsPlayerController_ReturnValue1) == 0x0000B1, "Member 'BP_AJBVirusInfection_C_ExecuteUbergraph_BP_AJBVirusInfection::CallFunc_IsPlayerController_ReturnValue1' has a wrong offset!");

// Function BP_AJBVirusInfection.BP_AJBVirusInfection_C.MakeDamageDisplayProperty
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBVirusInfection_C_MakeDamageDisplayProperty final
{
public:
	struct FAJBDamageDisplayProperty              CharacterDamageDisplayProperty;                    // 0x0000(0x0003)(Parm, OutParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBDamageDisplayProperty              CallFunc_MakeDamageDisplayProperty_CharacterDamageDisplayProperty; // 0x0010(0x0003)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAJBDamageDisplayProperty              K2Node_MakeStruct_AJBDamageDisplayProperty;        // 0x0023(0x0003)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty) == 0x000008, "Wrong alignment on BP_AJBVirusInfection_C_MakeDamageDisplayProperty");
static_assert(sizeof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty) == 0x000028, "Wrong size on BP_AJBVirusInfection_C_MakeDamageDisplayProperty");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, CharacterDamageDisplayProperty) == 0x000000, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::CharacterDamageDisplayProperty' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, CallFunc_MakeDamageDisplayProperty_CharacterDamageDisplayProperty) == 0x000010, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::CallFunc_MakeDamageDisplayProperty_CharacterDamageDisplayProperty' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, CallFunc_DoesImplementInterface_ReturnValue) == 0x000021, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusInfection_C_MakeDamageDisplayProperty, K2Node_MakeStruct_AJBDamageDisplayProperty) == 0x000023, "Member 'BP_AJBVirusInfection_C_MakeDamageDisplayProperty::K2Node_MakeStruct_AJBDamageDisplayProperty' has a wrong offset!");

// Function BP_AJBVirusInfection.BP_AJBVirusInfection_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBVirusInfection_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBVirusInfection_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBVirusInfection_C_OnActionActivate");
static_assert(sizeof(BP_AJBVirusInfection_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBVirusInfection_C_OnActionActivate");
static_assert(offsetof(BP_AJBVirusInfection_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBVirusInfection_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBVirusInfection.BP_AJBVirusInfection_C.PlaySE
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBVirusInfection_C_PlaySE final
{
public:
	class UObject*                                Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVirusInfection_C_PlaySE) == 0x000008, "Wrong alignment on BP_AJBVirusInfection_C_PlaySE");
static_assert(sizeof(BP_AJBVirusInfection_C_PlaySE) == 0x000008, "Wrong size on BP_AJBVirusInfection_C_PlaySE");
static_assert(offsetof(BP_AJBVirusInfection_C_PlaySE, Causer) == 0x000000, "Member 'BP_AJBVirusInfection_C_PlaySE::Causer' has a wrong offset!");

// Function BP_AJBVirusInfection.BP_AJBVirusInfection_C.OnActionInactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBVirusInfection_C_OnActionInactivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBVirusInfection_C_OnActionInactivate) == 0x000001, "Wrong alignment on BP_AJBVirusInfection_C_OnActionInactivate");
static_assert(sizeof(BP_AJBVirusInfection_C_OnActionInactivate) == 0x000001, "Wrong size on BP_AJBVirusInfection_C_OnActionInactivate");
static_assert(offsetof(BP_AJBVirusInfection_C_OnActionInactivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBVirusInfection_C_OnActionInactivate::bTriggeredByStand' has a wrong offset!");

}

