#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameMessageManagerProxy

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameMessageManagerProxy.BP_AJBInGameMessageManagerProxy_C.ExecuteUbergraph_BP_AJBInGameMessageManagerProxy
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MessageType;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value1;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value2;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy) == 0x000004, "Wrong alignment on BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy");
static_assert(sizeof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy) == 0x000010, "Wrong size on BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy, EntryPoint) == 0x000000, "Member 'BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy, K2Node_CustomEvent_MessageType) == 0x000004, "Member 'BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy::K2Node_CustomEvent_MessageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy, K2Node_CustomEvent_Value1) == 0x000008, "Member 'BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy::K2Node_CustomEvent_Value1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy, K2Node_CustomEvent_Value2) == 0x00000C, "Member 'BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy::K2Node_CustomEvent_Value2' has a wrong offset!");

// Function BP_AJBInGameMessageManagerProxy.BP_AJBInGameMessageManagerProxy_C.RequestMessage
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameMessageManagerProxy_C_RequestMessage final
{
public:
	int32                                         MessageType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value1;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value2;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameMessageManagerProxy_C_RequestMessage) == 0x000004, "Wrong alignment on BP_AJBInGameMessageManagerProxy_C_RequestMessage");
static_assert(sizeof(BP_AJBInGameMessageManagerProxy_C_RequestMessage) == 0x00000C, "Wrong size on BP_AJBInGameMessageManagerProxy_C_RequestMessage");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_RequestMessage, MessageType) == 0x000000, "Member 'BP_AJBInGameMessageManagerProxy_C_RequestMessage::MessageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_RequestMessage, Value1) == 0x000004, "Member 'BP_AJBInGameMessageManagerProxy_C_RequestMessage::Value1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameMessageManagerProxy_C_RequestMessage, Value2) == 0x000008, "Member 'BP_AJBInGameMessageManagerProxy_C_RequestMessage::Value2' has a wrong offset!");

}

