#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHearingThings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBHearingThings.BP_AJBHearingThings_C
// 0x0048 (0x0258 - 0x0210)
class UBP_AJBHearingThings_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBHearingThings_C;              // 0x0210(0x0008)(Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   SpawnGionList;                                     // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         Sec_;                                              // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningRateOn3D;                              // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningPointForwardOffset_cm_;                // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningPointVelocityOffsetMultiplier;         // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GionSpawningBoxExtent;                             // 0x0238(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectileKOIEcho_C*       PassiveSkillCausingEcho;                           // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HearingAbilityRate;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBHearingThings(int32 EntryPoint);
	void ChangeEnable(bool bEnable);
	void MC_RequestEchoGion(const struct FGameplayTag& EffectType, const struct FVector& WorldLocation, class USceneComponent* SceneComponentToAttachWwise);
	void ROS_RequestEchoGion(const struct FGameplayTag& EffectType, const struct FVector& WorldLocation, class USceneComponent* SceneComponentToAttachWwise);
	void ChangeStatus(bool bEnable);
	void ReceiveBeginPlay();
	void PlaySE(class UObject* Causer);
	void OnActionActivate(bool bTriggeredByStand);
	void OnActionInactivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBHearingThings_C">();
	}
	static class UBP_AJBHearingThings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBHearingThings_C>();
	}
};
static_assert(alignof(UBP_AJBHearingThings_C) == 0x000008, "Wrong alignment on UBP_AJBHearingThings_C");
static_assert(sizeof(UBP_AJBHearingThings_C) == 0x000258, "Wrong size on UBP_AJBHearingThings_C");
static_assert(offsetof(UBP_AJBHearingThings_C, UberGraphFrame_BP_AJBHearingThings_C) == 0x000210, "Member 'UBP_AJBHearingThings_C::UberGraphFrame_BP_AJBHearingThings_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, SpawnGionList) == 0x000218, "Member 'UBP_AJBHearingThings_C::SpawnGionList' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, Sec_) == 0x000228, "Member 'UBP_AJBHearingThings_C::Sec_' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, GionSpawningRateOn3D) == 0x00022C, "Member 'UBP_AJBHearingThings_C::GionSpawningRateOn3D' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, GionSpawningPointForwardOffset_cm_) == 0x000230, "Member 'UBP_AJBHearingThings_C::GionSpawningPointForwardOffset_cm_' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, GionSpawningPointVelocityOffsetMultiplier) == 0x000234, "Member 'UBP_AJBHearingThings_C::GionSpawningPointVelocityOffsetMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, GionSpawningBoxExtent) == 0x000238, "Member 'UBP_AJBHearingThings_C::GionSpawningBoxExtent' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, PassiveSkillCausingEcho) == 0x000248, "Member 'UBP_AJBHearingThings_C::PassiveSkillCausingEcho' has a wrong offset!");
static_assert(offsetof(UBP_AJBHearingThings_C, HearingAbilityRate) == 0x000250, "Member 'UBP_AJBHearingThings_C::HearingAbilityRate' has a wrong offset!");

}

