#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneSpecialImpulse

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBCrossfireHurricaneSpecialImpulse.BP_AJBCrossfireHurricaneSpecialImpulse_C.GetSkillClass
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass final
{
public:
	class AActor*                                 Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameSkillComponent*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBCrossFireHurricaneSpecialSkill_C* CallFunc_GetComponentByClass_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass) == 0x000008, "Wrong alignment on BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass");
static_assert(sizeof(BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass) == 0x000018, "Wrong size on BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass");
static_assert(offsetof(BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass, Owner_0) == 0x000000, "Member 'BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass::Owner_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass, ReturnValue) == 0x000008, "Member 'BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_AJBCrossfireHurricaneSpecialImpulse_C_GetSkillClass::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

