#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileTrailBase

#include "Basic.hpp"

#include "BP_AJBActorBase_classes.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameProjectileTrailBase.BP_AJBInGameProjectileTrailBase_C
// 0x0018 (0x0348 - 0x0330)
class ABP_AJBInGameProjectileTrailBase_C : public ABP_AJBActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               TrailParticle_GL;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TrailParticle;                                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameProjectileTrailBase(int32 EntryPoint);
	void OnOwnerDestroyed(class AActor* DestroyedActor);
	void ReceiveBeginPlay();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameProjectileTrailBase_C">();
	}
	static class ABP_AJBInGameProjectileTrailBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameProjectileTrailBase_C>();
	}
};
static_assert(alignof(ABP_AJBInGameProjectileTrailBase_C) == 0x000008, "Wrong alignment on ABP_AJBInGameProjectileTrailBase_C");
static_assert(sizeof(ABP_AJBInGameProjectileTrailBase_C) == 0x000348, "Wrong size on ABP_AJBInGameProjectileTrailBase_C");
static_assert(offsetof(ABP_AJBInGameProjectileTrailBase_C, UberGraphFrame) == 0x000330, "Member 'ABP_AJBInGameProjectileTrailBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileTrailBase_C, TrailParticle_GL) == 0x000338, "Member 'ABP_AJBInGameProjectileTrailBase_C::TrailParticle_GL' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileTrailBase_C, TrailParticle) == 0x000340, "Member 'ABP_AJBInGameProjectileTrailBase_C::TrailParticle' has a wrong offset!");

}

