#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBModeBase

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBModeBase.BP_AJBModeBase_C.ExecuteUbergraph_BP_AJBModeBase
// 0x03F8 (0x03F8 - 0x0000)
struct BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetAnimTarget_AnimTarget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetAnimTarget_AnimTarget1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base3;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base4;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base5;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSeconds3;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds2;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds1;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyModeChanging_IsReady;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base6;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyModeChanging_IsReady1;             // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyModeChanging_IsReady2;             // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyModeChanging_IsReady3;             // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MathExpression_ReturnValue;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBModePassiveState                          Temp_byte_Variable;                                // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable1;                               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue3;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess4;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance4;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue4;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess5;             // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance5;    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue5;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess6;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance6;    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue6;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess7;             // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance7;    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue7;             // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Causer;                               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_CauserType;                           // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_PropagationSource;                    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Causer;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTriggeredByStand;              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_CauserType;                     // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SerialNumber;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_PropagationSource;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName1_CmpSuccess;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base7;   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue7;    // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0363(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0370(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBitesTheDust;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bBitesTheDust)>           K2Node_CreateDelegate_OutputDelegate9;             // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue1;               // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3[0x5];                                      // 0x03E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase) == 0x000008, "Wrong alignment on BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase");
static_assert(sizeof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase) == 0x0003F8, "Wrong size on BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, EntryPoint) == 0x000000, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000010, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAnimTarget_AnimTarget) == 0x000020, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAnimTarget_AnimTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue) == 0x000028, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_name_Variable) == 0x000030, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue1) == 0x000038, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000040, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAnimTarget_AnimTarget1) == 0x000050, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAnimTarget_AnimTarget1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000058, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsValid_ReturnValue1) == 0x000059, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_IsClosed_Variable) == 0x00005A, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Has_Been_Initd_Variable) == 0x00005B, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName9) == 0x000060, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_IsClosed_Variable1) == 0x000068, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Has_Been_Initd_Variable1) == 0x000069, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue2) == 0x000070, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsServer_ReturnValue) == 0x000078, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x000080, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000089, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000A1, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName10) == 0x0000A8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsValid_ReturnValue2) == 0x0000B0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_IsClosed_Variable2) == 0x0000B1, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Has_Been_Initd_Variable2) == 0x0000B2, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_IsClosed_Variable3) == 0x0000B3, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Has_Been_Initd_Variable3) == 0x0000B4, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue3) == 0x0000B8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base3) == 0x0000C0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess3) == 0x0000C8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue3) == 0x0000C9, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue4) == 0x0000E0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000E8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000F0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess4) == 0x0000F8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue5) == 0x000100, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base4) == 0x000108, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess5) == 0x000110, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue4) == 0x000111, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName11) == 0x000118, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue6) == 0x000120, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base5) == 0x000128, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess6) == 0x000130, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsServer_ReturnValue1) == 0x000131, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue5) == 0x000132, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Variable) == 0x000133, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_DeltaSeconds3) == 0x000134, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_DeltaSeconds3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_DeltaSeconds2) == 0x000138, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_DeltaSeconds2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_DeltaSeconds1) == 0x00013C, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_DeltaSeconds1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetOwner_ReturnValue7) == 0x000140, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsReadyModeChanging_IsReady) == 0x000148, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsReadyModeChanging_IsReady' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base6) == 0x000150, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base6' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_DynamicCast_bSuccess7) == 0x000158, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_HasLocalSharedController_ReturnValue6) == 0x000159, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_HasLocalSharedController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Variable1) == 0x00015A, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Variable2) == 0x00015B, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_bool_Variable3) == 0x00015C, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsReadyModeChanging_IsReady1) == 0x00015D, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsReadyModeChanging_IsReady1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsReadyModeChanging_IsReady2) == 0x00015E, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsReadyModeChanging_IsReady2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsReadyModeChanging_IsReady3) == 0x00015F, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsReadyModeChanging_IsReady3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_MathExpression_ReturnValue) == 0x000160, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsServer_ReturnValue2) == 0x000161, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_byte_Variable) == 0x000162, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CreateDelegate_OutputDelegate2) == 0x000168, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_DeltaSeconds) == 0x000178, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetValidValue_ReturnValue) == 0x00017C, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_SwitchEnum_CmpSuccess) == 0x00017D, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, Temp_name_Variable1) == 0x000180, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess) == 0x000188, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000190, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue) == 0x000198, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess1) == 0x00019A, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x0001A0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue1) == 0x0001A8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName12) == 0x0001B0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsServer_ReturnValue3) == 0x0001B8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName4) == 0x0001C0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0001C8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0001D0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue2) == 0x0001D8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_Not_PreBool_ReturnValue1) == 0x0001D9, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CreateDelegate_OutputDelegate3) == 0x0001E0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess3) == 0x0001F0, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance3) == 0x0001F8, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue3) == 0x000200, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CreateDelegate_OutputDelegate4) == 0x000208, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess4) == 0x000218, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance4) == 0x000220, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, K2Node_CustomEvent_NotifyName5) == 0x000228, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue4) == 0x000230, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_Not_PreBool_ReturnValue2) == 0x000231, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_bSuccess5) == 0x000232, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance5) == 0x000238, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance5' has a wrong offset!");
static_assert(offsetof(BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase, CallFunc_IsPlayingReplay_ReturnValue5) == 0x000240, "Member 'BP_AJBModeBase_C_ExecuteUbergraph_BP_AJBModeBase::CallFunc_IsPlayingReplay_ReturnValue5' has a wrong offset!");
