#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHamonBreathingSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHamonBreathingSkill.BP_AJBHamonBreathingSkill_C.ExecuteUbergraph_BP_AJBHamonBreathingSkill
// 0x02C8 (0x02C8 - 0x0000)
struct BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRangeTiming_bResult;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHamonMode_bIsHamonMode;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue1;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHamonMode_bIsHamonMode1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable1;                               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable2;                               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Timing;                         // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaySE3;                       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLastHamonModeEnabled3;        // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBSwitchPlayerKindOutPin                    CallFunc_SwitchPlayerKind_Impl_OutBranches;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReInputTiming_bResult;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate; // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTiming_bResult;                         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTiming_bResult1;                        // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_wildcard_Variable;                            // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Select_Default;                             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJustTiming_bResult;                     // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsJustTiming_bResult1;                    // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select2_Default;                            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue2;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHamonMode_bIsHamonMode2;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_Result2;                        // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaySE2;                       // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLastHamonModeEnabled2;        // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_Result1;                        // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StateTimeRatio1;                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaySE1;                       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLastHamonModeEnabled1;        // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_Result;                         // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StateTimeRatio;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaySE;                        // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLastHamonModeEnabled;         // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBHighlightManager*                   CallFunc_GetHighlightManager_HighlightManager;     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStateTimeRatio_StateTimeRatio;         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBSwitchPlayerKindOutPin                    CallFunc_SwitchPlayerKind_Impl_OutBranches1;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue3;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHamonMode_bIsHamonMode3;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue13;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent2; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRangeTiming_bResult1;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue14;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue4;         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue15;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue9;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue16;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue3;         // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent3; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bShouldRestore;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue17;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTiming_bResult2;                        // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsJustTiming_bResult2;                    // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutRangeTiming_bResult;                 // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue10;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue18;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutRangeTiming_bResult1;                // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill) == 0x000008, "Wrong alignment on BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill");
static_assert(sizeof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill) == 0x0002C8, "Wrong size on BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, EntryPoint) == 0x000000, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsInRangeTiming_bResult) == 0x000004, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsInRangeTiming_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Variable) == 0x000005, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000028, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000030, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue1) == 0x000039, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x00003A, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x00003B, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_byte_Variable) == 0x00003C, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_Operator) == 0x000040, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_Time) == 0x000048, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_Timing) == 0x00004C, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_bEnable) == 0x00004D, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_bOperatorIsEmpty) == 0x00004E, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue2) == 0x000058, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsHamonMode_bIsHamonMode) == 0x000068, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsHamonMode_bIsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue3) == 0x000069, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Variable1) == 0x00006A, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Variable2) == 0x00006B, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_IsClosed_Variable) == 0x00006C, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_CallbackType) == 0x00006D, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_CallbackInfo) == 0x000070, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwner_ReturnValue1) == 0x000080, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue4) == 0x000088, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetComponentByClass_ReturnValue1) == 0x000090, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsHamonMode_bIsHamonMode1) == 0x000098, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsHamonMode_bIsHamonMode1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue5) == 0x000099, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_byte_Variable1) == 0x00009A, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue6) == 0x00009B, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x0000A0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000A8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_bSuccess1) == 0x0000B0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x0000B1, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x0000B2, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000B8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue7) == 0x0000C0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x0000C1, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_byte_Variable2) == 0x0000C2, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_Timing) == 0x0000C3, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_bPlaySE3) == 0x0000C4, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_bPlaySE3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_IsLastHamonModeEnabled3) == 0x0000C5, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_IsLastHamonModeEnabled3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x0000D0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_SwitchInteger_CmpSuccess) == 0x0000D8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_SwitchPlayerKind_Impl_OutBranches) == 0x0000D9, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_SwitchPlayerKind_Impl_OutBranches' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_SwitchEnum1_CmpSuccess) == 0x0000DA, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Event_DeltaSeconds) == 0x0000DC, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue8) == 0x0000E0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000E1, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsReInputTiming_bResult) == 0x0000E2, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsReInputTiming_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000E8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000F0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000100, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000108, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_Has_Been_Initd_Variable1) == 0x000110, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000111, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000118, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000120, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000128, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_bool_IsClosed_Variable1) == 0x000140, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsTiming_bResult) == 0x000141, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsTiming_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsTiming_bResult1) == 0x000142, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsTiming_bResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, Temp_wildcard_Variable) == 0x000143, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Select_Default) == 0x000144, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsJustTiming_bResult) == 0x000145, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsJustTiming_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsJustTiming_bResult1) == 0x000146, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsJustTiming_bResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Select1_Default) == 0x000148, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_Select2_Default) == 0x00014C, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x000150, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue9) == 0x000158, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000160, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_DynamicCast_bSuccess3) == 0x000168, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000170, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000178, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1) == 0x000180, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetOwner_ReturnValue2) == 0x000188, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue10) == 0x000190, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_GetComponentByClass_ReturnValue2) == 0x000198, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsHamonMode_bIsHamonMode2) == 0x0001A0, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsHamonMode_bIsHamonMode2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, CallFunc_IsValid_ReturnValue11) == 0x0001A1, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_Result2) == 0x0001A2, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_bPlaySE2) == 0x0001A3, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_bPlaySE2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_IsLastHamonModeEnabled2) == 0x0001A4, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_IsLastHamonModeEnabled2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill, K2Node_CustomEvent_Result1) == 0x0001A5, "Member 'BP_AJBHamonBreathingSkill_C_ExecuteUbergraph_BP_AJBHamonBreathingSkill::K2Node_CustomEvent_Result1' has a wrong offset!");
