#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHistoryManageComponent

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.ExecuteUbergraph_BP_AJBHistoryManageComponent
// 0x01D8 (0x01D8 - 0x0000)
struct BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacterBP;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_AccessedHistoryDateTime;        // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AJBHistoryActorBase_C*              CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_UpdateLeftTime_RemoveIndexes;             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D8(0x0008)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIgnoreDistanceLimit_bLimit;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetBattleStartGameTime_ReturnValue;       // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item1;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue1;   // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAllRemoveTarget_bShouldRemove;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue1;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed; // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F[0x1];                                      // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed1; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor1; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent) == 0x000008, "Wrong alignment on BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent) == 0x0001D8, "Wrong size on BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, EntryPoint) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000019, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_Operator) == 0x000028, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_Time) == 0x000030, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_Timing) == 0x000034, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_bEnable) == 0x000035, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_bOperatorIsEmpty) == 0x000036, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetOwner_ReturnValue1) == 0x000040, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000048, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetOwner_ReturnValue2) == 0x000058, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000060, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_CustomEvent_TargetCharacterBP) == 0x000078, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_CustomEvent_TargetCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_CustomEvent_AccessedHistoryDateTime) == 0x000080, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_CustomEvent_AccessedHistoryDateTime' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_IsServer_ReturnValue) == 0x000088, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_UpdateLeftTime_RemoveIndexes) == 0x0000B0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_UpdateLeftTime_RemoveIndexes' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Array_Length_ReturnValue1) == 0x0000D0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D8, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Max_ReturnValue) == 0x0000E4, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_CheckIgnoreDistanceLimit_bLimit) == 0x0000E8, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_CheckIgnoreDistanceLimit_bLimit' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetGameState_ReturnValue) == 0x0000F0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x0000F8, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, K2Node_DynamicCast_bSuccess3) == 0x000100, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, Temp_int_Array_Index_Variable1) == 0x000104, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetBattleStartGameTime_ReturnValue) == 0x000108, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetBattleStartGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Array_Get_Item1) == 0x000110, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000118, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetTotalSeconds_ReturnValue) == 0x000120, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Now_ReturnValue) == 0x000128, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Subtract_DateTimeDateTime_ReturnValue1) == 0x000130, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Subtract_DateTimeDateTime_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_ShouldAllRemoveTarget_bShouldRemove) == 0x000138, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_ShouldAllRemoveTarget_bShouldRemove' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetTotalSeconds_ReturnValue1) == 0x00013C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetTotalSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000140, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, Temp_int_Loop_Counter_Variable1) == 0x000148, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed) == 0x00014C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor) == 0x000150, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000158, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00015C, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00015D, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_IsServer_ReturnValue1) == 0x00015E, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Conv_FloatToString_ReturnValue) == 0x000160, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_IsServer_ReturnValue2) == 0x000170, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Conv_FloatToString_ReturnValue1) == 0x000178, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Conv_FloatToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Concat_StrStr_ReturnValue1) == 0x000188, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_GetViewTargetActor_ViewTargetActor1) == 0x000198, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_GetViewTargetActor_ViewTargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Concat_StrStr_ReturnValue2) == 0x0001A0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed1) == 0x0001B0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor1) == 0x0001B8, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Concat_StrStr_ReturnValue3) == 0x0001C0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x0001D0, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0001D1, "Member 'BP_AJBHistoryManageComponent_C_ExecuteUbergraph_BP_AJBHistoryManageComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBHistoryManageComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBHistoryManageComponent_C_ReceiveTick");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBHistoryManageComponent_C_ReceiveTick");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.AddIgnoreDistanceTargetServer
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacterBP;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              AccessedHistoryDateTime;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer) == 0x000008, "Wrong alignment on BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer) == 0x000010, "Wrong size on BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer, TargetCharacterBP) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer::TargetCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer, AccessedHistoryDateTime) == 0x000008, "Member 'BP_AJBHistoryManageComponent_C_AddIgnoreDistanceTargetServer::AccessedHistoryDateTime' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBHistoryManageComponent_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBHistoryManageComponent_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBHistoryManageComponent_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBHistoryManageComponent_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBHistoryManageComponent_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBHistoryManageComponent_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBHistoryManageComponent_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.GetHistoryAfterOnlyExists
// 0x0140 (0x0140 - 0x0000)
struct BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists final
{
public:
	TArray<struct FAJBHistoryInfo>                Before;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FAJBHistoryInfo>                After;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FAJBHistoryInfo>                Result;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          bTempBreak;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAJBHistoryInfo>                TempResult;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBHistoryInfo                        CallFunc_Array_Get_Item;                           // 0x0068(0x0060)()
	struct FAJBHistoryInfo                        CallFunc_Array_Get_Item1;                          // 0x00C8(0x0060)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists) == 0x000008, "Wrong alignment on BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists) == 0x000140, "Wrong size on BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Before) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Before' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, After) == 0x000010, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::After' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Result) == 0x000020, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, bTempBreak) == 0x000030, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::bTempBreak' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, TempResult) == 0x000038, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::TempResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Temp_bool_True_if_break_was_hit_Variable) == 0x000054, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Temp_int_Array_Index_Variable1) == 0x000058, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, Temp_int_Loop_Counter_Variable1) == 0x00005C, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Add_IntInt_ReturnValue1) == 0x000060, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Array_Get_Item1) == 0x0000C8, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Array_AddUnique_ReturnValue) == 0x000128, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Array_Length_ReturnValue1) == 0x000134, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_Less_IntInt_ReturnValue1) == 0x000138, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists, CallFunc_BooleanAND_ReturnValue) == 0x000139, "Member 'BP_AJBHistoryManageComponent_C_GetHistoryAfterOnlyExists::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.UpdateHistoryInfo
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBHistoryManageComponent_C_UpdateHistoryInfo final
{
public:
	TArray<struct FAJBHistoryInfo>                CallFunc_CollectHistoryInfoList_HistoryInfoList;   // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo) == 0x000008, "Wrong alignment on BP_AJBHistoryManageComponent_C_UpdateHistoryInfo");
static_assert(sizeof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo) == 0x000028, "Wrong size on BP_AJBHistoryManageComponent_C_UpdateHistoryInfo");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, CallFunc_CollectHistoryInfoList_HistoryInfoList) == 0x000000, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::CallFunc_CollectHistoryInfoList_HistoryInfoList' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryManageComponent_C_UpdateHistoryInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBHistoryManageComponent_C_UpdateHistoryInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C.UpdateHistoryActors
// 0x0270 (0x0270 - 0x0000)
struct BP_AJBHistoryManageComponent_C_UpdateHistoryActors final
{
public:
	TArray<int32>                                 TempDeleteList;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_SortInt32Array_OutArray;                  // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBHistoryActorBase_C*              CallFunc_Array_Get_Item1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAJBHistoryInfo>                CallFunc_GetHistoryAfterOnlyExists_Result;         // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAJBHistoryInfo                        CallFunc_Array_Get_Item2;                          // 0x00B8(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
