#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSHASkill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.ExecuteUbergraph_BP_AJBSHASkill
// 0x02B0 (0x02B0 - 0x0000)
struct BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview;             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview1;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectile_C*              K2Node_Event_Bullet;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate4; // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBitesTheDust;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition, class UObject* Causer, const struct FGameplayTag& CauserType)> K2Node_CreateDelegate_OutputDelegate5; // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& AddCondition, class UObject* Causer, const struct FGameplayTag& CauserType)> K2Node_CreateDelegate_OutputDelegate6; // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate7; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bBitesTheDust)>           K2Node_CreateDelegate_OutputDelegate9;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewTime;                        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate10; // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition1;               // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag1;                     // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP1;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition1;                  // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Causer1;                        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_CauserType1;                    // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_SHA_C*           K2Node_CustomEvent_SHA;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Causer;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_CauserType;                     // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag;                      // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill");
static_assert(sizeof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill) == 0x0002B0, "Wrong size on BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, EntryPoint) == 0x000000, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000012, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsServer_ReturnValue) == 0x000013, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NotifyName3) == 0x000018, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000020, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsServer_ReturnValue1) == 0x000048, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000050, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue1) == 0x000058, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000059, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NotifyName4) == 0x000060, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_Not_PreBool_ReturnValue1) == 0x000068, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000070, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000080, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue2) == 0x000088, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000089, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NotifyName2) == 0x000090, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000098, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x0000A0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000B0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000B8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_bSuccess1) == 0x0000C0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerStand_ReturnValue) == 0x0000C8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x0000D0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x0000D8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_bSuccess2) == 0x0000E0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000E8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000F0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue3) == 0x0000F8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue3) == 0x0000F9, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue4) == 0x0000FA, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_Not_PreBool_ReturnValue2) == 0x0000FB, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000100, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_Event_DeltaSeconds) == 0x000110, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetValidValue_ReturnValue) == 0x000114, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_SwitchEnum_CmpSuccess) == 0x000115, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x000118, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_AsWB_Skill_Preview) == 0x000120, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_AsWB_Skill_Preview' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_bSuccess3) == 0x000128, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue5) == 0x000129, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue4) == 0x00012A, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_AsWB_Skill_Preview1) == 0x000130, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_AsWB_Skill_Preview1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_DynamicCast_bSuccess4) == 0x000138, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000139, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_Event_Bullet) == 0x000140, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_Event_Bullet' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NotifyName1) == 0x000148, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000150, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue7) == 0x000160, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue6) == 0x000168, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue5) == 0x000169, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_GetOwnerCharacter_ReturnValue8) == 0x000170, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_GetOwnerCharacter_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_IsValid_ReturnValue7) == 0x000178, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate4) == 0x000180, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_HasLocalSharedController_ReturnValue6) == 0x000190, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_HasLocalSharedController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_DamageType) == 0x000198, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_DeadActor) == 0x0001A0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_DamageCauser) == 0x0001A8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_bBitesTheDust) == 0x0001B0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_bBitesTheDust' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate5) == 0x0001B8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate6) == 0x0001C8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate7) == 0x0001D8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate8) == 0x0001E8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate9) == 0x0001F8, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NewTime) == 0x000208, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NewTime' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate10) == 0x000210, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000220, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x000224, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_RemoveCondition1) == 0x000228, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_RemoveCondition1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_SecondTag1) == 0x000230, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_SecondTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_CharacterBP1) == 0x000238, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_AddCondition1) == 0x000240, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_AddCondition1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_Causer1) == 0x000248, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_Causer1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_CauserType1) == 0x000250, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_CauserType1' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_SHA) == 0x000258, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_SHA' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_AddCondition) == 0x000260, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_Causer) == 0x000268, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_CauserType) == 0x000270, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_CauserType' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_RemoveCondition) == 0x000278, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_SecondTag) == 0x000280, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_CharacterBP) == 0x000288, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, Temp_name_Variable) == 0x000290, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CustomEvent_NotifyName) == 0x000298, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill, K2Node_CreateDelegate_OutputDelegate11) == 0x0002A0, "Member 'BP_AJBSHASkill_C_ExecuteUbergraph_BP_AJBSHASkill::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnPassiveRemoved_SHA
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBSHASkill_C_OnPassiveRemoved_SHA final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnPassiveRemoved_SHA) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnPassiveRemoved_SHA");
static_assert(sizeof(BP_AJBSHASkill_C_OnPassiveRemoved_SHA) == 0x000018, "Wrong size on BP_AJBSHASkill_C_OnPassiveRemoved_SHA");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved_SHA, RemoveCondition) == 0x000000, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved_SHA::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved_SHA, SecondTag) == 0x000008, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved_SHA::SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved_SHA, CharacterBP) == 0x000010, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved_SHA::CharacterBP' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnPassiveAddedAfterSetCauser_SHA
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CauserType;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA");
static_assert(sizeof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA) == 0x000018, "Wrong size on BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA, AddCondition) == 0x000000, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA, Causer) == 0x000008, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA::Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA, CauserType) == 0x000010, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser_SHA::CauserType' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnSHARegistered
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSHASkill_C_OnSHARegistered final
{
public:
	class ABP_AJBInGameCharacter_SHA_C*           SHA;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnSHARegistered) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnSHARegistered");
static_assert(sizeof(BP_AJBSHASkill_C_OnSHARegistered) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnSHARegistered");
static_assert(offsetof(BP_AJBSHASkill_C_OnSHARegistered, SHA) == 0x000000, "Member 'BP_AJBSHASkill_C_OnSHARegistered::SHA' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnPassiveAddedAfterSetCauser
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CauserType;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser");
static_assert(sizeof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser) == 0x000018, "Wrong size on BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser, AddCondition) == 0x000000, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser, Causer) == 0x000008, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser::Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser, CauserType) == 0x000010, "Member 'BP_AJBSHASkill_C_OnPassiveAddedAfterSetCauser::CauserType' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnPassiveRemoved
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBSHASkill_C_OnPassiveRemoved final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnPassiveRemoved) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnPassiveRemoved");
static_assert(sizeof(BP_AJBSHASkill_C_OnPassiveRemoved) == 0x000018, "Wrong size on BP_AJBSHASkill_C_OnPassiveRemoved");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved, RemoveCondition) == 0x000000, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved, SecondTag) == 0x000008, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved::SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnPassiveRemoved, CharacterBP) == 0x000010, "Member 'BP_AJBSHASkill_C_OnPassiveRemoved::CharacterBP' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.ROS_DebugChangeLoiteringTime
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime final
{
public:
	int32                                         NewTime;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime) == 0x000004, "Wrong alignment on BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime");
static_assert(sizeof(BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime) == 0x000004, "Wrong size on BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime");
static_assert(offsetof(BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime, NewTime) == 0x000000, "Member 'BP_AJBSHASkill_C_ROS_DebugChangeLoiteringTime::NewTime' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnBecomeLastSurvivor
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBSHASkill_C_OnBecomeLastSurvivor final
{
public:
	bool                                          bBitesTheDust;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSHASkill_C_OnBecomeLastSurvivor) == 0x000001, "Wrong alignment on BP_AJBSHASkill_C_OnBecomeLastSurvivor");
static_assert(sizeof(BP_AJBSHASkill_C_OnBecomeLastSurvivor) == 0x000001, "Wrong size on BP_AJBSHASkill_C_OnBecomeLastSurvivor");
static_assert(offsetof(BP_AJBSHASkill_C_OnBecomeLastSurvivor, bBitesTheDust) == 0x000000, "Member 'BP_AJBSHASkill_C_OnBecomeLastSurvivor::bBitesTheDust' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnCharacterDead
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBSHASkill_C_OnCharacterDead final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnCharacterDead) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnCharacterDead");
static_assert(sizeof(BP_AJBSHASkill_C_OnCharacterDead) == 0x000018, "Wrong size on BP_AJBSHASkill_C_OnCharacterDead");
static_assert(offsetof(BP_AJBSHASkill_C_OnCharacterDead, DamageType) == 0x000000, "Member 'BP_AJBSHASkill_C_OnCharacterDead::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnCharacterDead, DeadActor) == 0x000008, "Member 'BP_AJBSHASkill_C_OnCharacterDead::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_OnCharacterDead, DamageCauser) == 0x000010, "Member 'BP_AJBSHASkill_C_OnCharacterDead::DamageCauser' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.ConfigureBullet
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSHASkill_C_ConfigureBullet final
{
public:
	class ABP_AJBInGameProjectile_C*              Bullet;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_ConfigureBullet) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_ConfigureBullet");
static_assert(sizeof(BP_AJBSHASkill_C_ConfigureBullet) == 0x000008, "Wrong size on BP_AJBSHASkill_C_ConfigureBullet");
static_assert(offsetof(BP_AJBSHASkill_C_ConfigureBullet, Bullet) == 0x000000, "Member 'BP_AJBSHASkill_C_ConfigureBullet::Bullet' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnCompleted_821E4A124DAD86922FF9ECB404191777
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777");
static_assert(sizeof(BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777");
static_assert(offsetof(BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777, NotifyName) == 0x000000, "Member 'BP_AJBSHASkill_C_OnCompleted_821E4A124DAD86922FF9ECB404191777::NotifyName' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnBlendOut_821E4A124DAD86922FF9ECB404191777
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777");
static_assert(sizeof(BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777");
static_assert(offsetof(BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777, NotifyName) == 0x000000, "Member 'BP_AJBSHASkill_C_OnBlendOut_821E4A124DAD86922FF9ECB404191777::NotifyName' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnInterrupted_821E4A124DAD86922FF9ECB404191777
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777");
static_assert(sizeof(BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777");
static_assert(offsetof(BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777, NotifyName) == 0x000000, "Member 'BP_AJBSHASkill_C_OnInterrupted_821E4A124DAD86922FF9ECB404191777::NotifyName' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnNotifyBegin_821E4A124DAD86922FF9ECB404191777
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777");
static_assert(sizeof(BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777");
static_assert(offsetof(BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777, NotifyName) == 0x000000, "Member 'BP_AJBSHASkill_C_OnNotifyBegin_821E4A124DAD86922FF9ECB404191777::NotifyName' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.OnNotifyEnd_821E4A124DAD86922FF9ECB404191777
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong alignment on BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777");
static_assert(sizeof(BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777) == 0x000008, "Wrong size on BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777");
static_assert(offsetof(BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777, NotifyName) == 0x000000, "Member 'BP_AJBSHASkill_C_OnNotifyEnd_821E4A124DAD86922FF9ECB404191777::NotifyName' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.TryDestroyPreviewObject
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBSHASkill_C_TryDestroyPreviewObject final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSHASkill_C_TryDestroyPreviewObject) == 0x000001, "Wrong alignment on BP_AJBSHASkill_C_TryDestroyPreviewObject");
static_assert(sizeof(BP_AJBSHASkill_C_TryDestroyPreviewObject) == 0x000002, "Wrong size on BP_AJBSHASkill_C_TryDestroyPreviewObject");
static_assert(offsetof(BP_AJBSHASkill_C_TryDestroyPreviewObject, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBSHASkill_C_TryDestroyPreviewObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSHASkill_C_TryDestroyPreviewObject, CallFunc_IsValid_ReturnValue1) == 0x000001, "Member 'BP_AJBSHASkill_C_TryDestroyPreviewObject::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_AJBSHASkill.BP_AJBSHASkill_C.TrySpawnPreviewObject
// 0x0140 (0x0140 - 0x0000)
struct BP_AJBSHASkill_C_TrySpawnPreviewObject final
{
public:
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
