#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDebugScreenDrawHelper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.ExecuteUbergraph_BP_AJBDebugScreenDrawHelper
// 0x01C8 (0x01C8 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_Array_Get_Item;                           // 0x000C(0x0014)(NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Location2;                      // 0x0038(0x0008)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 K2Node_CustomEvent_Box2;                           // 0x0040(0x0014)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x0058(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Location1;                      // 0x0068(0x0008)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Location;                       // 0x007C(0x0008)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0084(0x0010)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 K2Node_CustomEvent_Box1;                           // 0x00AC(0x0014)(NoDestructor)
	float                                         K2Node_CustomEvent_GaugeMax1;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_GaugeValue1;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_OutlineColor;                   // 0x00C8(0x0010)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_FilledColor;                    // 0x00D8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOwnerHUD_Success;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetOwnerHUD_HUD;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOwnerHUD_Success1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetOwnerHUD_HUD1;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 K2Node_CustomEvent_Box;                            // 0x0128(0x0014)(NoDestructor)
	float                                         K2Node_CustomEvent_GaugeMax;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_GaugeValue;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOwnerHUD_Success2;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetOwnerHUD_HUD2;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item1;                          // 0x0150(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOwnerHUD_Success3;                     // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetOwnerHUD_HUD3;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item2;                          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item3;                          // 0x0190(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_Array_Get_Item4;                          // 0x01B4(0x0014)(NoDestructor)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper) == 0x000008, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper) == 0x0001C8, "Wrong size on BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, EntryPoint) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Get_Item) == 0x00000C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_X) == 0x000020, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_X1) == 0x000028, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_Y1) == 0x00002C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000034, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Location2) == 0x000038, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Location2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Box2) == 0x000040, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Box2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Text) == 0x000058, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Location1) == 0x000068, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Location1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue1) == 0x000070, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue2) == 0x000074, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Location) == 0x00007C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Color) == 0x000084, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue3) == 0x000098, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue4) == 0x00009C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Loop_Counter_Variable1) == 0x0000A0, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Add_IntInt_ReturnValue1) == 0x0000A8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Box1) == 0x0000AC, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Box1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_GaugeMax1) == 0x0000C0, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_GaugeMax1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_GaugeValue1) == 0x0000C4, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_GaugeValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_OutlineColor) == 0x0000C8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_OutlineColor' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_FilledColor) == 0x0000D8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_FilledColor' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue5) == 0x0000E8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue6) == 0x0000EC, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Array_Index_Variable1) == 0x0000F0, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue7) == 0x0000F4, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Loop_Counter_Variable2) == 0x0000F8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Add_IntInt_ReturnValue2) == 0x0000FC, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_Success) == 0x000100, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_Success' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_HUD) == 0x000108, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue8) == 0x000110, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Add_ReturnValue9) == 0x000114, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_Success1) == 0x000118, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_Success1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_HUD1) == 0x000120, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_Box) == 0x000128, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_Box' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_GaugeMax) == 0x00013C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_GaugeMax' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, K2Node_CustomEvent_GaugeValue) == 0x000140, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::K2Node_CustomEvent_GaugeValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_Success2) == 0x000144, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_Success2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_HUD2) == 0x000148, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_HUD2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Get_Item1) == 0x000150, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Length_ReturnValue1) == 0x000158, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Less_IntInt_ReturnValue1) == 0x00015C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Length_ReturnValue2) == 0x000160, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Length_ReturnValue3) == 0x000164, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Less_IntInt_ReturnValue2) == 0x000168, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_Success3) == 0x000169, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_Success3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_GetOwnerHUD_HUD3) == 0x000170, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_GetOwnerHUD_HUD3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_IsDistribution_ReturnValue) == 0x000178, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Not_PreBool_ReturnValue) == 0x000179, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Array_Index_Variable2) == 0x00017C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Get_Item2) == 0x000180, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Get_Item3) == 0x000190, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_X2) == 0x000198, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_BreakVector2D_Y2) == 0x00019C, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Loop_Counter_Variable3) == 0x0001A0, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_MapRangeClamped_ReturnValue) == 0x0001A4, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Less_IntInt_ReturnValue3) == 0x0001A8, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Add_IntInt_ReturnValue3) == 0x0001AC, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, Temp_int_Array_Index_Variable3) == 0x0001B0, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper, CallFunc_Array_Get_Item4) == 0x0001B4, "Member 'BP_AJBDebugScreenDrawHelper_C_ExecuteUbergraph_BP_AJBDebugScreenDrawHelper::CallFunc_Array_Get_Item4' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawBoxGaugeDefaultColor
// 0x001C (0x001C - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor final
{
public:
	struct FBox2D                                 Box;                                               // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         GaugeMax;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GaugeValue;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor) == 0x00001C, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor, Box) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor::Box' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor, GaugeMax) == 0x000014, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor::GaugeMax' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor, GaugeValue) == 0x000018, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGaugeDefaultColor::GaugeValue' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawBoxGauge
// 0x003C (0x003C - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge final
{
public:
	struct FBox2D                                 Box;                                               // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         GaugeMax;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GaugeValue;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor;                                      // 0x001C(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FilledColor;                                       // 0x002C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge) == 0x00003C, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge, Box) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge::Box' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge, GaugeMax) == 0x000014, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge::GaugeMax' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge, GaugeValue) == 0x000018, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge::GaugeValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge, OutlineColor) == 0x00001C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge::OutlineColor' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge, FilledColor) == 0x00002C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawBoxGauge::FilledColor' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawCrossWithColor
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor) == 0x000018, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor, Location) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor, Color) == 0x000008, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCrossWithColor::Color' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawText
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	struct FVector2D                              Location;                                          // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawText) == 0x000008, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawText");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawText) == 0x000018, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawText");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawText, Text) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawText::Text' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawText, Location) == 0x000010, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawText::Location' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawOutlineRect
// 0x0014 (0x0014 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect final
{
public:
	struct FBox2D                                 Box;                                               // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect) == 0x000014, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect, Box) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect::Box' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawCross
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawCross final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawCross) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawCross");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawCross) == 0x000008, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawCross");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross, Location) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross::Location' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.GetOwnerHUD
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   HUD;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   K2Node_DynamicCast_AsHUD;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD) == 0x000008, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD) == 0x000028, "Wrong size on BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD, Success) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD::Success' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD, HUD) == 0x000008, "Member 'BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD::HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD, K2Node_DynamicCast_AsHUD) == 0x000018, "Member 'BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD::K2Node_DynamicCast_AsHUD' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBDebugScreenDrawHelper_C_GetOwnerHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.GetCrossLine
// 0x0078 (0x0078 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_GetCrossLine final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LineStartV;                                        // 0x0008(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LineEndV;                                          // 0x0010(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LineStartH;                                        // 0x0018(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LineEndH;                                          // 0x0020(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DFloat_ReturnValue;       // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DFloat_ReturnValue;            // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0068(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0070(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine) == 0x000004, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_GetCrossLine");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine) == 0x000078, "Wrong size on BP_AJBDebugScreenDrawHelper_C_GetCrossLine");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, Location) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, LineStartV) == 0x000008, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::LineStartV' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, LineEndV) == 0x000010, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::LineEndV' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, LineStartH) == 0x000018, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::LineStartH' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, LineEndH) == 0x000020, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::LineEndH' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_X) == 0x000028, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_Subtract_Vector2DFloat_ReturnValue) == 0x000038, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_Subtract_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_Add_Vector2DFloat_ReturnValue) == 0x000040, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_Add_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_X1) == 0x000048, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_Y1) == 0x00004C, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_X2) == 0x000050, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_BreakVector2D_Y2) == 0x000054, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_MakeVector2D_ReturnValue1) == 0x000060, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_MakeVector2D_ReturnValue2) == 0x000068, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_GetCrossLine, CallFunc_MakeVector2D_ReturnValue3) == 0x000070, "Member 'BP_AJBDebugScreenDrawHelper_C_GetCrossLine::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawCross_Internal
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Location;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LineColor_0;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineThickness_0;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCrossLine_LineStartV;                  // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCrossLine_LineEndV;                    // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCrossLine_LineStartH;                  // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCrossLine_LineEndH;                    // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal) == 0x000008, "Wrong alignment on BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal");
static_assert(sizeof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal) == 0x000068, "Wrong size on BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, HUD) == 0x000000, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, Location) == 0x000008, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, LineColor_0) == 0x000010, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::LineColor_0' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, LineThickness_0) == 0x000020, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::LineThickness_0' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_GetCrossLine_LineStartV) == 0x000024, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_GetCrossLine_LineStartV' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_GetCrossLine_LineEndV) == 0x00002C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_GetCrossLine_LineEndV' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_GetCrossLine_LineStartH) == 0x000034, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_GetCrossLine_LineStartH' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_GetCrossLine_LineEndH) == 0x00003C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_GetCrossLine_LineEndH' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_X) == 0x000044, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_X1) == 0x00004C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_Y1) == 0x000050, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_X2) == 0x000054, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_Y2) == 0x000058, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_X3) == 0x00005C, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal, CallFunc_BreakVector2D_Y3) == 0x000060, "Member 'BP_AJBDebugScreenDrawHelper_C_DrawCross_Internal::CallFunc_BreakVector2D_Y3' has a wrong offset!");

// Function BP_AJBDebugScreenDrawHelper.BP_AJBDebugScreenDrawHelper_C.DrawOutlineRect_Internal
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AJBDebugScreenDrawHelper_C_DrawOutlineRect_Internal final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
