#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStand

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_CharaSkin_structs.hpp"
#include "E_StencilDigit_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameStand.BP_AJBInGameStand_C.ExecuteUbergraph_BP_AJBInGameStand
// 0x04D8 (0x04D8 - 0x0000)
struct BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Event_Montage;                              // 0x0030(0x0028)(HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_Tag2;                                 // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Operator;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Target;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CauserType;                           // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag1;                                 // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatValue;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded2;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStandAccompanyTransition                     K2Node_Event_PrevTransition;                       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStandAccompanyTransition                     K2Node_Event_NextTransition;                       // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBySeparate;                          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1; // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded1;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2; // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable1;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface1;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_StandName;                      // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_SkinId;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue1;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FST_CharaSkin                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0210(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Array_Get_Item;                           // 0x0280(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_CharaSkin                          CallFunc_GetDataTableRowFromName_OutRow1;          // 0x02B8(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue1;     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Array_Get_Item1;                          // 0x02F8(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item2;                          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldDestroy;                       // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue6;           // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayMode                                     CallFunc_GetPlayMode_PlayMode;                     // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh1;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStandInfoForChangingSkin_StandName;    // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetStandInfoForChangingSkin_SkinId;       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue7;           // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item3;                          // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded3;                        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0410(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate1;             // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate2;             // 0x0438(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_Value;                          // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTransitionRate_Rate;                   // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate3;             // 0x0490(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CallFunc_GetComponentsByTag_ReturnValue;           // 0x04B8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand) == 0x000008, "Wrong alignment on BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand");
static_assert(sizeof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand) == 0x0004D8, "Wrong size on BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, EntryPoint) == 0x000000, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000019, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000028, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Montage) == 0x000030, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Tag2) == 0x000058, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Tag2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Operator) == 0x000060, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Target) == 0x000068, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_CauserType) == 0x000070, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_CauserType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_SerialNumber) == 0x000078, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Variable) == 0x00007C, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue1) == 0x000080, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Tag1) == 0x000088, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Tag1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_FloatValue) == 0x000090, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_FloatValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_Tag) == 0x000098, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_RemoveGameplayTag_ReturnValue) == 0x0000A0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_MatchesTag_ReturnValue) == 0x0000A1, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_MatchesTag_ReturnValue1) == 0x0000A2, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_MatchesTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_DeltaSeconds) == 0x0000A4, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0000A8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsServer_ReturnValue) == 0x0000AA, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue4) == 0x0000AB, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_object_Variable) == 0x0000B0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_AsMaterial_Interface) == 0x0000B8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_Loaded2) == 0x0000D0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_Loaded2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_Time) == 0x0000DC, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_bEnable) == 0x0000E0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_PrevTransition) == 0x0000E2, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_PrevTransition' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_NextTransition) == 0x0000E3, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_NextTransition' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_bBySeparate) == 0x0000E4, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_bBySeparate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Variable1) == 0x0000E8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue2) == 0x0000EC, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000F0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000101, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000102, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1) == 0x000108, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_BooleanOR_ReturnValue) == 0x000118, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00011A, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_BooleanAND_ReturnValue1) == 0x00011B, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Variable2) == 0x00011C, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue3) == 0x000120, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue4) == 0x000124, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Conv_IntToString_ReturnValue) == 0x000128, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_Loaded1) == 0x000138, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_Loaded1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue5) == 0x000140, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2) == 0x000148, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_int_Variable3) == 0x000158, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Add_IntInt_ReturnValue5) == 0x00015C, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_object_Variable1) == 0x000160, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_AsMaterial_Interface1) == 0x000168, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_AsMaterial_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_bSuccess1) == 0x000170, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsValid_ReturnValue1) == 0x000171, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsValid_ReturnValue2) == 0x000172, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_StandName) == 0x000178, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_StandName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_SkinId) == 0x000188, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_SkinId' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Conv_ByteToString_ReturnValue) == 0x000190, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue) == 0x0001A0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_object_Variable2) == 0x0001B0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue1) == 0x0001B8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0001C8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_bSuccess2) == 0x0001D0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetSubstring_ReturnValue) == 0x0001D8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetSubstring_ReturnValue1) == 0x0001E8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetSubstring_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Conv_StringToName_ReturnValue) == 0x0001F8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue2) == 0x000200, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetDataTableRowFromName_OutRow) == 0x000210, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000248, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue3) == 0x000250, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue4) == 0x000260, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue5) == 0x000270, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Get_Item) == 0x000280, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Length_ReturnValue) == 0x0002A8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Less_IntInt_ReturnValue) == 0x0002AC, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Conv_StringToName_ReturnValue1) == 0x0002B0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Conv_StringToName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetDataTableRowFromName_OutRow1) == 0x0002B8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetDataTableRowFromName_OutRow1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetDataTableRowFromName_ReturnValue1) == 0x0002F0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetDataTableRowFromName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002F1, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Get_Item1) == 0x0002F8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Length_ReturnValue1) == 0x000320, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetOwner_ReturnValue1) == 0x000328, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Less_IntInt_ReturnValue1) == 0x000330, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsValid_ReturnValue3) == 0x000331, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Get_Item2) == 0x000338, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000340, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_Event_bShouldDestroy) == 0x000341, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_Event_bShouldDestroy' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue6) == 0x000342, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetPlayMode_PlayMode) == 0x000343, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetPlayMode_PlayMode' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetDisplayName_ReturnValue) == 0x000348, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_SwitchEnum1_CmpSuccess) == 0x000358, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue6) == 0x000360, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_CustomEvent_Loaded) == 0x000370, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, Temp_object_Variable3) == 0x000378, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_AsSkeletal_Mesh1) == 0x000380, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_AsSkeletal_Mesh1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_bSuccess3) == 0x000388, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000389, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetStandInfoForChangingSkin_StandName) == 0x000390, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetStandInfoForChangingSkin_StandName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetStandInfoForChangingSkin_SkinId) == 0x0003A0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetStandInfoForChangingSkin_SkinId' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Conv_IntToString_ReturnValue1) == 0x0003A8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Concat_StrStr_ReturnValue7) == 0x0003B8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_IsDedicatedServer_ReturnValue7) == 0x0003C8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_IsDedicatedServer_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_GetOwner_ReturnValue2) == 0x0003D0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, CallFunc_Array_Get_Item3) == 0x0003D8, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0003E0, "Member 'BP_AJBInGameStand_C_ExecuteUbergraph_BP_AJBInGameStand::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
