#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameLastSurvivorSceneCameraCut3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameLastSurvivorSceneCameraCut3.BP_AJBInGameLastSurvivorSceneCameraCut3_C.GetObjectTypesToTrace
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace final
{
public:
	TArray<EObjectTypeQuery>                      Objects;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace) == 0x000008, "Wrong alignment on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace");
static_assert(sizeof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace) == 0x000020, "Wrong size on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace, Objects) == 0x000000, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace::Objects' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetObjectTypesToTrace::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_AJBInGameLastSurvivorSceneCameraCut3.BP_AJBInGameLastSurvivorSceneCameraCut3_C.SearchProperLocationAndRotation
// 0x0378 (0x0378 - 0x0000)
struct BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation final
{
public:
	class AAJBInGameCharacterBase*                TargetCharacterBase;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartTargetSocketName;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndTargetSocketName;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFound;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartLocation_0;                                   // 0x001C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation_0;                                   // 0x0028(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FVector                                EndLocation_0;                                     // 0x0034(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EndRotation_0;                                     // 0x0040(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_GivedUp;                                      // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_DistanceFromCameraStartToEnd;                 // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_MinDistanceFromCameraStartToEnd;              // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_TraceDistance;                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_CandidateWorldYaw;                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_CandidateWorldDirectionFromTargetToCamera;    // 0x0060(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_TargetBoneWorldLocation;                      // 0x006C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_CandidateCameraWorldLocation;                 // 0x0078(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_GetObjectTypesToTrace_Objects;            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_GetObjectTypesToTrace_Objects1;           // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array1;                           // 0x00C0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x00D0(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0174(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0184(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01BC(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0294(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0308(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0314(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0330(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x033C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDegreeFromIndex_TickTack_Degree;       // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X1;                           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation) == 0x000008, "Wrong alignment on BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation");
static_assert(sizeof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation) == 0x000378, "Wrong size on BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, TargetCharacterBase) == 0x000000, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::TargetCharacterBase' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, StartTargetSocketName) == 0x000008, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::StartTargetSocketName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, EndTargetSocketName) == 0x000010, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::EndTargetSocketName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, bFound) == 0x000018, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::bFound' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, StartLocation_0) == 0x00001C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::StartLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, StartRotation_0) == 0x000028, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::StartRotation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, EndLocation_0) == 0x000034, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::EndLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, EndRotation_0) == 0x000040, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::EndRotation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_GivedUp) == 0x00004C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_GivedUp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_DistanceFromCameraStartToEnd) == 0x000050, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_DistanceFromCameraStartToEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_MinDistanceFromCameraStartToEnd) == 0x000054, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_MinDistanceFromCameraStartToEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_TraceDistance) == 0x000058, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_TraceDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_CandidateWorldYaw) == 0x00005C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_CandidateWorldYaw' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_CandidateWorldDirectionFromTargetToCamera) == 0x000060, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_CandidateWorldDirectionFromTargetToCamera' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_TargetBoneWorldLocation) == 0x00006C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_TargetBoneWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_CandidateCameraWorldLocation) == 0x000078, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_CandidateCameraWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GetObjectTypesToTrace_Objects) == 0x000088, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GetObjectTypesToTrace_Objects' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GetObjectTypesToTrace_Objects1) == 0x0000A8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GetObjectTypesToTrace_Objects1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_int_Variable) == 0x0000B8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, K2Node_MakeArray_Array1) == 0x0000C0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GetSocketRotation_ReturnValue) == 0x0000D0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakRotator_Roll) == 0x0000DC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakRotator_Pitch) == 0x0000E0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakRotator_Yaw) == 0x0000E4, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000E8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000170, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000174, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GetSocketLocation_ReturnValue) == 0x000184, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000190, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000194, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_X) == 0x000198, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_Y) == 0x00019C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_Z) == 0x0001A0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, Temp_int_Variable1) == 0x0001A4, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001A8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001AC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001B8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001BC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_IntInt_ReturnValue1) == 0x0001CC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001D0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_MakeVector_ReturnValue) == 0x0001D4, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x0001E0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_MakeVector_ReturnValue1) == 0x0001EC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000208, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000290, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_MakeRotator_ReturnValue) == 0x000294, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_bBlockingHit) == 0x0002A0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002A1, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_Time) == 0x0002A4, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_Distance) == 0x0002A8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_Location) == 0x0002AC, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_Normal) == 0x0002C4, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_ImpactNormal) == 0x0002D0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_PhysMat) == 0x0002E0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_HitActor) == 0x0002E8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_HitComponent) == 0x0002F0, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_HitBoneName) == 0x0002F8, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_HitItem) == 0x000300, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_FaceIndex) == 0x000304, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_TraceStart) == 0x000308, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakHitResult_TraceEnd) == 0x000314, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000320, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00032C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BooleanOR_ReturnValue) == 0x00032D, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000330, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue1) == 0x00033C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_GetDegreeFromIndex_TickTack_Degree) == 0x000348, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_GetDegreeFromIndex_TickTack_Degree' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x00034C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000350, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000354, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000358, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x00035C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_X1) == 0x000360, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_Y1) == 0x000364, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_BreakVector_Z1) == 0x000368, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00036C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000370, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000374, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_SearchProperLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");

// Function BP_AJBInGameLastSurvivorSceneCameraCut3.BP_AJBInGameLastSurvivorSceneCameraCut3_C.GetStartLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation final
{
public:
	struct FVector                                StartLocation_0;                                   // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation) == 0x000004, "Wrong alignment on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation");
static_assert(sizeof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation) == 0x000030, "Wrong size on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation, StartLocation_0) == 0x000000, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation::StartLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x00000C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000018, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetStartLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameLastSurvivorSceneCameraCut3.BP_AJBInGameLastSurvivorSceneCameraCut3_C.GetEndLocation
// 0x0064 (0x0064 - 0x0000)
struct BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation final
{
public:
	struct FVector                                EndLocation_0;                                     // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue1;           // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation) == 0x000004, "Wrong alignment on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation");
static_assert(sizeof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation) == 0x000064, "Wrong size on BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation, EndLocation_0) == 0x000000, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation::EndLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x00000C, "Member 'BP_AJBInGameLastSurvivorSceneCameraCut3_C_GetEndLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
