#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIDummyPlayerInputComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIDummyPlayerInputComponent.BP_AJBAIDummyPlayerInputComponent_C.ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent
// 0x0080 (0x0080 - 0x0000)
struct BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent) == 0x000010, "Wrong alignment on BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent");
static_assert(sizeof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent) == 0x000080, "Wrong size on BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, EntryPoint) == 0x000000, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, K2Node_DynamicCast_AsAIController) == 0x000060, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent, CallFunc_GetInput_ReturnValue) == 0x000070, "Member 'BP_AJBAIDummyPlayerInputComponent_C_ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent::CallFunc_GetInput_ReturnValue' has a wrong offset!");

// Function BP_AJBAIDummyPlayerInputComponent.BP_AJBAIDummyPlayerInputComponent_C.GetPlayerPawn
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn) == 0x000008, "Wrong alignment on BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn");
static_assert(sizeof(BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn) == 0x000018, "Wrong size on BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn, ReturnValue) == 0x000000, "Member 'BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBAIDummyPlayerInputComponent_C_GetPlayerPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

