#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileVirusCapsule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule
// 0x02E0 (0x02E0 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeadShot;                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              K2Node_Event_SurfaceType;                          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CuttingRate;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBlockedByAAP;                        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bReflect;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComponent;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromSweep;                            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_SweepResult;                          // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bHeadShot1;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrate;                           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFirstHit;                            // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0120(0x0020)()
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor1;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation1;                         // 0x0158(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0164(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeadShot2;                           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrate1;                          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFirstHit1;                           // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CuttingRate1;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage1;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bReflect1;                            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_ReflectRotation;                      // 0x017C(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlocking;                            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ReflectSkillTag;                      // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAvoidSkill;                          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bResetGravityScale;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBKillerHazeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcActiveTime_ActiveTime;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_1;     // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0258(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcActiveTime_ActiveTime1;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0264(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBVirusSmokeAffecterKillerHaze_C*  CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule) == 0x000010, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule) == 0x0002E0, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, EntryPoint) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_HitActor) == 0x000010, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_HitLocation) == 0x000018, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bHeadShot) == 0x000024, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_SurfaceType) == 0x000025, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bDisableDamage) == 0x000026, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_CuttingRate) == 0x000028, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bBlockedByAAP) == 0x00002C, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bReflect) == 0x00002D, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bReflect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetOwner_ReturnValue1) == 0x000040, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000048, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_OverlappedComponent) == 0x000058, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_OtherActor) == 0x000060, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_OtherComp) == 0x000068, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_OtherBodyIndex) == 0x000070, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_FromSweep) == 0x000074, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_FromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_SweepResult) == 0x000078, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bHeadShot1) == 0x000100, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bHeadShot1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bPenetrate) == 0x000101, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bPenetrate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bFirstHit) == 0x000102, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bFirstHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000108, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000120, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetObjectClass_ReturnValue) == 0x000140, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_ClassIsChildOf_ReturnValue) == 0x000148, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_MatchesAnyTags_ReturnValue) == 0x000149, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_Not_PreBool_ReturnValue1) == 0x00014A, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_HitActor1) == 0x000150, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_HitActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_HitLocation1) == 0x000158, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_HitLocation1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_HitNormal) == 0x000164, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bHeadShot2) == 0x000170, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bHeadShot2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bPenetrate1) == 0x000171, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bPenetrate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bFirstHit1) == 0x000172, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bFirstHit1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_CuttingRate1) == 0x000174, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_CuttingRate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bDisableDamage1) == 0x000178, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bDisableDamage1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bReflect1) == 0x000179, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bReflect1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_ReflectRotation) == 0x00017C, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_ReflectRotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bBlocking) == 0x000188, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bBlocking' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_ReflectSkillTag) == 0x000190, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_ReflectSkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bAvoidSkill) == 0x000198, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bAvoidSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_Not_PreBool_ReturnValue2) == 0x000199, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetDisplayName_ReturnValue) == 0x0001D0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0001E0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_bResetGravityScale) == 0x0001E1, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_bResetGravityScale' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetOwner_ReturnValue2) == 0x0001E8, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Event_DeltaSeconds) == 0x0001F0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0001F8, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_bSuccess3) == 0x000200, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetComponentByClass_ReturnValue) == 0x000208, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_CalcActiveTime_ActiveTime) == 0x000210, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_CalcActiveTime_ActiveTime' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000218, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000220, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_GetOwner_ReturnValue3) == 0x000228, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_BooleanOR_ReturnValue) == 0x000230, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000238, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_DynamicCast_bSuccess4) == 0x000240, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_RequestGion_AkComponent__LocalOnly_1) == 0x000248, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_RequestGion_AkComponent__LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1) == 0x000250, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_IsDedicatedServer_ReturnValue) == 0x000251, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_BooleanOR_ReturnValue1) == 0x000252, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, Temp_float_Variable) == 0x000254, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, Temp_struct_Variable) == 0x000258, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_CalcActiveTime_ActiveTime1) == 0x000260, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_CalcActiveTime_ActiveTime1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000264, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, Temp_bool_Variable) == 0x000270, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_MakeTransform_ReturnValue1) == 0x000280, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002B0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Select_Default) == 0x0002B8, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, Temp_float_Variable1) == 0x0002C8, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, Temp_bool_Variable1) == 0x0002CC, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule, K2Node_Select1_Default) == 0x0002D0, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ExecuteUbergraph_BP_AJBInGameProjectileVirusCapsule::K2Node_Select1_Default' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.CalcActiveTime
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime final
{
public:
	float                                         ActiveTime_0;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetStageIsNight_bIsNight;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime) == 0x000004, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime) == 0x00000C, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime, ActiveTime_0) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime::ActiveTime_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime, Temp_bool_Variable) == 0x000004, "Member 'BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime, CallFunc_GetStageIsNight_bIsNight) == 0x000005, "Member 'BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime::CallFunc_GetStageIsNight_bIsNight' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime, K2Node_Select_Default) == 0x000008, "Member 'BP_AJBInGameProjectileVirusCapsule_C_CalcActiveTime::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.AddGravityScale
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale final
{
public:
	bool                                          bResetGravityScale;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale) == 0x000001, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale) == 0x000001, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale, bResetGravityScale) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_AddGravityScale::bResetGravityScale' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.OnMC_ProjectileHit
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeadShot;                                         // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              SurfaceType;                                       // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableDamage;                                    // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CuttingRate;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlockedByAAP;                                     // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReflect;                                          // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit) == 0x000020, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, HitActor) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, HitLocation_0) == 0x000008, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, bHeadShot) == 0x000014, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, SurfaceType) == 0x000015, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, bDisableDamage) == 0x000016, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, CuttingRate) == 0x000018, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, bBlockedByAAP) == 0x00001C, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit, bReflect) == 0x00001D, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnMC_ProjectileHit::bReflect' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.OnProjectileHit
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bHeadShot;                                         // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPenetrate_0;                                      // 0x00A9(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstHit;                                         // 0x00AA(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit) == 0x0000B0, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, OverlappedComponent) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, OtherActor) == 0x000008, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, OtherComp) == 0x000010, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, OtherBodyIndex) == 0x000018, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, FromSweep) == 0x00001C, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::FromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, SweepResult) == 0x000020, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, bHeadShot) == 0x0000A8, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, bPenetrate_0) == 0x0000A9, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::bPenetrate_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit, bFirstHit) == 0x0000AA, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnProjectileHit::bFirstHit' has a wrong offset!");

// Function BP_AJBInGameProjectileVirusCapsule.BP_AJBInGameProjectileVirusCapsule_C.OnROS_ProjectileHit
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeadShot;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPenetrate_0;                                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstHit;                                         // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CuttingRate;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableDamage;                                    // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReflect;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReflectRotation;                                   // 0x002C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          bBlocking;                                         // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReflectSkillTag_0;                                 // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bAvoidSkill;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit) == 0x000050, "Wrong size on BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit, HitActor) == 0x000000, "Member 'BP_AJBInGameProjectileVirusCapsule_C_OnROS_ProjectileHit::HitActor' has a wrong offset!");
