#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHistoryActorBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.ExecuteUbergraph_BP_AJBHistoryActorBase
// 0x01B8 (0x01B8 - 0x0000)
struct BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DelayTime;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetBattleStartGameTime_ReturnValue;       // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0128(0x0018)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0148(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0198(0x0018)()
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase) == 0x000008, "Wrong alignment on BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase");
static_assert(sizeof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase) == 0x0001B8, "Wrong size on BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, EntryPoint) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_CustomEvent_DelayTime) == 0x000008, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_CustomEvent_DelayTime' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_CustomEvent_bEnable) == 0x00000D, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000018, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_GetBattleStartGameTime_ReturnValue) == 0x000028, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_GetBattleStartGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000030, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_GetTotalSeconds_ReturnValue) == 0x00003C, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Conv_IntToText_ReturnValue1) == 0x000058, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeStruct_FormatArgumentData1) == 0x0000B0, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeArray_Array1) == 0x000100, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Format_ReturnValue1) == 0x000128, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000140, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeStruct_FormatArgumentData2) == 0x000148, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, K2Node_MakeArray_Array2) == 0x000188, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_Format_ReturnValue2) == 0x000198, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase, CallFunc_BooleanXOR_ReturnValue) == 0x0001B0, "Member 'BP_AJBHistoryActorBase_C_ExecuteUbergraph_BP_AJBHistoryActorBase::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBHistoryActorBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBHistoryActorBase_C_ReceiveTick");
static_assert(sizeof(BP_AJBHistoryActorBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBHistoryActorBase_C_ReceiveTick");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.ChangeEnableTimeStop
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBHistoryActorBase_C_ChangeEnableTimeStop final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_ChangeEnableTimeStop) == 0x000001, "Wrong alignment on BP_AJBHistoryActorBase_C_ChangeEnableTimeStop");
static_assert(sizeof(BP_AJBHistoryActorBase_C_ChangeEnableTimeStop) == 0x000001, "Wrong size on BP_AJBHistoryActorBase_C_ChangeEnableTimeStop");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ChangeEnableTimeStop, bEnable) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_ChangeEnableTimeStop::bEnable' has a wrong offset!");

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.DelayedDestroy
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBHistoryActorBase_C_DelayedDestroy final
{
public:
	float                                         DelayTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_DelayedDestroy) == 0x000004, "Wrong alignment on BP_AJBHistoryActorBase_C_DelayedDestroy");
static_assert(sizeof(BP_AJBHistoryActorBase_C_DelayedDestroy) == 0x000004, "Wrong size on BP_AJBHistoryActorBase_C_DelayedDestroy");
static_assert(offsetof(BP_AJBHistoryActorBase_C_DelayedDestroy, DelayTime) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_DelayedDestroy::DelayTime' has a wrong offset!");

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.ShouldActivate
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBHistoryActorBase_C_ShouldActivate final
{
public:
	bool                                          bShouldActivate;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP1;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess1;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_ShouldActivate) == 0x000008, "Wrong alignment on BP_AJBHistoryActorBase_C_ShouldActivate");
static_assert(sizeof(BP_AJBHistoryActorBase_C_ShouldActivate) == 0x000040, "Wrong size on BP_AJBHistoryActorBase_C_ShouldActivate");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, bShouldActivate) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::bShouldActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000008, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, Temp_bool_Variable) == 0x000010, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000018, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000020, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetAJBCharacterFromActor_CharacterBP1) == 0x000030, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetAJBCharacterFromActor_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_GetAJBCharacterFromActor_bSuccess1) == 0x000038, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_GetAJBCharacterFromActor_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000039, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00003A, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_IsValid_ReturnValue) == 0x00003B, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, Temp_bool_Variable1) == 0x00003C, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, K2Node_Select_Default) == 0x00003D, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ShouldActivate, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'BP_AJBHistoryActorBase_C_ShouldActivate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C.ChangeActive
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBHistoryActorBase_C_ChangeActive final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHistoryActorBase_C_ChangeActive) == 0x000001, "Wrong alignment on BP_AJBHistoryActorBase_C_ChangeActive");
static_assert(sizeof(BP_AJBHistoryActorBase_C_ChangeActive) == 0x000001, "Wrong size on BP_AJBHistoryActorBase_C_ChangeActive");
static_assert(offsetof(BP_AJBHistoryActorBase_C_ChangeActive, bEnable) == 0x000000, "Member 'BP_AJBHistoryActorBase_C_ChangeActive::bEnable' has a wrong offset!");

}

