#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBubbleLensSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.ExecuteUbergraph_BP_AJBBubbleLensSkill
// 0x01A0 (0x01A0 - 0x0000)
struct BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Skill_BubbleLens_C*                 K2Node_DynamicCast_AsWB_Skill_Bubble_Lens;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_BubbleLens_C*                 K2Node_DynamicCast_AsWB_Skill_Bubble_Lens1;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0144(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DamageDecal_BubbleLens_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill) == 0x000010, "Wrong alignment on BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill) == 0x0001A0, "Wrong size on BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, EntryPoint) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000020, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000038, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000040, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x000050, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess3) == 0x000060, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000068, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsWB_Skill_Bubble_Lens) == 0x000070, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsWB_Skill_Bubble_Lens' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess4) == 0x000078, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000080, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess5) == 0x000088, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2) == 0x000090, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess6) == 0x0000A0, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsWB_Skill_Bubble_Lens1) == 0x0000A8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsWB_Skill_Bubble_Lens1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess7) == 0x0000B0, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x0000B8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x0000C0, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess8) == 0x0000C8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000D0, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3) == 0x0000D8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess9) == 0x0000E8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x0000F0, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess10) == 0x0000F8, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4) == 0x000100, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess11) == 0x000110, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x000118, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000120, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess12) == 0x000128, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5) == 0x000130, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface5' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_DynamicCast_bSuccess13) == 0x000140, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, K2Node_Event_Location) == 0x000144, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_IsValid_ReturnValue1) == 0x000180, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000188, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill, CallFunc_FinishSpawningActor_ReturnValue) == 0x000190, "Member 'BP_AJBBubbleLensSkill_C_ExecuteUbergraph_BP_AJBBubbleLensSkill::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.GetVampireDamageRate
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBBubbleLensSkill_C_GetVampireDamageRate final
{
public:
	float                                         VampireDamageRate;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_GetVampireDamageRate) == 0x000004, "Wrong alignment on BP_AJBBubbleLensSkill_C_GetVampireDamageRate");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_GetVampireDamageRate) == 0x000004, "Wrong size on BP_AJBBubbleLensSkill_C_GetVampireDamageRate");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetVampireDamageRate, VampireDamageRate) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_GetVampireDamageRate::VampireDamageRate' has a wrong offset!");

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.ShouldApplyHamonRateDirectly
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly final
{
public:
	bool                                          ShouldApplyDirectly;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong alignment on BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong size on BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly, ShouldApplyDirectly) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_ShouldApplyHamonRateDirectly::ShouldApplyDirectly' has a wrong offset!");

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.IsHamonRateEnabledSkill
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong alignment on BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong size on BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill, IsEnabled) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_IsHamonRateEnabledSkill::IsEnabled' has a wrong offset!");

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.Play_LaserParticle_Impact
// 0x000C (0x000C - 0x0000)
struct BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact) == 0x000004, "Wrong alignment on BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact) == 0x00000C, "Wrong size on BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact, Location) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_Play_LaserParticle_Impact::Location' has a wrong offset!");

// Function BP_AJBBubbleLensSkill.BP_AJBBubbleLensSkill_C.GetLaserLaunchComponents
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents final
{
public:
	TArray<class USceneComponent*>                LaserLaunchComponents;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetBubbleLensShotPointComponents_ShotPointComponents; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents) == 0x000008, "Wrong alignment on BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents");
static_assert(sizeof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents) == 0x000048, "Wrong size on BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, LaserLaunchComponents) == 0x000000, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::LaserLaunchComponents' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000010, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR) == 0x000028, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents, CallFunc_GetBubbleLensShotPointComponents_ShotPointComponents) == 0x000038, "Member 'BP_AJBBubbleLensSkill_C_GetLaserLaunchComponents::CallFunc_GetBubbleLensShotPointComponents_ShotPointComponents' has a wrong offset!");

}

