#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRollerImpulseGround

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRoadRollerImpulseGround.BP_AJBRoadRollerImpulseGround_C.ExecuteUbergraph_BP_AJBRoadRollerImpulseGround
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DamageDecal_RoadRoller_Ground_C*    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround) == 0x000010, "Wrong alignment on BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround");
static_assert(sizeof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround) == 0x000050, "Wrong size on BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround");
static_assert(offsetof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround, EntryPoint) == 0x000000, "Member 'BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BP_AJBRoadRollerImpulseGround_C_ExecuteUbergraph_BP_AJBRoadRollerImpulseGround::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

