#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBEmphasizeActorBase

#include "Basic.hpp"

#include "BP_AJBActorBase_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C
// 0x0028 (0x0358 - 0x0330)
class ABP_AJBEmphasizeActorBase_C : public ABP_AJBActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           EmphasisParticleTag;                               // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          EmphasisParticle;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringTheWorld;                                   // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSpawnParticleAtFootLocation;                      // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowParticleInfo;                            // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreParticleTimeStop;                           // 0x034B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EmphasisParticleTagPvE;                            // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBEmphasizeActorBase(int32 EntryPoint);
	void ChangeEffectActivate(bool bActivate);
	void ChangeVisibility(bool bNewVisibility);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void TrySpawnParticle();
	void TryDestroyParticle();
	void CheckEffectActivate(bool* bActivate);
	void GetViewTargetActor(class AActor** ViewTargetActor);
	void ChangeParticleDilationEnable(bool bEnable);
	void DuringTheWorld(bool* bResult);
	void SpawnParticle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBEmphasizeActorBase_C">();
	}
	static class ABP_AJBEmphasizeActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBEmphasizeActorBase_C>();
	}
};
static_assert(alignof(ABP_AJBEmphasizeActorBase_C) == 0x000008, "Wrong alignment on ABP_AJBEmphasizeActorBase_C");
static_assert(sizeof(ABP_AJBEmphasizeActorBase_C) == 0x000358, "Wrong size on ABP_AJBEmphasizeActorBase_C");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, UberGraphFrame) == 0x000330, "Member 'ABP_AJBEmphasizeActorBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, EmphasisParticleTag) == 0x000338, "Member 'ABP_AJBEmphasizeActorBase_C::EmphasisParticleTag' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, EmphasisParticle) == 0x000340, "Member 'ABP_AJBEmphasizeActorBase_C::EmphasisParticle' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, bDuringTheWorld) == 0x000348, "Member 'ABP_AJBEmphasizeActorBase_C::bDuringTheWorld' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, bSpawnParticleAtFootLocation) == 0x000349, "Member 'ABP_AJBEmphasizeActorBase_C::bSpawnParticleAtFootLocation' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, bDebugShowParticleInfo) == 0x00034A, "Member 'ABP_AJBEmphasizeActorBase_C::bDebugShowParticleInfo' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, bIgnoreParticleTimeStop) == 0x00034B, "Member 'ABP_AJBEmphasizeActorBase_C::bIgnoreParticleTimeStop' has a wrong offset!");
static_assert(offsetof(ABP_AJBEmphasizeActorBase_C, EmphasisParticleTagPvE) == 0x000350, "Member 'ABP_AJBEmphasizeActorBase_C::EmphasisParticleTagPvE' has a wrong offset!");

}

