#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectile_BubbleLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameProjectile_Straight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C
// 0x0020 (0x04F8 - 0x04D8)
class ABP_AJBInGameProjectile_BubbleLauncher_C final : public ABP_AJBInGameProjectile_Straight_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameProjectile_BubbleLauncher_C; // 0x04D8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Bubble_Hamon;                                   // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Bubble;                                         // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHamonMode;                                       // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpulseDelayTimeOnVOT;                             // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher(int32 EntryPoint);
	void OnProjectileReflected_Server(class ABP_AJBInGameProjectile_Straight_C* ReflectedProjectile);
	void MC_InitHamonStatus(bool IsHamonMode_0);
	void GetHamonStatus(bool* IsHamonMode_0);
	void InitHamonStatus_Server(bool IsHamonMode_0);
	void GetHamonStatusTag(class FName* HamonStatusTag);
	void GetHamonTargetTag(class FName* HamonTargetTag);
	void ShouldProcessCuttingDamage(bool bHeadShot, bool* bShould);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnROS_ProjectileHit(class AActor* HitActor, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, bool bHeadShot, bool bPenetrate_0, bool bFirstHit, float CuttingRate, bool bDisableDamage, bool bReflect, const struct FRotator& ReflectRotation, bool bBlocking, const struct FGameplayTag& ReflectSkillTag_0, bool bAvoidSkill);
	void GetPoliticDamage(bool bHeadShot, int32* Damage_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameProjectile_BubbleLauncher_C">();
	}
	static class ABP_AJBInGameProjectile_BubbleLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameProjectile_BubbleLauncher_C>();
	}
};
static_assert(alignof(ABP_AJBInGameProjectile_BubbleLauncher_C) == 0x000008, "Wrong alignment on ABP_AJBInGameProjectile_BubbleLauncher_C");
static_assert(sizeof(ABP_AJBInGameProjectile_BubbleLauncher_C) == 0x0004F8, "Wrong size on ABP_AJBInGameProjectile_BubbleLauncher_C");
static_assert(offsetof(ABP_AJBInGameProjectile_BubbleLauncher_C, UberGraphFrame_BP_AJBInGameProjectile_BubbleLauncher_C) == 0x0004D8, "Member 'ABP_AJBInGameProjectile_BubbleLauncher_C::UberGraphFrame_BP_AJBInGameProjectile_BubbleLauncher_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_BubbleLauncher_C, PS_Bubble_Hamon) == 0x0004E0, "Member 'ABP_AJBInGameProjectile_BubbleLauncher_C::PS_Bubble_Hamon' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_BubbleLauncher_C, PS_Bubble) == 0x0004E8, "Member 'ABP_AJBInGameProjectile_BubbleLauncher_C::PS_Bubble' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_BubbleLauncher_C, IsHamonMode) == 0x0004F0, "Member 'ABP_AJBInGameProjectile_BubbleLauncher_C::IsHamonMode' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_BubbleLauncher_C, ImpulseDelayTimeOnVOT) == 0x0004F4, "Member 'ABP_AJBInGameProjectile_BubbleLauncher_C::ImpulseDelayTimeOnVOT' has a wrong offset!");

}

