#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaSelectModelLoader

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaSelectModelLoader.BP_CharaSelectModelLoader_C.ExecuteUbergraph_BP_CharaSelectModelLoader
// 0x01D8 (0x01D8 - 0x0000)
struct BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_LoadId;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_LoadedObject;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBCharacterInfo                      CallFunc_GetCharacterInfoByCharaIndex_Out;         // 0x0038(0x00E8)()
	bool                                          CallFunc_GetCharacterInfoByCharaIndex_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_LoadId1;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ComponentBoundEvent_LoadObjClass;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS1;                             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS1;                            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue1;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Name_ReturnValue1;            // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader) == 0x000008, "Wrong alignment on BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader");
static_assert(sizeof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader) == 0x0001D8, "Wrong size on BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, EntryPoint) == 0x000000, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ComponentBoundEvent_LoadId) == 0x000008, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ComponentBoundEvent_LoadId' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ComponentBoundEvent_LoadedObject) == 0x000018, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ComponentBoundEvent_LoadedObject' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_CustomEvent_Index) == 0x000020, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_GetCharacterInfoByCharaIndex_Out) == 0x000038, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_GetCharacterInfoByCharaIndex_Out' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_GetCharacterInfoByCharaIndex_ReturnValue) == 0x000120, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_GetCharacterInfoByCharaIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_LeftS) == 0x000128, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_RightS) == 0x000138, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_ReturnValue) == 0x000148, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Conv_StringToName_ReturnValue) == 0x000150, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_GetTagName_ReturnValue) == 0x000158, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ComponentBoundEvent_LoadId1) == 0x000160, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ComponentBoundEvent_LoadId1' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ComponentBoundEvent_LoadObjClass) == 0x000170, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ComponentBoundEvent_LoadObjClass' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_BuildString_Name_ReturnValue) == 0x000178, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ClassDynamicCast_AsActor) == 0x000188, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, K2Node_ClassDynamicCast_bSuccess) == 0x000190, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_LeftS1) == 0x000198, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_LeftS1' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_RightS1) == 0x0001A8, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_RightS1' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Split_ReturnValue1) == 0x0001B8, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Split_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_BuildString_Name_ReturnValue1) == 0x0001C0, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_BuildString_Name_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader, CallFunc_Conv_StringToName_ReturnValue1) == 0x0001D0, "Member 'BP_CharaSelectModelLoader_C_ExecuteUbergraph_BP_CharaSelectModelLoader::CallFunc_Conv_StringToName_ReturnValue1' has a wrong offset!");

// Function BP_CharaSelectModelLoader.BP_CharaSelectModelLoader_C.BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature final
{
public:
	class FString                                 LoadId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                LoadedObject;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature) == 0x000008, "Wrong alignment on BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature");
static_assert(sizeof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature) == 0x000018, "Wrong size on BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature");
static_assert(offsetof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature, LoadId) == 0x000000, "Member 'BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature::LoadId' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature, LoadedObject) == 0x000010, "Member 'BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature::LoadedObject' has a wrong offset!");

// Function BP_CharaSelectModelLoader.BP_CharaSelectModelLoader_C.BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature final
{
public:
	class FString                                 LoadId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 LoadObjClass;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature) == 0x000008, "Wrong alignment on BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature");
static_assert(sizeof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature) == 0x000018, "Wrong size on BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature");
static_assert(offsetof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature, LoadId) == 0x000000, "Member 'BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature::LoadId' has a wrong offset!");
static_assert(offsetof(BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature, LoadObjClass) == 0x000010, "Member 'BP_CharaSelectModelLoader_C_BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature::LoadObjClass' has a wrong offset!");

// Function BP_CharaSelectModelLoader.BP_CharaSelectModelLoader_C.RequestCharaSelectModel
// 0x0004 (0x0004 - 0x0000)
struct BP_CharaSelectModelLoader_C_RequestCharaSelectModel final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaSelectModelLoader_C_RequestCharaSelectModel) == 0x000004, "Wrong alignment on BP_CharaSelectModelLoader_C_RequestCharaSelectModel");
static_assert(sizeof(BP_CharaSelectModelLoader_C_RequestCharaSelectModel) == 0x000004, "Wrong size on BP_CharaSelectModelLoader_C_RequestCharaSelectModel");
static_assert(offsetof(BP_CharaSelectModelLoader_C_RequestCharaSelectModel, Index_0) == 0x000000, "Member 'BP_CharaSelectModelLoader_C_RequestCharaSelectModel::Index_0' has a wrong offset!");

}

