#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageDecal_LastingBase

#include "Basic.hpp"

#include "BP_DamageDecal_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageDecal_LastingBase.BP_DamageDecal_LastingBase_C
// 0x0038 (0x03A0 - 0x0368)
class ABP_DamageDecal_LastingBase_C : public ABP_DamageDecal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DamageDecal_LastingBase_C;       // 0x0368(0x0008)(Transient, DuplicateTransient)
	float                                         Timeline_0___Track_1_0BE070594A437C4439B5F49722EBA1CF; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0___Track_0_0BE070594A437C4439B5F49722EBA1CF; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_0BE070594A437C4439B5F49722EBA1CF; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewTime;                                           // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginClearingTime;                                 // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewScale;                                          // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         LoopTime;                                          // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DuringTheWorld;                                    // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_DamageDecal_LastingBase(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void CancelAnimationTimeline();
	void Timeline_0__BeginStop__EventFunc();
	void PlayAnimationTimeline();
	void ReceiveBeginPlay();
	void StopAnimationTimeline();
	void Timeline_0__FinishedFunc();
	void Timeline_0__LoopStart__EventFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageDecal_LastingBase_C">();
	}
	static class ABP_DamageDecal_LastingBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageDecal_LastingBase_C>();
	}
};
static_assert(alignof(ABP_DamageDecal_LastingBase_C) == 0x000008, "Wrong alignment on ABP_DamageDecal_LastingBase_C");
static_assert(sizeof(ABP_DamageDecal_LastingBase_C) == 0x0003A0, "Wrong size on ABP_DamageDecal_LastingBase_C");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, UberGraphFrame_BP_DamageDecal_LastingBase_C) == 0x000368, "Member 'ABP_DamageDecal_LastingBase_C::UberGraphFrame_BP_DamageDecal_LastingBase_C' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, Timeline_0___Track_1_0BE070594A437C4439B5F49722EBA1CF) == 0x000370, "Member 'ABP_DamageDecal_LastingBase_C::Timeline_0___Track_1_0BE070594A437C4439B5F49722EBA1CF' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, Timeline_0___Track_0_0BE070594A437C4439B5F49722EBA1CF) == 0x000374, "Member 'ABP_DamageDecal_LastingBase_C::Timeline_0___Track_0_0BE070594A437C4439B5F49722EBA1CF' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, Timeline_0__Direction_0BE070594A437C4439B5F49722EBA1CF) == 0x000378, "Member 'ABP_DamageDecal_LastingBase_C::Timeline_0__Direction_0BE070594A437C4439B5F49722EBA1CF' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, Timeline_0) == 0x000380, "Member 'ABP_DamageDecal_LastingBase_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, NewTime) == 0x000388, "Member 'ABP_DamageDecal_LastingBase_C::NewTime' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, BeginClearingTime) == 0x00038C, "Member 'ABP_DamageDecal_LastingBase_C::BeginClearingTime' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, NewScale) == 0x000390, "Member 'ABP_DamageDecal_LastingBase_C::NewScale' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, LoopTime) == 0x000394, "Member 'ABP_DamageDecal_LastingBase_C::LoopTime' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_LastingBase_C, DuringTheWorld) == 0x000398, "Member 'ABP_DamageDecal_LastingBase_C::DuringTheWorld' has a wrong offset!");

}

