#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerEventManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequencerEventManager.BP_SequencerEventManager_C
// 0x0020 (0x0348 - 0x0328)
class ABP_SequencerEventManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SequencerTrackBase_C*>       SequencerTracks;                                   // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_SequencerEventManager(int32 EntryPoint);
	void CacheTracks();
	void SkipSequencer();
	void UserConstructionScript();
	void GetValidSequencerTracks(TArray<class ABP_SequencerTrackBase_C*>& InSequencerTracks, TArray<class ABP_SequencerTrackBase_C*>* OutSequencerTracks);
	void IsSkipping(bool* bIsSkipping);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SequencerEventManager_C">();
	}
	static class ABP_SequencerEventManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SequencerEventManager_C>();
	}
};
static_assert(alignof(ABP_SequencerEventManager_C) == 0x000008, "Wrong alignment on ABP_SequencerEventManager_C");
static_assert(sizeof(ABP_SequencerEventManager_C) == 0x000348, "Wrong size on ABP_SequencerEventManager_C");
static_assert(offsetof(ABP_SequencerEventManager_C, UberGraphFrame) == 0x000328, "Member 'ABP_SequencerEventManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SequencerEventManager_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_SequencerEventManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SequencerEventManager_C, SequencerTracks) == 0x000338, "Member 'ABP_SequencerEventManager_C::SequencerTracks' has a wrong offset!");

}

