#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMoatTest4

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMoatTest4.BP_SplineMoatTest4_C.ExecuteUbergraph_BP_SplineMoatTest4
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location1; // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1; // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0070(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable1;                             // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue1;                // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue1;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4) == 0x000010, "Wrong alignment on BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4");
static_assert(sizeof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4) == 0x0000F0, "Wrong size on BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, EntryPoint) == 0x000000, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue1) == 0x00000C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue2) == 0x000014, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00001C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue3) == 0x000020, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_int_Variable) == 0x00002C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000034, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000040, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Location1) == 0x00004C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Location1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1) == 0x000058, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Add_IntInt_ReturnValue1) == 0x000068, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_struct_Variable) == 0x000070, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_struct_Variable1) == 0x0000B0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_AddComponent_ReturnValue1) == 0x0000E0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_AddComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_SetStaticMesh_ReturnValue1) == 0x0000E8, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_SetStaticMesh_ReturnValue1' has a wrong offset!");

}

