#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerSubtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SequencerTrackBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequencerSubtitle.BP_SequencerSubtitle_C
// 0x0028 (0x0360 - 0x0338)
class ABP_SequencerSubtitle_C final : public ABP_SequencerTrackBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SequencerSubtitle_C;             // 0x0338(0x0008)(Transient, DuplicateTransient)
	class UWB_DBISequencerSubtitler_C*            WB_Subtitler;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SubTitle;                                          // 0x0348(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_SequencerSubtitle(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void SkipTrack();
	void UserConstructionScript();

	void Parse(const class FString& Source, class FString* ParsedTxt) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SequencerSubtitle_C">();
	}
	static class ABP_SequencerSubtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SequencerSubtitle_C>();
	}
};
static_assert(alignof(ABP_SequencerSubtitle_C) == 0x000008, "Wrong alignment on ABP_SequencerSubtitle_C");
static_assert(sizeof(ABP_SequencerSubtitle_C) == 0x000360, "Wrong size on ABP_SequencerSubtitle_C");
static_assert(offsetof(ABP_SequencerSubtitle_C, UberGraphFrame_BP_SequencerSubtitle_C) == 0x000338, "Member 'ABP_SequencerSubtitle_C::UberGraphFrame_BP_SequencerSubtitle_C' has a wrong offset!");
static_assert(offsetof(ABP_SequencerSubtitle_C, WB_Subtitler) == 0x000340, "Member 'ABP_SequencerSubtitle_C::WB_Subtitler' has a wrong offset!");
static_assert(offsetof(ABP_SequencerSubtitle_C, SubTitle) == 0x000348, "Member 'ABP_SequencerSubtitle_C::SubTitle' has a wrong offset!");

}

