#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StartPointCursor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StartPointCursor.BP_StartPointCursor_C.ExecuteUbergraph_BP_StartPointCursor
// 0x0010 (0x0010 - 0x0000)
struct BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue1;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor) == 0x000004, "Wrong alignment on BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor");
static_assert(sizeof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor) == 0x000010, "Wrong size on BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor");
static_assert(offsetof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor, EntryPoint) == 0x000000, "Member 'BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor, CallFunc_Lerp_ReturnValue1) == 0x000008, "Member 'BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor::CallFunc_Lerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor, K2Node_CustomEvent_bVisible) == 0x00000C, "Member 'BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'BP_StartPointCursor_C_ExecuteUbergraph_BP_StartPointCursor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_StartPointCursor.BP_StartPointCursor_C.SetVisibleCursor
// 0x0001 (0x0001 - 0x0000)
struct BP_StartPointCursor_C_SetVisibleCursor final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StartPointCursor_C_SetVisibleCursor) == 0x000001, "Wrong alignment on BP_StartPointCursor_C_SetVisibleCursor");
static_assert(sizeof(BP_StartPointCursor_C_SetVisibleCursor) == 0x000001, "Wrong size on BP_StartPointCursor_C_SetVisibleCursor");
static_assert(offsetof(BP_StartPointCursor_C_SetVisibleCursor, bVisible) == 0x000000, "Member 'BP_StartPointCursor_C_SetVisibleCursor::bVisible' has a wrong offset!");

// Function BP_StartPointCursor.BP_StartPointCursor_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_StartPointCursor_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartPointCursor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_StartPointCursor_C_UserConstructionScript");
static_assert(sizeof(BP_StartPointCursor_C_UserConstructionScript) == 0x000008, "Wrong size on BP_StartPointCursor_C_UserConstructionScript");
static_assert(offsetof(BP_StartPointCursor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_StartPointCursor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

