#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShopCompetitionUISharingCharaParam

#include "Basic.hpp"

#include "ST_ShopCompetitionUICharaPollingParam_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "ST_ShopCompetitionUICharaParam_structs.hpp"


namespace SDK::Params
{

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam
// 0x01D0 (0x01D0 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType1;                    // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNotUseCollision;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSelfDamage;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_AAPValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP1;            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueMax_AAPValueMax;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ShopCompetitionUICharaParam        K2Node_MakeStruct_ST_ShopCompetitionUICharaParam;  // 0x0078(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsShopCompetition_bReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_CriticalTimeRate;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameWatcherCamera_C*>   CallFunc_GetCameraman_CachedCameraman;             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameWatcherCamera_C*>   CallFunc_GetCameraman_CachedCameraman1;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ShopCompetitionUICharaPollingParam K2Node_MakeStruct_ST_ShopCompetitionUICharaPollingParam; // 0x0100(0x0008)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            K2Node_CustomEvent_New;                            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            K2Node_CustomEvent_Old;                            // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameWatcherCamera_C*           CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision, bool bSelfDamage)> K2Node_CreateDelegate_OutputDelegate1; // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCharacterFloatParameterFromDefaultContent_bSuccess; // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCharacterFloatParameterFromDefaultContent_Value; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECharacterBehavior New, ECharacterBehavior Old)> K2Node_CreateDelegate_OutputDelegate2; // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ShopCompetitionUICharaParam        K2Node_MakeStruct_ST_ShopCompetitionUICharaParam1; // 0x016C(0x0020)(HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate3; // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class ABP_AJBInGameWatcherCamera_C*>   CallFunc_GetCameraman_CachedCameraman2;            // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameWatcherCamera_C*           CallFunc_Array_Get_Item1;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam) == 0x000008, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam) == 0x0001D0, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, EntryPoint) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_Damage) == 0x000010, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_DamageType1) == 0x000018, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_DamageType1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_DamageCauser1) == 0x000020, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_bRemainHP) == 0x000028, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_bDamageIsCut) == 0x000029, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_bNotUseCollision) == 0x00002A, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_bSelfDamage) == 0x00002B, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_bSelfDamage' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_bool_IsClosed_Variable) == 0x000039, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_AsBI_Additional_AP) == 0x000048, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_AsBI_Additional_AP' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_bSuccess1) == 0x000058, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetValue_AAPValue) == 0x00005C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetValue_AAPValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_AsBI_Additional_AP1) == 0x000060, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_AsBI_Additional_AP1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetValueMax_AAPValueMax) == 0x000074, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetValueMax_AAPValueMax' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_MakeStruct_ST_ShopCompetitionUICharaParam) == 0x000078, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_MakeStruct_ST_ShopCompetitionUICharaParam' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_IsShopCompetition_bReturnValue) == 0x000098, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_IsShopCompetition_bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_Event_DeltaSeconds) == 0x00009C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_CriticalTimeRate) == 0x0000A0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_CriticalTimeRate' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_SwitchEnum_CmpSuccess) == 0x0000A4, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000AC, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetCameraman_CachedCameraman) == 0x0000B0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetCameraman_CachedCameraman' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetCameraman_CachedCameraman1) == 0x0000D0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetCameraman_CachedCameraman1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Array_Length_ReturnValue1) == 0x0000E0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_DamageType) == 0x0000E8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_DeadActor) == 0x0000F0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_DamageCauser) == 0x0000F8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_MakeStruct_ST_ShopCompetitionUICharaPollingParam) == 0x000100, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_MakeStruct_ST_ShopCompetitionUICharaPollingParam' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_SwitchEnum1_CmpSuccess) == 0x000108, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_int_Loop_Counter_Variable1) == 0x00010C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Less_IntInt_ReturnValue1) == 0x000110, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Add_IntInt_ReturnValue1) == 0x000128, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_New) == 0x00012C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_New' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CustomEvent_Old) == 0x00012D, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CustomEvent_Old' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00012E, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_int_Array_Index_Variable) == 0x000130, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CreateDelegate_OutputDelegate1) == 0x000140, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_IsValid_ReturnValue1) == 0x000150, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetCharacterFloatParameterFromDefaultContent_bSuccess) == 0x000151, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetCharacterFloatParameterFromDefaultContent_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetCharacterFloatParameterFromDefaultContent_Value) == 0x000154, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetCharacterFloatParameterFromDefaultContent_Value' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CreateDelegate_OutputDelegate2) == 0x000158, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_FTrunc_ReturnValue) == 0x000168, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_MakeStruct_ST_ShopCompetitionUICharaParam1) == 0x00016C, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_MakeStruct_ST_ShopCompetitionUICharaParam1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, K2Node_CreateDelegate_OutputDelegate3) == 0x000190, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_GetCameraman_CachedCameraman2) == 0x0001A0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_GetCameraman_CachedCameraman2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Array_Length_ReturnValue2) == 0x0001B0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, Temp_int_Array_Index_Variable1) == 0x0001B8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_Array_Get_Item1) == 0x0001C0, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_IsValid_ReturnValue2) == 0x0001C8, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001C9, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ExecuteUbergraph_BP_ShopCompetitionUISharingCharaParam::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.OnChangeCharacterBehavior
// 0x0002 (0x0002 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior final
{
public:
	ECharacterBehavior                            New;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            Old;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior) == 0x000001, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior) == 0x000002, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior, New) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior::New' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior, Old) == 0x000001, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnChangeCharacterBehavior::Old' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.OnDead
// 0x0018 (0x0018 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_OnDead final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_OnDead) == 0x000008, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_OnDead");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_OnDead) == 0x000018, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_OnDead");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDead, DamageType) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDead::DamageType' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDead, DeadActor) == 0x000008, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDead::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDead, DamageCauser) == 0x000010, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDead::DamageCauser' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.OnUpdateCharaPollingParam
// 0x0004 (0x0004 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam final
{
public:
	float                                         CriticalTimeRate;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam) == 0x000004, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam) == 0x000004, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam, CriticalTimeRate) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnUpdateCharaPollingParam::CriticalTimeRate' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.OnDamageOwnerChara(Svr)
// 0x0020 (0x0020 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_ final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfDamage;                                       // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_) == 0x000008, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_) == 0x000020, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, Damage) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::Damage' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, DamageType) == 0x000008, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::DamageType' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, DamageCauser) == 0x000010, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, bRemainHP) == 0x000018, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, bDamageIsCut) == 0x000019, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, bNotUseCollision) == 0x00001A, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_, bSelfDamage) == 0x00001B, "Member 'BP_ShopCompetitionUISharingCharaParam_C_OnDamageOwnerChara_Svr_::bSelfDamage' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.IsShopCompetition
// 0x0020 (0x0020 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition final
{
public:
	bool                                          bReturnValue;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsShopCompetition_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsShopCompetition_ReturnValue1;   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition) == 0x000008, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition) == 0x000020, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, bReturnValue) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, CallFunc_PlayModeIsShopCompetition_ReturnValue) == 0x000001, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::CallFunc_PlayModeIsShopCompetition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000008, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, CallFunc_IsEditor_ReturnValue) == 0x000018, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, CallFunc_Contains_ReturnValue) == 0x000019, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition, CallFunc_PlayModeIsShopCompetition_ReturnValue1) == 0x00001A, "Member 'BP_ShopCompetitionUISharingCharaParam_C_IsShopCompetition::CallFunc_PlayModeIsShopCompetition_ReturnValue1' has a wrong offset!");

// Function BP_ShopCompetitionUISharingCharaParam.BP_ShopCompetitionUISharingCharaParam_C.GetCameraman
// 0x0020 (0x0020 - 0x0000)
struct BP_ShopCompetitionUISharingCharaParam_C_GetCameraman final
{
public:
	TArray<class ABP_AJBInGameWatcherCamera_C*>   CachedCameraman_0;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class ABP_AJBInGameWatcherCamera_C*>   CallFunc_GetJoinPawns_OutPawns;                    // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ShopCompetitionUISharingCharaParam_C_GetCameraman) == 0x000008, "Wrong alignment on BP_ShopCompetitionUISharingCharaParam_C_GetCameraman");
static_assert(sizeof(BP_ShopCompetitionUISharingCharaParam_C_GetCameraman) == 0x000020, "Wrong size on BP_ShopCompetitionUISharingCharaParam_C_GetCameraman");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_GetCameraman, CachedCameraman_0) == 0x000000, "Member 'BP_ShopCompetitionUISharingCharaParam_C_GetCameraman::CachedCameraman_0' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUISharingCharaParam_C_GetCameraman, CallFunc_GetJoinPawns_OutPawns) == 0x000010, "Member 'BP_ShopCompetitionUISharingCharaParam_C_GetCameraman::CallFunc_GetJoinPawns_OutPawns' has a wrong offset!");

}

