#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_AJBConsoleCommandFunctions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPF_AJBConsoleCommandFunctions.BPF_AJBConsoleCommandFunctions_C.DumpMemreportLog
// 0x00D8 (0x00D8 - 0x0000)
struct BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog final
{
public:
	class UObject*                                SourceObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAutoPlayTestMode_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsDate_DateTime_ReturnValue;              // 0x0048(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog) == 0x000008, "Wrong alignment on BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog");
static_assert(sizeof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog) == 0x0000D8, "Wrong size on BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, SourceObject) == 0x000000, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::SourceObject' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, __WorldContext) == 0x000008, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_GetObjectName_ReturnValue) == 0x000020, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_GetAutoPlayTestMode_ReturnValue) == 0x000030, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_GetAutoPlayTestMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Now_ReturnValue) == 0x000038, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_AsDate_DateTime_ReturnValue) == 0x000048, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_AsDate_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Conv_TextToString_ReturnValue) == 0x000068, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue1) == 0x000088, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue2) == 0x000098, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue3) == 0x0000A8, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue4) == 0x0000B8, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog, CallFunc_Concat_StrStr_ReturnValue5) == 0x0000C8, "Member 'BPF_AJBConsoleCommandFunctions_C_DumpMemreportLog::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");

}

