#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBCooldownTime_Paramed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTD_AJBCooldownTime_Paramed.BTD_AJBCooldownTime_Paramed_C.ExecuteUbergraph_BTD_AJBCooldownTime_Paramed
// 0x0078 (0x0078 - 0x0000)
struct BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetElapsedGameTimespan_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_Event_NodeResult;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed) == 0x000008, "Wrong alignment on BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed");
static_assert(sizeof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed) == 0x000078, "Wrong size on BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, EntryPoint) == 0x000000, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetElapsedGameTimespan_ReturnValue) == 0x000008, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetElapsedGameTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000018, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_Event_OwnerController1) == 0x000028, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_Event_ControlledPawn1) == 0x000030, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_Event_NodeResult) == 0x000038, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_Event_NodeResult' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_Less_FloatFloat_ReturnValue) == 0x000039, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_Event_OwnerController) == 0x000040, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, K2Node_Event_ControlledPawn) == 0x000048, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetRecognition_ReturnValue) == 0x000058, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetFloatParam_ReturnValue) == 0x000068, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetFloatParam_Found) == 0x00006C, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetFloatParam_ReturnValue1) == 0x000070, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed, CallFunc_GetFloatParam_Found1) == 0x000074, "Member 'BTD_AJBCooldownTime_Paramed_C_ExecuteUbergraph_BTD_AJBCooldownTime_Paramed::CallFunc_GetFloatParam_Found1' has a wrong offset!");

// Function BTD_AJBCooldownTime_Paramed.BTD_AJBCooldownTime_Paramed_C.ReceiveExecutionStartAI
// 0x0010 (0x0010 - 0x0000)
struct BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI) == 0x000008, "Wrong alignment on BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI");
static_assert(sizeof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI) == 0x000010, "Wrong size on BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI, OwnerController) == 0x000000, "Member 'BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionStartAI::ControlledPawn' has a wrong offset!");

// Function BTD_AJBCooldownTime_Paramed.BTD_AJBCooldownTime_Paramed_C.ReceiveExecutionFinishAI
// 0x0018 (0x0018 - 0x0000)
struct BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 NodeResult;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI) == 0x000008, "Wrong alignment on BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI");
static_assert(sizeof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI) == 0x000018, "Wrong size on BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI, OwnerController) == 0x000000, "Member 'BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI, NodeResult) == 0x000010, "Member 'BTD_AJBCooldownTime_Paramed_C_ReceiveExecutionFinishAI::NodeResult' has a wrong offset!");

// Function BTD_AJBCooldownTime_Paramed.BTD_AJBCooldownTime_Paramed_C.PerformConditionCheckAI
// 0x0048 (0x0048 - 0x0000)
struct BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetElapsedGameTimespan_ReturnValue;       // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_TimespanTimespan_ReturnValue;    // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI) == 0x000048, "Wrong size on BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000020, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, CallFunc_GetElapsedGameTimespan_ReturnValue) == 0x000030, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::CallFunc_GetElapsedGameTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, CallFunc_Subtract_TimespanTimespan_ReturnValue) == 0x000038, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::CallFunc_Subtract_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, CallFunc_GetTotalSeconds_ReturnValue) == 0x000040, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BTD_AJBCooldownTime_Paramed_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

