#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBCooldownTime_Paramed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_AJBCooldownTime_Paramed.BTD_AJBCooldownTime_Paramed_C
// 0x0038 (0x00D8 - 0x00A0)
class UBTD_AJBCooldownTime_Paramed_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FTimespan                              GameTimeAtExit;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               GameState;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CoolDownTime;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownTimeParam;                                 // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanEnter;                                         // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownTimeDeviationParam;                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownTimeCurrent;                               // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CooldownTimeDeviation;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTD_AJBCooldownTime_Paramed(int32 EntryPoint);
	void ReceiveExecutionStartAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecutionFinishAI(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_AJBCooldownTime_Paramed_C">();
	}
	static class UBTD_AJBCooldownTime_Paramed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBCooldownTime_Paramed_C>();
	}
};
static_assert(alignof(UBTD_AJBCooldownTime_Paramed_C) == 0x000008, "Wrong alignment on UBTD_AJBCooldownTime_Paramed_C");
static_assert(sizeof(UBTD_AJBCooldownTime_Paramed_C) == 0x0000D8, "Wrong size on UBTD_AJBCooldownTime_Paramed_C");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, UberGraphFrame) == 0x0000A0, "Member 'UBTD_AJBCooldownTime_Paramed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, GameTimeAtExit) == 0x0000A8, "Member 'UBTD_AJBCooldownTime_Paramed_C::GameTimeAtExit' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, GameState) == 0x0000B0, "Member 'UBTD_AJBCooldownTime_Paramed_C::GameState' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, CoolDownTime) == 0x0000B8, "Member 'UBTD_AJBCooldownTime_Paramed_C::CoolDownTime' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, CooldownTimeParam) == 0x0000C0, "Member 'UBTD_AJBCooldownTime_Paramed_C::CooldownTimeParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, bCanEnter) == 0x0000C4, "Member 'UBTD_AJBCooldownTime_Paramed_C::bCanEnter' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, CooldownTimeDeviationParam) == 0x0000C8, "Member 'UBTD_AJBCooldownTime_Paramed_C::CooldownTimeDeviationParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, CooldownTimeCurrent) == 0x0000CC, "Member 'UBTD_AJBCooldownTime_Paramed_C::CooldownTimeCurrent' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCooldownTime_Paramed_C, CooldownTimeDeviation) == 0x0000D0, "Member 'UBTD_AJBCooldownTime_Paramed_C::CooldownTimeDeviation' has a wrong offset!");

}

