#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBDebugDrawBasics

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_AJBDebugDrawBasics.BTS_AJBDebugDrawBasics_C
// 0x0038 (0x00D0 - 0x0098)
class UBTS_AJBDebugDrawBasics_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 RO_FocusingEnemy;                                  // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTS_AJBDebugDrawBasics(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_AJBDebugDrawBasics_C">();
	}
	static class UBTS_AJBDebugDrawBasics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBDebugDrawBasics_C>();
	}
};
static_assert(alignof(UBTS_AJBDebugDrawBasics_C) == 0x000008, "Wrong alignment on UBTS_AJBDebugDrawBasics_C");
static_assert(sizeof(UBTS_AJBDebugDrawBasics_C) == 0x0000D0, "Wrong size on UBTS_AJBDebugDrawBasics_C");
static_assert(offsetof(UBTS_AJBDebugDrawBasics_C, UberGraphFrame) == 0x000098, "Member 'UBTS_AJBDebugDrawBasics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_AJBDebugDrawBasics_C, Recognition) == 0x0000A0, "Member 'UBTS_AJBDebugDrawBasics_C::Recognition' has a wrong offset!");
static_assert(offsetof(UBTS_AJBDebugDrawBasics_C, RO_FocusingEnemy) == 0x0000A8, "Member 'UBTS_AJBDebugDrawBasics_C::RO_FocusingEnemy' has a wrong offset!");

}

