#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfFacingInstantWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_AJBJumpIfFacingInstantWall.BTS_AJBJumpIfFacingInstantWall_C
// 0x0018 (0x00B0 - 0x0098)
class UBTS_AJBJumpIfFacingInstantWall_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	float                                         TraceDistance;                                     // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEventTagLocker*                        HighJumpEventLocker;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_AJBJumpIfFacingInstantWall(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_AJBJumpIfFacingInstantWall_C">();
	}
	static class UBTS_AJBJumpIfFacingInstantWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBJumpIfFacingInstantWall_C>();
	}
};
static_assert(alignof(UBTS_AJBJumpIfFacingInstantWall_C) == 0x000008, "Wrong alignment on UBTS_AJBJumpIfFacingInstantWall_C");
static_assert(sizeof(UBTS_AJBJumpIfFacingInstantWall_C) == 0x0000B0, "Wrong size on UBTS_AJBJumpIfFacingInstantWall_C");
static_assert(offsetof(UBTS_AJBJumpIfFacingInstantWall_C, UberGraphFrame) == 0x000098, "Member 'UBTS_AJBJumpIfFacingInstantWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfFacingInstantWall_C, TraceDistance) == 0x0000A0, "Member 'UBTS_AJBJumpIfFacingInstantWall_C::TraceDistance' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfFacingInstantWall_C, HighJumpEventLocker) == 0x0000A8, "Member 'UBTS_AJBJumpIfFacingInstantWall_C::HighJumpEventLocker' has a wrong offset!");

}

