#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBDoReactionOnAttacked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBDoReactionOnAttacked.BTT_AJBDoReactionOnAttacked_C.ExecuteUbergraph_BTT_AJBDoReactionOnAttacked
// 0x0130 (0x0130 - 0x0000)
struct BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue;               // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_FindReachableLocations_ReturnValue;       // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_MathExpression_ReturnValue;                 // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X1;                           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_MathExpression_ReturnValue1;                // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue1;              // 0x0120(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked) == 0x000008, "Wrong alignment on BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked");
static_assert(sizeof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked) == 0x000130, "Wrong size on BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, EntryPoint) == 0x000000, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_AI_GetLogColor_ReturnValue) == 0x000004, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_AI_GetLogColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000018, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, K2Node_Event_OwnerController) == 0x000030, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x000040, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000048, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetLocation_ReturnValue) == 0x000050, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetInput_ReturnValue) == 0x000060, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_FindReachableLocations_ReturnValue) == 0x000068, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_FindReachableLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_Array_LastIndex_ReturnValue) == 0x000078, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00007C, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000080, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_Array_Get_Item) == 0x000084, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000090, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetRecognition_ReturnValue) == 0x000098, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetLocation_ReturnValue1) == 0x0000A0, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000AC, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_IsValid_ReturnValue1) == 0x0000B8, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_X) == 0x0000BC, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, K2Node_MathExpression_ReturnValue) == 0x0000C8, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000D4, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetLocation_ReturnValue2) == 0x0000E0, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x0000EC, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000F8, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_X1) == 0x0000FC, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_Y1) == 0x000100, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_BreakVector_Z1) == 0x000104, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, K2Node_MathExpression_ReturnValue1) == 0x000108, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::K2Node_MathExpression_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000114, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked, CallFunc_AI_GetLogColor_ReturnValue1) == 0x000120, "Member 'BTT_AJBDoReactionOnAttacked_C_ExecuteUbergraph_BTT_AJBDoReactionOnAttacked::CallFunc_AI_GetLogColor_ReturnValue1' has a wrong offset!");

// Function BTT_AJBDoReactionOnAttacked.BTT_AJBDoReactionOnAttacked_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBDoReactionOnAttacked_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBDoReactionOnAttacked.BTT_AJBDoReactionOnAttacked_C.FindReachableLocations
// 0x01F0 (0x01F0 - 0x0000)
struct BTT_AJBDoReactionOnAttacked_C_FindReachableLocations final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionToEnemyXY_0;                              // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
	struct FVector                                VectorToMoveCandidate;                             // 0x0028(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CharaLocationBase;                                 // 0x0034(0x000C)(Edit, BlueprintVisible, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	struct FVector                                CharaForwardVectorBase;                            // 0x0050(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Results;                                           // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                 Rotations;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetKneeHeight_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetRawBodyActor_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x00E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithPlayers_ReturnValue; // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBDoReactionOnAttacked_C_FindReachableLocations) == 0x000008, "Wrong alignment on BTT_AJBDoReactionOnAttacked_C_FindReachableLocations");
static_assert(sizeof(BTT_AJBDoReactionOnAttacked_C_FindReachableLocations) == 0x0001F0, "Wrong size on BTT_AJBDoReactionOnAttacked_C_FindReachableLocations");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_FindReachableLocations, AI_Controller) == 0x000000, "Member 'BTT_AJBDoReactionOnAttacked_C_FindReachableLocations::AI_Controller' has a wrong offset!");
static_assert(offsetof(BTT_AJBDoReactionOnAttacked_C_FindReachableLocations, Distance) == 0x000008, "Member 'BTT_AJBDoReactionOnAttacked_C_FindReachableLocations::Distance' has a wrong offset!");
