#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFakeAttack

#include "Basic.hpp"

#include "ST_AJBAICharacterSkillInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBFakeAttack.BTT_AJBFakeAttack_C.ExecuteUbergraph_BTT_AJBFakeAttack
// 0x01C8 (0x01C8 - 0x0000)
struct BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController2;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn2;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue;     // 0x0030(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsPressingR2_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue2;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found2;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue3;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found3;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_GetFloatValueWithDeviation_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue4;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue5;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue1;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue; // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressingR2_ReturnValue1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue2;                    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue3;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue2; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue1;    // 0x0128(0x0020)(HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue1; // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInvokeSkill_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue1;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_GetFloatValueWithDeviation_ReturnValue1; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue;               // 0x0194(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x01A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x01B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack) == 0x000008, "Wrong alignment on BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack");
static_assert(sizeof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack) == 0x0001C8, "Wrong size on BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, EntryPoint) == 0x000000, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_OwnerController2) == 0x000008, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_OwnerController2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_ControlledPawn2) == 0x000010, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_ControlledPawn2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetRecognition_ReturnValue) == 0x000018, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetInput_ReturnValue) == 0x000020, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000028, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetNormalAttackSkillInfo_ReturnValue) == 0x000030, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetNormalAttackSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_IsPressingR2_ReturnValue) == 0x000050, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_IsPressingR2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetRecognition_ReturnValue1) == 0x000058, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetRecognition_ReturnValue2) == 0x000060, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetRecognition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue) == 0x000068, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found) == 0x00006C, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue1) == 0x000070, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found1) == 0x000074, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue2) == 0x000078, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found2) == 0x00007C, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue3) == 0x000080, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found3) == 0x000084, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_AI_GetFloatValueWithDeviation_ReturnValue) == 0x000088, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_AI_GetFloatValueWithDeviation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue4) == 0x00008C, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found4) == 0x000090, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found4' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_ReturnValue5) == 0x000094, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetFloatParam_Found5) == 0x000098, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetFloatParam_Found5' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_OwnerController1) == 0x0000A0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_ControlledPawn1) == 0x0000A8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetInput_ReturnValue1) == 0x0000B0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetInput_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue) == 0x0000B8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_IsPressingR2_ReturnValue1) == 0x0000C4, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_IsPressingR2_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_OwnerController) == 0x0000C8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_ControlledPawn) == 0x0000D0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_Event_DeltaSeconds) == 0x0000D8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x0000E0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetInput_ReturnValue2) == 0x0000E8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetInput_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x0000F0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetLocation_ReturnValue) == 0x0000FC, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetRecognition_ReturnValue3) == 0x000108, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetRecognition_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x000110, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000118, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetControllingImaginaryCharacter_ReturnValue2) == 0x000120, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetControllingImaginaryCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetNormalAttackSkillInfo_ReturnValue1) == 0x000128, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetNormalAttackSkillInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetLocation_ReturnValue1) == 0x000148, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue1) == 0x000154, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_CalcRelativeLocationForFakeAttack_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_SwitchEnum_CmpSuccess) == 0x000160, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_CanInvokeSkill_ReturnValue) == 0x000170, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_CanInvokeSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetBlackboardValueAsObject_ReturnValue1) == 0x000178, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetBlackboardValueAsObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1) == 0x000180, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, K2Node_DynamicCast_bSuccess1) == 0x000188, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_AI_GetFloatValueWithDeviation_ReturnValue1) == 0x00018C, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_AI_GetFloatValueWithDeviation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, Temp_bool_Has_Been_Initd_Variable) == 0x000190, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, Temp_bool_IsClosed_Variable) == 0x000191, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_AI_GetLogColor_ReturnValue) == 0x000194, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_AI_GetLogColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_GetLocation_ReturnValue2) == 0x0001A4, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_Add_VectorVector_ReturnValue1) == 0x0001B0, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001BC, "Member 'BTT_AJBFakeAttack_C_ExecuteUbergraph_BTT_AJBFakeAttack::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BTT_AJBFakeAttack.BTT_AJBFakeAttack_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_AJBFakeAttack_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFakeAttack_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_AJBFakeAttack_C_ReceiveTickAI");
static_assert(sizeof(BTT_AJBFakeAttack_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_AJBFakeAttack_C_ReceiveTickAI");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_AJBFakeAttack_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFakeAttack_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_AJBFakeAttack_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_AJBFakeAttack.BTT_AJBFakeAttack_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBFakeAttack_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFakeAttack_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_AJBFakeAttack_C_ReceiveAbortAI");
static_assert(sizeof(BTT_AJBFakeAttack_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_AJBFakeAttack_C_ReceiveAbortAI");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_AJBFakeAttack_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFakeAttack_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBFakeAttack.BTT_AJBFakeAttack_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBFakeAttack_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFakeAttack_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBFakeAttack_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBFakeAttack_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBFakeAttack_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBFakeAttack_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFakeAttack_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFakeAttack_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

