#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBWaitTime_Paramed

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_AJBWaitTime_Paramed.BTT_AJBWaitTime_Paramed_C.ExecuteUbergraph_BTT_AJBWaitTime_Paramed
// 0x0038 (0x0038 - 0x0000)
struct BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_GetFloatValueWithDeviation_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed) == 0x000008, "Wrong alignment on BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed");
static_assert(sizeof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed) == 0x000038, "Wrong size on BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, EntryPoint) == 0x000000, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_GetRecognition_ReturnValue) == 0x000018, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_GetFloatParam_ReturnValue) == 0x000020, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_GetFloatParam_Found) == 0x000024, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_GetFloatParam_ReturnValue1) == 0x000028, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_GetFloatParam_Found1) == 0x00002C, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed, CallFunc_AI_GetFloatValueWithDeviation_ReturnValue) == 0x000030, "Member 'BTT_AJBWaitTime_Paramed_C_ExecuteUbergraph_BTT_AJBWaitTime_Paramed::CallFunc_AI_GetFloatValueWithDeviation_ReturnValue' has a wrong offset!");

// Function BTT_AJBWaitTime_Paramed.BTT_AJBWaitTime_Paramed_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBWaitTime_Paramed_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

