#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindHidingPlace

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AJBFindHidingPlace.BTT_AJBFindHidingPlace_C
// 0x00A8 (0x0148 - 0x00A0)
class UBTT_AJBFindHidingPlace_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	float                                         Radius;                                            // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 HidingObjectKey;                                   // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<float>                                 TraceAngles;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FBlackboardKeySelector                 PathToHidingPlaceKey;                              // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 RO_EnemyFocusingOnKey;                             // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTT_AJBFindHidingPlace(int32 EntryPoint);
	void BreakLineTrace();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_AJBFindHidingPlace_C">();
	}
	static class UBTT_AJBFindHidingPlace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBFindHidingPlace_C>();
	}
};
static_assert(alignof(UBTT_AJBFindHidingPlace_C) == 0x000008, "Wrong alignment on UBTT_AJBFindHidingPlace_C");
static_assert(sizeof(UBTT_AJBFindHidingPlace_C) == 0x000148, "Wrong size on UBTT_AJBFindHidingPlace_C");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_AJBFindHidingPlace_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, Radius) == 0x0000A8, "Member 'UBTT_AJBFindHidingPlace_C::Radius' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, HidingObjectKey) == 0x0000B0, "Member 'UBTT_AJBFindHidingPlace_C::HidingObjectKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, TraceAngles) == 0x0000D8, "Member 'UBTT_AJBFindHidingPlace_C::TraceAngles' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, TraceObjectTypes) == 0x0000E8, "Member 'UBTT_AJBFindHidingPlace_C::TraceObjectTypes' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, PathToHidingPlaceKey) == 0x0000F8, "Member 'UBTT_AJBFindHidingPlace_C::PathToHidingPlaceKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindHidingPlace_C, RO_EnemyFocusingOnKey) == 0x000120, "Member 'UBTT_AJBFindHidingPlace_C::RO_EnemyFocusingOnKey' has a wrong offset!");

}

