#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBInGamePvE_PhaseInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_AJBInGamePvE_PhaseInfo.ST_AJBInGamePvE_PhaseInfo
// 0x000C (0x000C - 0x0000)
struct FST_AJBInGamePvE_PhaseInfo final
{
public:
	int32                                         WaveIndex_13_B3A094BF4C6BE71A17675C9CF201F80D;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalDuration_14_EA5FA04944FC6D16F92F20AC6E6D4451; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaveDuration_15_01DE68C745CCE428DE7D3AA1FE9A3444;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_AJBInGamePvE_PhaseInfo) == 0x000004, "Wrong alignment on FST_AJBInGamePvE_PhaseInfo");
static_assert(sizeof(FST_AJBInGamePvE_PhaseInfo) == 0x00000C, "Wrong size on FST_AJBInGamePvE_PhaseInfo");
static_assert(offsetof(FST_AJBInGamePvE_PhaseInfo, WaveIndex_13_B3A094BF4C6BE71A17675C9CF201F80D) == 0x000000, "Member 'FST_AJBInGamePvE_PhaseInfo::WaveIndex_13_B3A094BF4C6BE71A17675C9CF201F80D' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_PhaseInfo, IntervalDuration_14_EA5FA04944FC6D16F92F20AC6E6D4451) == 0x000004, "Member 'FST_AJBInGamePvE_PhaseInfo::IntervalDuration_14_EA5FA04944FC6D16F92F20AC6E6D4451' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_PhaseInfo, WaveDuration_15_01DE68C745CCE428DE7D3AA1FE9A3444) == 0x000008, "Member 'FST_AJBInGamePvE_PhaseInfo::WaveDuration_15_01DE68C745CCE428DE7D3AA1FE9A3444' has a wrong offset!");

}

