#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBInGamePvE_ScoreRankSettings

#include "Basic.hpp"

#include "EPvEGameDifficulty_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_AJBInGamePvE_ScoreRankSettings.ST_AJBInGamePvE_ScoreRankSettings
// 0x0018 (0x0018 - 0x0000)
struct FST_AJBInGamePvE_ScoreRankSettings final
{
public:
	int32                                         BorderGroup_14_244192854D1E77DCBD63D5806D8B5993;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPvEGameDifficulty                            Difficulty_2_599308BC4D913B89785FED80D3360145;     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RankC_Border_5_E9DE72EE419EB48FFB61D9AAA6EA5D48;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RankB_Border_7_2D818254403AB219EE1C048C8A528CAE;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RankA_Border_10_B922B64B45333D1447F78FA8972404F5;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RankS_Border_11_83C36ADE4099F9304CB0CDA48F25B854;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_AJBInGamePvE_ScoreRankSettings) == 0x000004, "Wrong alignment on FST_AJBInGamePvE_ScoreRankSettings");
static_assert(sizeof(FST_AJBInGamePvE_ScoreRankSettings) == 0x000018, "Wrong size on FST_AJBInGamePvE_ScoreRankSettings");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, BorderGroup_14_244192854D1E77DCBD63D5806D8B5993) == 0x000000, "Member 'FST_AJBInGamePvE_ScoreRankSettings::BorderGroup_14_244192854D1E77DCBD63D5806D8B5993' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, Difficulty_2_599308BC4D913B89785FED80D3360145) == 0x000004, "Member 'FST_AJBInGamePvE_ScoreRankSettings::Difficulty_2_599308BC4D913B89785FED80D3360145' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, RankC_Border_5_E9DE72EE419EB48FFB61D9AAA6EA5D48) == 0x000008, "Member 'FST_AJBInGamePvE_ScoreRankSettings::RankC_Border_5_E9DE72EE419EB48FFB61D9AAA6EA5D48' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, RankB_Border_7_2D818254403AB219EE1C048C8A528CAE) == 0x00000C, "Member 'FST_AJBInGamePvE_ScoreRankSettings::RankB_Border_7_2D818254403AB219EE1C048C8A528CAE' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, RankA_Border_10_B922B64B45333D1447F78FA8972404F5) == 0x000010, "Member 'FST_AJBInGamePvE_ScoreRankSettings::RankA_Border_10_B922B64B45333D1447F78FA8972404F5' has a wrong offset!");
static_assert(offsetof(FST_AJBInGamePvE_ScoreRankSettings, RankS_Border_11_83C36ADE4099F9304CB0CDA48F25B854) == 0x000014, "Member 'FST_AJBInGamePvE_ScoreRankSettings::RankS_Border_11_83C36ADE4099F9304CB0CDA48F25B854' has a wrong offset!");

}

