#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_GionInfo

#include "Basic.hpp"

#include "E_GionWidgetOutAnimKind_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_GionWidgetInAnimKind_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GionWidgetLoopAnimKind_structs.hpp"
#include "E_GionLocallyControlScreenKind_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_GionInfo.ST_GionInfo
// 0x0060 (0x0060 - 0x0000)
struct FST_GionInfo final
{
public:
	struct FGameplayTag                           EffectTypeTag_2_774877894F1D8802775BB1BA1CBB930A;  // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_20_B469B7154A62B04E2520C9A367357BC1;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionWidgetInAnimKind                        GionWidgetInAnimKind_55_97665D464F912C23E8682DA79E7E5403; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionWidgetLoopAnimKind                      GionWidgetLoopAnimKind_50_93ACCF3348D8B824203D1DAE053F0971; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionWidgetOutAnimKind                       GionWidgetOutAnimKind_51_0989C2E14A6458CA68F987934A4E350B; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopAnimSecond_54_9C471F1B47CC6010F02BE78EA0BBE90B; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionLocallyControlScreenKind                LocallyControlScreenKind_41_58EDCA00440F8DFB1764CA8E8D64920E; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocallyControlSize_42_39DA2FC64FA1625E9507E68170C46628; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WorldUnitSize_59_B7F5ED124DF1731694B1AFA7FE51D2B5; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinSize_32_368C57854ACAE88FDA8B12AD7E61E265;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarDistance_34_FDE2D8494E7D4B9EF869AB9B78D18C2D;   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSize_37_A497E0494582A81139099DBA25AC02A7;       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearDistance_38_B4385564430C0D809FF870B16F5AA05D;  // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       RondomBox_29_0581759C4FEEADF944E3A18801488029;     // 0x0034(0x001C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         GenerateLimit_62_E9C99248446555FBD7107983B5FB4DA8; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AIEventTag_65_B5227D2D4E23C2395A3D8EAD67D82AA5;    // 0x0058(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_GionInfo) == 0x000008, "Wrong alignment on FST_GionInfo");
static_assert(sizeof(FST_GionInfo) == 0x000060, "Wrong size on FST_GionInfo");
static_assert(offsetof(FST_GionInfo, EffectTypeTag_2_774877894F1D8802775BB1BA1CBB930A) == 0x000000, "Member 'FST_GionInfo::EffectTypeTag_2_774877894F1D8802775BB1BA1CBB930A' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, Material_20_B469B7154A62B04E2520C9A367357BC1) == 0x000008, "Member 'FST_GionInfo::Material_20_B469B7154A62B04E2520C9A367357BC1' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, GionWidgetInAnimKind_55_97665D464F912C23E8682DA79E7E5403) == 0x000010, "Member 'FST_GionInfo::GionWidgetInAnimKind_55_97665D464F912C23E8682DA79E7E5403' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, GionWidgetLoopAnimKind_50_93ACCF3348D8B824203D1DAE053F0971) == 0x000011, "Member 'FST_GionInfo::GionWidgetLoopAnimKind_50_93ACCF3348D8B824203D1DAE053F0971' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, GionWidgetOutAnimKind_51_0989C2E14A6458CA68F987934A4E350B) == 0x000012, "Member 'FST_GionInfo::GionWidgetOutAnimKind_51_0989C2E14A6458CA68F987934A4E350B' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, LoopAnimSecond_54_9C471F1B47CC6010F02BE78EA0BBE90B) == 0x000014, "Member 'FST_GionInfo::LoopAnimSecond_54_9C471F1B47CC6010F02BE78EA0BBE90B' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, LocallyControlScreenKind_41_58EDCA00440F8DFB1764CA8E8D64920E) == 0x000018, "Member 'FST_GionInfo::LocallyControlScreenKind_41_58EDCA00440F8DFB1764CA8E8D64920E' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, LocallyControlSize_42_39DA2FC64FA1625E9507E68170C46628) == 0x00001C, "Member 'FST_GionInfo::LocallyControlSize_42_39DA2FC64FA1625E9507E68170C46628' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, WorldUnitSize_59_B7F5ED124DF1731694B1AFA7FE51D2B5) == 0x000020, "Member 'FST_GionInfo::WorldUnitSize_59_B7F5ED124DF1731694B1AFA7FE51D2B5' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, MinSize_32_368C57854ACAE88FDA8B12AD7E61E265) == 0x000024, "Member 'FST_GionInfo::MinSize_32_368C57854ACAE88FDA8B12AD7E61E265' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, FarDistance_34_FDE2D8494E7D4B9EF869AB9B78D18C2D) == 0x000028, "Member 'FST_GionInfo::FarDistance_34_FDE2D8494E7D4B9EF869AB9B78D18C2D' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, MaxSize_37_A497E0494582A81139099DBA25AC02A7) == 0x00002C, "Member 'FST_GionInfo::MaxSize_37_A497E0494582A81139099DBA25AC02A7' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, NearDistance_38_B4385564430C0D809FF870B16F5AA05D) == 0x000030, "Member 'FST_GionInfo::NearDistance_38_B4385564430C0D809FF870B16F5AA05D' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, RondomBox_29_0581759C4FEEADF944E3A18801488029) == 0x000034, "Member 'FST_GionInfo::RondomBox_29_0581759C4FEEADF944E3A18801488029' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, GenerateLimit_62_E9C99248446555FBD7107983B5FB4DA8) == 0x000050, "Member 'FST_GionInfo::GenerateLimit_62_E9C99248446555FBD7107983B5FB4DA8' has a wrong offset!");
static_assert(offsetof(FST_GionInfo, AIEventTag_65_B5227D2D4E23C2395A3D8EAD67D82AA5) == 0x000058, "Member 'FST_GionInfo::AIEventTag_65_B5227D2D4E23C2395A3D8EAD67D82AA5' has a wrong offset!");

}

