#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_GrowupInfo_Processed

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_GrowupInfo_Processed.ST_GrowupInfo_Processed
// 0x0028 (0x0028 - 0x0000)
struct FST_GrowupInfo_Processed final
{
public:
	struct FGameplayTag                           CharacterTag_5_340AFEDD471CF7CE11E7499031E93051;   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   GrowupTags_12_8D3BF7AD44B906D094C40F97257C5BF4;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                 GrowupValues_13_7FA18EBA408EB8721A9ADAAD89729BAD;  // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
};
static_assert(alignof(FST_GrowupInfo_Processed) == 0x000008, "Wrong alignment on FST_GrowupInfo_Processed");
static_assert(sizeof(FST_GrowupInfo_Processed) == 0x000028, "Wrong size on FST_GrowupInfo_Processed");
static_assert(offsetof(FST_GrowupInfo_Processed, CharacterTag_5_340AFEDD471CF7CE11E7499031E93051) == 0x000000, "Member 'FST_GrowupInfo_Processed::CharacterTag_5_340AFEDD471CF7CE11E7499031E93051' has a wrong offset!");
static_assert(offsetof(FST_GrowupInfo_Processed, GrowupTags_12_8D3BF7AD44B906D094C40F97257C5BF4) == 0x000008, "Member 'FST_GrowupInfo_Processed::GrowupTags_12_8D3BF7AD44B906D094C40F97257C5BF4' has a wrong offset!");
static_assert(offsetof(FST_GrowupInfo_Processed, GrowupValues_13_7FA18EBA408EB8721A9ADAAD89729BAD) == 0x000018, "Member 'FST_GrowupInfo_Processed::GrowupValues_13_7FA18EBA408EB8721A9ADAAD89729BAD' has a wrong offset!");

}

