#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_TraceInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_TraceInfo.ST_TraceInfo
// 0x0008 (0x0008 - 0x0000)
struct FST_TraceInfo final
{
public:
	bool                                          bShouldShowTraceInfo_1_3205CFCA4C4451FE7AC0F7B624C60571; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               DrawDebugTrace_4_6C6BACF84E61D3465ACA63BBC05DB7C0; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawTime_8_1DCFB0A04E8712B1FD4EDCB12B6A687B;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_TraceInfo) == 0x000004, "Wrong alignment on FST_TraceInfo");
static_assert(sizeof(FST_TraceInfo) == 0x000008, "Wrong size on FST_TraceInfo");
static_assert(offsetof(FST_TraceInfo, bShouldShowTraceInfo_1_3205CFCA4C4451FE7AC0F7B624C60571) == 0x000000, "Member 'FST_TraceInfo::bShouldShowTraceInfo_1_3205CFCA4C4451FE7AC0F7B624C60571' has a wrong offset!");
static_assert(offsetof(FST_TraceInfo, DrawDebugTrace_4_6C6BACF84E61D3465ACA63BBC05DB7C0) == 0x000001, "Member 'FST_TraceInfo::DrawDebugTrace_4_6C6BACF84E61D3465ACA63BBC05DB7C0' has a wrong offset!");
static_assert(offsetof(FST_TraceInfo, DrawTime_8_1DCFB0A04E8712B1FD4EDCB12B6A687B) == 0x000004, "Member 'FST_TraceInfo::DrawTime_8_1DCFB0A04E8712B1FD4EDCB12B6A687B' has a wrong offset!");

}

