#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBInGameGionEffect

#include "Basic.hpp"

#include "E_GionState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"


namespace SDK::Params
{

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.ExecuteUbergraph_WB_AJBInGameGionEffect
// 0x0068 (0x0068 - 0x0000)
struct WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array1;                           // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_CustomEvent_bIsOwner;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Owner;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsFriend;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInOwnersEnv;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv;     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameGion_C*                    K2Node_CustomEvent_GionActor;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array2;                           // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect) == 0x000008, "Wrong alignment on WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect");
static_assert(sizeof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect) == 0x000068, "Wrong size on WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, EntryPoint) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_Event_Animation) == 0x000008, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_MakeArray_Array) == 0x000010, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_MakeArray_Array1) == 0x000020, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_bIsOwner) == 0x000030, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_bIsOwner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_Owner) == 0x000038, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_bIsFriend) == 0x000040, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_bIsFriend' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_SpanwedSpaceInOwnersEnv) == 0x000041, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_SpanwedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv) == 0x000042, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_CustomEvent_GionActor) == 0x000048, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_CustomEvent_GionActor' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_MakeArray_Array2) == 0x000050, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000060, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'WB_AJBInGameGionEffect_C_ExecuteUbergraph_WB_AJBInGameGionEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.OnActiveEffect
// 0x0020 (0x0020 - 0x0000)
struct WB_AJBInGameGionEffect_C_OnActiveEffect final
{
public:
	bool                                          bIsOwner_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner_0;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFriend_0;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            SpanwedSpaceInOwnersEnv_0;                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpanwedSpaceInNotOwnersEnv_0;                      // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameGion_C*                    GionActor_0;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_OnActiveEffect) == 0x000008, "Wrong alignment on WB_AJBInGameGionEffect_C_OnActiveEffect");
static_assert(sizeof(WB_AJBInGameGionEffect_C_OnActiveEffect) == 0x000020, "Wrong size on WB_AJBInGameGionEffect_C_OnActiveEffect");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, bIsOwner_0) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::bIsOwner_0' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, Owner_0) == 0x000008, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::Owner_0' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, bIsFriend_0) == 0x000010, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::bIsFriend_0' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, SpanwedSpaceInOwnersEnv_0) == 0x000011, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::SpanwedSpaceInOwnersEnv_0' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, SpanwedSpaceInNotOwnersEnv_0) == 0x000012, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::SpanwedSpaceInNotOwnersEnv_0' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnActiveEffect, GionActor_0) == 0x000018, "Member 'WB_AJBInGameGionEffect_C_OnActiveEffect::GionActor_0' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBInGameGionEffect_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WB_AJBInGameGionEffect_C_OnAnimationFinished");
static_assert(sizeof(WB_AJBInGameGionEffect_C_OnAnimationFinished) == 0x000008, "Wrong size on WB_AJBInGameGionEffect_C_OnAnimationFinished");
static_assert(offsetof(WB_AJBInGameGionEffect_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.CanActiveEffect
// 0x0003 (0x0003 - 0x0000)
struct WB_AJBInGameGionEffect_C_CanActiveEffect final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_CanActiveEffect) == 0x000001, "Wrong alignment on WB_AJBInGameGionEffect_C_CanActiveEffect");
static_assert(sizeof(WB_AJBInGameGionEffect_C_CanActiveEffect) == 0x000003, "Wrong size on WB_AJBInGameGionEffect_C_CanActiveEffect");
static_assert(offsetof(WB_AJBInGameGionEffect_C_CanActiveEffect, Result) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_CanActiveEffect::Result' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_CanActiveEffect, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_AJBInGameGionEffect_C_CanActiveEffect::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_CanActiveEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_AJBInGameGionEffect_C_CanActiveEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.IsNeedUpdatePosition
// 0x0011 (0x0011 - 0x0000)
struct WB_AJBInGameGionEffect_C_IsNeedUpdatePosition final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select2_Default;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition) == 0x000001, "Wrong alignment on WB_AJBInGameGionEffect_C_IsNeedUpdatePosition");
static_assert(sizeof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition) == 0x000011, "Wrong size on WB_AJBInGameGionEffect_C_IsNeedUpdatePosition");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Result) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Result' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_byte_Variable) == 0x000001, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable) == 0x000002, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable1) == 0x000003, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable2) == 0x000004, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable3) == 0x000005, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_byte_Variable1) == 0x000006, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable4) == 0x000007, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable5) == 0x000008, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable6) == 0x000009, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable7) == 0x00000A, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000B, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, Temp_bool_Variable8) == 0x00000C, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, K2Node_Select_Default) == 0x00000D, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, K2Node_Select1_Default) == 0x00000E, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000F, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_IsNeedUpdatePosition, K2Node_Select2_Default) == 0x000010, "Member 'WB_AJBInGameGionEffect_C_IsNeedUpdatePosition::K2Node_Select2_Default' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.SetEffectPositionAndScale
// 0x0028 (0x0028 - 0x0000)
struct WB_AJBInGameGionEffect_C_SetEffectPositionAndScale final
{
public:
	struct FVector2D                              Translation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale) == 0x000004, "Wrong alignment on WB_AJBInGameGionEffect_C_SetEffectPositionAndScale");
static_assert(sizeof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale) == 0x000028, "Wrong size on WB_AJBInGameGionEffect_C_SetEffectPositionAndScale");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, Translation) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::Translation' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, Scale) == 0x000008, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::Scale' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000018, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_SetEffectPositionAndScale, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'WB_AJBInGameGionEffect_C_SetEffectPositionAndScale::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WB_AJBInGameGionEffect.WB_AJBInGameGionEffect_C.ChangeState
// 0x0068 (0x0068 - 0x0000)
struct WB_AJBInGameGionEffect_C_ChangeState final
{
public:
	E_GionState                                   NextState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionState                                   PrevState;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionEffect_C_ChangeState) == 0x000008, "Wrong alignment on WB_AJBInGameGionEffect_C_ChangeState");
static_assert(sizeof(WB_AJBInGameGionEffect_C_ChangeState) == 0x000068, "Wrong size on WB_AJBInGameGionEffect_C_ChangeState");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ChangeState, NextState) == 0x000000, "Member 'WB_AJBInGameGionEffect_C_ChangeState::NextState' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ChangeState, PrevState) == 0x000001, "Member 'WB_AJBInGameGionEffect_C_ChangeState::PrevState' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionEffect_C_ChangeState, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_AJBInGameGionEffect_C_ChangeState::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
