#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ArrowButton_Small_R

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.ExecuteUbergraph_WB_ArrowButton_Small_R
// 0x0080 (0x0080 - 0x0000)
struct WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0070(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R) == 0x000008, "Wrong alignment on WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R");
static_assert(sizeof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R) == 0x000080, "Wrong size on WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, EntryPoint) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, K2Node_Event_MyGeometry) == 0x000008, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_FInterpTo_ReturnValue) == 0x000044, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, K2Node_CustomEvent_IsActive) == 0x000048, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_GetEffectMaterial_ReturnValue) == 0x000050, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000060, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000068, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_MakeVector2D_ReturnValue) == 0x000070, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R, CallFunc_FInterpTo_ReturnValue1) == 0x000078, "Member 'WB_ArrowButton_Small_R_C_ExecuteUbergraph_WB_ArrowButton_Small_R::CallFunc_FInterpTo_ReturnValue1' has a wrong offset!");

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ArrowButton_Small_R_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ArrowButton_Small_R_C_PreConstruct");
static_assert(sizeof(WB_ArrowButton_Small_R_C_PreConstruct) == 0x000001, "Wrong size on WB_ArrowButton_Small_R_C_PreConstruct");
static_assert(offsetof(WB_ArrowButton_Small_R_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.SetButtonActive
// 0x0001 (0x0001 - 0x0000)
struct WB_ArrowButton_Small_R_C_SetButtonActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_SetButtonActive) == 0x000001, "Wrong alignment on WB_ArrowButton_Small_R_C_SetButtonActive");
static_assert(sizeof(WB_ArrowButton_Small_R_C_SetButtonActive) == 0x000001, "Wrong size on WB_ArrowButton_Small_R_C_SetButtonActive");
static_assert(offsetof(WB_ArrowButton_Small_R_C_SetButtonActive, IsActive) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_SetButtonActive::IsActive' has a wrong offset!");

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ArrowButton_Small_R_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_Tick) == 0x000004, "Wrong alignment on WB_ArrowButton_Small_R_C_Tick");
static_assert(sizeof(WB_ArrowButton_Small_R_C_Tick) == 0x00003C, "Wrong size on WB_ArrowButton_Small_R_C_Tick");
static_assert(offsetof(WB_ArrowButton_Small_R_C_Tick, MyGeometry) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_ArrowButton_Small_R_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ArrowButton_Small_R_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_GetButton) == 0x000008, "Wrong alignment on WB_ArrowButton_Small_R_C_GetButton");
static_assert(sizeof(WB_ArrowButton_Small_R_C_GetButton) == 0x000008, "Wrong size on WB_ArrowButton_Small_R_C_GetButton");
static_assert(offsetof(WB_ArrowButton_Small_R_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ArrowButton_Small_R.WB_ArrowButton_Small_R_C.IsPlayingAnimationButton
// 0x0003 (0x0003 - 0x0000)
struct WB_ArrowButton_Small_R_C_IsPlayingAnimationButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_Small_R_C_IsPlayingAnimationButton) == 0x000001, "Wrong alignment on WB_ArrowButton_Small_R_C_IsPlayingAnimationButton");
static_assert(sizeof(WB_ArrowButton_Small_R_C_IsPlayingAnimationButton) == 0x000003, "Wrong size on WB_ArrowButton_Small_R_C_IsPlayingAnimationButton");
static_assert(offsetof(WB_ArrowButton_Small_R_C_IsPlayingAnimationButton, ReturnValue) == 0x000000, "Member 'WB_ArrowButton_Small_R_C_IsPlayingAnimationButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_IsPlayingAnimationButton, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'WB_ArrowButton_Small_R_C_IsPlayingAnimationButton::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_Small_R_C_IsPlayingAnimationButton, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_ArrowButton_Small_R_C_IsPlayingAnimationButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

