#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressWindow

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ChallengeEventProgressWindow.WB_ChallengeEventProgressWindow_C.ExecuteUbergraph_WB_ChallengeEventProgressWindow
// 0x07C8 (0x07C8 - 0x0000)
struct WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0038(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base2;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBHUDBase*                            K2Node_CustomEvent_AJBHUDBase1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGameRewardInfo                     K2Node_MakeStruct_AJBGameRewardInfo;               // 0x0090(0x0040)()
	TArray<struct FAJBGameRewardInfo>             K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 Temp_byte_Variable2;                               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext;      // 0x00E8(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext1;     // 0x0118(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext2;     // 0x0148(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext3;     // 0x0178(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext4;     // 0x01A8(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext5;     // 0x01D8(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext6;     // 0x0208(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext7;     // 0x0238(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext8;     // 0x0268(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext9;     // 0x0298(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext10;    // 0x02C8(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext11;    // 0x02F8(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext12;    // 0x0328(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext13;    // 0x0358(0x0030)()
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext14;    // 0x0388(0x0030)()
	TArray<struct FChallengeEventClassContext>    K2Node_MakeArray_Array1;                           // 0x03B8(0x0010)(ZeroConstructor, ReferenceParm)
	EAJBInputMode                                 Temp_byte_Variable3;                               // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeEventProgressContext         K2Node_MakeStruct_ChallengeEventProgressContext;   // 0x03D0(0x0058)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x042C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FChallengeEventProgressContext         K2Node_CustomEvent_ProgressContext;                // 0x0468(0x0058)()
	class AAJBHUDBase*                            K2Node_CustomEvent_AJBHUDBase;                     // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ChallengeEventClassItem_C*          K2Node_CustomEvent_ItemObj;                        // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FChallengeEventClassContext            CallFunc_GetClassContext_ReturnValue;              // 0x04D8(0x0030)()
	bool                                          CallFunc_IsClassExpFulfilledAfterProgress_ReturnValue; // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base3;   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeEventClassContext            K2Node_CustomEvent_ClassContext;                   // 0x0528(0x0030)()
	struct FAJBGameRewardInfo                     CallFunc_GetRewardInfoFromClassContext_ReturnValue; // 0x0558(0x0040)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAJBGameRewardInfo>             K2Node_MakeArray_Array2;                           // 0x05A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable2;                               // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x05B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBInputMode                                 K2Node_Select1_Default;                            // 0x05B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetRestExpToClassUp_ReturnValue;          // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_CustomEvent_OwnerWidget;                    // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_CustomEvent_TargetButton;                   // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_HUDCountDownTimerWrapper_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ChallengeEventClassItem_C*          CallFunc_Create_ReturnValue;                       // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProgressStartingClass_ReturnValue;      // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IfNeedsToProgress_ReturnValue;            // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Reward_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ClassIndexTo;                   // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOperatable_ReturnValue;           // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61D[0x3];                                      // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerOperatable_ReturnValue1;          // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton)> K2Node_CreateDelegate_OutputDelegate1; // 0x0638(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0650(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0670(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UWB_ChallengeEventClassItem_C* ItemObj)> K2Node_CreateDelegate_OutputDelegate4; // 0x0680(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0690(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x06B8(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent3;    // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent4;    // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x06DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB[0x5];                                      // 0x06DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Reward_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget1;          // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x06E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UWB_ChallengeEventClassItem_C* ItemObj)> K2Node_CreateDelegate_OutputDelegate8; // 0x06F8(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70B[0x5];                                      // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWB_ChallengeEventClassItem_C* ItemObj)> K2Node_CreateDelegate_OutputDelegate9; // 0x0710(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ChallengeEventClassItem_C*          CallFunc_Array_Get_Item;                           // 0x0728(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ChallengeEventClassItem_C*          CallFunc_Array_Get_Item1;                          // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBInputMode                                 Temp_byte_Variable8;                               // 0x073A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73B[0x1];                                      // 0x073B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 Temp_byte_Variable9;                               // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ChallengeEventClassItem_C*          CallFunc_Array_Get_Item2;                          // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue2;          // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x0759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 K2Node_Select4_Default;                            // 0x075A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x075B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBInputMode                                 Temp_byte_Variable12;                              // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x076A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 Temp_byte_Variable13;                              // 0x076B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 K2Node_Select6_Default;                            // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76D[0x3];                                      // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 Temp_byte_Variable14;                              // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775[0x3];                                      // 0x0775(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBHUDBase*                            CallFunc_GetAJBHUDBase_ReturnValue;                // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 Temp_byte_Variable15;                              // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBInputMode                                 K2Node_Select7_Default;                            // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_782[0x2];                                      // 0x0782(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue1;             // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select8_Default;                            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795[0x3];                                      // 0x0795(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeEventClassContext            K2Node_MakeStruct_ChallengeEventClassContext15;    // 0x0798(0x0030)()
};
static_assert(alignof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow) == 0x000008, "Wrong alignment on WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow");
static_assert(sizeof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow) == 0x0007C8, "Wrong size on WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, EntryPoint) == 0x000000, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Variable) == 0x000004, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable) == 0x000005, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base) == 0x000010, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetPlayerController_ReturnValue1) == 0x000020, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base1) == 0x000028, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable1) == 0x000031, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetDebugTags_ReturnValue) == 0x000038, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_HasTag_ReturnValue) == 0x00005C, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_int_Array_Index_Variable) == 0x000064, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetPlayerController_ReturnValue2) == 0x000068, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base2) == 0x000070, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_AJBHUDBase1) == 0x000080, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_AJBHUDBase1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Variable1) == 0x000088, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_AJBGameRewardInfo) == 0x000090, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_AJBGameRewardInfo' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_Select_Default) == 0x0000E0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable2) == 0x0000E1, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext) == 0x0000E8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext1) == 0x000118, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext2) == 0x000148, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext3) == 0x000178, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext4) == 0x0001A8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext4' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext5) == 0x0001D8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext5' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext6) == 0x000208, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext6' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext7) == 0x000238, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext7' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext8) == 0x000268, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext8' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext9) == 0x000298, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext9' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext10) == 0x0002C8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext10' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext11) == 0x0002F8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext11' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext12) == 0x000328, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext12' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext13) == 0x000358, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext13' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventClassContext14) == 0x000388, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventClassContext14' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeArray_Array1) == 0x0003B8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable3) == 0x0003C8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeStruct_ChallengeEventProgressContext) == 0x0003D0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeStruct_ChallengeEventProgressContext' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_Event_IsDesignTime) == 0x000428, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_Event_MyGeometry) == 0x00042C, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_Event_InDeltaTime) == 0x000464, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_ProgressContext) == 0x000468, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_ProgressContext' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_AJBHUDBase) == 0x0004C0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_AJBHUDBase' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Has_Been_Initd_Variable) == 0x0004C8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_ItemObj) == 0x0004D0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_ItemObj' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetClassContext_ReturnValue) == 0x0004D8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetClassContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_IsClassExpFulfilledAfterProgress_ReturnValue) == 0x000508, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_IsClassExpFulfilledAfterProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetPlayerController_ReturnValue3) == 0x000510, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base3) == 0x000518, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_DynamicCast_bSuccess3) == 0x000520, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_ClassContext) == 0x000528, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_ClassContext' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetRewardInfoFromClassContext_ReturnValue) == 0x000558, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetRewardInfoFromClassContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_IsClosed_Variable) == 0x000598, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_MakeArray_Array2) == 0x0005A0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Variable2) == 0x0005B0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Variable3) == 0x0005B1, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Has_Been_Initd_Variable1) == 0x0005B2, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_Select1_Default) == 0x0005B3, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate) == 0x0005B8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_GetRestExpToClassUp_ReturnValue) == 0x0005C8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_GetRestExpToClassUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_OwnerWidget) == 0x0005D0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_TargetButton) == 0x0005D8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_SpawnObject_ReturnValue) == 0x0005E0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Create_ReturnValue) == 0x0005E8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_IsProgressStartingClass_ReturnValue) == 0x0005F0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_IsProgressStartingClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_IfNeedsToProgress_ReturnValue) == 0x0005F1, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_IfNeedsToProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_int_Variable) == 0x0005F4, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x0005F8, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_Variable4) == 0x000600, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CustomEvent_ClassIndexTo) == 0x000604, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CustomEvent_ClassIndexTo' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Subtract_IntInt_ReturnValue) == 0x000608, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue1) == 0x00060C, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue2) == 0x000610, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue3) == 0x000614, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue4) == 0x000618, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_IsPlayerOperatable_ReturnValue) == 0x00061C, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_IsPlayerOperatable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Array_LastIndex_ReturnValue) == 0x000620, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_IsPlayerOperatable_ReturnValue1) == 0x000624, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_IsPlayerOperatable_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue5) == 0x000628, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Add_IntInt_ReturnValue6) == 0x00062C, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_Clamp_ReturnValue) == 0x000630, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable4) == 0x000634, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate1) == 0x000638, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000648, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate2) == 0x000650, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_byte_Variable5) == 0x000660, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000668, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate3) == 0x000670, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate4) == 0x000680, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, K2Node_CreateDelegate_OutputDelegate5) == 0x000690, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow, Temp_bool_IsClosed_Variable1) == 0x0006A0, "Member 'WB_ChallengeEventProgressWindow_C_ExecuteUbergraph_WB_ChallengeEventProgressWindow::Temp_bool_IsClosed_Variable1' has a wrong offset!");
