#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharacterSelect_PairWindow

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_CharacterSelect_PairWindow.WB_CharacterSelect_PairWindow_C.ExecuteUbergraph_WB_CharacterSelect_PairWindow
// 0x0120 (0x0120 - 0x0000)
struct WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_TitleName;                      // 0x0008(0x0018)()
	class FText                                   K2Node_CustomEvent_PairPlayerName;                 // 0x0020(0x0018)()
	struct FAJBCharacterInfo                      K2Node_CustomEvent_InputPin;                       // 0x0038(0x00E8)()
};
static_assert(alignof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow");
static_assert(sizeof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow) == 0x000120, "Wrong size on WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow, EntryPoint) == 0x000000, "Member 'WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow, K2Node_CustomEvent_TitleName) == 0x000008, "Member 'WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow::K2Node_CustomEvent_TitleName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow, K2Node_CustomEvent_PairPlayerName) == 0x000020, "Member 'WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow::K2Node_CustomEvent_PairPlayerName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow, K2Node_CustomEvent_InputPin) == 0x000038, "Member 'WB_CharacterSelect_PairWindow_C_ExecuteUbergraph_WB_CharacterSelect_PairWindow::K2Node_CustomEvent_InputPin' has a wrong offset!");

// Function WB_CharacterSelect_PairWindow.WB_CharacterSelect_PairWindow_C.SetPairCharaInfo
// 0x0118 (0x0118 - 0x0000)
struct WB_CharacterSelect_PairWindow_C_SetPairCharaInfo final
{
public:
	class FText                                   TitleName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PairPlayerName;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAJBCharacterInfo                      InputPin;                                          // 0x0030(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_CharacterSelect_PairWindow_C_SetPairCharaInfo) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairWindow_C_SetPairCharaInfo");
static_assert(sizeof(WB_CharacterSelect_PairWindow_C_SetPairCharaInfo) == 0x000118, "Wrong size on WB_CharacterSelect_PairWindow_C_SetPairCharaInfo");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_SetPairCharaInfo, TitleName) == 0x000000, "Member 'WB_CharacterSelect_PairWindow_C_SetPairCharaInfo::TitleName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_SetPairCharaInfo, PairPlayerName) == 0x000018, "Member 'WB_CharacterSelect_PairWindow_C_SetPairCharaInfo::PairPlayerName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_SetPairCharaInfo, InputPin) == 0x000030, "Member 'WB_CharacterSelect_PairWindow_C_SetPairCharaInfo::InputPin' has a wrong offset!");

// Function WB_CharacterSelect_PairWindow.WB_CharacterSelect_PairWindow_C.IsShowingUI
// 0x0002 (0x0002 - 0x0000)
struct WB_CharacterSelect_PairWindow_C_IsShowingUI final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingUI_bShow;                        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharacterSelect_PairWindow_C_IsShowingUI) == 0x000001, "Wrong alignment on WB_CharacterSelect_PairWindow_C_IsShowingUI");
static_assert(sizeof(WB_CharacterSelect_PairWindow_C_IsShowingUI) == 0x000002, "Wrong size on WB_CharacterSelect_PairWindow_C_IsShowingUI");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_IsShowingUI, bShow) == 0x000000, "Member 'WB_CharacterSelect_PairWindow_C_IsShowingUI::bShow' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairWindow_C_IsShowingUI, CallFunc_IsShowingUI_bShow) == 0x000001, "Member 'WB_CharacterSelect_PairWindow_C_IsShowingUI::CallFunc_IsShowingUI_bShow' has a wrong offset!");

}

