#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Credit

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_Credit.WB_Credit_C.ExecuteUbergraph_WB_Credit
// 0x0278 (0x0278 - 0x0000)
struct WB_Credit_C_ExecuteUbergraph_WB_Credit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_PpBuyWindow_C*                      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate;      // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget2;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue1;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBHUDBase*                            K2Node_DynamicCast_AsAJBHUDBase;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAJBUserWidget*>                 CallFunc_GetViewportWidgets_OutWidgets;            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetViewportWidgets_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible4;                      // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible3;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible2;                      // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBUserWidget*                         CallFunc_Array_Get_Item1;                          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       K2Node_DynamicCast_AsAJBWindow_Widget;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisible1;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;     // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate3;     // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0154(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsumePP_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x01A4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C0(0x0028)()
	bool                                          CallFunc_IsServicePlay_ReturnValue;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue1;                   // 0x01EC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0200(0x0028)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Fade_C*                             CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCacheInteger_ReturnValue;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess1;   // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_GameOver_C*                         CallFunc_FindAJBViewportWidgetOfClass_OutWidget1;  // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanButton_bCan;                           // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanButton_bCan1;                          // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue1;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCacheInteger_ReturnValue1;             // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_ExecuteUbergraph_WB_Credit) == 0x000008, "Wrong alignment on WB_Credit_C_ExecuteUbergraph_WB_Credit");
static_assert(sizeof(WB_Credit_C_ExecuteUbergraph_WB_Credit) == 0x000278, "Wrong size on WB_Credit_C_ExecuteUbergraph_WB_Credit");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, EntryPoint) == 0x000000, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable) == 0x000004, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable1) == 0x000005, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsValid_ReturnValue1) == 0x000011, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_bool_Variable) == 0x000012, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable2) == 0x000028, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable3) == 0x000029, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_MakeLiteralByte_ReturnValue) == 0x00002A, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_MakeLiteralByte_ReturnValue1) == 0x00002B, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Conv_ByteToInt_ReturnValue1) == 0x000030, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Conv_ByteToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_TargetWidget2) == 0x000038, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_TargetWidget2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_TargetWidget1) == 0x000040, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_TargetWidget1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_NotEqual_ByteByte_ReturnValue1) == 0x000049, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_NotEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_bool_Variable1) == 0x00004A, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_AddUnique_ReturnValue) == 0x00004C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_LastIndex_ReturnValue) == 0x000054, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_Get_Item) == 0x000058, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_RemoveItem_ReturnValue) == 0x000060, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsValid_ReturnValue2) == 0x000070, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetHUD_ReturnValue) == 0x000078, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_DynamicCast_AsAJBHUDBase) == 0x000080, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_DynamicCast_AsAJBHUDBase' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetViewportWidgets_OutWidgets) == 0x000090, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetViewportWidgets_OutWidgets' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetViewportWidgets_ReturnValue) == 0x0000A0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetViewportWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable4) == 0x0000A8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable5) == 0x0000A9, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_bool_Variable2) == 0x0000AA, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_bVisible4) == 0x0000AB, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_bVisible4' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_bVisible3) == 0x0000AC, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_bVisible3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_bVisible2) == 0x0000AD, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_bVisible2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Select_Default) == 0x0000B4, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Array_Get_Item1) == 0x0000B8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_DynamicCast_AsAJBWindow_Widget) == 0x0000C0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_DynamicCast_AsAJBWindow_Widget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_DynamicCast_bSuccess1) == 0x0000C8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x0000D0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_ComponentBoundEvent_TargetButton1) == 0x0000D8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CreateDelegate_OutputDelegate1) == 0x0000E0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable6) == 0x0000F0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_bVisible1) == 0x0000F1, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_bVisible1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Select1_Default) == 0x0000F2, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CreateDelegate_OutputDelegate2) == 0x0000F8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_TargetWidget) == 0x000108, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CreateDelegate_OutputDelegate3) == 0x000110, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000120, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_ComponentBoundEvent_TargetButton) == 0x000128, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_bSuccess) == 0x000130, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000138, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CreateDelegate_OutputDelegate4) == 0x000140, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsValid_ReturnValue3) == 0x000150, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_CustomEvent_bVisible) == 0x000151, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Select2_Default) == 0x000152, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Event_MyGeometry) == 0x000154, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Event_InDeltaTime) == 0x00018C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsVisible_ReturnValue) == 0x000190, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000191, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000198, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsConsumePP_ReturnValue) == 0x0001A0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsConsumePP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Not_PreBool_ReturnValue) == 0x0001A1, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_MakeColor_ReturnValue) == 0x0001A4, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0001B4, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0001B8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_MakeStruct_SlateColor) == 0x0001C0, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsServicePlay_ReturnValue) == 0x0001E8, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsServicePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_MakeColor_ReturnValue1) == 0x0001EC, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_MakeColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable7) == 0x0001FC, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_MakeStruct_SlateColor1) == 0x000200, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_int_Loop_Counter_Variable) == 0x000228, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x00022C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x000230, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Less_IntInt_ReturnValue) == 0x000238, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Add_IntInt_ReturnValue) == 0x00023C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_bool_Variable3) == 0x000240, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Select3_Default) == 0x000241, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_bSuccess3) == 0x000242, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_GetAJBGameInstance_AJB_Game_Instance3) == 0x000248, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_GetAJBGameInstance_AJB_Game_Instance3' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable8) == 0x000250, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsFreePlay_ReturnValue) == 0x000251, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsFreePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000254, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_SetCacheInteger_ReturnValue) == 0x000258, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_SetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_FindAJBViewportWidgetOfClass_bSuccess1) == 0x000259, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_FindAJBViewportWidgetOfClass_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_FindAJBViewportWidgetOfClass_OutWidget1) == 0x000260, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_FindAJBViewportWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_byte_Variable9) == 0x000268, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_CanButton_bCan) == 0x000269, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_CanButton_bCan' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_CanButton_bCan1) == 0x00026A, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_CanButton_bCan1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x00026B, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, Temp_bool_Variable4) == 0x00026C, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Not_PreBool_ReturnValue1) == 0x00026D, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_Conv_BoolToInt_ReturnValue1) == 0x000270, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_Conv_BoolToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, K2Node_Select4_Default) == 0x000274, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_ExecuteUbergraph_WB_Credit, CallFunc_SetCacheInteger_ReturnValue1) == 0x000275, "Member 'WB_Credit_C_ExecuteUbergraph_WB_Credit::CallFunc_SetCacheInteger_ReturnValue1' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Credit_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_Tick) == 0x000004, "Wrong alignment on WB_Credit_C_Tick");
static_assert(sizeof(WB_Credit_C_Tick) == 0x00003C, "Wrong size on WB_Credit_C_Tick");
static_assert(offsetof(WB_Credit_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Credit_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Credit_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdateVisiblePPStop
// 0x0001 (0x0001 - 0x0000)
struct WB_Credit_C_UpdateVisiblePPStop final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_UpdateVisiblePPStop) == 0x000001, "Wrong alignment on WB_Credit_C_UpdateVisiblePPStop");
static_assert(sizeof(WB_Credit_C_UpdateVisiblePPStop) == 0x000001, "Wrong size on WB_Credit_C_UpdateVisiblePPStop");
static_assert(offsetof(WB_Credit_C_UpdateVisiblePPStop, bVisible) == 0x000000, "Member 'WB_Credit_C_UpdateVisiblePPStop::bVisible' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_Credit_C_BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.OnClosedPPBuy
// 0x0008 (0x0008 - 0x0000)
struct WB_Credit_C_OnClosedPPBuy final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_OnClosedPPBuy) == 0x000008, "Wrong alignment on WB_Credit_C_OnClosedPPBuy");
static_assert(sizeof(WB_Credit_C_OnClosedPPBuy) == 0x000008, "Wrong size on WB_Credit_C_OnClosedPPBuy");
static_assert(offsetof(WB_Credit_C_OnClosedPPBuy, TargetWidget) == 0x000000, "Member 'WB_Credit_C_OnClosedPPBuy::TargetWidget' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdateVisibleTimeCountDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Credit_C_UpdateVisibleTimeCountDown final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_UpdateVisibleTimeCountDown) == 0x000001, "Wrong alignment on WB_Credit_C_UpdateVisibleTimeCountDown");
static_assert(sizeof(WB_Credit_C_UpdateVisibleTimeCountDown) == 0x000001, "Wrong size on WB_Credit_C_UpdateVisibleTimeCountDown");
static_assert(offsetof(WB_Credit_C_UpdateVisibleTimeCountDown, bVisible) == 0x000000, "Member 'WB_Credit_C_UpdateVisibleTimeCountDown::bVisible' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_Credit_C_BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdateVisiblePPNum
// 0x0001 (0x0001 - 0x0000)
struct WB_Credit_C_UpdateVisiblePPNum final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_UpdateVisiblePPNum) == 0x000001, "Wrong alignment on WB_Credit_C_UpdateVisiblePPNum");
static_assert(sizeof(WB_Credit_C_UpdateVisiblePPNum) == 0x000001, "Wrong size on WB_Credit_C_UpdateVisiblePPNum");
static_assert(offsetof(WB_Credit_C_UpdateVisiblePPNum, bVisible) == 0x000000, "Member 'WB_Credit_C_UpdateVisiblePPNum::bVisible' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdateVisibleGameEnd
// 0x0001 (0x0001 - 0x0000)
struct WB_Credit_C_UpdateVisibleGameEnd final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_UpdateVisibleGameEnd) == 0x000001, "Wrong alignment on WB_Credit_C_UpdateVisibleGameEnd");
static_assert(sizeof(WB_Credit_C_UpdateVisibleGameEnd) == 0x000001, "Wrong size on WB_Credit_C_UpdateVisibleGameEnd");
static_assert(offsetof(WB_Credit_C_UpdateVisibleGameEnd, bVisible) == 0x000000, "Member 'WB_Credit_C_UpdateVisibleGameEnd::bVisible' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdatePPBuyVisible
// 0x0001 (0x0001 - 0x0000)
struct WB_Credit_C_UpdatePPBuyVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Credit_C_UpdatePPBuyVisible) == 0x000001, "Wrong alignment on WB_Credit_C_UpdatePPBuyVisible");
static_assert(sizeof(WB_Credit_C_UpdatePPBuyVisible) == 0x000001, "Wrong size on WB_Credit_C_UpdatePPBuyVisible");
static_assert(offsetof(WB_Credit_C_UpdatePPBuyVisible, bVisible) == 0x000000, "Member 'WB_Credit_C_UpdatePPBuyVisible::bVisible' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.OnClosedWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_Credit_C_OnClosedWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_OnClosedWindow) == 0x000008, "Wrong alignment on WB_Credit_C_OnClosedWindow");
static_assert(sizeof(WB_Credit_C_OnClosedWindow) == 0x000008, "Wrong size on WB_Credit_C_OnClosedWindow");
static_assert(offsetof(WB_Credit_C_OnClosedWindow, TargetWidget) == 0x000000, "Member 'WB_Credit_C_OnClosedWindow::TargetWidget' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.OnOpeningWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_Credit_C_OnOpeningWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Credit_C_OnOpeningWindow) == 0x000008, "Wrong alignment on WB_Credit_C_OnOpeningWindow");
static_assert(sizeof(WB_Credit_C_OnOpeningWindow) == 0x000008, "Wrong size on WB_Credit_C_OnOpeningWindow");
static_assert(offsetof(WB_Credit_C_OnOpeningWindow, TargetWidget) == 0x000000, "Member 'WB_Credit_C_OnOpeningWindow::TargetWidget' has a wrong offset!");

// Function WB_Credit.WB_Credit_C.UpdatePPAndCreditNumberDisplay
// 0x00F0 (0x00F0 - 0x0000)
struct WB_Credit_C_UpdatePPAndCreditNumberDisplay final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCreaditNumClamp_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	bool                                          CallFunc_SetCacheInteger_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCacheInteger_ReturnValue1;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
};
static_assert(alignof(WB_Credit_C_UpdatePPAndCreditNumberDisplay) == 0x000008, "Wrong alignment on WB_Credit_C_UpdatePPAndCreditNumberDisplay");
static_assert(sizeof(WB_Credit_C_UpdatePPAndCreditNumberDisplay) == 0x0000F0, "Wrong size on WB_Credit_C_UpdatePPAndCreditNumberDisplay");
static_assert(offsetof(WB_Credit_C_UpdatePPAndCreditNumberDisplay, Temp_text_Variable) == 0x000000, "Member 'WB_Credit_C_UpdatePPAndCreditNumberDisplay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_UpdatePPAndCreditNumberDisplay, Temp_bool_Variable) == 0x000018, "Member 'WB_Credit_C_UpdatePPAndCreditNumberDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_UpdatePPAndCreditNumberDisplay, CallFunc_MakeLiteralByte_ReturnValue) == 0x000019, "Member 'WB_Credit_C_UpdatePPAndCreditNumberDisplay::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Credit_C_UpdatePPAndCreditNumberDisplay, CallFunc_MakeLiteralByte_ReturnValue1) == 0x00001A, "Member 'WB_Credit_C_UpdatePPAndCreditNumberDisplay::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
