#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DBISequencerSkipper

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_DBISequencerSkipper.WB_DBISequencerSkipper_C.ExecuteUbergraph_WB_DBISequencerSkipper
// 0x0008 (0x0008 - 0x0000)
struct WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper) == 0x000004, "Wrong alignment on WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper");
static_assert(sizeof(WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper) == 0x000008, "Wrong size on WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper");
static_assert(offsetof(WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper, EntryPoint) == 0x000000, "Member 'WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WB_DBISequencerSkipper_C_ExecuteUbergraph_WB_DBISequencerSkipper::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

