#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ExchangeScoreBoard

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ST_ScoreBoardPlayerInfo_structs.hpp"


namespace SDK::Params
{

// Function WB_ExchangeScoreBoard.WB_ExchangeScoreBoard_C.ExecuteUbergraph_WB_ExchangeScoreBoard
// 0x0218 (0x0218 - 0x0000)
struct WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ScoreBoardManager_C*                CallFunc_TryGetScoreBoardManager_Output;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetScoreBoardManager_bSuccess;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchingPlayerInfo>            CallFunc_Map_Values_Values;                        // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchingPlayerInfo>            CallFunc_SortMatchingPlayerInfo_SortedMatchingPlayerInfo; // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item;                           // 0x0098(0x0088)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0124(0x0010)(IsPlainOldData, NoDestructor)
	struct FST_ScoreBoardPlayerInfo               CallFunc_Array_Get_Item1;                          // 0x0134(0x000C)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0040)(HasGetValueTypeHash)
	class UWB_ScoreBoardRow_C*                    CallFunc_FindScoreBoardRowByPlayerID_Widget;       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindScoreBoardRowByPlayerID_bSuccess;     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScoreBoardRow_C*                    CallFunc_Create_ReturnValue;                       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0208(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard) == 0x000008, "Wrong alignment on WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard");
static_assert(sizeof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard) == 0x000218, "Wrong size on WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, EntryPoint) == 0x000000, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_Event_MyGeometry) == 0x000010, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_TryGetScoreBoardManager_Output) == 0x000050, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_TryGetScoreBoardManager_Output' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_TryGetScoreBoardManager_bSuccess) == 0x000058, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_TryGetScoreBoardManager_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_GetAJBGameInstance_bSuccess) == 0x000059, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000060, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, Temp_int_Array_Index_Variable1) == 0x000068, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Map_Values_Values) == 0x000070, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_SortMatchingPlayerInfo_SortedMatchingPlayerInfo) == 0x000088, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_SortMatchingPlayerInfo_SortedMatchingPlayerInfo' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Array_Get_Item) == 0x000098, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_MakeStruct_Margin) == 0x000124, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Array_Get_Item1) == 0x000134, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Array_Length_ReturnValue1) == 0x000140, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Less_IntInt_ReturnValue) == 0x000144, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000148, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_FindScoreBoardRowByPlayerID_Widget) == 0x000190, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_FindScoreBoardRowByPlayerID_Widget' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_FindScoreBoardRowByPlayerID_bSuccess) == 0x000198, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_FindScoreBoardRowByPlayerID_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_MakeArray_Array) == 0x0001A0, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Conv_TextToString_ReturnValue) == 0x0001C8, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Create_ReturnValue) == 0x0001F0, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_AddChild_ReturnValue) == 0x0001F8, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, Temp_int_Loop_Counter_Variable1) == 0x000200, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000208, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Less_IntInt_ReturnValue1) == 0x000210, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard, CallFunc_Add_IntInt_ReturnValue1) == 0x000214, "Member 'WB_ExchangeScoreBoard_C_ExecuteUbergraph_WB_ExchangeScoreBoard::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");

// Function WB_ExchangeScoreBoard.WB_ExchangeScoreBoard_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ExchangeScoreBoard_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ExchangeScoreBoard_C_Tick) == 0x000004, "Wrong alignment on WB_ExchangeScoreBoard_C_Tick");
static_assert(sizeof(WB_ExchangeScoreBoard_C_Tick) == 0x00003C, "Wrong size on WB_ExchangeScoreBoard_C_Tick");
static_assert(offsetof(WB_ExchangeScoreBoard_C_Tick, MyGeometry) == 0x000000, "Member 'WB_ExchangeScoreBoard_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_ExchangeScoreBoard_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_ExchangeScoreBoard.WB_ExchangeScoreBoard_C.TryGetScoreBoardManager
// 0x0038 (0x0038 - 0x0000)
struct WB_ExchangeScoreBoard_C_TryGetScoreBoardManager final
{
public:
	class ABP_ScoreBoardManager_C*                Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ScoreBoardManager_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ScoreBoardManager_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager) == 0x000008, "Wrong alignment on WB_ExchangeScoreBoard_C_TryGetScoreBoardManager");
static_assert(sizeof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager) == 0x000038, "Wrong size on WB_ExchangeScoreBoard_C_TryGetScoreBoardManager");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, Output) == 0x000000, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::Output' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, bSuccess) == 0x000008, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_TryGetScoreBoardManager, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'WB_ExchangeScoreBoard_C_TryGetScoreBoardManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ExchangeScoreBoard.WB_ExchangeScoreBoard_C.FindScoreBoardRowByPlayerID
// 0x0050 (0x0050 - 0x0000)
struct WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID final
{
public:
	uint8                                         PlayerID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScoreBoardRow_C*                    Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ScoreBoardRow_C*                    K2Node_DynamicCast_AsWB_Score_Board_Row;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID) == 0x000008, "Wrong alignment on WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID");
static_assert(sizeof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID) == 0x000050, "Wrong size on WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, PlayerID) == 0x000000, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::PlayerID' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, Widget) == 0x000008, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::Widget' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, bSuccess) == 0x000010, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, Temp_bool_Variable) == 0x000011, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, Temp_int_Variable) == 0x000014, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, K2Node_DynamicCast_AsWB_Score_Board_Row) == 0x000038, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::K2Node_DynamicCast_AsWB_Score_Board_Row' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_Not_PreBool_ReturnValue1) == 0x000041, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'WB_ExchangeScoreBoard_C_FindScoreBoardRowByPlayerID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ExchangeScoreBoard.WB_ExchangeScoreBoard_C.SortMatchingPlayerInfo
// 0x0170 (0x0170 - 0x0000)
struct WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo final
{
public:
	TArray<struct FMatchingPlayerInfo>            MatchingPlayerInfo;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FMatchingPlayerInfo>            SortedMatchingPlayerInfo;                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FMatchingPlayerInfo>            MatchingPlayerInfo_local;                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FMatchingPlayerInfo                    TempLocalPlayerInfo_Local;                         // 0x0030(0x0088)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item;                           // 0x00D8(0x0088)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo) == 0x000008, "Wrong alignment on WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo");
static_assert(sizeof(WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo) == 0x000170, "Wrong size on WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo");
static_assert(offsetof(WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo, MatchingPlayerInfo) == 0x000000, "Member 'WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo::MatchingPlayerInfo' has a wrong offset!");
static_assert(offsetof(WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo, SortedMatchingPlayerInfo) == 0x000010, "Member 'WB_ExchangeScoreBoard_C_SortMatchingPlayerInfo::SortedMatchingPlayerInfo' has a wrong offset!");
