#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Emoney_MenuDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AmwPlugin_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Emoney_MenuDisplay.WB_Emoney_MenuDisplay_C
// 0x0050 (0x0258 - 0x0208)
class UWB_Emoney_MenuDisplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_BrandImage;                               // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_0;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          CoinNum_A_hundred;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          CreditNum_A;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Emoney_MenuDisplay(int32 EntryPoint);
	void UpdateDisplay(int32 Credit, EAmwEmoneyBrand Brand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Emoney_MenuDisplay_C">();
	}
	static class UWB_Emoney_MenuDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Emoney_MenuDisplay_C>();
	}
};
static_assert(alignof(UWB_Emoney_MenuDisplay_C) == 0x000008, "Wrong alignment on UWB_Emoney_MenuDisplay_C");
static_assert(sizeof(UWB_Emoney_MenuDisplay_C) == 0x000258, "Wrong size on UWB_Emoney_MenuDisplay_C");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, UberGraphFrame) == 0x000208, "Member 'UWB_Emoney_MenuDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, AJBImage_BrandImage) == 0x000210, "Member 'UWB_Emoney_MenuDisplay_C::AJBImage_BrandImage' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, AJBTextBlock_0) == 0x000218, "Member 'UWB_Emoney_MenuDisplay_C::AJBTextBlock_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, Button) == 0x000220, "Member 'UWB_Emoney_MenuDisplay_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, CoinNum_A_hundred) == 0x000228, "Member 'UWB_Emoney_MenuDisplay_C::CoinNum_A_hundred' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, CreditNum_A) == 0x000230, "Member 'UWB_Emoney_MenuDisplay_C::CreditNum_A' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, RetainerBox_0) == 0x000238, "Member 'UWB_Emoney_MenuDisplay_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, ScaleBox_0) == 0x000240, "Member 'UWB_Emoney_MenuDisplay_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, VerticalBox_0) == 0x000248, "Member 'UWB_Emoney_MenuDisplay_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_MenuDisplay_C, WidgetSwitcher_0) == 0x000250, "Member 'UWB_Emoney_MenuDisplay_C::WidgetSwitcher_0' has a wrong offset!");

}

