#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Emoney_BrandButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "AmwPlugin_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Emoney_BrandButton.WB_Emoney_BrandButton_C
// 0x0078 (0x0318 - 0x02A0)
class UWB_Emoney_BrandButton_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Released;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Selected;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_BrandImage;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_GrayOut;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_0;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_1;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Root;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        RetainerBoxSelectedButton;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAmwEmoneyBrand                               Brand;                                             // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPressedAnim;                                      // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSelect;                                           // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_Emoney_BrandButton(int32 EntryPoint);
	void PlayReleasedAnim();
	void PlaySelectedAnim();
	void SetupDisplay(EAmwEmoneyBrand Brand_0);
	void ActiveDisplay();
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonCancelledEvent__DelegateSignature();
	class UAJBButton* GetButton();
	void InactiveDisplay();
	void OnButtonPressedAnimation();
	void OnButtonReleasedAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Emoney_BrandButton_C">();
	}
	static class UWB_Emoney_BrandButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Emoney_BrandButton_C>();
	}
};
static_assert(alignof(UWB_Emoney_BrandButton_C) == 0x000008, "Wrong alignment on UWB_Emoney_BrandButton_C");
static_assert(sizeof(UWB_Emoney_BrandButton_C) == 0x000318, "Wrong size on UWB_Emoney_BrandButton_C");
static_assert(offsetof(UWB_Emoney_BrandButton_C, UberGraphFrame) == 0x0002A0, "Member 'UWB_Emoney_BrandButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Anim_Released) == 0x0002A8, "Member 'UWB_Emoney_BrandButton_C::Anim_Released' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Anim_Selected) == 0x0002B0, "Member 'UWB_Emoney_BrandButton_C::Anim_Selected' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Anim_Pressed) == 0x0002B8, "Member 'UWB_Emoney_BrandButton_C::Anim_Pressed' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, AJBImage_BrandImage) == 0x0002C0, "Member 'UWB_Emoney_BrandButton_C::AJBImage_BrandImage' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, AJBImage_GrayOut) == 0x0002C8, "Member 'UWB_Emoney_BrandButton_C::AJBImage_GrayOut' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, AJBRetainerBox_0) == 0x0002D0, "Member 'UWB_Emoney_BrandButton_C::AJBRetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, AJBRetainerBox_1) == 0x0002D8, "Member 'UWB_Emoney_BrandButton_C::AJBRetainerBox_1' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Button) == 0x0002E0, "Member 'UWB_Emoney_BrandButton_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Overlay_Root) == 0x0002E8, "Member 'UWB_Emoney_BrandButton_C::Overlay_Root' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, RetainerBox_0) == 0x0002F0, "Member 'UWB_Emoney_BrandButton_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, RetainerBoxSelectedButton) == 0x0002F8, "Member 'UWB_Emoney_BrandButton_C::RetainerBoxSelectedButton' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, ScaleBox_0) == 0x000300, "Member 'UWB_Emoney_BrandButton_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, WidgetSwitcher_0) == 0x000308, "Member 'UWB_Emoney_BrandButton_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, Brand) == 0x000310, "Member 'UWB_Emoney_BrandButton_C::Brand' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, bPressedAnim) == 0x000311, "Member 'UWB_Emoney_BrandButton_C::bPressedAnim' has a wrong offset!");
static_assert(offsetof(UWB_Emoney_BrandButton_C, bSelect) == 0x000312, "Member 'UWB_Emoney_BrandButton_C::bSelect' has a wrong offset!");

}

