#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FocusLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FocusLine.WB_FocusLine_C
// 0x0048 (0x0250 - 0x0208)
class UWB_FocusLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       LastHit;                                           // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Main;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI;                                               // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CenterPos;                                         // 0x0230(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnFinishedAnimation;                               // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bPlayAppearAnimation;                              // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WB_FocusLine(int32 EntryPoint);
	void BndEvt__Appear_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__LastHit_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void Construct();
	void PlayLastHitAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FocusLine_C">();
	}
	static class UWB_FocusLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FocusLine_C>();
	}
};
static_assert(alignof(UWB_FocusLine_C) == 0x000008, "Wrong alignment on UWB_FocusLine_C");
static_assert(sizeof(UWB_FocusLine_C) == 0x000250, "Wrong size on UWB_FocusLine_C");
static_assert(offsetof(UWB_FocusLine_C, UberGraphFrame) == 0x000208, "Member 'UWB_FocusLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, LastHit) == 0x000210, "Member 'UWB_FocusLine_C::LastHit' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, Appear) == 0x000218, "Member 'UWB_FocusLine_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, AJBImage_Main) == 0x000220, "Member 'UWB_FocusLine_C::AJBImage_Main' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, DMI) == 0x000228, "Member 'UWB_FocusLine_C::DMI' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, CenterPos) == 0x000230, "Member 'UWB_FocusLine_C::CenterPos' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, OnFinishedAnimation) == 0x000238, "Member 'UWB_FocusLine_C::OnFinishedAnimation' has a wrong offset!");
static_assert(offsetof(UWB_FocusLine_C, bPlayAppearAnimation) == 0x000248, "Member 'UWB_FocusLine_C::bPlayAppearAnimation' has a wrong offset!");

}

