#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameResultTicket_Detail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_GameResultTicket_Detail.WB_GameResultTicket_Detail_C
// 0x0020 (0x0268 - 0x0248)
class UWB_GameResultTicket_Detail_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          Detail_Num;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Detail_Title;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Sign;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_GameResultTicket_Detail(int32 EntryPoint);
	void SetupDisplay(const class FText& InText, EAJBLimitedBounusSign Sign_0, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_GameResultTicket_Detail_C">();
	}
	static class UWB_GameResultTicket_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GameResultTicket_Detail_C>();
	}
};
static_assert(alignof(UWB_GameResultTicket_Detail_C) == 0x000008, "Wrong alignment on UWB_GameResultTicket_Detail_C");
static_assert(sizeof(UWB_GameResultTicket_Detail_C) == 0x000268, "Wrong size on UWB_GameResultTicket_Detail_C");
static_assert(offsetof(UWB_GameResultTicket_Detail_C, UberGraphFrame) == 0x000248, "Member 'UWB_GameResultTicket_Detail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_Detail_C, Detail_Num) == 0x000250, "Member 'UWB_GameResultTicket_Detail_C::Detail_Num' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_Detail_C, Detail_Title) == 0x000258, "Member 'UWB_GameResultTicket_Detail_C::Detail_Title' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_Detail_C, Sign) == 0x000260, "Member 'UWB_GameResultTicket_Detail_C::Sign' has a wrong offset!");

}

