#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Highlight_UpperLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Highlight_UpperLabel.WB_Highlight_UpperLabel_C
// 0x0018 (0x02D8 - 0x02C0)
class UWB_Highlight_UpperLabel_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Watching;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_0;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Highlight_UpperLabel(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void OnClosingWindow();
	void OnFinishedAnim();
	void OnOpeningWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Highlight_UpperLabel_C">();
	}
	static class UWB_Highlight_UpperLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Highlight_UpperLabel_C>();
	}
};
static_assert(alignof(UWB_Highlight_UpperLabel_C) == 0x000008, "Wrong alignment on UWB_Highlight_UpperLabel_C");
static_assert(sizeof(UWB_Highlight_UpperLabel_C) == 0x0002D8, "Wrong size on UWB_Highlight_UpperLabel_C");
static_assert(offsetof(UWB_Highlight_UpperLabel_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_Highlight_UpperLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Highlight_UpperLabel_C, Anim_Watching) == 0x0002C8, "Member 'UWB_Highlight_UpperLabel_C::Anim_Watching' has a wrong offset!");
static_assert(offsetof(UWB_Highlight_UpperLabel_C, AJBImage_0) == 0x0002D0, "Member 'UWB_Highlight_UpperLabel_C::AJBImage_0' has a wrong offset!");

}

