#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameMain

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_AJBInGamePvE_GamePhase_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_InGameMain.WB_InGameMain_C.ExecuteUbergraph_WB_InGameMain
// 0x0408 (0x0408 - 0x0000)
struct WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLivingPlayerCount_Count;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0028(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacter;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0120(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x012C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue1;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0154(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatValue;                           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid;                 // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableDebugInput_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid1;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue1;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableDebugInput_ReturnValue1;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_UI_FollowPairInfo_C*>        CallFunc_Map_Values_Values;                        // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_UI_FollowPairInfo_C*                CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBUIMapManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0240(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTag                           K2Node_Event_Tag1;                                 // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBUIMapManager_C*                  CallFunc_Array_Get_Item1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag2;                                 // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Operator;                             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Target;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CauserType;                           // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid2;                // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue2;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue2;         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPvEPlayMode_IsPvEPlayMode;              // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonBreathingSkill_C*           CallFunc_GetComponentByClass_ReturnValue3;         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue4;         // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_SkillPartsTimer_C*>          K2Node_MakeArray_Array;                            // 0x02F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_AJBHamonStatus_C*                   CallFunc_GetComponentByClass_ReturnValue5;         // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Result;                         // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StateTimeRatio;                 // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBHamonBreathingSkill_C*           CallFunc_GetComponentByClass_ReturnValue6;         // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ActivatedSkill;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton)> K2Node_CreateDelegate_OutputDelegate2; // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton)> K2Node_CreateDelegate_OutputDelegate3; // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_CustomEvent_OwnerWidget1;                   // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_CustomEvent_TargetButton1;                  // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_CustomEvent_OwnerWidget;                    // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_CustomEvent_TargetButton;                   // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayMode                                     CallFunc_GetPlayMode_PlayMode;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_NewUITarget;                    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x03A0(0x0018)()
	TDelegate<void(class UBP_AJBSkillBase_C* ActivatedSkill)> K2Node_CreateDelegate_OutputDelegate4; // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(uint8 Result, float StateTimeRatio)> K2Node_CreateDelegate_OutputDelegate5;       // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UBP_AJBSkillBase_C* ActivatedSkill)> K2Node_CreateDelegate_OutputDelegate6; // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(uint8 Result, float StateTimeRatio)> K2Node_CreateDelegate_OutputDelegate7;       // 0x03E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x03F8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain) == 0x000008, "Wrong alignment on WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain");
static_assert(sizeof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain) == 0x000408, "Wrong size on WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, EntryPoint) == 0x000000, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000018, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetLivingPlayerCount_Count) == 0x000024, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetLivingPlayerCount_Count' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000028, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000B0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000E1, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x0000E2, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_TargetCharacter) == 0x0000E8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x0000F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_TargetButton1) == 0x0000F8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000100, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_PlayCameraShake_ReturnValue) == 0x000108, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate1) == 0x000110, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000120, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_MakeColor_ReturnValue) == 0x00012C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000140, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetDynamicMaterial_ReturnValue1) == 0x000148, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetDynamicMaterial_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000150, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_MyGeometry) == 0x000154, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_InDeltaTime) == 0x00018C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBGameInstance_bSuccess) == 0x000190, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000198, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, Temp_int_Array_Index_Variable) == 0x0001A0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsPlayingReplay_ReturnValue) == 0x0001A4, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue) == 0x0001A5, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag) == 0x0001A8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_FloatValue) == 0x0001B0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_FloatValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid) == 0x0001B4, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue) == 0x0001B8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEnableDebugInput_ReturnValue) == 0x0001C0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEnableDebugInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue) == 0x0001C8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue1) == 0x0001D0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid1) == 0x0001D1, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue1) == 0x0001D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEnableDebugInput_ReturnValue1) == 0x0001E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEnableDebugInput_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue1) == 0x0001E8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue2) == 0x0001F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Length_ReturnValue) == 0x0001F4, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsVisible_ReturnValue) == 0x0001F8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Map_Values_Values) == 0x000200, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000210, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000218, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Get_Item) == 0x000220, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetCurrentFlowState_FlowState) == 0x000228, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000230, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Length_ReturnValue1) == 0x000234, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue1) == 0x000238, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Less_IntInt_ReturnValue) == 0x000239, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAllActorsOfClass_OutActors) == 0x000240, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag1) == 0x000250, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Get_Item1) == 0x000258, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEditor_ReturnValue) == 0x000260, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag2) == 0x000268, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Operator) == 0x000270, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Target) == 0x000278, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_CauserType) == 0x000280, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_CauserType' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_SerialNumber) == 0x000288, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue2) == 0x00028C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid2) == 0x00028D, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue2) == 0x000290, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsDistribution_ReturnValue) == 0x000298, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue2) == 0x0002A0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue3) == 0x0002A8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue3) == 0x0002A9, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_BooleanAND_ReturnValue) == 0x0002AA, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetObjectClass_ReturnValue) == 0x0002B0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_ClassIsChildOf_ReturnValue) == 0x0002B8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsPvEPlayMode_IsPvEPlayMode) == 0x0002B9, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsPvEPlayMode_IsPvEPlayMode' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_OwnerWidget) == 0x0002C0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_TargetButton) == 0x0002C8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue4) == 0x0002D0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue3) == 0x0002D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue5) == 0x0002E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue4) == 0x0002E8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue6) == 0x0002F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_MakeArray_Array) == 0x0002F8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue5) == 0x000308, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue7) == 0x000310, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue8) == 0x000311, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000314, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000318, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_Result) == 0x00031C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_StateTimeRatio) == 0x000320, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_StateTimeRatio' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue6) == 0x000328, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_ActivatedSkill) == 0x000330, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_ActivatedSkill' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000338, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate2) == 0x000340, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate3) == 0x000350, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_OwnerWidget1) == 0x000360, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_TargetButton1) == 0x000368, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_OwnerWidget) == 0x000370, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_TargetButton) == 0x000378, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetPlayMode_PlayMode) == 0x000380, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetPlayMode_PlayMode' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_SwitchEnum_CmpSuccess) == 0x000381, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetObjectClass_ReturnValue1) == 0x000388, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_ClassIsChildOf_ReturnValue1) == 0x000390, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_NewUITarget) == 0x000398, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_NewUITarget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_MakeLiteralText_ReturnValue) == 0x0003A0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate4) == 0x0003B8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate5) == 0x0003C8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate6) == 0x0003D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate7) == 0x0003E8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate8) == 0x0003F8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.UnbindsBeforeInit
// 0x0008 (0x0008 - 0x0000)
struct WB_InGameMain_C_UnbindsBeforeInit final
{
public:
	class ABP_AJBInGameCharacter_C*               NewUITarget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_UnbindsBeforeInit) == 0x000008, "Wrong alignment on WB_InGameMain_C_UnbindsBeforeInit");
static_assert(sizeof(WB_InGameMain_C_UnbindsBeforeInit) == 0x000008, "Wrong size on WB_InGameMain_C_UnbindsBeforeInit");
static_assert(offsetof(WB_InGameMain_C_UnbindsBeforeInit, NewUITarget) == 0x000000, "Member 'WB_InGameMain_C_UnbindsBeforeInit::NewUITarget' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.OnDecidedFilterR
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_OnDecidedFilterR final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_OnDecidedFilterR) == 0x000008, "Wrong alignment on WB_InGameMain_C_OnDecidedFilterR");
static_assert(sizeof(WB_InGameMain_C_OnDecidedFilterR) == 0x000010, "Wrong size on WB_InGameMain_C_OnDecidedFilterR");
static_assert(offsetof(WB_InGameMain_C_OnDecidedFilterR, OwnerWidget) == 0x000000, "Member 'WB_InGameMain_C_OnDecidedFilterR::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_OnDecidedFilterR, TargetButton) == 0x000008, "Member 'WB_InGameMain_C_OnDecidedFilterR::TargetButton' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.OnDecidedFilterL
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_OnDecidedFilterL final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_OnDecidedFilterL) == 0x000008, "Wrong alignment on WB_InGameMain_C_OnDecidedFilterL");
static_assert(sizeof(WB_InGameMain_C_OnDecidedFilterL) == 0x000010, "Wrong size on WB_InGameMain_C_OnDecidedFilterL");
static_assert(offsetof(WB_InGameMain_C_OnDecidedFilterL, OwnerWidget) == 0x000000, "Member 'WB_InGameMain_C_OnDecidedFilterL::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_OnDecidedFilterL, TargetButton) == 0x000008, "Member 'WB_InGameMain_C_OnDecidedFilterL::TargetButton' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.OnSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct WB_InGameMain_C_OnSkillActivated final
{
public:
	class UBP_AJBSkillBase_C*                     ActivatedSkill;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_OnSkillActivated) == 0x000008, "Wrong alignment on WB_InGameMain_C_OnSkillActivated");
static_assert(sizeof(WB_InGameMain_C_OnSkillActivated) == 0x000008, "Wrong size on WB_InGameMain_C_OnSkillActivated");
static_assert(offsetof(WB_InGameMain_C_OnSkillActivated, ActivatedSkill) == 0x000000, "Member 'WB_InGameMain_C_OnSkillActivated::ActivatedSkill' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.OnSuccess
// 0x0008 (0x0008 - 0x0000)
struct WB_InGameMain_C_OnSuccess final
{
public:
	uint8                                         Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StateTimeRatio;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_OnSuccess) == 0x000004, "Wrong alignment on WB_InGameMain_C_OnSuccess");
static_assert(sizeof(WB_InGameMain_C_OnSuccess) == 0x000008, "Wrong size on WB_InGameMain_C_OnSuccess");
static_assert(offsetof(WB_InGameMain_C_OnSuccess, Result) == 0x000000, "Member 'WB_InGameMain_C_OnSuccess::Result' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_OnSuccess, StateTimeRatio) == 0x000004, "Member 'WB_InGameMain_C_OnSuccess::StateTimeRatio' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_InGameMain_C_BndEvt__WB_SelectOperationTypeButton_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
