#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_IngamePlayerIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_IngamePlayerIcon.WB_IngamePlayerIcon_C
// 0x0030 (0x0238 - 0x0208)
class UWB_IngamePlayerIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_0;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_PlayerName;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerIcon_C*                       WB_PlayerIcon;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         IconBlurOffset;                                    // 0x0228(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverridePlayerIconMaterial;                        // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WB_IngamePlayerIcon(int32 EntryPoint);
	void UpdateDisplay(const class FText& InText, int32 PlayerIconID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_IngamePlayerIcon_C">();
	}
	static class UWB_IngamePlayerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_IngamePlayerIcon_C>();
	}
};
static_assert(alignof(UWB_IngamePlayerIcon_C) == 0x000008, "Wrong alignment on UWB_IngamePlayerIcon_C");
static_assert(sizeof(UWB_IngamePlayerIcon_C) == 0x000238, "Wrong size on UWB_IngamePlayerIcon_C");
static_assert(offsetof(UWB_IngamePlayerIcon_C, UberGraphFrame) == 0x000208, "Member 'UWB_IngamePlayerIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_IngamePlayerIcon_C, AJBImage_0) == 0x000210, "Member 'UWB_IngamePlayerIcon_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_IngamePlayerIcon_C, Txt_PlayerName) == 0x000218, "Member 'UWB_IngamePlayerIcon_C::Txt_PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_IngamePlayerIcon_C, WB_PlayerIcon) == 0x000220, "Member 'UWB_IngamePlayerIcon_C::WB_PlayerIcon' has a wrong offset!");
static_assert(offsetof(UWB_IngamePlayerIcon_C, IconBlurOffset) == 0x000228, "Member 'UWB_IngamePlayerIcon_C::IconBlurOffset' has a wrong offset!");
static_assert(offsetof(UWB_IngamePlayerIcon_C, OverridePlayerIconMaterial) == 0x000230, "Member 'UWB_IngamePlayerIcon_C::OverridePlayerIconMaterial' has a wrong offset!");

}

