#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameLoadingOld

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_InGameLoadingOld.WB_InGameLoadingOld_C.ExecuteUbergraph_WB_InGameLoadingOld
// 0x0070 (0x0070 - 0x0000)
struct WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableDebugDisplay_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld) == 0x000008, "Wrong alignment on WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld");
static_assert(sizeof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld) == 0x000070, "Wrong size on WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, EntryPoint) == 0x000000, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable) == 0x000004, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable) == 0x000005, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable1) == 0x000006, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_int_Variable) == 0x000008, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable2) == 0x00000C, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_int_Variable1) == 0x000010, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable3) == 0x000014, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_int_Variable2) == 0x000018, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_int_Variable3) == 0x00001C, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000028, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_IsEnableDebugDisplay_ReturnValue) == 0x000031, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_IsEnableDebugDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult) == 0x000032, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000033, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_GetAJBGameInstance_bSuccess) == 0x000034, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000038, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult1) == 0x000040, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult2) == 0x000041, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult2' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_Less_IntInt_ReturnValue) == 0x000043, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000044, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select_Default) == 0x000048, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select1_Default) == 0x000050, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select2_Default) == 0x000054, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable1) == 0x000058, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000060, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select3_Default) == 0x000068, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select3_Default' has a wrong offset!");

}

