#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_ReturnTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C.ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle");
static_assert(sizeof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle) == 0x00000C, "Wrong size on WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, EntryPoint) == 0x000000, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle, CallFunc_IsPressableVisibility_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_ReturnTitle_C_ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle::CallFunc_IsPressableVisibility_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_ReturnTitle_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_ReturnTitle_C_GetButton) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_ReturnTitle_C_GetButton");
static_assert(sizeof(WB_ModeSelect_Button_ReturnTitle_C_GetButton) == 0x000008, "Wrong size on WB_ModeSelect_Button_ReturnTitle_C_GetButton");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_Button_ReturnTitle_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C.IsButtonDecisioning
// 0x0005 (0x0005 - 0x0000)
struct WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning");
static_assert(sizeof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning) == 0x000005, "Wrong size on WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning, IsDecisioning) == 0x000000, "Member 'WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning::IsDecisioning' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000002, "Member 'WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_Button_ReturnTitle_C_IsButtonDecisioning::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage");
static_assert(sizeof(WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage) == 0x000008, "Wrong size on WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage, AuraImage) == 0x000000, "Member 'WB_ModeSelect_Button_ReturnTitle_C_GetAuraImage::AuraImage' has a wrong offset!");

// Function WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial");
static_assert(sizeof(WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial) == 0x000010, "Wrong size on WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial, EffectMaterial) == 0x000000, "Member 'WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial::EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_ReturnTitle_C_GetRetainerEffectMaterial::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

}

