#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_Training

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_ModeSelectButtonBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ModeSelect_Button_Training.WB_ModeSelect_Button_Training_C
// 0x0038 (0x0338 - 0x0300)
class UWB_ModeSelect_Button_Training_C final : public UWB_ModeSelectButtonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_ModeSelect_Button_Training_C;    // 0x0300(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Release;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Press;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Aura;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Txt_Training_C*          WB_ModeSelect_Txt_Training;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ModeSelect_Button_Training(int32 EntryPoint);
	void BndEvt__Anim_Release_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void PlayClickAnimation();
	class UAJBButton* GetButton();
	void ResetPressAndReleaseAnimation();
	void OnButtonReleasedAnimation();
	void OnButtonPressedAnimation();
	void IsButtonDecisioning(bool* IsDecisioning);
	void IsEnableSelect(bool* bEnable);

	void GetAuraImage(class UImage** AuraImage) const;
	void GetRetainerEffectMaterial(class UMaterialInstanceDynamic** EffectMaterial) const;
	void GetButtonCenterPosition(struct FVector2D* ScreenPosition) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ModeSelect_Button_Training_C">();
	}
	static class UWB_ModeSelect_Button_Training_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ModeSelect_Button_Training_C>();
	}
};
static_assert(alignof(UWB_ModeSelect_Button_Training_C) == 0x000008, "Wrong alignment on UWB_ModeSelect_Button_Training_C");
static_assert(sizeof(UWB_ModeSelect_Button_Training_C) == 0x000338, "Wrong size on UWB_ModeSelect_Button_Training_C");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, UberGraphFrame_WB_ModeSelect_Button_Training_C) == 0x000300, "Member 'UWB_ModeSelect_Button_Training_C::UberGraphFrame_WB_ModeSelect_Button_Training_C' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, Anim_Release) == 0x000308, "Member 'UWB_ModeSelect_Button_Training_C::Anim_Release' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, Anim_Press) == 0x000310, "Member 'UWB_ModeSelect_Button_Training_C::Anim_Press' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, Aura) == 0x000318, "Member 'UWB_ModeSelect_Button_Training_C::Aura' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, Button) == 0x000320, "Member 'UWB_ModeSelect_Button_Training_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, RetainerBox_0) == 0x000328, "Member 'UWB_ModeSelect_Button_Training_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_Training_C, WB_ModeSelect_Txt_Training) == 0x000330, "Member 'UWB_ModeSelect_Button_Training_C::WB_ModeSelect_Txt_Training' has a wrong offset!");

}

