#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_ReturnTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_ModeSelectButtonBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ModeSelect_Button_ReturnTitle.WB_ModeSelect_Button_ReturnTitle_C
// 0x0028 (0x0328 - 0x0300)
class UWB_ModeSelect_Button_ReturnTitle_C final : public UWB_ModeSelectButtonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_ModeSelect_Button_ReturnTitle_C; // 0x0300(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pressed;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ModeSelect_Button_ReturnTitle(int32 EntryPoint);
	void BndEvt__Anim_Pressed_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ResetPressAndReleaseAnimation();
	void OnButtonReleasedAnimation();
	void OnButtonPressedAnimation();
	class UAJBButton* GetButton();
	void IsButtonDecisioning(bool* IsDecisioning);

	void GetAuraImage(class UImage** AuraImage) const;
	void GetRetainerEffectMaterial(class UMaterialInstanceDynamic** EffectMaterial) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ModeSelect_Button_ReturnTitle_C">();
	}
	static class UWB_ModeSelect_Button_ReturnTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ModeSelect_Button_ReturnTitle_C>();
	}
};
static_assert(alignof(UWB_ModeSelect_Button_ReturnTitle_C) == 0x000008, "Wrong alignment on UWB_ModeSelect_Button_ReturnTitle_C");
static_assert(sizeof(UWB_ModeSelect_Button_ReturnTitle_C) == 0x000328, "Wrong size on UWB_ModeSelect_Button_ReturnTitle_C");
static_assert(offsetof(UWB_ModeSelect_Button_ReturnTitle_C, UberGraphFrame_WB_ModeSelect_Button_ReturnTitle_C) == 0x000300, "Member 'UWB_ModeSelect_Button_ReturnTitle_C::UberGraphFrame_WB_ModeSelect_Button_ReturnTitle_C' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_ReturnTitle_C, Anim_Pressed) == 0x000308, "Member 'UWB_ModeSelect_Button_ReturnTitle_C::Anim_Pressed' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_ReturnTitle_C, Button) == 0x000310, "Member 'UWB_ModeSelect_Button_ReturnTitle_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_ReturnTitle_C, RetainerBox_0) == 0x000318, "Member 'UWB_ModeSelect_Button_ReturnTitle_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ModeSelect_Button_ReturnTitle_C, RetainerBox_1) == 0x000320, "Member 'UWB_ModeSelect_Button_ReturnTitle_C::RetainerBox_1' has a wrong offset!");

}

