#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_OnDeathCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_OnDeathCamera.WB_OnDeathCamera_C.ExecuteUbergraph_WB_OnDeathCamera
// 0x0004 (0x0004 - 0x0000)
struct WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera) == 0x000004, "Wrong alignment on WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera");
static_assert(sizeof(WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera) == 0x000004, "Wrong size on WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera");
static_assert(offsetof(WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera, EntryPoint) == 0x000000, "Member 'WB_OnDeathCamera_C_ExecuteUbergraph_WB_OnDeathCamera::EntryPoint' has a wrong offset!");

// Function WB_OnDeathCamera.WB_OnDeathCamera_C.TryGetCharacterInfoFollowerWidget
// 0x0020 (0x0020 - 0x0000)
struct WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget final
{
public:
	class UWB_UI_FollowPairInfo_C*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_UI_FollowPairInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget) == 0x000008, "Wrong alignment on WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget");
static_assert(sizeof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget) == 0x000020, "Wrong size on WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget");
static_assert(offsetof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget, ReturnValue) == 0x000000, "Member 'WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget, CallFunc_AddChildToCanvas_ReturnValue) == 0x000018, "Member 'WB_OnDeathCamera_C_TryGetCharacterInfoFollowerWidget::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

}

