#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PlayerIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_PlayerIcon.WB_PlayerIcon_C.ExecuteUbergraph_WB_PlayerIcon
// 0x0060 (0x0060 - 0x0000)
struct WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnableGrayscale;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_TryGetPlayerIcon_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_AuraOffset;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BlurOffset;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon) == 0x000008, "Wrong alignment on WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon");
static_assert(sizeof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon) == 0x000060, "Wrong size on WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, EntryPoint) == 0x000000, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, Temp_bool_Variable) == 0x000005, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, Temp_object_Variable) == 0x000008, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, Temp_object_Variable1) == 0x000010, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_CustomEvent_bVisible) == 0x000018, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_CustomEvent_bEnableGrayscale) == 0x000019, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_CustomEvent_bEnableGrayscale' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_Select_Default) == 0x000020, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_GetAJBGameInstance_bSuccess) == 0x00002C, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000030, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_TryGetPlayerIcon_ReturnValue) == 0x000038, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_TryGetPlayerIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_CustomEvent_AuraOffset) == 0x000044, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_CustomEvent_AuraOffset' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, K2Node_CustomEvent_BlurOffset) == 0x000048, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::K2Node_CustomEvent_BlurOffset' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon, CallFunc_IsValid_ReturnValue1) == 0x000058, "Member 'WB_PlayerIcon_C_ExecuteUbergraph_WB_PlayerIcon::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.UpdateIconBlurOffset
// 0x0004 (0x0004 - 0x0000)
struct WB_PlayerIcon_C_UpdateIconBlurOffset final
{
public:
	float                                         BlurOffset;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerIcon_C_UpdateIconBlurOffset) == 0x000004, "Wrong alignment on WB_PlayerIcon_C_UpdateIconBlurOffset");
static_assert(sizeof(WB_PlayerIcon_C_UpdateIconBlurOffset) == 0x000004, "Wrong size on WB_PlayerIcon_C_UpdateIconBlurOffset");
static_assert(offsetof(WB_PlayerIcon_C_UpdateIconBlurOffset, BlurOffset) == 0x000000, "Member 'WB_PlayerIcon_C_UpdateIconBlurOffset::BlurOffset' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.SetAuraOffset
// 0x0004 (0x0004 - 0x0000)
struct WB_PlayerIcon_C_SetAuraOffset final
{
public:
	float                                         AuraOffset_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerIcon_C_SetAuraOffset) == 0x000004, "Wrong alignment on WB_PlayerIcon_C_SetAuraOffset");
static_assert(sizeof(WB_PlayerIcon_C_SetAuraOffset) == 0x000004, "Wrong size on WB_PlayerIcon_C_SetAuraOffset");
static_assert(offsetof(WB_PlayerIcon_C_SetAuraOffset, AuraOffset_0) == 0x000000, "Member 'WB_PlayerIcon_C_SetAuraOffset::AuraOffset_0' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_PlayerIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PlayerIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WB_PlayerIcon_C_PreConstruct");
static_assert(sizeof(WB_PlayerIcon_C_PreConstruct) == 0x000001, "Wrong size on WB_PlayerIcon_C_PreConstruct");
static_assert(offsetof(WB_PlayerIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_PlayerIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.SetVisiblePlayerIcon
// 0x0002 (0x0002 - 0x0000)
struct WB_PlayerIcon_C_SetVisiblePlayerIcon final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnableGrayscale;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PlayerIcon_C_SetVisiblePlayerIcon) == 0x000001, "Wrong alignment on WB_PlayerIcon_C_SetVisiblePlayerIcon");
static_assert(sizeof(WB_PlayerIcon_C_SetVisiblePlayerIcon) == 0x000002, "Wrong size on WB_PlayerIcon_C_SetVisiblePlayerIcon");
static_assert(offsetof(WB_PlayerIcon_C_SetVisiblePlayerIcon, bVisible) == 0x000000, "Member 'WB_PlayerIcon_C_SetVisiblePlayerIcon::bVisible' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_SetVisiblePlayerIcon, bEnableGrayscale) == 0x000001, "Member 'WB_PlayerIcon_C_SetVisiblePlayerIcon::bEnableGrayscale' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.SetupIconID
// 0x0018 (0x0018 - 0x0000)
struct WB_PlayerIcon_C_SetupIconID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConvertRewardNo;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBAssetManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerIconIDByRewardNo_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerIcon_C_SetupIconID) == 0x000008, "Wrong alignment on WB_PlayerIcon_C_SetupIconID");
static_assert(sizeof(WB_PlayerIcon_C_SetupIconID) == 0x000018, "Wrong size on WB_PlayerIcon_C_SetupIconID");
static_assert(offsetof(WB_PlayerIcon_C_SetupIconID, ID) == 0x000000, "Member 'WB_PlayerIcon_C_SetupIconID::ID' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_SetupIconID, bConvertRewardNo) == 0x000004, "Member 'WB_PlayerIcon_C_SetupIconID::bConvertRewardNo' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_SetupIconID, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WB_PlayerIcon_C_SetupIconID::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_SetupIconID, CallFunc_GetPlayerIconIDByRewardNo_ReturnValue) == 0x000010, "Member 'WB_PlayerIcon_C_SetupIconID::CallFunc_GetPlayerIconIDByRewardNo_ReturnValue' has a wrong offset!");

// Function WB_PlayerIcon.WB_PlayerIcon_C.OverrideIconMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_PlayerIcon_C_OverrideIconMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerIcon_C_OverrideIconMaterial) == 0x000008, "Wrong alignment on WB_PlayerIcon_C_OverrideIconMaterial");
static_assert(sizeof(WB_PlayerIcon_C_OverrideIconMaterial) == 0x000010, "Wrong size on WB_PlayerIcon_C_OverrideIconMaterial");
static_assert(offsetof(WB_PlayerIcon_C_OverrideIconMaterial, Material) == 0x000000, "Member 'WB_PlayerIcon_C_OverrideIconMaterial::Material' has a wrong offset!");
static_assert(offsetof(WB_PlayerIcon_C_OverrideIconMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_PlayerIcon_C_OverrideIconMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

