#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PpBuy_Button_1Credit

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.ExecuteUbergraph_WB_PpBuy_Button_1Credit
// 0x01F0 (0x01F0 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue1;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaySE;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_EnableActve;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPP_ReturnValue;                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseButton_bCan;                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanUseButton_bLimit3000PP;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue1; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0138(0x0018)()
	int32                                         CallFunc_GetAJBMaxBuyPP_ReturnValue;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0170(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x01B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x01C8(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBMaxBuyPP_ReturnValue1;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit) == 0x000008, "Wrong alignment on WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit) == 0x0001F0, "Wrong size on WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, EntryPoint) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_text_Variable) == 0x000008, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_Event_IsDesignTime) == 0x000022, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BuildString_Int_ReturnValue) == 0x000028, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BuildString_Int_ReturnValue1) == 0x000038, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BuildString_Int_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_CustomEvent_bPlaySE) == 0x000048, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_CustomEvent_bPlaySE' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000050, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000058, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_RequestWwiseEventOnLocal_AkComponent2) == 0x000060, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_RequestWwiseEventOnLocal_AkComponent2' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue1) == 0x00006A, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetEffectMaterial_ReturnValue) == 0x000070, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_CustomEvent_EnableActve) == 0x000078, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_CustomEvent_EnableActve' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_Variable) == 0x000079, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBGameInstance_bSuccess) == 0x00007A, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000080, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_AddPP_ReturnValue) == 0x000088, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_AddPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00008C, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_CanUseButton_bCan) == 0x000090, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_CanUseButton_bCan' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_CanUseButton_bLimit3000PP) == 0x000091, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_CanUseButton_bLimit3000PP' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Not_PreBool_ReturnValue1) == 0x000092, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000093, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue) == 0x000094, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Not_PreBool_ReturnValue2) == 0x000099, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue2) == 0x00009A, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue3) == 0x00009B, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_byte_Variable) == 0x00009C, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_byte_Variable1) == 0x00009D, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Not_PreBool_ReturnValue3) == 0x00009E, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue4) == 0x00009F, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue1) == 0x0000A0, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_Variable1) == 0x000100, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_MakeArray_Array) == 0x000108, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_Select_Default) == 0x000130, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_Select1_Default) == 0x000138, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBMaxBuyPP_ReturnValue) == 0x000150, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBMaxBuyPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_byte_Variable2) == 0x000154, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Conv_IntToText_ReturnValue1) == 0x000158, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_MakeStruct_FormatArgumentData1) == 0x000170, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_byte_Variable3) == 0x0001B0, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_MakeArray_Array1) == 0x0001B8, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_Format_ReturnValue1) == 0x0001C8, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, Temp_bool_Variable2) == 0x0001E0, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_GetAJBMaxBuyPP_ReturnValue1) == 0x0001E4, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_GetAJBMaxBuyPP_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, K2Node_Select2_Default) == 0x0001E8, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001E9, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit, CallFunc_BooleanAND_ReturnValue5) == 0x0001EA, "Member 'WB_PpBuy_Button_1Credit_C_ExecuteUbergraph_WB_PpBuy_Button_1Credit::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.SetEnableActiveWithoutVisualUpdate
// 0x0001 (0x0001 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate final
{
public:
	bool                                          EnableActve;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate) == 0x000001, "Wrong alignment on WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate) == 0x000001, "Wrong size on WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate, EnableActve) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_SetEnableActiveWithoutVisualUpdate::EnableActve' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.UpdateEnableButton
// 0x0001 (0x0001 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_UpdateEnableButton final
{
public:
	bool                                          bPlaySE;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_UpdateEnableButton) == 0x000001, "Wrong alignment on WB_PpBuy_Button_1Credit_C_UpdateEnableButton");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_UpdateEnableButton) == 0x000001, "Wrong size on WB_PpBuy_Button_1Credit_C_UpdateEnableButton");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateEnableButton, bPlaySE) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_UpdateEnableButton::bPlaySE' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_PreConstruct) == 0x000001, "Wrong alignment on WB_PpBuy_Button_1Credit_C_PreConstruct");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_PreConstruct) == 0x000001, "Wrong size on WB_PpBuy_Button_1Credit_C_PreConstruct");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.UpdateDisplay
// 0x0068 (0x0068 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_UpdateDisplay final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExtraPPByPayCreditNum_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExtraPPKind                                  CallFunc_GetExtraPPKind_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetBuyPPByPayCreditNum_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0050(0x0018)()
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_UpdateDisplay) == 0x000008, "Wrong alignment on WB_PpBuy_Button_1Credit_C_UpdateDisplay");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_UpdateDisplay) == 0x000068, "Wrong size on WB_PpBuy_Button_1Credit_C_UpdateDisplay");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, Temp_byte_Variable) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, Temp_byte_Variable1) == 0x000001, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, Temp_bool_Variable) == 0x000002, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GetAJBGameInstance_bSuccess) == 0x000003, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GetExtraPPByPayCreditNum_ReturnValue) == 0x000010, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GetExtraPPByPayCreditNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GetExtraPPKind_ReturnValue) == 0x000015, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GetExtraPPKind_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, K2Node_Select_Default) == 0x000016, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000017, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_GetBuyPPByPayCreditNum_ReturnValue) == 0x000018, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_GetBuyPPByPayCreditNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_Conv_IntToText_ReturnValue1) == 0x000038, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_UpdateDisplay, CallFunc_Conv_IntToText_ReturnValue2) == 0x000050, "Member 'WB_PpBuy_Button_1Credit_C_UpdateDisplay::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_GetButton) == 0x000008, "Wrong alignment on WB_PpBuy_Button_1Credit_C_GetButton");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_GetButton) == 0x000008, "Wrong size on WB_PpBuy_Button_1Credit_C_GetButton");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_PpBuy_Button_1Credit.WB_PpBuy_Button_1Credit_C.CanUseButton
// 0x0078 (0x0078 - 0x0000)
struct WB_PpBuy_Button_1Credit_C_CanUseButton final
{
public:
	bool                                          bCan;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLimit3000PP_0;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLResultLimit3000PP;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLResult;                                          // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         LCurrentPP;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LCurrentCredit;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnablePromotionMode_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAJBArcadeLimitNumPossessionPP_ReturnValue1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCreditNumPurchaseLimitPP_ReturnValue;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCreaditNum_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBMaxBuyPP_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PpBuy_Button_1Credit_C_CanUseButton) == 0x000008, "Wrong alignment on WB_PpBuy_Button_1Credit_C_CanUseButton");
static_assert(sizeof(WB_PpBuy_Button_1Credit_C_CanUseButton) == 0x000078, "Wrong size on WB_PpBuy_Button_1Credit_C_CanUseButton");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_CanUseButton, bCan) == 0x000000, "Member 'WB_PpBuy_Button_1Credit_C_CanUseButton::bCan' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_CanUseButton, bLimit3000PP_0) == 0x000001, "Member 'WB_PpBuy_Button_1Credit_C_CanUseButton::bLimit3000PP_0' has a wrong offset!");
static_assert(offsetof(WB_PpBuy_Button_1Credit_C_CanUseButton, bLResultLimit3000PP) == 0x000002, "Member 'WB_PpBuy_Button_1Credit_C_CanUseButton::bLResultLimit3000PP' has a wrong offset!");
