#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_WaitingWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RoomSelect_WaitingWindow.WB_RoomSelect_WaitingWindow_C
// 0x0030 (0x02F0 - 0x02C0)
class UWB_RoomSelect_WaitingWindow_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          Txt_RoomNum;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_Dissolution;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAJBConfirmResult                             ButtonResult;                                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDecideDeleteRoom;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_RoomSelect_WaitingWindow(int32 EntryPoint);
	void BndEvt__WB_CommonButton_Dissolution_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void Setup(int32 RoomNum);
	void OnCurveAnimationFinished();
	void OnClosingWindow();
	void OnOpeningWindow();
	void Construct();
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedUp();
	bool OnInputReleasedTouch();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool IsModeless();
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL2();
	bool OnInputPressedL1();
	bool OnInputReleasedL3();
	bool OnInputPressedL3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RoomSelect_WaitingWindow_C">();
	}
	static class UWB_RoomSelect_WaitingWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RoomSelect_WaitingWindow_C>();
	}
};
static_assert(alignof(UWB_RoomSelect_WaitingWindow_C) == 0x000008, "Wrong alignment on UWB_RoomSelect_WaitingWindow_C");
static_assert(sizeof(UWB_RoomSelect_WaitingWindow_C) == 0x0002F0, "Wrong size on UWB_RoomSelect_WaitingWindow_C");
static_assert(offsetof(UWB_RoomSelect_WaitingWindow_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_RoomSelect_WaitingWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_WaitingWindow_C, Txt_RoomNum) == 0x0002C8, "Member 'UWB_RoomSelect_WaitingWindow_C::Txt_RoomNum' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_WaitingWindow_C, WB_CommonButton_Dissolution) == 0x0002D0, "Member 'UWB_RoomSelect_WaitingWindow_C::WB_CommonButton_Dissolution' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_WaitingWindow_C, ButtonResult) == 0x0002D8, "Member 'UWB_RoomSelect_WaitingWindow_C::ButtonResult' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_WaitingWindow_C, OnDecideDeleteRoom) == 0x0002E0, "Member 'UWB_RoomSelect_WaitingWindow_C::OnDecideDeleteRoom' has a wrong offset!");

}

