#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_IDMatchWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RoomSelect_IDMatchWindow.WB_RoomSelect_IDMatchWindow_C
// 0x0040 (0x0300 - 0x02C0)
class UWB_RoomSelect_IDMatchWindow_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWB_CommonButton_C*                     WB_CommonButton_NO;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_YES;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RoomSelect_IDSelect_C*              WB_RoomSelect_IDSelect;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RoomSelect_IDSelect_C*              WB_RoomSelect_IDSelect_0;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RoomSelect_IDSelect_C*              WB_RoomSelect_IDSelect_1;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RoomSelect_IDSelect_C*              WB_RoomSelect_IDSelect_2;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAJBConfirmResult                             ButtonResult;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_RoomSelect_IDMatchWindow(int32 EntryPoint);
	void Construct();
	void BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnOpeningWindow();
	void OnFinishedOpenCurveAnim();
	void BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnClosingWindow();
	void GetMatchingIDString(class FString* MachingID);
	void SetMatchingID(TArray<int32>& ID);
	void GetMatchingIDIntArray(TArray<int32>* ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RoomSelect_IDMatchWindow_C">();
	}
	static class UWB_RoomSelect_IDMatchWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RoomSelect_IDMatchWindow_C>();
	}
};
static_assert(alignof(UWB_RoomSelect_IDMatchWindow_C) == 0x000008, "Wrong alignment on UWB_RoomSelect_IDMatchWindow_C");
static_assert(sizeof(UWB_RoomSelect_IDMatchWindow_C) == 0x000300, "Wrong size on UWB_RoomSelect_IDMatchWindow_C");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_RoomSelect_IDMatchWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_CommonButton_NO) == 0x0002C8, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_CommonButton_NO' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_CommonButton_YES) == 0x0002D0, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_CommonButton_YES' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_RoomSelect_IDSelect) == 0x0002D8, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_RoomSelect_IDSelect' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_RoomSelect_IDSelect_0) == 0x0002E0, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_RoomSelect_IDSelect_0' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_RoomSelect_IDSelect_1) == 0x0002E8, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_RoomSelect_IDSelect_1' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, WB_RoomSelect_IDSelect_2) == 0x0002F0, "Member 'UWB_RoomSelect_IDMatchWindow_C::WB_RoomSelect_IDSelect_2' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_IDMatchWindow_C, ButtonResult) == 0x0002F8, "Member 'UWB_RoomSelect_IDMatchWindow_C::ButtonResult' has a wrong offset!");

}

