#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChatButtonList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RadioChatButtonList.WB_RadioChatButtonList_C
// 0x0068 (0x02B0 - 0x0248)
class UWB_RadioChatButtonList_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_1;                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_2;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_3;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_4;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_5;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_6;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_7;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_8;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  WB_RadioChatButton_9;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_RadioChatButton_C*>          ButtonList;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_RadioChatButtonList(int32 EntryPoint);
	void Construct();
	void ForceCloseList();
	void OnFinishedCloseListAnim();
	void OnFinishedOpenAnim();
	void CloseList();
	void OpenList();
	void GetButtons(TArray<class UWB_RadioChatButton_C*>* ReturnValues);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RadioChatButtonList_C">();
	}
	static class UWB_RadioChatButtonList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RadioChatButtonList_C>();
	}
};
static_assert(alignof(UWB_RadioChatButtonList_C) == 0x000008, "Wrong alignment on UWB_RadioChatButtonList_C");
static_assert(sizeof(UWB_RadioChatButtonList_C) == 0x0002B0, "Wrong size on UWB_RadioChatButtonList_C");
static_assert(offsetof(UWB_RadioChatButtonList_C, UberGraphFrame) == 0x000248, "Member 'UWB_RadioChatButtonList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, Anim_Appear) == 0x000250, "Member 'UWB_RadioChatButtonList_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_1) == 0x000258, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_1' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_2) == 0x000260, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_2' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_3) == 0x000268, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_3' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_4) == 0x000270, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_4' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_5) == 0x000278, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_5' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_6) == 0x000280, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_6' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_7) == 0x000288, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_7' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_8) == 0x000290, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_8' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, WB_RadioChatButton_9) == 0x000298, "Member 'UWB_RadioChatButtonList_C::WB_RadioChatButton_9' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButtonList_C, ButtonList) == 0x0002A0, "Member 'UWB_RadioChatButtonList_C::ButtonList' has a wrong offset!");

}

