#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillGuideText

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SkillGuideText.WB_SkillGuideText_C
// 0x0038 (0x0240 - 0x0208)
class UWB_SkillGuideText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          Guide;                                             // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              PadIcon;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   GuideTitle;                                        // 0x0220(0x0018)(Edit, BlueprintVisible)
	EAJBPadIconType                               PadType;                                           // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_SkillGuideText(int32 EntryPoint);
	void OnChangedPadicon();
	void PreConstruct(bool IsDesignTime);
	void SetParamater(EAJBPadIconType PadType_0, const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SkillGuideText_C">();
	}
	static class UWB_SkillGuideText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillGuideText_C>();
	}
};
static_assert(alignof(UWB_SkillGuideText_C) == 0x000008, "Wrong alignment on UWB_SkillGuideText_C");
static_assert(sizeof(UWB_SkillGuideText_C) == 0x000240, "Wrong size on UWB_SkillGuideText_C");
static_assert(offsetof(UWB_SkillGuideText_C, UberGraphFrame) == 0x000208, "Member 'UWB_SkillGuideText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuideText_C, Guide) == 0x000210, "Member 'UWB_SkillGuideText_C::Guide' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuideText_C, PadIcon) == 0x000218, "Member 'UWB_SkillGuideText_C::PadIcon' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuideText_C, GuideTitle) == 0x000220, "Member 'UWB_SkillGuideText_C::GuideTitle' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuideText_C, PadType) == 0x000238, "Member 'UWB_SkillGuideText_C::PadType' has a wrong offset!");

}

