#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StandBy

#include "Basic.hpp"

#include "ERoomConnectState_structs.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "ETrainingCPUStrength_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_StandBy.WB_StandBy_C
// 0x0270 (0x0530 - 0x02C0)
class UWB_StandBy_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          AJBTextBlock_2;                                    // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_OneRow;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AreaSubTitle;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AreaTitle;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_HostLabel;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_TwoRow;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_L_C*                    WB_ArrowButton_L_StageSelect;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_L_C*                    WB_ArrowButton_Left;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_C*                      WB_ArrowButton_R_StageSelect;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_C*                      WB_ArrowButton_Right;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_CancelShopMatch;                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_JoinMatch;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_ReleaseRoom;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_StartMatch;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_OFF_C*                              WB_OFF;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ON_C*                               WB_ON;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail0;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail1;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail2;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail3;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail4;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail5;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail6;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PlayerDetail_C*                     WB_PlayerDetail7;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TimeLimit_TextSet_C*                WB_TimeLimit_TextSet;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_AreaTitle;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_CommunicateMode;                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_HostOrClient;                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_AJBOutGameHUD_C*                    CachedOutGameHUD;                                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableUpdateTimeCountDown;                        // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDecisionBeginMatch;                               // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bJoinedMatchForClient;                             // 0x03B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B3[0x1];                                      // 0x03B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CountDownMaxTime;                                  // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MatchSuccessConfirmLifeTime;                       // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MatchFailureConfirmLifeTime;                       // 0x03BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugForceExistRoom;                               // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugEnableCommand;                                // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_StandBy_Setting_C*                  CachedMatchSettings;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    InvalidMatchingInfo;                               // 0x03D0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class UWB_PlayerDetail_C*>             PlayerDetails;                                     // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          DebugForceJoinPlayers;                             // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    DebugJoinPlayerTemplate;                           // 0x0470(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DebugJoinPlayerNum;                                // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousJoinPlayerNum;                             // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayJoinSEOnOneflame;                              // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ERoomConnectState                             ConnectedEnterTenpoRoom;                           // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoomConnectState                             ConnectedLeaveTenpoRoom;                           // 0x0502(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoomConnectState                             ConnectedTenpoGameSettings;                        // 0x0503(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoomConnectState                             ConnectedDecisionTenpoMatching;                    // 0x0504(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdatedAfterEntry;                                // 0x0505(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506[0x2];                                      // 0x0506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultNPCNum;                                     // 0x0508(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          DefaultCPUStrength;                                // 0x050C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestErrorReturnModeSelect;                     // 0x050D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsExchangeMode;                                    // 0x050E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDecidedRoomDeleteReason;                          // 0x050F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TakeOverRemainTime;                                // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AreaIdCache;                                       // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)
	int32                                         SelectedAreaIndex;                                 // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_StandBy(int32 EntryPoint);
	void StopTimeCountdown();
	void StartTimeCountdown();
	void SetTimeCountDownElapsedTime(float ElapsedTime);
	void UpdateSelectExchangeMode(bool IsExchangeMode_0);
	void BndEvt__WB_ArrowButton_Right_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ArrowButton_Left_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void UpdateSettings(const bool bServer);
	void CacheSettingsWindow();
	void OnClosedMatchSettings(class UAJBWindowWidget* TargetWidget);
	void MatchStart(bool bIsPlayOpenSE);
	void OnChangedJoinPlayer();
	void UpdatePlayerDetails();
	void SetupClientMode();
	void SetupServerMode();
	void TransitionNextFlowForCloseDelegate(class UAJBWindowWidget* TargetWidget);
	void OpenMatchSettings();
	void OpenMatchFailureConfirm(const class FText& FailureReason);
	void OpenMatchSuccessConfirm(bool bIsPlayOpenSE);
	void BndEvt__WB_CommonButton_StartMatch_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_CommonButton_ReleaseRoom_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_CommonButton_JoinMatch_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_CommonButton_CancelShopMatch_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnClosingWindow();
	void OnOpeningWindow();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void OnFailedStartMatching();
	void OnStartTenpoMatchingClinet();
	void OnStartTenpoMatchingHost(bool bIsSuccess);
	void Connect_DecisionTenpoMatching();
	void Connect_SendTenpoGameSettings();
	void Connect_LeaveTenpoRoom();
	void Connect_EnterTenpoRoom();
	void OnFinishedMathcing();
	void OnLeaveRoom(bool bIsHost, bool bSuccess);
	void OnEnterRoom(bool bSuccess);
	void OnUpdateGameSettings(bool IsExchangeMode_0, int32 AreaId);
	void UnbindOutGameProxyEvents();
	void BindOutGameProxyEvents();
	void OnUpdateRoom();
	void SetAreaId(int32 AreaId);
	void BndEvt__WB_ArrowButton_R_StageSelect_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ArrowButton_L_StageSelect_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void ResetAreaSettings();
	void UpdateAreaSelectButtonEnabled_Internal();
	void SetAreaTitle_Internal(int32 Index_0);
	void InitAreaSettings();
	void SetArea(int32 Index_0);
	void Finished_0D8247534EDB0BF3FAC7038198B4DBED();
	void Finished_0BD51B124A0D7E4586B488B2F1B71993();
	void Finished_05047C664948733D2F11D0840ABA5133();
	void Finished_6A59BCF342C5FE1A10FFCBA8102B99E3();
	void JoinMatch();
	void GetOutGameProxyInstance(class ABP_AJBOutGameProxy_C** Object);
	void UpdateGameInstanceBattleSettings(int32 NPCNum, ETrainingCPUStrength CPUStrength);
	void IsTenpoHost(bool* bHost);
	void ForceCloseConfirmWidget();
	class FText GetText_0();
	void GetSelectedAreaId(int32* AreaId);
	void GetSelectedAreaIndex(int32* AreaIndex);
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedUp();
	bool OnInputReleasedTouch();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool IsModeless();
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL2();
	bool OnInputPressedL1();
	bool OnInputReleasedL3();
	bool OnInputPressedL3();

	void IsInShopMatch(bool* IsShopMatch) const;
	void GetJoinedPlayerNum(int32* PlayerNum) const;
	void GetJoinedPlayers(TArray<struct FMatchingPlayerInfo>* JoinedPlayers) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_StandBy_C">();
	}
	static class UWB_StandBy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_StandBy_C>();
	}
};
static_assert(alignof(UWB_StandBy_C) == 0x000008, "Wrong alignment on UWB_StandBy_C");
static_assert(sizeof(UWB_StandBy_C) == 0x000530, "Wrong size on UWB_StandBy_C");
static_assert(offsetof(UWB_StandBy_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_StandBy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, AJBTextBlock_2) == 0x0002C8, "Member 'UWB_StandBy_C::AJBTextBlock_2' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, AJBTextBlock_OneRow) == 0x0002D0, "Member 'UWB_StandBy_C::AJBTextBlock_OneRow' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, AreaSubTitle) == 0x0002D8, "Member 'UWB_StandBy_C::AreaSubTitle' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, AreaTitle) == 0x0002E0, "Member 'UWB_StandBy_C::AreaTitle' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, Overlay_HostLabel) == 0x0002E8, "Member 'UWB_StandBy_C::Overlay_HostLabel' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, VerticalBox_TwoRow) == 0x0002F0, "Member 'UWB_StandBy_C::VerticalBox_TwoRow' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_ArrowButton_L_StageSelect) == 0x0002F8, "Member 'UWB_StandBy_C::WB_ArrowButton_L_StageSelect' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_ArrowButton_Left) == 0x000300, "Member 'UWB_StandBy_C::WB_ArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_ArrowButton_R_StageSelect) == 0x000308, "Member 'UWB_StandBy_C::WB_ArrowButton_R_StageSelect' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_ArrowButton_Right) == 0x000310, "Member 'UWB_StandBy_C::WB_ArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_CommonButton_CancelShopMatch) == 0x000318, "Member 'UWB_StandBy_C::WB_CommonButton_CancelShopMatch' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_CommonButton_JoinMatch) == 0x000320, "Member 'UWB_StandBy_C::WB_CommonButton_JoinMatch' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_CommonButton_ReleaseRoom) == 0x000328, "Member 'UWB_StandBy_C::WB_CommonButton_ReleaseRoom' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_CommonButton_StartMatch) == 0x000330, "Member 'UWB_StandBy_C::WB_CommonButton_StartMatch' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_OFF) == 0x000338, "Member 'UWB_StandBy_C::WB_OFF' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_ON) == 0x000340, "Member 'UWB_StandBy_C::WB_ON' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail0) == 0x000348, "Member 'UWB_StandBy_C::WB_PlayerDetail0' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail1) == 0x000350, "Member 'UWB_StandBy_C::WB_PlayerDetail1' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail2) == 0x000358, "Member 'UWB_StandBy_C::WB_PlayerDetail2' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail3) == 0x000360, "Member 'UWB_StandBy_C::WB_PlayerDetail3' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail4) == 0x000368, "Member 'UWB_StandBy_C::WB_PlayerDetail4' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail5) == 0x000370, "Member 'UWB_StandBy_C::WB_PlayerDetail5' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail6) == 0x000378, "Member 'UWB_StandBy_C::WB_PlayerDetail6' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_PlayerDetail7) == 0x000380, "Member 'UWB_StandBy_C::WB_PlayerDetail7' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WB_TimeLimit_TextSet) == 0x000388, "Member 'UWB_StandBy_C::WB_TimeLimit_TextSet' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WidgetSwitcher_AreaTitle) == 0x000390, "Member 'UWB_StandBy_C::WidgetSwitcher_AreaTitle' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WidgetSwitcher_CommunicateMode) == 0x000398, "Member 'UWB_StandBy_C::WidgetSwitcher_CommunicateMode' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, WidgetSwitcher_HostOrClient) == 0x0003A0, "Member 'UWB_StandBy_C::WidgetSwitcher_HostOrClient' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, CachedOutGameHUD) == 0x0003A8, "Member 'UWB_StandBy_C::CachedOutGameHUD' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bEnableUpdateTimeCountDown) == 0x0003B0, "Member 'UWB_StandBy_C::bEnableUpdateTimeCountDown' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bDecisionBeginMatch) == 0x0003B1, "Member 'UWB_StandBy_C::bDecisionBeginMatch' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bJoinedMatchForClient) == 0x0003B2, "Member 'UWB_StandBy_C::bJoinedMatchForClient' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, CountDownMaxTime) == 0x0003B4, "Member 'UWB_StandBy_C::CountDownMaxTime' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, MatchSuccessConfirmLifeTime) == 0x0003B8, "Member 'UWB_StandBy_C::MatchSuccessConfirmLifeTime' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, MatchFailureConfirmLifeTime) == 0x0003BC, "Member 'UWB_StandBy_C::MatchFailureConfirmLifeTime' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DebugForceExistRoom) == 0x0003C0, "Member 'UWB_StandBy_C::DebugForceExistRoom' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DebugEnableCommand) == 0x0003C1, "Member 'UWB_StandBy_C::DebugEnableCommand' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, CachedMatchSettings) == 0x0003C8, "Member 'UWB_StandBy_C::CachedMatchSettings' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, InvalidMatchingInfo) == 0x0003D0, "Member 'UWB_StandBy_C::InvalidMatchingInfo' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, PlayerDetails) == 0x000458, "Member 'UWB_StandBy_C::PlayerDetails' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DebugForceJoinPlayers) == 0x000468, "Member 'UWB_StandBy_C::DebugForceJoinPlayers' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DebugJoinPlayerTemplate) == 0x000470, "Member 'UWB_StandBy_C::DebugJoinPlayerTemplate' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DebugJoinPlayerNum) == 0x0004F8, "Member 'UWB_StandBy_C::DebugJoinPlayerNum' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, PreviousJoinPlayerNum) == 0x0004FC, "Member 'UWB_StandBy_C::PreviousJoinPlayerNum' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, PlayJoinSEOnOneflame) == 0x000500, "Member 'UWB_StandBy_C::PlayJoinSEOnOneflame' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, ConnectedEnterTenpoRoom) == 0x000501, "Member 'UWB_StandBy_C::ConnectedEnterTenpoRoom' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, ConnectedLeaveTenpoRoom) == 0x000502, "Member 'UWB_StandBy_C::ConnectedLeaveTenpoRoom' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, ConnectedTenpoGameSettings) == 0x000503, "Member 'UWB_StandBy_C::ConnectedTenpoGameSettings' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, ConnectedDecisionTenpoMatching) == 0x000504, "Member 'UWB_StandBy_C::ConnectedDecisionTenpoMatching' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bUpdatedAfterEntry) == 0x000505, "Member 'UWB_StandBy_C::bUpdatedAfterEntry' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DefaultNPCNum) == 0x000508, "Member 'UWB_StandBy_C::DefaultNPCNum' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, DefaultCPUStrength) == 0x00050C, "Member 'UWB_StandBy_C::DefaultCPUStrength' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bRequestErrorReturnModeSelect) == 0x00050D, "Member 'UWB_StandBy_C::bRequestErrorReturnModeSelect' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, IsExchangeMode) == 0x00050E, "Member 'UWB_StandBy_C::IsExchangeMode' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, bDecidedRoomDeleteReason) == 0x00050F, "Member 'UWB_StandBy_C::bDecidedRoomDeleteReason' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, TakeOverRemainTime) == 0x000510, "Member 'UWB_StandBy_C::TakeOverRemainTime' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, AreaIdCache) == 0x000518, "Member 'UWB_StandBy_C::AreaIdCache' has a wrong offset!");
static_assert(offsetof(UWB_StandBy_C, SelectedAreaIndex) == 0x000528, "Member 'UWB_StandBy_C::SelectedAreaIndex' has a wrong offset!");

}

