#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StandBy_Setting

#include "Basic.hpp"

#include "ETrainingCPUStrength_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.ExecuteUbergraph_WB_StandBy_Setting
// 0x0128 (0x0128 - 0x0000)
struct WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable1;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable3;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable4;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable5;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable6;                               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable7;                               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable8;                               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable9;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable10;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable11;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable12;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable13;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable14;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable15;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable16;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable17;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable18;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable19;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable20;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable21;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Num;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          K2Node_CustomEvent_CPUStrength;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue1;           // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget5;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton5;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget4;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton4;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget3;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton3;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton2;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          K2Node_Select1_Default;                            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          K2Node_Select2_Default;                            // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSettingNPCMinNum_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSettingNPCMinNum_ReturnValue1;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	ETrainingCPUStrength                          K2Node_Select3_Default;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select4_Default;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBBattleSettings                     K2Node_MakeStruct_AJBBattleSettings;               // 0x011C(0x0008)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting");
static_assert(sizeof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting) == 0x000128, "Wrong size on WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, EntryPoint) == 0x000000, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable) == 0x000004, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_int_Variable) == 0x000008, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_int_Variable1) == 0x00000C, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_int_Variable2) == 0x000010, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_int_Variable3) == 0x000014, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable1) == 0x000018, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable2) == 0x000019, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable3) == 0x00001A, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable4) == 0x00001B, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable5) == 0x00001C, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable6) == 0x00001D, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable7) == 0x00001E, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable8) == 0x00001F, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable9) == 0x000020, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable10) == 0x000021, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable11) == 0x000022, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable12) == 0x000023, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable13) == 0x000024, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable14) == 0x000025, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable15) == 0x000026, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable16) == 0x000027, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable17) == 0x000028, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable18) == 0x000029, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable19) == 0x00002A, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable20) == 0x00002B, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, Temp_byte_Variable21) == 0x00002C, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::Temp_byte_Variable21' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_CustomEvent_Num) == 0x000030, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_CustomEvent_Num' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_CustomEvent_CPUStrength) == 0x000034, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_CustomEvent_CPUStrength' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000036, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_NotEqual_ByteByte_ReturnValue1) == 0x000037, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_NotEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_Select_Default) == 0x000038, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget5) == 0x000040, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget5' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton5) == 0x000048, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton5' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget4) == 0x000050, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget4' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton4) == 0x000058, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton4' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget3) == 0x000060, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget3' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton3) == 0x000068, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton3' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget2) == 0x000070, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton2) == 0x000078, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x000080, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton1) == 0x000088, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000090, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_ComponentBoundEvent_TargetButton) == 0x000098, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_Select1_Default) == 0x0000A4, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_Select2_Default) == 0x0000A5, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A8, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetSettingNPCMinNum_ReturnValue) == 0x0000AC, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetSettingNPCMinNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetSettingNPCMinNum_ReturnValue1) == 0x0000CC, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetSettingNPCMinNum_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_bSuccess) == 0x0000D0, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0000D8, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_Clamp_ReturnValue) == 0x0000E0, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_Select3_Default) == 0x0000F8, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_bSuccess1) == 0x0000F9, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000100, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000108, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000110, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_Select4_Default) == 0x000118, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting, K2Node_MakeStruct_AJBBattleSettings) == 0x00011C, "Member 'WB_StandBy_Setting_C_ExecuteUbergraph_WB_StandBy_Setting::K2Node_MakeStruct_AJBBattleSettings' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_CommonButton_CANCEL_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthUp_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUStrengthDown_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumUp_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_StandBy_Setting_C_BndEvt__WB_ArrowButton_CPUNumDown_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.UpdateCPUStrength
// 0x0001 (0x0001 - 0x0000)
struct WB_StandBy_Setting_C_UpdateCPUStrength final
{
public:
	ETrainingCPUStrength                          CPUStrength;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_UpdateCPUStrength) == 0x000001, "Wrong alignment on WB_StandBy_Setting_C_UpdateCPUStrength");
static_assert(sizeof(WB_StandBy_Setting_C_UpdateCPUStrength) == 0x000001, "Wrong size on WB_StandBy_Setting_C_UpdateCPUStrength");
static_assert(offsetof(WB_StandBy_Setting_C_UpdateCPUStrength, CPUStrength) == 0x000000, "Member 'WB_StandBy_Setting_C_UpdateCPUStrength::CPUStrength' has a wrong offset!");

// Function WB_StandBy_Setting.WB_StandBy_Setting_C.UpdateCPUNum
// 0x0004 (0x0004 - 0x0000)
struct WB_StandBy_Setting_C_UpdateCPUNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StandBy_Setting_C_UpdateCPUNum) == 0x000004, "Wrong alignment on WB_StandBy_Setting_C_UpdateCPUNum");
static_assert(sizeof(WB_StandBy_Setting_C_UpdateCPUNum) == 0x000004, "Wrong size on WB_StandBy_Setting_C_UpdateCPUNum");
static_assert(offsetof(WB_StandBy_Setting_C_UpdateCPUNum, Num) == 0x000000, "Member 'WB_StandBy_Setting_C_UpdateCPUNum::Num' has a wrong offset!");

}

