#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TutorialInGameInputGuide

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_TutorialInGameInputGuide.WB_TutorialInGameInputGuide_C.ExecuteUbergraph_WB_TutorialInGameInputGuide
// 0x0030 (0x0030 - 0x0000)
struct WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_SkillGuide_C*                       K2Node_CustomEvent_SkillGuideWidget;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide) == 0x000008, "Wrong alignment on WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide");
static_assert(sizeof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide) == 0x000030, "Wrong size on WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide");
static_assert(offsetof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide, EntryPoint) == 0x000000, "Member 'WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide, K2Node_CustomEvent_SkillGuideWidget) == 0x000028, "Member 'WB_TutorialInGameInputGuide_C_ExecuteUbergraph_WB_TutorialInGameInputGuide::K2Node_CustomEvent_SkillGuideWidget' has a wrong offset!");

// Function WB_TutorialInGameInputGuide.WB_TutorialInGameInputGuide_C.SetSkillGuide
// 0x0008 (0x0008 - 0x0000)
struct WB_TutorialInGameInputGuide_C_SetSkillGuide final
{
public:
	class UWB_SkillGuide_C*                       SkillGuideWidget_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialInGameInputGuide_C_SetSkillGuide) == 0x000008, "Wrong alignment on WB_TutorialInGameInputGuide_C_SetSkillGuide");
static_assert(sizeof(WB_TutorialInGameInputGuide_C_SetSkillGuide) == 0x000008, "Wrong size on WB_TutorialInGameInputGuide_C_SetSkillGuide");
static_assert(offsetof(WB_TutorialInGameInputGuide_C_SetSkillGuide, SkillGuideWidget_0) == 0x000000, "Member 'WB_TutorialInGameInputGuide_C_SetSkillGuide::SkillGuideWidget_0' has a wrong offset!");

}

