#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItemValue

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "WB_TestModeMenuItemBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TestModeMenuItemValue.WB_TestModeMenuItemValue_C
// 0x0030 (0x0328 - 0x02F8)
class UWB_TestModeMenuItemValue_C : public UWB_TestModeMenuItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_TestModeMenuItemValue_C;         // 0x02F8(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             ValueText;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAlignRight;                                 // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bChangeValue;                                      // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ValueOffsetX;                                      // 0x030C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnChangeValue;                                     // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_TestModeMenuItemValue(int32 EntryPoint);
	void OnCancel();
	void OnDecide();
	void Construct();
	void GetValueText(class FText* OutText);
	bool IsDefaultValue();
	void ValueUp(bool* IsMax);
	void ModifyMaxValue();
	void ModifyMinValue();
	bool ValueDown();
	void UpdateValueText();
	void SetSelectValue(int32 Value);
	void BlinkTextBlock(class UTextBlock* TargetTextBlock);
	void OnPrev();
	void OnNext();
	void PreConstruct(bool IsDesignTime);
	void ModifyLabelColor();
	void CreateText(class UTextBlock** ValueText_0);
	void IsLock(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TestModeMenuItemValue_C">();
	}
	static class UWB_TestModeMenuItemValue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TestModeMenuItemValue_C>();
	}
};
static_assert(alignof(UWB_TestModeMenuItemValue_C) == 0x000008, "Wrong alignment on UWB_TestModeMenuItemValue_C");
static_assert(sizeof(UWB_TestModeMenuItemValue_C) == 0x000328, "Wrong size on UWB_TestModeMenuItemValue_C");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, UberGraphFrame_WB_TestModeMenuItemValue_C) == 0x0002F8, "Member 'UWB_TestModeMenuItemValue_C::UberGraphFrame_WB_TestModeMenuItemValue_C' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, ValueText) == 0x000300, "Member 'UWB_TestModeMenuItemValue_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, bShouldAlignRight) == 0x000308, "Member 'UWB_TestModeMenuItemValue_C::bShouldAlignRight' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, bChangeValue) == 0x000309, "Member 'UWB_TestModeMenuItemValue_C::bChangeValue' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, ValueOffsetX) == 0x00030C, "Member 'UWB_TestModeMenuItemValue_C::ValueOffsetX' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, IsLoop) == 0x000310, "Member 'UWB_TestModeMenuItemValue_C::IsLoop' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItemValue_C, OnChangeValue) == 0x000318, "Member 'UWB_TestModeMenuItemValue_C::OnChangeValue' has a wrong offset!");

}

