#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Window_SelectOperationType

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Window_SelectOperationType.WB_Window_SelectOperationType_C
// 0x00A8 (0x0368 - 0x02C0)
class UWB_Window_SelectOperationType_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TwoButtonRoot;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_1;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_5;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_6;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_8;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_16;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_19;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_20;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_21;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_22;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Belt_L;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Circle1;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_2ButtonTitle;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_C_3;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_YES;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAJBConfirmResult                             ButtonResult;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnFinishedConfirmDispatcher;                       // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         LifeTime;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         CountDownElapsedTime;                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Window_SelectOperationType(int32 EntryPoint);
	void OnOpeningWindow();
	void OnFinishedOpenCurveAnim();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void OnClosingWindow();
	void BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void GetButtonResult(EAJBConfirmResult* Result);
	bool OnInputReleasedUp();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedTouch();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool IsModeless();
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL3();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL3();
	bool OnInputPressedL2();
	bool OnInputPressedL1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Window_SelectOperationType_C">();
	}
	static class UWB_Window_SelectOperationType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Window_SelectOperationType_C>();
	}
};
static_assert(alignof(UWB_Window_SelectOperationType_C) == 0x000008, "Wrong alignment on UWB_Window_SelectOperationType_C");
static_assert(sizeof(UWB_Window_SelectOperationType_C) == 0x000368, "Wrong size on UWB_Window_SelectOperationType_C");
static_assert(offsetof(UWB_Window_SelectOperationType_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_Window_SelectOperationType_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, NewAnimation_1) == 0x0002C8, "Member 'UWB_Window_SelectOperationType_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, TwoButtonRoot) == 0x0002D0, "Member 'UWB_Window_SelectOperationType_C::TwoButtonRoot' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_1) == 0x0002D8, "Member 'UWB_Window_SelectOperationType_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_5) == 0x0002E0, "Member 'UWB_Window_SelectOperationType_C::AJBImage_5' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_6) == 0x0002E8, "Member 'UWB_Window_SelectOperationType_C::AJBImage_6' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_8) == 0x0002F0, "Member 'UWB_Window_SelectOperationType_C::AJBImage_8' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_16) == 0x0002F8, "Member 'UWB_Window_SelectOperationType_C::AJBImage_16' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_19) == 0x000300, "Member 'UWB_Window_SelectOperationType_C::AJBImage_19' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_20) == 0x000308, "Member 'UWB_Window_SelectOperationType_C::AJBImage_20' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_21) == 0x000310, "Member 'UWB_Window_SelectOperationType_C::AJBImage_21' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_22) == 0x000318, "Member 'UWB_Window_SelectOperationType_C::AJBImage_22' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_Belt_L) == 0x000320, "Member 'UWB_Window_SelectOperationType_C::AJBImage_Belt_L' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, AJBImage_Circle1) == 0x000328, "Member 'UWB_Window_SelectOperationType_C::AJBImage_Circle1' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, Txt_2ButtonTitle) == 0x000330, "Member 'UWB_Window_SelectOperationType_C::Txt_2ButtonTitle' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, WB_CommonButton_C_3) == 0x000338, "Member 'UWB_Window_SelectOperationType_C::WB_CommonButton_C_3' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, WB_CommonButton_YES) == 0x000340, "Member 'UWB_Window_SelectOperationType_C::WB_CommonButton_YES' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, ButtonResult) == 0x000348, "Member 'UWB_Window_SelectOperationType_C::ButtonResult' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, OnFinishedConfirmDispatcher) == 0x000350, "Member 'UWB_Window_SelectOperationType_C::OnFinishedConfirmDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, LifeTime) == 0x000360, "Member 'UWB_Window_SelectOperationType_C::LifeTime' has a wrong offset!");
static_assert(offsetof(UWB_Window_SelectOperationType_C, CountDownElapsedTime) == 0x000364, "Member 'UWB_Window_SelectOperationType_C::CountDownElapsedTime' has a wrong offset!");

}

