#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_WaitingOtherPlayers

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_WaitingOtherPlayers.WB_WaitingOtherPlayers_C.ExecuteUbergraph_WB_WaitingOtherPlayers
// 0x0018 (0x0018 - 0x0000)
struct WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers) == 0x000008, "Wrong alignment on WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers");
static_assert(sizeof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers) == 0x000018, "Wrong size on WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, EntryPoint) == 0x000000, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000008, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000010, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, Temp_bool_IsClosed_Variable) == 0x000012, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers, CallFunc_IsValid_ReturnValue) == 0x000013, "Member 'WB_WaitingOtherPlayers_C_ExecuteUbergraph_WB_WaitingOtherPlayers::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

