#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_KIR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_KIR.ABP_AJBInGameCharacter_KIR_C
// 0x04F8 (0x0850 - 0x0358)
class UABP_AJBInGameCharacter_KIR_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_139E81E54729FCA17837919AAD398EF9; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_139E81E54729FCA17837919AAD398EF9; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_139E81E54729FCA17837919AAD398EF9; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_139E81E54729FCA17837919AAD398EF9; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_139E81E54729FCA17837919AAD398EF9; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_139E81E54729FCA17837919AAD398EF9; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_139E81E54729FCA17837919AAD398EF9; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_139E81E54729FCA17837919AAD398EF9; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_139E81E54729FCA17837919AAD398EF9; // 0x03A8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_37349C7E4D3CB1C0B47DE7BE571CC002; // 0x0470(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1E538FFA44511B24F98ED1B6FFD92256; // 0x04E0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D9D3728648ECF6292B7DD1812DDB81AC; // 0x0528(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C01DD287440BD76A18E567968AFC0E2C; // 0x0608(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4E1EFFFE4F7C704E7D1B24A2DBC0C940; // 0x06E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C2002125445DD42D74A53DB0A71CF772; // 0x0738(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_D15F4A604BC19DFEF7B8C4ABB18ECFE2; // 0x0788(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_KIR(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameCharacter_KIR_C">();
	}
	static class UABP_AJBInGameCharacter_KIR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_KIR_C>();
	}
};
static_assert(alignof(UABP_AJBInGameCharacter_KIR_C) == 0x000008, "Wrong alignment on UABP_AJBInGameCharacter_KIR_C");
static_assert(sizeof(UABP_AJBInGameCharacter_KIR_C) == 0x000850, "Wrong size on UABP_AJBInGameCharacter_KIR_C");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameCharacter_KIR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_JumpLoop_139E81E54729FCA17837919AAD398EF9) == 0x000368, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_JumpLoop_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_JumpStart_139E81E54729FCA17837919AAD398EF9) == 0x000370, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_JumpStart_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_DeathLoop_139E81E54729FCA17837919AAD398EF9) == 0x000378, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_DeathLoop_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_Dash_139E81E54729FCA17837919AAD398EF9) == 0x000380, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_Dash_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_BS_Run_139E81E54729FCA17837919AAD398EF9) == 0x000388, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_BS_Run_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_BS_Walk_139E81E54729FCA17837919AAD398EF9) == 0x000390, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_BS_Walk_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_CIdle_139E81E54729FCA17837919AAD398EF9) == 0x000398, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_CIdle_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, __SUBINSTANCE_AS_Idle_139E81E54729FCA17837919AAD398EF9) == 0x0003A0, "Member 'UABP_AJBInGameCharacter_KIR_C::__SUBINSTANCE_AS_Idle_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_SubInstance_139E81E54729FCA17837919AAD398EF9) == 0x0003A8, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_SubInstance_139E81E54729FCA17837919AAD398EF9' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_Slot_37349C7E4D3CB1C0B47DE7BE571CC002) == 0x000470, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_Slot_37349C7E4D3CB1C0B47DE7BE571CC002' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_Root_1E538FFA44511B24F98ED1B6FFD92256) == 0x0004E0, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_Root_1E538FFA44511B24F98ED1B6FFD92256' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_LayeredBoneBlend_D9D3728648ECF6292B7DD1812DDB81AC) == 0x000528, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_LayeredBoneBlend_D9D3728648ECF6292B7DD1812DDB81AC' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_SaveCachedPose_C01DD287440BD76A18E567968AFC0E2C) == 0x000608, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_SaveCachedPose_C01DD287440BD76A18E567968AFC0E2C' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_UseCachedPose_4E1EFFFE4F7C704E7D1B24A2DBC0C940) == 0x0006E8, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_UseCachedPose_4E1EFFFE4F7C704E7D1B24A2DBC0C940' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_UseCachedPose_C2002125445DD42D74A53DB0A71CF772) == 0x000738, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_UseCachedPose_C2002125445DD42D74A53DB0A71CF772' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_KIR_C, AnimGraphNode_SubInstance_D15F4A604BC19DFEF7B8C4ABB18ECFE2) == 0x000788, "Member 'UABP_AJBInGameCharacter_KIR_C::AnimGraphNode_SubInstance_D15F4A604BC19DFEF7B8C4ABB18ECFE2' has a wrong offset!");

}

