#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameSub_SkillActivated

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.OnSkillInactive
// 0x0010 (0x0010 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive final
{
public:
	class UBP_AJBSkillBase_C*                     InactiveSkill;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRenaturation;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive) == 0x000008, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive) == 0x000010, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive, InactiveSkill) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive::InactiveSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive, bRenaturation) == 0x000008, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillInactive::bRenaturation' has a wrong offset!");

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.OnSkillActivated
// 0x0010 (0x0010 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated final
{
public:
	class UBP_AJBSkillBase_C*                     ActiveSkill;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRenaturation;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated) == 0x000008, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated) == 0x000010, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated, ActiveSkill) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated::ActiveSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated, bRenaturation) == 0x000008, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillActivated::bRenaturation' has a wrong offset!");

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.OnSkillReady
// 0x0010 (0x0010 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_OnSkillReady final
{
public:
	class UBP_AJBSkillBase_C*                     ReadySkill;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRenaturation;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_OnSkillReady) == 0x000008, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_OnSkillReady");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_OnSkillReady) == 0x000010, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_OnSkillReady");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillReady, ReadySkill) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillReady::ReadySkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_OnSkillReady, bRenaturation) == 0x000008, "Member 'ABP_AJBInGameSub_SkillActivated_C_OnSkillReady::bRenaturation' has a wrong offset!");

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated
// 0x0220 (0x0220 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperatingSeparatedStand_ReturnValue;    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue3;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue4;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue5;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperatingSeparatedStand_ReturnValue1;   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue6;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxMoveSpeed_MaxSpeed;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue7;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_AJBSkillBase_C* InactiveSkill, bool bRenaturation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ReadySkill;                     // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRenaturation2;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_AJBSkillBase_C* ActiveSkill, bool bRenaturation)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ActiveSkill;                    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRenaturation1;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_InactiveSkill;                  // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRenaturation;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_AJBSkillBase_C* ReadySkill, bool bRenaturation)> K2Node_CreateDelegate_OutputDelegate2;             // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue8;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bImmediate;                     // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DF[0x1];                                      // 0x01DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable4;                              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            Temp_byte_Variable;                                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue2;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue3;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated) == 0x000010, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated) == 0x000220, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, EntryPoint) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_float_Variable) == 0x000004, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_bool_Variable) == 0x00000C, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_Select_Default) == 0x000010, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetMovementComponent_ReturnValue) == 0x000030, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsCrouching_ReturnValue) == 0x000039, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue1) == 0x000040, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000048, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x000058, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000060, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_bool_Variable1) == 0x000069, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsOperatingSeparatedStand_ReturnValue) == 0x00006A, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsOperatingSeparatedStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue1) == 0x00006B, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue3) == 0x000070, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000078, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess3) == 0x000080, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue4) == 0x000088, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000090, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess4) == 0x000098, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue5) == 0x0000A0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x0000A8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess5) == 0x0000B0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsOperatingSeparatedStand_ReturnValue1) == 0x0000B1, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsOperatingSeparatedStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue2) == 0x0000B2, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue3) == 0x0000B3, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue4) == 0x0000B4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000B5, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanAND_ReturnValue) == 0x0000B6, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue5) == 0x0000B7, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x0000B8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000BC, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanOR_ReturnValue) == 0x0000BD, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanOR_ReturnValue1) == 0x0000BE, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000BF, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue6) == 0x0000C0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue6) == 0x0000C8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0000D0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess6) == 0x0000D8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_float_Variable1) == 0x0000DC, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetMaxMoveSpeed_MaxSpeed) == 0x0000E0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetMaxMoveSpeed_MaxSpeed' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetMaxSpeed_ReturnValue) == 0x0000E4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue7) == 0x0000E8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_bool_Variable2) == 0x0000F0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetVelocity_ReturnValue) == 0x0000F4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_GetTransform_ReturnValue) == 0x000100, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_InverseTransformDirection_ReturnValue) == 0x000130, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CreateDelegate_OutputDelegate) == 0x000140, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BreakVector_X) == 0x000150, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BreakVector_Y) == 0x000154, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BreakVector_Z) == 0x000158, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_ReadySkill) == 0x000160, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_ReadySkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_bRenaturation2) == 0x000168, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_bRenaturation2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CreateDelegate_OutputDelegate1) == 0x000170, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_SwitchEnum1_CmpSuccess) == 0x000180, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_ActiveSkill) == 0x000188, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_ActiveSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_bRenaturation1) == 0x000190, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_bRenaturation1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_InactiveSkill) == 0x000198, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_InactiveSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_bRenaturation) == 0x0001A0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_bRenaturation' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_Select1_Default) == 0x0001A4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_SwitchEnum2_CmpSuccess) == 0x0001A8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_SwitchEnum3_CmpSuccess) == 0x0001A9, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_SwitchEnum4_CmpSuccess) == 0x0001AA, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CreateDelegate_OutputDelegate2) == 0x0001B0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanAND_ReturnValue1) == 0x0001C0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001C1, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanOR_ReturnValue2) == 0x0001C2, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsValid_ReturnValue1) == 0x0001C3, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_BooleanOR_ReturnValue3) == 0x0001C4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_TryGetPawnOwner_ReturnValue8) == 0x0001C8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_TryGetPawnOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x0001D0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_DynamicCast_bSuccess7) == 0x0001D8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_bool_Has_Been_Initd_Variable) == 0x0001D9, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_bool_IsClosed_Variable) == 0x0001DA, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x0001DB, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Not_PreBool_ReturnValue7) == 0x0001DC, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Not_PreBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_CustomEvent_bImmediate) == 0x0001DD, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_CustomEvent_bImmediate' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsValid_ReturnValue2) == 0x0001DE, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_float_Variable2) == 0x0001E0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_float_Variable3) == 0x0001E4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_float_Variable4) == 0x0001E8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, Temp_byte_Variable) == 0x0001EC, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_Select2_Default) == 0x0001F0, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_FInterpTo_ReturnValue) == 0x0001F4, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001F8, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0001FC, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000200, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_FInterpTo_ReturnValue1) == 0x000204, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_FInterpTo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, K2Node_Select3_Default) == 0x000208, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_FInterpTo_ReturnValue2) == 0x00020C, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_FInterpTo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_FInterpTo_ReturnValue3) == 0x000210, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_FInterpTo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000214, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_FMax_ReturnValue) == 0x000218, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated, CallFunc_IsValid_ReturnValue3) == 0x00021C, "Member 'ABP_AJBInGameSub_SkillActivated_C_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C.EndTestFlowAnimation
// 0x0001 (0x0001 - 0x0000)
struct ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation) == 0x000001, "Wrong alignment on ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation");
static_assert(sizeof(ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation) == 0x000001, "Wrong size on ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation");
static_assert(offsetof(ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation, bImmediate) == 0x000000, "Member 'ABP_AJBInGameSub_SkillActivated_C_EndTestFlowAnimation::bImmediate' has a wrong offset!");

}

