#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameSub_SkillActivated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C
// 0x0D78 (0x10D0 - 0x0358)
class UABP_AJBInGameSub_SkillActivated_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F6485962458765D49BD88CA63B15CA6D; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8BECA815435C718D7B45448262A9F604; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_620DACF84CE019C810CA57967FD73EDB; // 0x03F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C65DB38F4C939CFBF47D9CB6356B1A8C; // 0x0440(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B95D1F2842E136BBA4978EA50521AF2B; // 0x0488(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_937C0D4E4B0280BC34703F8EDF21CE37; // 0x04D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E5F0DA8943D741911AD8748B43ABC54C; // 0x0518(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8344C4F5422FC8FC8F2EF7BCD9597DBC; // 0x0560(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77B4C9094C35028E9A76908D8A3B015F; // 0x05A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68DEE91848BB44D085D3418E98E9DFEC; // 0x05F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4D8C145940D40496FB1F6E924596B347; // 0x0638(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_47EC13144BD47268343EBDB3E6B78D52; // 0x0680(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_37F5F3BA42454FFBFE06C094690783AF; // 0x07A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7A25D13D4C51613495D271B2A6A5224B; // 0x07F0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C901D95746426061406F7A9F4858D1C3; // 0x08A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DEBCCADC44DBE2F5B963B8B4898ABBF2; // 0x08E8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_DDA380424259294E07CA0A98EAF8B248; // 0x0998(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8B8F032547C5CA7A31C3FEBD91298A0A; // 0x09E0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6CAFC0C84375F843E32D2A9401F81A0D; // 0x0AC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D6C6038C49E700CD9908C481C9ED9033; // 0x0B08(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8CA792394E7D08AD04B278B09F24578E; // 0x0BB8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_355FD55041EDBB8026306EBA9DC8D06B; // 0x0C00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D6C4B584462C4AFE89F72BB5F952F130; // 0x0C48(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_02759F3D45FAF3283C1CDABDCBFC72B3; // 0x0CF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20C72D3E4D7E24DB236D93A6F6DB2721; // 0x0D40(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_88AE9B3F4D728376752D4EB08E7788CB; // 0x0DF0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E14CC0724372F15CC8F066AE6F56AB56; // 0x0E38(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA; // 0x0F18(0x00E0)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_5C05AFD94E71AA812BC57AB0C2D8583B; // 0x0FF8(0x0068)()
	class UAnimSequenceBase*                      AS_SkillAnimation01;                               // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_SkillAnimation02;                               // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkillAnimationBlendWeight;                         // 0x1070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCrouch;                                         // 0x1074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDash;                                           // 0x1075(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1076[0x2];                                     // 0x1076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSkillAnimationIdx;                          // 0x1078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugSkillAnimation;                              // 0x107C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bActiveSkillAnimation;                             // 0x107D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_107E[0x2];                                     // 0x107E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndSkillAnimationInterpSpeed;                      // 0x1080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginSkillAnimationInterpSpeed;                    // 0x1084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTestFlow;                                      // 0x1088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTestFlow;                                         // 0x1089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_108A[0x6];                                     // 0x108A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      AS_TestFlowStart;                                  // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_TestFlowLoop;                                   // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSidling;                                        // 0x10A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A1[0x3];                                     // 0x10A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementVectorRight_CameraSpace;                   // 0x10A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorForward_CameraSpace;                 // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetRight;                                       // 0x10AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetForward;                                     // 0x10B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementInterpSpeed;                               // 0x10B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestFlowEndTime;                                   // 0x10B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestFlowEndLeftTime;                               // 0x10BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeRemaining_TestFlowStart_TestFlowLoop;          // 0x10C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReadyAnimationSkip;                               // 0x10C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C5[0x3];                                     // 0x10C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x10C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActivateWhenUsedUltimateSkill;                    // 0x10CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_937C0D4E4B0280BC34703F8EDF21CE37();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_E5F0DA8943D741911AD8748B43ABC54C();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_20C72D3E4D7E24DB236D93A6F6DB2721();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_D6C4B584462C4AFE89F72BB5F952F130();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_7A25D13D4C51613495D271B2A6A5224B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendSpacePlayer_47EC13144BD47268343EBDB3E6B78D52();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_4D8C145940D40496FB1F6E924596B347();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_68DEE91848BB44D085D3418E98E9DFEC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_C65DB38F4C939CFBF47D9CB6356B1A8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_77B4C9094C35028E9A76908D8A3B015F();
	void OnSkillInactive(class UBP_AJBSkillBase_C* InactiveSkill, bool bRenaturation);
	void OnSkillActivated(class UBP_AJBSkillBase_C* ActiveSkill, bool bRenaturation);
	void OnSkillReady(class UBP_AJBSkillBase_C* ReadySkill, bool bRenaturation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_B95D1F2842E136BBA4978EA50521AF2B();
	void ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated(int32 EntryPoint);
	void EndTestFlowAnimation(bool bImmediate);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_8BECA815435C718D7B45448262A9F604();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_620DACF84CE019C810CA57967FD73EDB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameSub_SkillActivated_C">();
	}
	static class UABP_AJBInGameSub_SkillActivated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameSub_SkillActivated_C>();
	}
};
static_assert(alignof(UABP_AJBInGameSub_SkillActivated_C) == 0x000008, "Wrong alignment on UABP_AJBInGameSub_SkillActivated_C");
static_assert(sizeof(UABP_AJBInGameSub_SkillActivated_C) == 0x0010D0, "Wrong size on UABP_AJBInGameSub_SkillActivated_C");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameSub_SkillActivated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_Root_F6485962458765D49BD88CA63B15CA6D) == 0x000368, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_Root_F6485962458765D49BD88CA63B15CA6D' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_8BECA815435C718D7B45448262A9F604) == 0x0003B0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_8BECA815435C718D7B45448262A9F604' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_620DACF84CE019C810CA57967FD73EDB) == 0x0003F8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_620DACF84CE019C810CA57967FD73EDB' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_C65DB38F4C939CFBF47D9CB6356B1A8C) == 0x000440, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_C65DB38F4C939CFBF47D9CB6356B1A8C' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_B95D1F2842E136BBA4978EA50521AF2B) == 0x000488, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_B95D1F2842E136BBA4978EA50521AF2B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_937C0D4E4B0280BC34703F8EDF21CE37) == 0x0004D0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_937C0D4E4B0280BC34703F8EDF21CE37' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_E5F0DA8943D741911AD8748B43ABC54C) == 0x000518, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_E5F0DA8943D741911AD8748B43ABC54C' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_8344C4F5422FC8FC8F2EF7BCD9597DBC) == 0x000560, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_8344C4F5422FC8FC8F2EF7BCD9597DBC' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_77B4C9094C35028E9A76908D8A3B015F) == 0x0005A8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_77B4C9094C35028E9A76908D8A3B015F' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_68DEE91848BB44D085D3418E98E9DFEC) == 0x0005F0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_68DEE91848BB44D085D3418E98E9DFEC' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_4D8C145940D40496FB1F6E924596B347) == 0x000638, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_4D8C145940D40496FB1F6E924596B347' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_BlendSpacePlayer_47EC13144BD47268343EBDB3E6B78D52) == 0x000680, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_BlendSpacePlayer_47EC13144BD47268343EBDB3E6B78D52' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_37F5F3BA42454FFBFE06C094690783AF) == 0x0007A8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_37F5F3BA42454FFBFE06C094690783AF' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SequencePlayer_7A25D13D4C51613495D271B2A6A5224B) == 0x0007F0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SequencePlayer_7A25D13D4C51613495D271B2A6A5224B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_C901D95746426061406F7A9F4858D1C3) == 0x0008A0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_C901D95746426061406F7A9F4858D1C3' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SequencePlayer_DEBCCADC44DBE2F5B963B8B4898ABBF2) == 0x0008E8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SequencePlayer_DEBCCADC44DBE2F5B963B8B4898ABBF2' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_DDA380424259294E07CA0A98EAF8B248) == 0x000998, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_DDA380424259294E07CA0A98EAF8B248' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateMachine_8B8F032547C5CA7A31C3FEBD91298A0A) == 0x0009E0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateMachine_8B8F032547C5CA7A31C3FEBD91298A0A' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_6CAFC0C84375F843E32D2A9401F81A0D) == 0x000AC0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_6CAFC0C84375F843E32D2A9401F81A0D' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SequencePlayer_D6C6038C49E700CD9908C481C9ED9033) == 0x000B08, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SequencePlayer_D6C6038C49E700CD9908C481C9ED9033' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_8CA792394E7D08AD04B278B09F24578E) == 0x000BB8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_8CA792394E7D08AD04B278B09F24578E' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_TransitionResult_355FD55041EDBB8026306EBA9DC8D06B) == 0x000C00, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_TransitionResult_355FD55041EDBB8026306EBA9DC8D06B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SequencePlayer_D6C4B584462C4AFE89F72BB5F952F130) == 0x000C48, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SequencePlayer_D6C4B584462C4AFE89F72BB5F952F130' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_02759F3D45FAF3283C1CDABDCBFC72B3) == 0x000CF8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_02759F3D45FAF3283C1CDABDCBFC72B3' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SequencePlayer_20C72D3E4D7E24DB236D93A6F6DB2721) == 0x000D40, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SequencePlayer_20C72D3E4D7E24DB236D93A6F6DB2721' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateResult_88AE9B3F4D728376752D4EB08E7788CB) == 0x000DF0, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateResult_88AE9B3F4D728376752D4EB08E7788CB' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_StateMachine_E14CC0724372F15CC8F066AE6F56AB56) == 0x000E38, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_StateMachine_E14CC0724372F15CC8F066AE6F56AB56' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA) == 0x000F18, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AnimGraphNode_SubInput_5C05AFD94E71AA812BC57AB0C2D8583B) == 0x000FF8, "Member 'UABP_AJBInGameSub_SkillActivated_C::AnimGraphNode_SubInput_5C05AFD94E71AA812BC57AB0C2D8583B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AS_SkillAnimation01) == 0x001060, "Member 'UABP_AJBInGameSub_SkillActivated_C::AS_SkillAnimation01' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AS_SkillAnimation02) == 0x001068, "Member 'UABP_AJBInGameSub_SkillActivated_C::AS_SkillAnimation02' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, SkillAnimationBlendWeight) == 0x001070, "Member 'UABP_AJBInGameSub_SkillActivated_C::SkillAnimationBlendWeight' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bIsCrouch) == 0x001074, "Member 'UABP_AJBInGameSub_SkillActivated_C::bIsCrouch' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bIsDash) == 0x001075, "Member 'UABP_AJBInGameSub_SkillActivated_C::bIsDash' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, CurrentSkillAnimationIdx) == 0x001078, "Member 'UABP_AJBInGameSub_SkillActivated_C::CurrentSkillAnimationIdx' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bDebugSkillAnimation) == 0x00107C, "Member 'UABP_AJBInGameSub_SkillActivated_C::bDebugSkillAnimation' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bActiveSkillAnimation) == 0x00107D, "Member 'UABP_AJBInGameSub_SkillActivated_C::bActiveSkillAnimation' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, EndSkillAnimationInterpSpeed) == 0x001080, "Member 'UABP_AJBInGameSub_SkillActivated_C::EndSkillAnimationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, BeginSkillAnimationInterpSpeed) == 0x001084, "Member 'UABP_AJBInGameSub_SkillActivated_C::BeginSkillAnimationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bUseTestFlow) == 0x001088, "Member 'UABP_AJBInGameSub_SkillActivated_C::bUseTestFlow' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bTestFlow) == 0x001089, "Member 'UABP_AJBInGameSub_SkillActivated_C::bTestFlow' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, AS_TestFlowStart) == 0x001090, "Member 'UABP_AJBInGameSub_SkillActivated_C::AS_TestFlowStart' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, BS_TestFlowLoop) == 0x001098, "Member 'UABP_AJBInGameSub_SkillActivated_C::BS_TestFlowLoop' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bIsSidling) == 0x0010A0, "Member 'UABP_AJBInGameSub_SkillActivated_C::bIsSidling' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, MovementVectorRight_CameraSpace) == 0x0010A4, "Member 'UABP_AJBInGameSub_SkillActivated_C::MovementVectorRight_CameraSpace' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, MovementVectorForward_CameraSpace) == 0x0010A8, "Member 'UABP_AJBInGameSub_SkillActivated_C::MovementVectorForward_CameraSpace' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, TargetRight) == 0x0010AC, "Member 'UABP_AJBInGameSub_SkillActivated_C::TargetRight' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, TargetForward) == 0x0010B0, "Member 'UABP_AJBInGameSub_SkillActivated_C::TargetForward' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, MovementInterpSpeed) == 0x0010B4, "Member 'UABP_AJBInGameSub_SkillActivated_C::MovementInterpSpeed' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, TestFlowEndTime) == 0x0010B8, "Member 'UABP_AJBInGameSub_SkillActivated_C::TestFlowEndTime' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, TestFlowEndLeftTime) == 0x0010BC, "Member 'UABP_AJBInGameSub_SkillActivated_C::TestFlowEndLeftTime' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, TimeRemaining_TestFlowStart_TestFlowLoop) == 0x0010C0, "Member 'UABP_AJBInGameSub_SkillActivated_C::TimeRemaining_TestFlowStart_TestFlowLoop' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bReadyAnimationSkip) == 0x0010C4, "Member 'UABP_AJBInGameSub_SkillActivated_C::bReadyAnimationSkip' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, DeltaSeconds) == 0x0010C8, "Member 'UABP_AJBInGameSub_SkillActivated_C::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameSub_SkillActivated_C, bActivateWhenUsedUltimateSkill) == 0x0010CC, "Member 'UABP_AJBInGameSub_SkillActivated_C::bActivateWhenUsedUltimateSkill' has a wrong offset!");

}

