#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInstantWall

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_AJBInstantWall.ABP_AJBInstantWall_C.ExecuteUbergraph_ABP_AJBInstantWall
// 0x0040 (0x0040 - 0x0000)
struct ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementDynamicBase_C*          K2Node_DynamicCast_AsBP_AJBPlacement_Dynamic_Base; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall) == 0x000008, "Wrong alignment on ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall");
static_assert(sizeof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall) == 0x000040, "Wrong size on ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, EntryPoint) == 0x000000, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_IsValid_ReturnValue1) == 0x00000C, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, K2Node_DynamicCast_AsBP_AJBPlacement_Dynamic_Base) == 0x000018, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::K2Node_DynamicCast_AsBP_AJBPlacement_Dynamic_Base' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000024, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_IsValid_ReturnValue2) == 0x000029, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_GetObjectClass_ReturnValue) == 0x000030, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'ABP_AJBInstantWall_C_ExecuteUbergraph_ABP_AJBInstantWall::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function ABP_AJBInstantWall.ABP_AJBInstantWall_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBInstantWall_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInstantWall_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBInstantWall_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBInstantWall_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBInstantWall_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBInstantWall_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBInstantWall_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

