#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_DDW

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_AJBInGameStand_DDW.ABP_AJBInGameStand_DDW_C.ExecuteUbergraph_ABP_AJBInGameStand_DDW
// 0x0070 (0x0070 - 0x0000)
struct ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOwnerMove_bCanMove;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW) == 0x000008, "Wrong alignment on ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW");
static_assert(sizeof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW) == 0x000070, "Wrong size on ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, EntryPoint) == 0x000000, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_CanOwnerMove_bCanMove) == 0x000004, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_CanOwnerMove_bCanMove' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_GetVelocity_ReturnValue) == 0x000034, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_GetMaxSpeed_ReturnValue) == 0x000040, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_BreakVector_X) == 0x000044, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_BreakVector_Y) == 0x000048, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_BreakVector_Z) == 0x00004C, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_MakeVector_ReturnValue) == 0x000054, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_IsValid_ReturnValue1) == 0x000064, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'ABP_AJBInGameStand_DDW_C_ExecuteUbergraph_ABP_AJBInGameStand_DDW::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function ABP_AJBInGameStand_DDW.ABP_AJBInGameStand_DDW_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBInGameStand_DDW_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AJBInGameStand_DDW.ABP_AJBInGameStand_DDW_C.CanOwnerMove
// 0x0002 (0x0002 - 0x0000)
struct ABP_AJBInGameStand_DDW_C_CanOwnerMove final
{
public:
	bool                                          bCanMove;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameStand_DDW_C_CanOwnerMove) == 0x000001, "Wrong alignment on ABP_AJBInGameStand_DDW_C_CanOwnerMove");
static_assert(sizeof(ABP_AJBInGameStand_DDW_C_CanOwnerMove) == 0x000002, "Wrong size on ABP_AJBInGameStand_DDW_C_CanOwnerMove");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_CanOwnerMove, bCanMove) == 0x000000, "Member 'ABP_AJBInGameStand_DDW_C_CanOwnerMove::bCanMove' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_DDW_C_CanOwnerMove, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'ABP_AJBInGameStand_DDW_C_CanOwnerMove::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

