#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStandPart_STFString

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameStandPart_STFString.ABP_AJBInGameStandPart_STFString_C
// 0x0398 (0x06F0 - 0x0358)
class UABP_AJBInGameStandPart_STFString_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_C86160AE4D7176D3E825D0BA4F81893B; // 0x0368(0x0048)()
	struct FAnimNode_SplineIK                     AnimGraphNode_SplineIK_43450B1B43871686F7AD249A2D7C5442; // 0x03B0(0x02B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_03E4C77246514D3F4B848588C79526A5; // 0x0668(0x0048)()
	float                                         ExtendProgress;                                    // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HookLocation;                                      // 0x06B4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             StringEndTransform;                                // 0x06C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameStandPart_STFString(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStandPart_STFString_AnimGraphNode_SplineIK_43450B1B43871686F7AD249A2D7C5442();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameStandPart_STFString_C">();
	}
	static class UABP_AJBInGameStandPart_STFString_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStandPart_STFString_C>();
	}
};
static_assert(alignof(UABP_AJBInGameStandPart_STFString_C) == 0x000010, "Wrong alignment on UABP_AJBInGameStandPart_STFString_C");
static_assert(sizeof(UABP_AJBInGameStandPart_STFString_C) == 0x0006F0, "Wrong size on UABP_AJBInGameStandPart_STFString_C");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameStandPart_STFString_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, AnimGraphNode_Root_C86160AE4D7176D3E825D0BA4F81893B) == 0x000368, "Member 'UABP_AJBInGameStandPart_STFString_C::AnimGraphNode_Root_C86160AE4D7176D3E825D0BA4F81893B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, AnimGraphNode_SplineIK_43450B1B43871686F7AD249A2D7C5442) == 0x0003B0, "Member 'UABP_AJBInGameStandPart_STFString_C::AnimGraphNode_SplineIK_43450B1B43871686F7AD249A2D7C5442' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, AnimGraphNode_ComponentToLocalSpace_03E4C77246514D3F4B848588C79526A5) == 0x000668, "Member 'UABP_AJBInGameStandPart_STFString_C::AnimGraphNode_ComponentToLocalSpace_03E4C77246514D3F4B848588C79526A5' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, ExtendProgress) == 0x0006B0, "Member 'UABP_AJBInGameStandPart_STFString_C::ExtendProgress' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, HookLocation) == 0x0006B4, "Member 'UABP_AJBInGameStandPart_STFString_C::HookLocation' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameStandPart_STFString_C, StringEndTransform) == 0x0006C0, "Member 'UABP_AJBInGameStandPart_STFString_C::StringEndTransform' has a wrong offset!");

}

