#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AJBIngameUtilFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_SkillInfo_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "E_StencilDigit_structs.hpp"
#include "ST_DamageInfo_structs.hpp"
#include "ST_TraceInfo_structs.hpp"


namespace SDK::Params
{

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.CuttingDamage
// 0x0070 (0x0070 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_CuttingDamage final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BaseDamage;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePriority                               DamagePriority;                                    // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackDistance;                                    // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CuttingRate;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPenetrateAP;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WithSeparatedStandAttack;                          // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempCuttingRate;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TempDamageIsCut;                                   // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcDamage_DamageForHPAP;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcDamage_DamageForAAP;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcDamage_CutDamage;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcDamage_bRemainHP;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcDamage_bDamageIsCutByAAP;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_CuttingDamage) == 0x000008, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_CuttingDamage");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_CuttingDamage) == 0x000070, "Wrong size on AJBIngameUtilFunctionLibrary_C_CuttingDamage");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, DamagedActor) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, BaseDamage) == 0x000008, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::BaseDamage' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, DamageType) == 0x000010, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::DamageType' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, SerialNumber) == 0x000018, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::SerialNumber' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, DamagePriority) == 0x00001C, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::DamagePriority' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, AttackDistance) == 0x000020, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::AttackDistance' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CuttingRate) == 0x000024, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CuttingRate' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, DamageCauser) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, bPenetrateAP) == 0x000030, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::bPenetrateAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, WithSeparatedStandAttack) == 0x000031, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::WithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, bNotUseCollision) == 0x000032, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::bNotUseCollision' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, __WorldContext) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, TempCuttingRate) == 0x000040, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::TempCuttingRate' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, TempDamageIsCut) == 0x000044, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::TempDamageIsCut' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_MakeLiteralBool_ReturnValue) == 0x000045, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_CalcDamage_DamageForHPAP) == 0x000048, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_CalcDamage_DamageForHPAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_CalcDamage_DamageForAAP) == 0x00004C, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_CalcDamage_DamageForAAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_CalcDamage_CutDamage) == 0x000050, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_CalcDamage_CutDamage' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_CalcDamage_bRemainHP) == 0x000054, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_CalcDamage_bRemainHP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, CallFunc_CalcDamage_bDamageIsCutByAAP) == 0x000055, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::CallFunc_CalcDamage_bDamageIsCutByAAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, K2Node_DynamicCast_AsBI_AJBInterface) == 0x000058, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::K2Node_DynamicCast_AsBI_AJBInterface' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_CuttingDamage, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AJBIngameUtilFunctionLibrary_C_CuttingDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.RandomPointInCircle
// 0x0070 (0x0070 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_RandomPointInCircle final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Length;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radian;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle) == 0x000008, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_RandomPointInCircle");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle) == 0x000070, "Wrong size on AJBIngameUtilFunctionLibrary_C_RandomPointInCircle");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, Origin) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::Origin' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, Radius) == 0x00000C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::Radius' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, __WorldContext) == 0x000010, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, ReturnValue) == 0x000018, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, Length) == 0x000024, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::Length' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, Radian) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::Radian' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Sin_ReturnValue) == 0x00002C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Cos_ReturnValue) == 0x000030, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_RandomFloatInRange_ReturnValue) == 0x00003C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Sqrt_ReturnValue) == 0x00004C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00005C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_RandomFloatInRange_ReturnValue1) == 0x000060, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_GetPI_ReturnValue) == 0x000064, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000068, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_RandomPointInCircle, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x00006C, "Member 'AJBIngameUtilFunctionLibrary_C_RandomPointInCircle::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.GetResolutionScale
// 0x0040 (0x0040 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_GetResolutionScale final
{
public:
	class AActor*                                 WorldActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Scale;                                             // 0x0010(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale) == 0x000008, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_GetResolutionScale");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale) == 0x000040, "Wrong size on AJBIngameUtilFunctionLibrary_C_GetResolutionScale");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, WorldActor) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::WorldActor' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, __WorldContext) == 0x000008, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, Scale) == 0x000010, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::Scale' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000018, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_GetViewportSize_ReturnValue) == 0x00001C, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_MakeLiteralFloat_ReturnValue1) == 0x000024, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_MakeLiteralFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_BreakVector2D_X) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000034, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetResolutionScale, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_GetResolutionScale::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.GetViewRotation
// 0x0690 (0x0690 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_GetViewRotation final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBHighlightSpectatorPawn_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class UAJBHighlightManager*                   CallFunc_GetHighlightManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBHighlightSpectatorPawn_C*        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0084(0x000C)(IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue1;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       CallFunc_GetCameraView_DesiredView;                // 0x00C0(0x0570)()
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue1;               // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue2;         // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651[0x3];                                      // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue1;            // 0x0654(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x0660(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x066C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue1;          // 0x0678(0x000C)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_GetViewRotation) == 0x000010, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_GetViewRotation");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_GetViewRotation) == 0x000690, "Wrong size on AJBIngameUtilFunctionLibrary_C_GetViewRotation");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, Actor) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::Actor' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, __WorldContext) == 0x000008, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, Rotation) == 0x000010, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::Rotation' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetAJBGameInstance_bSuccess) == 0x00001C, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000020, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetHighlightManager_ReturnValue) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetHighlightManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_Array_Get_Item) == 0x000040, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsPlayingReplay_ReturnValue) == 0x000048, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetForwardVector_ReturnValue) == 0x00005C, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000074, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_FindLookAtRotation_ReturnValue) == 0x000084, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000098, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x0000A0, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetViewTarget_ReturnValue) == 0x0000A8, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetComponentByClass_ReturnValue1) == 0x0000B0, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetCameraView_DesiredView) == 0x0000C0, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetCameraView_DesiredView' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsValid_ReturnValue1) == 0x000630, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetViewTarget_ReturnValue1) == 0x000638, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetViewTarget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsValid_ReturnValue2) == 0x000640, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsValid_ReturnValue3) == 0x000641, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetComponentByClass_ReturnValue2) == 0x000648, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_IsValid_ReturnValue4) == 0x000650, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_GetForwardVector_ReturnValue1) == 0x000654, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_GetForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x000660, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_Add_VectorVector_ReturnValue1) == 0x00066C, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetViewRotation, CallFunc_FindLookAtRotation_ReturnValue1) == 0x000678, "Member 'AJBIngameUtilFunctionLibrary_C_GetViewRotation::CallFunc_FindLookAtRotation_ReturnValue1' has a wrong offset!");

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.GetScreenCenterPosition
// 0x0040 (0x0040 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition final
{
public:
	class AActor*                                 WorldActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PosX;                                              // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PosY;                                              // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetResolutionScale_Scale;                 // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition) == 0x000008, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition) == 0x000040, "Wrong size on AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, WorldActor) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::WorldActor' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, __WorldContext) == 0x000008, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, PosX) == 0x000010, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::PosX' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, PosY) == 0x000014, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::PosY' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000018, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_GetResolutionScale_Scale) == 0x00001C, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_GetResolutionScale_Scale' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_BreakVector2D_X) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_MakeLiteralFloat_ReturnValue1) == 0x000030, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_MakeLiteralFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000034, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x00003C, "Member 'AJBIngameUtilFunctionLibrary_C_GetScreenCenterPosition::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");

// Function AJBIngameUtilFunctionLibrary.AJBIngameUtilFunctionLibrary_C.GenerateHitEffect_Local
// 0x0118 (0x0118 - 0x0000)
struct AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HitRotation;                                       // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bCharacter;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeftAP;                                           // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHeadShot;                                         // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              SurfaceType;                                       // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlockedByAAP;                                     // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ParticleTagBlockedByAAP;                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable1;                             // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable3;                             // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable4;                             // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable5;                             // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable6;                             // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable7;                             // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable8;                             // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable9;                             // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00C0(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x00CC(0x000C)(IsPlainOldData, NoDestructor)
	struct FGameplayTag                           K2Node_Select1_Default;                            // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select2_Default;                            // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select3_Default;                            // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select4_Default;                            // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select5_Default;                            // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select6_Default;                            // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local) == 0x000008, "Wrong alignment on AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local");
static_assert(sizeof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local) == 0x000118, "Wrong size on AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, HitLocation) == 0x000000, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::HitLocation' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, HitNormal) == 0x00000C, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::HitNormal' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, HitRotation) == 0x000018, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::HitRotation' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, DamageType) == 0x000028, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::DamageType' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, bCharacter) == 0x000030, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::bCharacter' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, bLeftAP) == 0x000031, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::bLeftAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, bHeadShot) == 0x000032, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::bHeadShot' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, SurfaceType) == 0x000033, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::SurfaceType' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, bBlockedByAAP) == 0x000034, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, ParticleTagBlockedByAAP) == 0x000038, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::ParticleTagBlockedByAAP' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, __WorldContext) == 0x000040, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_byte_Variable) == 0x000048, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable) == 0x000050, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable1) == 0x000058, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable2) == 0x000060, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable3) == 0x000068, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable4) == 0x000070, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable5) == 0x000078, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_bool_Variable) == 0x000080, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_bool_Variable1) == 0x000081, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable6) == 0x000088, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable7) == 0x000090, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_bool_Variable2) == 0x000098, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable8) == 0x0000A0, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_struct_Variable9) == 0x0000A8, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_bool_Variable3) == 0x0000B0, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, Temp_bool_Variable4) == 0x0000B1, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B4, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000C0, "Member 'AJBIngameUtilFunctionLibrary_C_GenerateHitEffect_Local::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
