#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBInGameGion

#include "Basic.hpp"

#include "E_GionSpawnedSpace_structs.hpp"


namespace SDK::Params
{

// Function BI_AJBInGameGion.BI_AJBInGameGion_C.GetGionOwner
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBInGameGion_C_GetGionOwner final
{
public:
	class AActor*                                 GionOwner;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGameGion_C_GetGionOwner) == 0x000008, "Wrong alignment on BI_AJBInGameGion_C_GetGionOwner");
static_assert(sizeof(BI_AJBInGameGion_C_GetGionOwner) == 0x000008, "Wrong size on BI_AJBInGameGion_C_GetGionOwner");
static_assert(offsetof(BI_AJBInGameGion_C_GetGionOwner, GionOwner) == 0x000000, "Member 'BI_AJBInGameGion_C_GetGionOwner::GionOwner' has a wrong offset!");

// Function BI_AJBInGameGion.BI_AJBInGameGion_C.GetSpawnedSpaceInOwnersEnv
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv final
{
public:
	E_GionSpawnedSpace                            SpawnedSpaceInOwnersEnv;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv) == 0x000001, "Wrong alignment on BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv");
static_assert(sizeof(BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv) == 0x000001, "Wrong size on BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv");
static_assert(offsetof(BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv, SpawnedSpaceInOwnersEnv) == 0x000000, "Member 'BI_AJBInGameGion_C_GetSpawnedSpaceInOwnersEnv::SpawnedSpaceInOwnersEnv' has a wrong offset!");

}

