#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBInGameCharacterProperty

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.SetSerialNumber
// 0x0004 (0x0004 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_SetSerialNumber final
{
public:
	int32                                         SerialNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGameCharacterProperty_C_SetSerialNumber) == 0x000004, "Wrong alignment on BI_AJBInGameCharacterProperty_C_SetSerialNumber");
static_assert(sizeof(BI_AJBInGameCharacterProperty_C_SetSerialNumber) == 0x000004, "Wrong size on BI_AJBInGameCharacterProperty_C_SetSerialNumber");
static_assert(offsetof(BI_AJBInGameCharacterProperty_C_SetSerialNumber, SerialNumber) == 0x000000, "Member 'BI_AJBInGameCharacterProperty_C_SetSerialNumber::SerialNumber' has a wrong offset!");

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.GetPropertyOwnerCharacterBP
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP) == 0x000008, "Wrong alignment on BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP");
static_assert(sizeof(BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP) == 0x000008, "Wrong size on BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP");
static_assert(offsetof(BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP, CharacterBP) == 0x000000, "Member 'BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP::CharacterBP' has a wrong offset!");

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.GetPropertyType
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_GetPropertyType final
{
public:
	EAJBCharacterPropertyType                     PropertyType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBInGameCharacterProperty_C_GetPropertyType) == 0x000001, "Wrong alignment on BI_AJBInGameCharacterProperty_C_GetPropertyType");
static_assert(sizeof(BI_AJBInGameCharacterProperty_C_GetPropertyType) == 0x000001, "Wrong size on BI_AJBInGameCharacterProperty_C_GetPropertyType");
static_assert(offsetof(BI_AJBInGameCharacterProperty_C_GetPropertyType, PropertyType) == 0x000000, "Member 'BI_AJBInGameCharacterProperty_C_GetPropertyType::PropertyType' has a wrong offset!");

}

