#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_MovementSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_MovementSkill.BI_MovementSkill_C.ChangeMovementDistanceScale
// 0x0004 (0x0004 - 0x0000)
struct BI_MovementSkill_C_ChangeMovementDistanceScale final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_MovementSkill_C_ChangeMovementDistanceScale) == 0x000004, "Wrong alignment on BI_MovementSkill_C_ChangeMovementDistanceScale");
static_assert(sizeof(BI_MovementSkill_C_ChangeMovementDistanceScale) == 0x000004, "Wrong size on BI_MovementSkill_C_ChangeMovementDistanceScale");
static_assert(offsetof(BI_MovementSkill_C_ChangeMovementDistanceScale, Value) == 0x000000, "Member 'BI_MovementSkill_C_ChangeMovementDistanceScale::Value' has a wrong offset!");

// Function BI_MovementSkill.BI_MovementSkill_C.ChangeStandMovementDistanceScale
// 0x0004 (0x0004 - 0x0000)
struct BI_MovementSkill_C_ChangeStandMovementDistanceScale final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_MovementSkill_C_ChangeStandMovementDistanceScale) == 0x000004, "Wrong alignment on BI_MovementSkill_C_ChangeStandMovementDistanceScale");
static_assert(sizeof(BI_MovementSkill_C_ChangeStandMovementDistanceScale) == 0x000004, "Wrong size on BI_MovementSkill_C_ChangeStandMovementDistanceScale");
static_assert(offsetof(BI_MovementSkill_C_ChangeStandMovementDistanceScale, Value) == 0x000000, "Member 'BI_MovementSkill_C_ChangeStandMovementDistanceScale::Value' has a wrong offset!");

// Function BI_MovementSkill.BI_MovementSkill_C.ChangeStandLaunchVelocityScale
// 0x0004 (0x0004 - 0x0000)
struct BI_MovementSkill_C_ChangeStandLaunchVelocityScale final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_MovementSkill_C_ChangeStandLaunchVelocityScale) == 0x000004, "Wrong alignment on BI_MovementSkill_C_ChangeStandLaunchVelocityScale");
static_assert(sizeof(BI_MovementSkill_C_ChangeStandLaunchVelocityScale) == 0x000004, "Wrong size on BI_MovementSkill_C_ChangeStandLaunchVelocityScale");
static_assert(offsetof(BI_MovementSkill_C_ChangeStandLaunchVelocityScale, Value) == 0x000000, "Member 'BI_MovementSkill_C_ChangeStandLaunchVelocityScale::Value' has a wrong offset!");

// Function BI_MovementSkill.BI_MovementSkill_C.ChangeCharacterMoveSpeedByStand
// 0x0004 (0x0004 - 0x0000)
struct BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand) == 0x000004, "Wrong alignment on BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand");
static_assert(sizeof(BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand) == 0x000004, "Wrong size on BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand");
static_assert(offsetof(BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand, Value) == 0x000000, "Member 'BI_MovementSkill_C_ChangeCharacterMoveSpeedByStand::Value' has a wrong offset!");

}

