#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSupportSkillBase

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBActionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBSupportSkillBase.BP_AJBSupportSkillBase_C
// 0x0048 (0x0158 - 0x0110)
class UBP_AJBSupportSkillBase_C : public UBP_AJBActionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBSupportSkillBase_C;           // 0x0110(0x0008)(Transient, DuplicateTransient)
	bool                                          bRequireStand;                                     // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTagContainer;                              // 0x0120(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bApplyParameterAutomatically;                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SkillTag;                                          // 0x0148(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 SkillType;                                         // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBSupportSkillBase(int32 EntryPoint);
	void RemoveGameplayTag(const struct FGameplayTag& Tag);
	void AddGameplayTag(const struct FGameplayTag& Tag, class UObject* Operator, class UObject* Target, const struct FGameplayTag& CauserType, int32 SerialNumber);
	void AddGameplayTagWithFloat(const struct FGameplayTag& Tag, float FloatValue);
	void ChangeSealEnable(bool bEnable);
	void CheckSeal(bool* bSeal);
	void CheckSupportSkill(bool* bSupportSkill);
	void GetGameplayTags(struct FGameplayTagContainer* TagContainerCopy);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBSupportSkillBase_C">();
	}
	static class UBP_AJBSupportSkillBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBSupportSkillBase_C>();
	}
};
static_assert(alignof(UBP_AJBSupportSkillBase_C) == 0x000008, "Wrong alignment on UBP_AJBSupportSkillBase_C");
static_assert(sizeof(UBP_AJBSupportSkillBase_C) == 0x000158, "Wrong size on UBP_AJBSupportSkillBase_C");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, UberGraphFrame_BP_AJBSupportSkillBase_C) == 0x000110, "Member 'UBP_AJBSupportSkillBase_C::UberGraphFrame_BP_AJBSupportSkillBase_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, bRequireStand) == 0x000118, "Member 'UBP_AJBSupportSkillBase_C::bRequireStand' has a wrong offset!");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, GameplayTagContainer) == 0x000120, "Member 'UBP_AJBSupportSkillBase_C::GameplayTagContainer' has a wrong offset!");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, bApplyParameterAutomatically) == 0x000140, "Member 'UBP_AJBSupportSkillBase_C::bApplyParameterAutomatically' has a wrong offset!");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, SkillTag) == 0x000148, "Member 'UBP_AJBSupportSkillBase_C::SkillTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBSupportSkillBase_C, SkillType) == 0x000150, "Member 'UBP_AJBSupportSkillBase_C::SkillType' has a wrong offset!");

}

