#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSkillGuide

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSkillGuide.BP_AJBSkillGuide_C.SetupWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSkillGuide_C_SetupWidget final
{
public:
	class UWB_SkillGuide_C*                       SkillGuideWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillGuide_C_SetupWidget) == 0x000008, "Wrong alignment on BP_AJBSkillGuide_C_SetupWidget");
static_assert(sizeof(BP_AJBSkillGuide_C_SetupWidget) == 0x000008, "Wrong size on BP_AJBSkillGuide_C_SetupWidget");
static_assert(offsetof(BP_AJBSkillGuide_C_SetupWidget, SkillGuideWidget) == 0x000000, "Member 'BP_AJBSkillGuide_C_SetupWidget::SkillGuideWidget' has a wrong offset!");

// Function BP_AJBSkillGuide.BP_AJBSkillGuide_C.PushSkillGuide
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBSkillGuide_C_PushSkillGuide final
{
public:
	struct FAJBSkillGuideInfo                     GuideInfo;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillGuide_C_PushSkillGuide) == 0x000008, "Wrong alignment on BP_AJBSkillGuide_C_PushSkillGuide");
static_assert(sizeof(BP_AJBSkillGuide_C_PushSkillGuide) == 0x000030, "Wrong size on BP_AJBSkillGuide_C_PushSkillGuide");
static_assert(offsetof(BP_AJBSkillGuide_C_PushSkillGuide, GuideInfo) == 0x000000, "Member 'BP_AJBSkillGuide_C_PushSkillGuide::GuideInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillGuide_C_PushSkillGuide, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBSkillGuide_C_PushSkillGuide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillGuide.BP_AJBSkillGuide_C.PopSkillGuide
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBSkillGuide_C_PopSkillGuide final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillGuide_C_PopSkillGuide) == 0x000001, "Wrong alignment on BP_AJBSkillGuide_C_PopSkillGuide");
static_assert(sizeof(BP_AJBSkillGuide_C_PopSkillGuide) == 0x000001, "Wrong size on BP_AJBSkillGuide_C_PopSkillGuide");
static_assert(offsetof(BP_AJBSkillGuide_C_PopSkillGuide, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBSkillGuide_C_PopSkillGuide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

