#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItemAccesser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameItemAccesser.BP_AJBInGameItemAccesser_C
// 0x0020 (0x0348 - 0x0328)
class ABP_AJBInGameItemAccesser_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameItem_C*>            Items;                                             // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_AJBInGameItemAccesser(int32 EntryPoint);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void RequestConsume(class ABP_AJBInGameItem_C* ItemBP, class ABP_AJBInGameCharacter_C* HitCharacter);
	void ROS_InsteadConsume(class ABP_AJBInGameItem_C* ItemBP, class ABP_AJBInGameCharacter_C* HitCharacter, int32 PlayerIndex);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameItemAccesser_C">();
	}
	static class ABP_AJBInGameItemAccesser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameItemAccesser_C>();
	}
};
static_assert(alignof(ABP_AJBInGameItemAccesser_C) == 0x000008, "Wrong alignment on ABP_AJBInGameItemAccesser_C");
static_assert(sizeof(ABP_AJBInGameItemAccesser_C) == 0x000348, "Wrong size on ABP_AJBInGameItemAccesser_C");
static_assert(offsetof(ABP_AJBInGameItemAccesser_C, UberGraphFrame) == 0x000328, "Member 'ABP_AJBInGameItemAccesser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItemAccesser_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_AJBInGameItemAccesser_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItemAccesser_C, Items) == 0x000338, "Member 'ABP_AJBInGameItemAccesser_C::Items' has a wrong offset!");

}

