#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCloudBarrier

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.ExecuteUbergraph_BP_AJBCloudBarrier
// 0x0300 (0x0300 - 0x0000)
struct BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bSuccess;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForceCancel;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractActor;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBCloudPointTarget_C*              CallFunc_TryGetCloudPointTarget_CloudPointTarget;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPossibleAddCPServer_bPossible;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCondition_bPossibleSelfAdded;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition1;                  // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP1;            // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_AAPValue;                        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP2;            // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueMax_AAPValueMax;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue11;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue12;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_ErrorType;                            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character10;    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue13;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character11;    // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloudPointTarget_C*              CallFunc_TryGetCloudPointTarget_CloudPointTarget1; // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP3;            // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02C8(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue14;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character12;    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess19;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloudPointTarget_C*              CallFunc_TryGetCloudPointTarget_CloudPointTarget2; // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier) == 0x000008, "Wrong alignment on BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier");
static_assert(sizeof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier) == 0x000300, "Wrong size on BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, EntryPoint) == 0x000000, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_bSuccess) == 0x000018, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_bForceCancel) == 0x000019, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_bForceCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_InteractActor) == 0x000020, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_InteractActor' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_TryGetCloudPointTarget_CloudPointTarget) == 0x000028, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_TryGetCloudPointTarget_CloudPointTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_CheckPossibleAddCPServer_bPossible) == 0x000030, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_CheckPossibleAddCPServer_bPossible' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBI_Additional_AP) == 0x000038, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBI_Additional_AP' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_DeltaSeconds) == 0x00004C, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsServer_ReturnValue) == 0x000050, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_Operator) == 0x000058, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_Time) == 0x000060, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_Timing) == 0x000064, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_bEnable) == 0x000065, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_bOperatorIsEmpty) == 0x000066, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsValid_ReturnValue) == 0x000067, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue1) == 0x000078, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000080, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess1) == 0x000088, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000090, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess2) == 0x000098, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_HasLocalSharedController_ReturnValue) == 0x000099, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_bEnable) == 0x00009A, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue2) == 0x0000A0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000A8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess3) == 0x0000B0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B1, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue3) == 0x0000B8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x0000C0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess4) == 0x0000C8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsServer_ReturnValue1) == 0x0000C9, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0000CA, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue4) == 0x0000D0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000D8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess5) == 0x0000E0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x0000F0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsValid_ReturnValue1) == 0x0000F8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue5) == 0x000100, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_BooleanXOR_ReturnValue) == 0x000108, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000110, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess6) == 0x000118, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000120, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess7) == 0x000128, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue6) == 0x000130, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_CheckCondition_bPossibleSelfAdded) == 0x000138, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_CheckCondition_bPossibleSelfAdded' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000140, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess8) == 0x000148, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsValid_ReturnValue2) == 0x000149, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue7) == 0x000150, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CreateDelegate_OutputDelegate1) == 0x000158, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x000168, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess9) == 0x000170, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_AddCondition1) == 0x000178, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_AddCondition1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_MatchesTag_ReturnValue) == 0x000180, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBI_Additional_AP1) == 0x000188, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBI_Additional_AP1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess10) == 0x000198, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetValue_AAPValue) == 0x00019C, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetValue_AAPValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBI_Additional_AP2) == 0x0001A0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBI_Additional_AP2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess11) == 0x0001B0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetValueMax_AAPValueMax) == 0x0001B4, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetValueMax_AAPValueMax' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsValid_ReturnValue3) == 0x0001B8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001B9, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue8) == 0x0001C0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x0001C8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess12) == 0x0001D0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue9) == 0x0001D8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x0001E0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess13) == 0x0001E8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsServer_ReturnValue2) == 0x0001E9, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue10) == 0x0001F0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue11) == 0x0001F8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x000200, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess14) == 0x000208, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x000210, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess15) == 0x000218, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000219, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_HasLocalSharedController_ReturnValue2) == 0x00021A, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CreateDelegate_OutputDelegate2) == 0x000220, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_DamageType) == 0x000230, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_DeadActor) == 0x000238, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_DamageCauser) == 0x000240, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue12) == 0x000248, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_Event_ErrorType) == 0x000250, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_Event_ErrorType' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character10) == 0x000258, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character10' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess16) == 0x000260, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetValidValue_ReturnValue) == 0x000261, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x000262, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000263, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000268, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_SwitchEnum_CmpSuccess) == 0x000270, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue13) == 0x000278, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CustomEvent_AddCondition) == 0x000280, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character11) == 0x000288, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character11' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess17) == 0x000290, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_MatchesTag_ReturnValue1) == 0x000291, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_MatchesTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_TryGetCloudPointTarget_CloudPointTarget1) == 0x000298, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_TryGetCloudPointTarget_CloudPointTarget1' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBI_Additional_AP3) == 0x0002A0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBI_Additional_AP3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess18) == 0x0002B0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess18' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_CreateDelegate_OutputDelegate3) == 0x0002B8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002C8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002D0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_BooleanAND_ReturnValue) == 0x0002D1, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsServer_ReturnValue3) == 0x0002D2, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_GetOwner_ReturnValue14) == 0x0002D8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_GetOwner_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_AsBP_AJBIn_Game_Character12) == 0x0002E0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_AsBP_AJBIn_Game_Character12' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, K2Node_DynamicCast_bSuccess19) == 0x0002E8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::K2Node_DynamicCast_bSuccess19' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_TryGetCloudPointTarget_CloudPointTarget2) == 0x0002F0, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_TryGetCloudPointTarget_CloudPointTarget2' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier, CallFunc_IsValid_ReturnValue4) == 0x0002F8, "Member 'BP_AJBCloudBarrier_C_ExecuteUbergraph_BP_AJBCloudBarrier::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.OnPassiveAddedLocal
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCloudBarrier_C_OnPassiveAddedLocal final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCloudBarrier_C_OnPassiveAddedLocal) == 0x000008, "Wrong alignment on BP_AJBCloudBarrier_C_OnPassiveAddedLocal");
static_assert(sizeof(BP_AJBCloudBarrier_C_OnPassiveAddedLocal) == 0x000008, "Wrong size on BP_AJBCloudBarrier_C_OnPassiveAddedLocal");
static_assert(offsetof(BP_AJBCloudBarrier_C_OnPassiveAddedLocal, AddCondition) == 0x000000, "Member 'BP_AJBCloudBarrier_C_OnPassiveAddedLocal::AddCondition' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.UpdateErrorTypeUI
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCloudBarrier_C_UpdateErrorTypeUI final
{
public:
	uint8                                         ErrorType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCloudBarrier_C_UpdateErrorTypeUI) == 0x000001, "Wrong alignment on BP_AJBCloudBarrier_C_UpdateErrorTypeUI");
static_assert(sizeof(BP_AJBCloudBarrier_C_UpdateErrorTypeUI) == 0x000001, "Wrong size on BP_AJBCloudBarrier_C_UpdateErrorTypeUI");
static_assert(offsetof(BP_AJBCloudBarrier_C_UpdateErrorTypeUI, ErrorType) == 0x000000, "Member 'BP_AJBCloudBarrier_C_UpdateErrorTypeUI::ErrorType' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.OnCharacterDead
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBCloudBarrier_C_OnCharacterDead final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCloudBarrier_C_OnCharacterDead) == 0x000008, "Wrong alignment on BP_AJBCloudBarrier_C_OnCharacterDead");
static_assert(sizeof(BP_AJBCloudBarrier_C_OnCharacterDead) == 0x000018, "Wrong size on BP_AJBCloudBarrier_C_OnCharacterDead");
static_assert(offsetof(BP_AJBCloudBarrier_C_OnCharacterDead, DamageType) == 0x000000, "Member 'BP_AJBCloudBarrier_C_OnCharacterDead::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_OnCharacterDead, DeadActor) == 0x000008, "Member 'BP_AJBCloudBarrier_C_OnCharacterDead::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBCloudBarrier_C_OnCharacterDead, DamageCauser) == 0x000010, "Member 'BP_AJBCloudBarrier_C_OnCharacterDead::DamageCauser' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.OnPassiveAddedServer
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCloudBarrier_C_OnPassiveAddedServer final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCloudBarrier_C_OnPassiveAddedServer) == 0x000008, "Wrong alignment on BP_AJBCloudBarrier_C_OnPassiveAddedServer");
static_assert(sizeof(BP_AJBCloudBarrier_C_OnPassiveAddedServer) == 0x000008, "Wrong size on BP_AJBCloudBarrier_C_OnPassiveAddedServer");
static_assert(offsetof(BP_AJBCloudBarrier_C_OnPassiveAddedServer, AddCondition) == 0x000000, "Member 'BP_AJBCloudBarrier_C_OnPassiveAddedServer::AddCondition' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.ChangeEnableSelfAdded
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCloudBarrier_C_ChangeEnableSelfAdded final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCloudBarrier_C_ChangeEnableSelfAdded) == 0x000001, "Wrong alignment on BP_AJBCloudBarrier_C_ChangeEnableSelfAdded");
static_assert(sizeof(BP_AJBCloudBarrier_C_ChangeEnableSelfAdded) == 0x000001, "Wrong size on BP_AJBCloudBarrier_C_ChangeEnableSelfAdded");
static_assert(offsetof(BP_AJBCloudBarrier_C_ChangeEnableSelfAdded, bEnable) == 0x000000, "Member 'BP_AJBCloudBarrier_C_ChangeEnableSelfAdded::bEnable' has a wrong offset!");

// Function BP_AJBCloudBarrier.BP_AJBCloudBarrier_C.TryDestroyAccompanyParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle) == 0x000001, "Wrong alignment on BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle");
static_assert(sizeof(BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle) == 0x000001, "Wrong size on BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle");
static_assert(offsetof(BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBCloudBarrier_C_TryDestroyAccompanyParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

