#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTheWorldWLDSkill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTheWorldWLDSkill.BP_AJBTheWorldWLDSkill_C.ExecuteUbergraph_BP_AJBTheWorldWLDSkill
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag1;                      // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag;                       // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EffectiveTimeSec;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUpdateEvenIfNotInGameplay;     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag, float EffectiveTimeSec, bool bUpdateEvenIfNotInGameplay)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGlimpseOfForceSkill_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTag_self_CastInput;            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self_CastInput;         // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill) == 0x000008, "Wrong alignment on BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill");
static_assert(sizeof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill) == 0x000090, "Wrong size on BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, EntryPoint) == 0x000000, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CustomEvent_SkillTag1) == 0x000018, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CustomEvent_SkillTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000020, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CustomEvent_SkillTag) == 0x000028, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CustomEvent_SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CustomEvent_EffectiveTimeSec) == 0x000030, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CustomEvent_EffectiveTimeSec' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CustomEvent_bUpdateEvenIfNotInGameplay) == 0x000034, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CustomEvent_bUpdateEvenIfNotInGameplay' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x000035, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000038, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000040, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000050, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_AddGameplayTag_self_CastInput) == 0x000070, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_AddGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill, CallFunc_RemoveGameplayTag_self_CastInput) == 0x000080, "Member 'BP_AJBTheWorldWLDSkill_C_ExecuteUbergraph_BP_AJBTheWorldWLDSkill::CallFunc_RemoveGameplayTag_self_CastInput' has a wrong offset!");

// Function BP_AJBTheWorldWLDSkill.BP_AJBTheWorldWLDSkill_C.OnSkillEffectiveTimeDetermined
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined final
{
public:
	struct FGameplayTag                           SkillTag_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         EffectiveTimeSec;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateEvenIfNotInGameplay;                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined) == 0x000008, "Wrong alignment on BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined");
static_assert(sizeof(BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined) == 0x000010, "Wrong size on BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined, SkillTag_0) == 0x000000, "Member 'BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined::SkillTag_0' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined, EffectiveTimeSec) == 0x000008, "Member 'BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined::EffectiveTimeSec' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined, bUpdateEvenIfNotInGameplay) == 0x00000C, "Member 'BP_AJBTheWorldWLDSkill_C_OnSkillEffectiveTimeDetermined::bUpdateEvenIfNotInGameplay' has a wrong offset!");

// Function BP_AJBTheWorldWLDSkill.BP_AJBTheWorldWLDSkill_C.OnSkillSucceeded_Local
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local final
{
public:
	struct FGameplayTag                           SkillTag_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local) == 0x000008, "Wrong alignment on BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local");
static_assert(sizeof(BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local) == 0x000008, "Wrong size on BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local");
static_assert(offsetof(BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local, SkillTag_0) == 0x000000, "Member 'BP_AJBTheWorldWLDSkill_C_OnSkillSucceeded_Local::SkillTag_0' has a wrong offset!");

}

