#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBFirstBombImpulse

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBFirstBombImpulse.BP_AJBFirstBombImpulse_C.ExecuteUbergraph_BP_AJBFirstBombImpulse
// 0x01A0 (0x01A0 - 0x0000)
struct BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0040(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x00D8(0x0018)()
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBFirstBombSkill_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0120(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse) == 0x000008, "Wrong alignment on BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse");
static_assert(sizeof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse) == 0x0001A0, "Wrong size on BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, EntryPoint) == 0x000000, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetTagName_ReturnValue) == 0x000008, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000028, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Right_ReturnValue) == 0x000030, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_NameToText_ReturnValue) == 0x000040, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x0000B8, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x0000C0, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetCharacterName_CharacterName) == 0x0000C8, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetOwner_ReturnValue1) == 0x0000D0, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_NameToText_ReturnValue1) == 0x0000D8, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000F0, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, Temp_bool_Variable) == 0x0000F9, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_GetComponentByClass_ReturnValue) == 0x000100, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_Select_Default) == 0x000108, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_MakeStruct_FormatArgumentData1) == 0x000120, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, K2Node_MakeArray_Array) == 0x000160, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Format_ReturnValue) == 0x000170, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_TextToString_ReturnValue) == 0x000188, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse, CallFunc_Conv_StringToName_ReturnValue) == 0x000198, "Member 'BP_AJBFirstBombImpulse_C_ExecuteUbergraph_BP_AJBFirstBombImpulse::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

