#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTheWorldSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTheWorldSkill.BP_AJBTheWorldSkill_C.ExecuteUbergraph_BP_AJBTheWorldSkill
// 0x0128 (0x0128 - 0x0000)
struct BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBTheWorldAffecter_C*              CallFunc_TryGetValidAffecter_Affecter;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill) == 0x000008, "Wrong alignment on BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill");
static_assert(sizeof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill) == 0x000128, "Wrong size on BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, EntryPoint) == 0x000000, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_Event_Value) == 0x000004, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, Temp_float_Variable) == 0x00000C, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000018, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000020, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsValid_ReturnValue1) == 0x000021, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsServer_ReturnValue) == 0x000022, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000024, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000028, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000030, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_BooleanAND_ReturnValue1) == 0x000032, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000034, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsValid_ReturnValue3) == 0x000038, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000040, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000048, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsServer_ReturnValue1) == 0x000051, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000058, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000060, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000070, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000078, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetAnimInstance_ReturnValue) == 0x000080, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsValid_ReturnValue4) == 0x000088, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_Montage_Play_ReturnValue) == 0x00008C, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_BooleanAND_ReturnValue2) == 0x000090, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000094, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000099, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetValidValue_ReturnValue) == 0x00009A, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_SwitchEnum_CmpSuccess) == 0x00009B, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_TryGetValidAffecter_Affecter) == 0x0000A0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_TryGetValidAffecter_Affecter' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000A8, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000B0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_IsServer_ReturnValue2) == 0x0000B9, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000C0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x0000C8, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000D0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess3) == 0x0000D8, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0000E0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess4) == 0x0000F0, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x0000F8, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000100, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess5) == 0x000108, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x000110, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_DynamicCast_bSuccess6) == 0x000120, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill, K2Node_Event_DeltaSeconds) == 0x000124, "Member 'BP_AJBTheWorldSkill_C_ExecuteUbergraph_BP_AJBTheWorldSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_AJBTheWorldSkill.BP_AJBTheWorldSkill_C.AddStopTime
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTheWorldSkill_C_AddStopTime final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTheWorldSkill_C_AddStopTime) == 0x000004, "Wrong alignment on BP_AJBTheWorldSkill_C_AddStopTime");
static_assert(sizeof(BP_AJBTheWorldSkill_C_AddStopTime) == 0x000008, "Wrong size on BP_AJBTheWorldSkill_C_AddStopTime");
static_assert(offsetof(BP_AJBTheWorldSkill_C_AddStopTime, Seconds) == 0x000000, "Member 'BP_AJBTheWorldSkill_C_AddStopTime::Seconds' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_AddStopTime, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_AJBTheWorldSkill_C_AddStopTime::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_AJBTheWorldSkill.BP_AJBTheWorldSkill_C.TryGetValidAffecter
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBTheWorldSkill_C_TryGetValidAffecter final
{
public:
	class ABP_AJBTheWorldAffecter_C*              Affecter;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirst;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBTheWorldAffecter_C*              TempAffecter;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class ABP_AJBTheWorldAffecter_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBTheWorldAffecter_C*              CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBTheWorldAffecter_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTheWorldSkill_C_TryGetValidAffecter) == 0x000010, "Wrong alignment on BP_AJBTheWorldSkill_C_TryGetValidAffecter");
static_assert(sizeof(BP_AJBTheWorldSkill_C_TryGetValidAffecter) == 0x0000B0, "Wrong size on BP_AJBTheWorldSkill_C_TryGetValidAffecter");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, Affecter) == 0x000000, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::Affecter' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, bFirst) == 0x000008, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::bFirst' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, TempAffecter) == 0x000010, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::TempAffecter' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_GetOwnerStand_ReturnValue) == 0x000018, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000020, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_GetOwnerStand_ReturnValue1) == 0x000030, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000038, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_GetAllActorsOfClass_OutActors) == 0x000080, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A8, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000AA, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TryGetValidAffecter, CallFunc_BooleanOR_ReturnValue) == 0x0000AB, "Member 'BP_AJBTheWorldSkill_C_TryGetValidAffecter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_AJBTheWorldSkill.BP_AJBTheWorldSkill_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBTheWorldSkill_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTheWorldSkill_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBTheWorldSkill_C_ReceiveTick");
static_assert(sizeof(BP_AJBTheWorldSkill_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBTheWorldSkill_C_ReceiveTick");
static_assert(offsetof(BP_AJBTheWorldSkill_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBTheWorldSkill_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBTheWorldSkill.BP_AJBTheWorldSkill_C.TimeExtension_Server
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBTheWorldSkill_C_TimeExtension_Server final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTheWorldSkill_C_TimeExtension_Server) == 0x000004, "Wrong alignment on BP_AJBTheWorldSkill_C_TimeExtension_Server");
static_assert(sizeof(BP_AJBTheWorldSkill_C_TimeExtension_Server) == 0x000004, "Wrong size on BP_AJBTheWorldSkill_C_TimeExtension_Server");
static_assert(offsetof(BP_AJBTheWorldSkill_C_TimeExtension_Server, Value) == 0x000000, "Member 'BP_AJBTheWorldSkill_C_TimeExtension_Server::Value' has a wrong offset!");

}

