#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCharacterBehaviorBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBCharacterBehaviorBase.BP_AJBCharacterBehaviorBase_C.ExecuteUbergraph_BP_AJBCharacterBehaviorBase
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCancel;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase) == 0x000004, "Wrong alignment on BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase");
static_assert(sizeof(BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase) == 0x000008, "Wrong size on BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase");
static_assert(offsetof(BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase, EntryPoint) == 0x000000, "Member 'BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase, K2Node_CustomEvent_bCancel) == 0x000004, "Member 'BP_AJBCharacterBehaviorBase_C_ExecuteUbergraph_BP_AJBCharacterBehaviorBase::K2Node_CustomEvent_bCancel' has a wrong offset!");

// Function BP_AJBCharacterBehaviorBase.BP_AJBCharacterBehaviorBase_C.OnBehaviorEnded
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded final
{
public:
	bool                                          bCancel;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded) == 0x000001, "Wrong alignment on BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded");
static_assert(sizeof(BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded) == 0x000001, "Wrong size on BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded");
static_assert(offsetof(BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded, bCancel) == 0x000000, "Member 'BP_AJBCharacterBehaviorBase_C_OnBehaviorEnded::bCancel' has a wrong offset!");

}

