#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBinGameDeathCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ExecuteUbergraph_BP_AJBinGameDeathCamera
// 0x0118 (0x0118 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_CustomEvent_LastOwningCharacter;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_CameraTargetRef1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_DeadCharacterBPRef1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_CameraTargetRef;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_DeadCharacterBPRef;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_OnDeathCamera_C*                    CallFunc_GetUIOnDeathCamera_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location1;                      // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PinTypeTag1;                    // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsRemove1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWithSound1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PinTypeTag;                     // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsRemove;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWithSound;                     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition1;            // 0x00D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SignalTypeTag1;                 // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition;             // 0x00F0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SignalTypeTag;                  // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess4;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera) == 0x000118, "Wrong size on BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, EntryPoint) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_LastOwningCharacter) == 0x000020, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_LastOwningCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsServer_ReturnValue) == 0x000029, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, Temp_bool_Has_Been_Initd_Variable) == 0x00002A, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsValid_ReturnValue1) == 0x00002B, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsValid_ReturnValue2) == 0x00002C, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00002D, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsValid_ReturnValue3) == 0x00002F, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_CameraTargetRef1) == 0x000030, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_CameraTargetRef1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_DeadCharacterBPRef1) == 0x000038, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_DeadCharacterBPRef1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_CameraTargetRef) == 0x000048, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_CameraTargetRef' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_DeadCharacterBPRef) == 0x000050, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_DeadCharacterBPRef' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_BooleanAND_ReturnValue1) == 0x000059, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x00005A, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000060, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetUIOnDeathCamera_ReturnValue) == 0x000068, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetUIOnDeathCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBGameInstance_bSuccess) == 0x000070, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000078, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_IsPlayingReplay_ReturnValue) == 0x000080, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_Location1) == 0x000084, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_Location1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_PinTypeTag1) == 0x000090, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_PinTypeTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_bIsRemove1) == 0x000098, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_bIsRemove1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_bWithSound1) == 0x000099, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_bWithSound1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_Location) == 0x00009C, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_PinTypeTag) == 0x0000A8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_PinTypeTag' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_bIsRemove) == 0x0000B0, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_bIsRemove' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_bWithSound) == 0x0000B1, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_bWithSound' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x0000B2, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x0000B8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x0000C0, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x0000C8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_NormalizedPosition1) == 0x0000D0, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_NormalizedPosition1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_SignalTypeTag1) == 0x0000D8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_SignalTypeTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x0000E0, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x0000E8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_NormalizedPosition) == 0x0000F0, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_NormalizedPosition' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, K2Node_CustomEvent_SignalTypeTag) == 0x0000F8, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::K2Node_CustomEvent_SignalTypeTag' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_bSuccess4) == 0x000100, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4) == 0x000108, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera, Temp_bool_IsClosed_Variable) == 0x000110, "Member 'BP_AJBinGameDeathCamera_C_ExecuteUbergraph_BP_AJBinGameDeathCamera::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ROC_StickedMarker_PairWatcher
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher final
{
public:
	struct FVector2D                              NormalizedPosition;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SignalTypeTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher) == 0x000010, "Wrong size on BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher, NormalizedPosition) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher::NormalizedPosition' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher, SignalTypeTag) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_ROC_StickedMarker_PairWatcher::SignalTypeTag' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ROC_StickedMarker_Watcher
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher final
{
public:
	struct FVector2D                              NormalizedPosition;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SignalTypeTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher) == 0x000010, "Wrong size on BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher, NormalizedPosition) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher::NormalizedPosition' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher, SignalTypeTag) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_ROC_StickedMarker_Watcher::SignalTypeTag' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ROC_SpawnSignalPin_PairWatcher
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PinTypeTag;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRemove;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWithSound;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher) == 0x000020, "Wrong size on BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher, Location) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher, PinTypeTag) == 0x000010, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher::PinTypeTag' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher, bIsRemove) == 0x000018, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher::bIsRemove' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher, bWithSound) == 0x000019, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_PairWatcher::bWithSound' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ROC_SpawnSignalPin_Watcher
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PinTypeTag;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRemove;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWithSound;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher) == 0x000020, "Wrong size on BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher, Location) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher, PinTypeTag) == 0x000010, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher::PinTypeTag' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher, bIsRemove) == 0x000018, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher::bIsRemove' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher, bWithSound) == 0x000019, "Member 'BP_AJBinGameDeathCamera_C_ROC_SpawnSignalPin_Watcher::bWithSound' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.Init_Internal
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBinGameDeathCamera_C_Init_Internal final
{
public:
	class AActor*                                 CameraTargetRef_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               DeadCharacterBPRef_0;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_Init_Internal) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_Init_Internal");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_Init_Internal) == 0x000010, "Wrong size on BP_AJBinGameDeathCamera_C_Init_Internal");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_Init_Internal, CameraTargetRef_0) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_Init_Internal::CameraTargetRef_0' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_Init_Internal, DeadCharacterBPRef_0) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_Init_Internal::DeadCharacterBPRef_0' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.Init(Server)
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBinGameDeathCamera_C_Init_Server_ final
{
public:
	class AActor*                                 CameraTargetRef_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               DeadCharacterBPRef_0;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_Init_Server_) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_Init_Server_");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_Init_Server_) == 0x000010, "Wrong size on BP_AJBinGameDeathCamera_C_Init_Server_");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_Init_Server_, CameraTargetRef_0) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_Init_Server_::CameraTargetRef_0' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_Init_Server_, DeadCharacterBPRef_0) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_Init_Server_::DeadCharacterBPRef_0' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ROC_PreparePossessed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ROC_PreparePossessed final
{
public:
	class AAJBInGameCharacterBase*                LastOwningCharacter;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ROC_PreparePossessed) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_ROC_PreparePossessed");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ROC_PreparePossessed) == 0x000008, "Wrong size on BP_AJBinGameDeathCamera_C_ROC_PreparePossessed");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ROC_PreparePossessed, LastOwningCharacter) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ROC_PreparePossessed::LastOwningCharacter' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBinGameDeathCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBinGameDeathCamera_C_ReceiveTick");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBinGameDeathCamera_C_ReceiveTick");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBinGameDeathCamera.BP_AJBinGameDeathCamera_C.OnTick_WatchTarget
// 0x0458 (0x0458 - 0x0000)
struct BP_AJBinGameDeathCamera_C_OnTick_WatchTarget final
{
public:
	float                                         Temp_PitchToAdd;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_YawToAdd;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_PitchThreshold;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_YawThreshold;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_PitchDiffCameraForwardAndTarget;              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_YawDiffCameraForwardAndTarget;                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_CameraLocation;                               // 0x0018(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_TargetWorldLocation;                          // 0x0024(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_CameraLocationXY;                             // 0x0030(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_TargetWorldLocationXY;                        // 0x003C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_DeadBodyWorldLocationXY;                      // 0x0048(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0054(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x0060(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x006C(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue1;                         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue2;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue3;                         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x01EC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable3;                              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue1;     // 0x025C(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x027C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x028C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x02AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02B8(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x02F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0300(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0388(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0398(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x03B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x03C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult1;      // 0x03D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget) == 0x000008, "Wrong alignment on BP_AJBinGameDeathCamera_C_OnTick_WatchTarget");
static_assert(sizeof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget) == 0x000458, "Wrong size on BP_AJBinGameDeathCamera_C_OnTick_WatchTarget");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_PitchToAdd) == 0x000000, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_PitchToAdd' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_YawToAdd) == 0x000004, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_YawToAdd' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_PitchThreshold) == 0x000008, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_PitchThreshold' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_YawThreshold) == 0x00000C, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_YawThreshold' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_PitchDiffCameraForwardAndTarget) == 0x000010, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_PitchDiffCameraForwardAndTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_YawDiffCameraForwardAndTarget) == 0x000014, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_YawDiffCameraForwardAndTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_CameraLocation) == 0x000018, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_CameraLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_TargetWorldLocation) == 0x000024, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_TargetWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_CameraLocationXY) == 0x000030, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_CameraLocationXY' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_TargetWorldLocationXY) == 0x00003C, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_TargetWorldLocationXY' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_DeadBodyWorldLocationXY) == 0x000048, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_DeadBodyWorldLocationXY' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_MakeRotator_ReturnValue) == 0x000054, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_MakeRotator_ReturnValue1) == 0x000060, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00006C, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000078, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x000100, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000188, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_Abs_ReturnValue) == 0x00018C, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000190, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_Abs_ReturnValue1) == 0x000194, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_Abs_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, Temp_float_Variable) == 0x000198, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBinGameDeathCamera_C_OnTick_WatchTarget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00019C, "Member 'BP_AJBinGameDeathCamera_C_OnTick_WatchTarget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
