#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBZipper_Preview

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBZipper_Preview.BP_AJBZipper_Preview_C.ExecuteUbergraph_BP_AJBZipper_Preview
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPossiblePlacement;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewVisibility;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview) == 0x000008, "Wrong alignment on BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview");
static_assert(sizeof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview) == 0x000038, "Wrong size on BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, EntryPoint) == 0x000000, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, K2Node_Event_bPossiblePlacement) == 0x000005, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::K2Node_Event_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, K2Node_Event_NewVisibility) == 0x000006, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::K2Node_Event_NewVisibility' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_IsValid_ReturnValue1) == 0x000009, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000018, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000028, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview, CallFunc_IsLocallyControlled_ReturnValue) == 0x000031, "Member 'BP_AJBZipper_Preview_C_ExecuteUbergraph_BP_AJBZipper_Preview::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function BP_AJBZipper_Preview.BP_AJBZipper_Preview_C.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBZipper_Preview_C_SetVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBZipper_Preview_C_SetVisibility) == 0x000001, "Wrong alignment on BP_AJBZipper_Preview_C_SetVisibility");
static_assert(sizeof(BP_AJBZipper_Preview_C_SetVisibility) == 0x000001, "Wrong size on BP_AJBZipper_Preview_C_SetVisibility");
static_assert(offsetof(BP_AJBZipper_Preview_C_SetVisibility, NewVisibility) == 0x000000, "Member 'BP_AJBZipper_Preview_C_SetVisibility::NewVisibility' has a wrong offset!");

// Function BP_AJBZipper_Preview.BP_AJBZipper_Preview_C.ChangeVisual
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBZipper_Preview_C_ChangeVisual final
{
public:
	bool                                          bPossiblePlacement;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBZipper_Preview_C_ChangeVisual) == 0x000001, "Wrong alignment on BP_AJBZipper_Preview_C_ChangeVisual");
static_assert(sizeof(BP_AJBZipper_Preview_C_ChangeVisual) == 0x000001, "Wrong size on BP_AJBZipper_Preview_C_ChangeVisual");
static_assert(offsetof(BP_AJBZipper_Preview_C_ChangeVisual, bPossiblePlacement) == 0x000000, "Member 'BP_AJBZipper_Preview_C_ChangeVisual::bPossiblePlacement' has a wrong offset!");

// Function BP_AJBZipper_Preview.BP_AJBZipper_Preview_C.ChangeMaterial
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBZipper_Preview_C_ChangeMaterial final
{
public:
	bool                                          bCanSetting;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBZipper_Preview_C_ChangeMaterial) == 0x000008, "Wrong alignment on BP_AJBZipper_Preview_C_ChangeMaterial");
static_assert(sizeof(BP_AJBZipper_Preview_C_ChangeMaterial) == 0x000010, "Wrong size on BP_AJBZipper_Preview_C_ChangeMaterial");
static_assert(offsetof(BP_AJBZipper_Preview_C_ChangeMaterial, bCanSetting) == 0x000000, "Member 'BP_AJBZipper_Preview_C_ChangeMaterial::bCanSetting' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ChangeMaterial, Temp_bool_Variable) == 0x000001, "Member 'BP_AJBZipper_Preview_C_ChangeMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipper_Preview_C_ChangeMaterial, K2Node_Select_Default) == 0x000008, "Member 'BP_AJBZipper_Preview_C_ChangeMaterial::K2Node_Select_Default' has a wrong offset!");

}

