#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAccompanyGEXSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBAccompanyGEXSkill.BP_AJBAccompanyGEXSkill_C.ExecuteUbergraph_BP_AJBAccompanyGEXSkill
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_GRN_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_GRN_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill) == 0x000008, "Wrong alignment on BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill");
static_assert(sizeof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill) == 0x000048, "Wrong size on BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, EntryPoint) == 0x000000, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN) == 0x000010, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_GetOwner_ReturnValue1) == 0x000020, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN1) == 0x000028, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_GRN1' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000038, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000040, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x000041, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'BP_AJBAccompanyGEXSkill_C_ExecuteUbergraph_BP_AJBAccompanyGEXSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

