#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBZipperInteractAnimator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBZipperInteractAnimator.BP_AJBZipperInteractAnimator_C
// 0x0070 (0x0398 - 0x0328)
class ABP_AJBZipperInteractAnimator_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationEnterFrom;                                 // 0x0338(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationEnterTo;                                   // 0x0344(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationExitFrom;                                  // 0x0350(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationExitTo;                                    // 0x035C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedSeconds;                                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnEnterAnimFinished;                               // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExitAnimFinished;                                // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DurationEnter;                                     // 0x0390(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationExit;                                      // 0x0394(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnEnterAnimFinished__DelegateSignature();
	void OnExitAnimFinished__DelegateSignature();
	void ExecuteUbergraph_BP_AJBZipperInteractAnimator(int32 EntryPoint);
	void OnExistServer();
	void OnFinishedInteract();
	void FinishExitAnim();
	void StartExitAnim();
	void FinishEnterAnim();
	void StartEnterAnim();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBZipperInteractAnimator_C">();
	}
	static class ABP_AJBZipperInteractAnimator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBZipperInteractAnimator_C>();
	}
};
static_assert(alignof(ABP_AJBZipperInteractAnimator_C) == 0x000008, "Wrong alignment on ABP_AJBZipperInteractAnimator_C");
static_assert(sizeof(ABP_AJBZipperInteractAnimator_C) == 0x000398, "Wrong size on ABP_AJBZipperInteractAnimator_C");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, UberGraphFrame) == 0x000328, "Member 'ABP_AJBZipperInteractAnimator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_AJBZipperInteractAnimator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, LocationEnterFrom) == 0x000338, "Member 'ABP_AJBZipperInteractAnimator_C::LocationEnterFrom' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, LocationEnterTo) == 0x000344, "Member 'ABP_AJBZipperInteractAnimator_C::LocationEnterTo' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, LocationExitFrom) == 0x000350, "Member 'ABP_AJBZipperInteractAnimator_C::LocationExitFrom' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, LocationExitTo) == 0x00035C, "Member 'ABP_AJBZipperInteractAnimator_C::LocationExitTo' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, ElapsedSeconds) == 0x000368, "Member 'ABP_AJBZipperInteractAnimator_C::ElapsedSeconds' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, OnEnterAnimFinished) == 0x000370, "Member 'ABP_AJBZipperInteractAnimator_C::OnEnterAnimFinished' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, OnExitAnimFinished) == 0x000380, "Member 'ABP_AJBZipperInteractAnimator_C::OnExitAnimFinished' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, DurationEnter) == 0x000390, "Member 'ABP_AJBZipperInteractAnimator_C::DurationEnter' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipperInteractAnimator_C, DurationExit) == 0x000394, "Member 'ABP_AJBZipperInteractAnimator_C::DurationExit' has a wrong offset!");

}

