#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStand_ECH

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.ExecuteUbergraph_BP_AJBInGameStand_ECH
// 0x0270 (0x0270 - 0x0000)
struct BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     Temp_byte_Variable1;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable1;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable2;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     Temp_byte_Variable2;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select1_Default;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select2_Default;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     Temp_byte_Variable3;                               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select3_Default;                            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLaunchedActorHomeLocation_Location;    // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LaunchPart_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     K2Node_CustomEvent_NewACT;                         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bForce;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EECHState                                     K2Node_CustomEvent_ACT2;                           // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     K2Node_CustomEvent_ACT1;                           // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EECHState                                     K2Node_CustomEvent_ACT;                            // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CallFunc_GetComponentsByTag_ReturnValue;           // 0x0220(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStandAccompanyTransition                     K2Node_Event_AccompanyTransition;                  // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldDestroy;                       // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH) == 0x000010, "Wrong alignment on BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH) == 0x000270, "Wrong size on BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, EntryPoint) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_byte_Variable) == 0x000004, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_class_Variable) == 0x000008, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_class_Variable1) == 0x000010, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_class_Variable2) == 0x000018, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Select_Default) == 0x000030, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName4) == 0x000038, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName3) == 0x000040, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate1) == 0x000048, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName2) == 0x000058, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName1) == 0x000070, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName) == 0x000088, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate4) == 0x000090, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_name_Variable) == 0x0000A0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_byte_Variable1) == 0x0000A8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_object_Variable) == 0x0000B0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_object_Variable1) == 0x0000B8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_object_Variable2) == 0x0000C0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_byte_Variable2) == 0x0000C8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Select1_Default) == 0x0000D0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_name_Variable1) == 0x0000D8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_name_Variable2) == 0x0000E8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_name_Variable3) == 0x0000F0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000F8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Select2_Default) == 0x000100, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_byte_Variable3) == 0x000108, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_bool_Variable) == 0x000109, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_bool_Variable1) == 0x00010A, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_bool_Variable2) == 0x00010B, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Select3_Default) == 0x00010C, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsValid_ReturnValue1) == 0x00010D, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_DynamicCast_AsPawn) == 0x000118, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate5) == 0x000128, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsLocallyControlled_ReturnValue) == 0x000138, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsValid_ReturnValue2) == 0x000139, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsDedicatedServer_ReturnValue) == 0x00013A, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_int_Loop_Counter_Variable) == 0x00013C, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_int_Array_Index_Variable) == 0x000144, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, Temp_name_Variable4) == 0x000148, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsServer_ReturnValue) == 0x000150, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName9) == 0x000158, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000160, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsValid_ReturnValue3) == 0x000168, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_GetLaunchedActorHomeLocation_Location) == 0x00016C, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_GetLaunchedActorHomeLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_GetOwner_ReturnValue1) == 0x0001B0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NewACT) == 0x0001C8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NewACT' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_bForce) == 0x0001C9, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_bForce' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_ACT2) == 0x0001CA, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_ACT2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_ACT1) == 0x0001CB, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_ACT1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_ACT) == 0x0001CC, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_ACT' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001CD, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName5) == 0x0001D0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_BooleanOR_ReturnValue) == 0x0001D8, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate6) == 0x0001E0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate7) == 0x0001F0, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName6) == 0x000200, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate8) == 0x000208, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName7) == 0x000218, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_GetComponentsByTag_ReturnValue) == 0x000220, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CreateDelegate_OutputDelegate9) == 0x000230, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_Array_Get_Item) == 0x000240, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_Less_IntInt_ReturnValue) == 0x00024C, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Event_AccompanyTransition) == 0x00024D, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Event_AccompanyTransition' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_CustomEvent_NotifyName8) == 0x000250, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000258, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, K2Node_Event_bShouldDestroy) == 0x000259, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::K2Node_Event_bShouldDestroy' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000260, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH, CallFunc_IsValid_ReturnValue4) == 0x000268, "Member 'BP_AJBInGameStand_ECH_C_ExecuteUbergraph_BP_AJBInGameStand_ECH::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.ChangeAct_Local
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameStand_ECH_C_ChangeAct_Local final
{
public:
	EECHState                                     ACT_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_ChangeAct_Local) == 0x000001, "Wrong alignment on BP_AJBInGameStand_ECH_C_ChangeAct_Local");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_ChangeAct_Local) == 0x000001, "Wrong size on BP_AJBInGameStand_ECH_C_ChangeAct_Local");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ChangeAct_Local, ACT_0) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_ChangeAct_Local::ACT_0' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.MC_Change
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameStand_ECH_C_MC_Change final
{
public:
	EECHState                                     ACT_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_MC_Change) == 0x000001, "Wrong alignment on BP_AJBInGameStand_ECH_C_MC_Change");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_MC_Change) == 0x000001, "Wrong size on BP_AJBInGameStand_ECH_C_MC_Change");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_MC_Change, ACT_0) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_MC_Change::ACT_0' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.ROS_Change
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameStand_ECH_C_ROS_Change final
{
public:
	EECHState                                     ACT_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_ROS_Change) == 0x000001, "Wrong alignment on BP_AJBInGameStand_ECH_C_ROS_Change");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_ROS_Change) == 0x000001, "Wrong size on BP_AJBInGameStand_ECH_C_ROS_Change");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ROS_Change, ACT_0) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_ROS_Change::ACT_0' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.ChangeAct
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameStand_ECH_C_ChangeAct final
{
public:
	EECHState                                     NewACT;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForce;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_ChangeAct) == 0x000001, "Wrong alignment on BP_AJBInGameStand_ECH_C_ChangeAct");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_ChangeAct) == 0x000002, "Wrong size on BP_AJBInGameStand_ECH_C_ChangeAct");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ChangeAct, NewACT) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_ChangeAct::NewACT' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_ChangeAct, bForce) == 0x000001, "Member 'BP_AJBInGameStand_ECH_C_ChangeAct::bForce' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5) == 0x000008, "Wrong size on BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.SetActMeshAndMaterial
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial final
{
public:
	EECHState                                     ACT_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial) == 0x000001, "Wrong alignment on BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial) == 0x000004, "Wrong size on BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial, ACT_0) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial::ACT_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000002, "Member 'BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial, CallFunc_NotEqual_ObjectObject_ReturnValue1) == 0x000003, "Member 'BP_AJBInGameStand_ECH_C_SetActMeshAndMaterial::CallFunc_NotEqual_ObjectObject_ReturnValue1' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.GetLaunchedActorHomeLocation
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFixedLocation_Location;                // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation) == 0x000004, "Wrong alignment on BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation) == 0x000038, "Wrong size on BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, Location) == 0x000004, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, Temp_int_Variable) == 0x000010, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, CallFunc_GetFixedLocation_Location) == 0x000014, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::CallFunc_GetFixedLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation, K2Node_Select_Default) == 0x00002C, "Member 'BP_AJBInGameStand_ECH_C_GetLaunchedActorHomeLocation::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.GetCloseRangeLaunchedActor
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LaunchedActor;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor) == 0x000008, "Wrong alignment on BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor");
static_assert(sizeof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor) == 0x000020, "Wrong size on BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor, LaunchedActor) == 0x000008, "Member 'BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor::LaunchedActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor, Temp_int_Variable) == 0x000010, "Member 'BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor, K2Node_Select_Default) == 0x000018, "Member 'BP_AJBInGameStand_ECH_C_GetCloseRangeLaunchedActor::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C.GetAttackRange
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameStand_ECH_C_GetAttackRange final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
