#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTorrentialRainCloud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTorrentialRainCloud.BP_AJBTorrentialRainCloud_C.ExecuteUbergraph_BP_AJBTorrentialRainCloud
// 0x0458 (0x0458 - 0x0000)
struct BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue2;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceZ_Z;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMovableStand_ReturnValue;              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable2;                       // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue3;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0094(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewPhase;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue4;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue1;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select2_Default;                            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item1;                          // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCharacterHeadLocation_HeadLocation;    // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item2;                          // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect1; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NextPhase;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select3_Default;                            // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item3;                          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue2;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_1;     // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable1;                       // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D8(0x0008)(NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue1;        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bNewVisibility;                 // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0204(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMovableStand_ReturnValue1;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue11;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue12;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameMovableStand_C*            K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand;  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue13;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UnderwaterAffecter_C*               CallFunc_GetComponentByClass_ReturnValue5;         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCameraInWater;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select4_Default;                            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsCameraInWater)>         K2Node_CreateDelegate_OutputDelegate1;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue3;            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable9;                               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select5_Default;                            // 0x02C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCloudPositionInWater_ReturnValue;      // 0x02D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue14;                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect2; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameMovableStand_C*            K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x039C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult1;      // 0x03C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue1;         // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0453(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud) == 0x000008, "Wrong alignment on BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud");
static_assert(sizeof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud) == 0x000458, "Wrong size on BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, EntryPoint) == 0x000000, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable) == 0x000010, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue1) == 0x000028, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetComponentByClass_ReturnValue1) == 0x000030, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsValid_ReturnValue1) == 0x000038, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable1) == 0x000039, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00003C, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_MakeLiteralFloat_ReturnValue1) == 0x000040, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_MakeLiteralFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue2) == 0x000048, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetComponentByClass_ReturnValue2) == 0x000050, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetWaterSurfaceZ_Z) == 0x000058, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetWaterSurfaceZ_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue3) == 0x000060, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000068, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable2) == 0x000071, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_HasMovableStand_ReturnValue) == 0x000072, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_HasMovableStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_Select_Default) == 0x000073, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Not_PreBool_ReturnValue) == 0x000074, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_CustomEvent_bEnable2) == 0x000075, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_CustomEvent_bEnable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue4) == 0x000078, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetComponentByClass_ReturnValue3) == 0x000080, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsInWater_ReturnValue) == 0x000088, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsValid_ReturnValue2) == 0x000089, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable3) == 0x00008A, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue) == 0x00008B, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_Select1_Default) == 0x00008C, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable4) == 0x00008D, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000094, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_CustomEvent_NewPhase) == 0x0000AC, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_CustomEvent_NewPhase' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_VSize_ReturnValue) == 0x0000B0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_SwitchInteger_CmpSuccess) == 0x0000B9, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue5) == 0x0000C0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_BooleanXOR_ReturnValue) == 0x0000C8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetComponentByClass_ReturnValue4) == 0x0000D0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetComponentByClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsInWater_ReturnValue1) == 0x0000D8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsInWater_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsValid_ReturnValue3) == 0x0000D9, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable5) == 0x0000DA, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_Select2_Default) == 0x0000E0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Not_PreBool_ReturnValue1) == 0x0000E1, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000E4, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000EC, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Array_Get_Item1) == 0x0000F0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x0000F8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable6) == 0x000100, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetCharacterHeadLocation_HeadLocation) == 0x000104, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetCharacterHeadLocation_HeadLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000110, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000120, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000128, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue6) == 0x000130, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000138, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_bSuccess1) == 0x000140, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetOwner_ReturnValue7) == 0x000148, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Array_Get_Item2) == 0x000150, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000158, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_DynamicCast_bSuccess2) == 0x000160, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestParticleEffectOnLocal_ParticleEffect1) == 0x000168, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestParticleEffectOnLocal_ParticleEffect1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_CustomEvent_NextPhase) == 0x000170, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_CustomEvent_NextPhase' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_bool_Variable7) == 0x000174, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000175, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_Select3_Default) == 0x000176, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000177, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_int_Variable) == 0x000178, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Array_Get_Item3) == 0x000180, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000188, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_MakeLiteralFloat_ReturnValue2) == 0x000190, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_MakeLiteralFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, Temp_float_Variable) == 0x000194, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Add_FloatFloat_ReturnValue) == 0x000198, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00019C, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Less_IntInt_ReturnValue) == 0x00019D, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_BooleanAND_ReturnValue) == 0x00019E, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001A4, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsValid_ReturnValue4) == 0x0001B0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Less_IntInt_ReturnValue1) == 0x0001B1, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestGion_AkComponent__LocalOnly_1) == 0x0001B8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestGion_AkComponent__LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1) == 0x0001C0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0001C1, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0001C2, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_BooleanAND_ReturnValue1) == 0x0001C3, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue4) == 0x0001C4, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_CustomEvent_bEnable1) == 0x0001C5, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_CustomEvent_bEnable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_Not_PreBool_ReturnValue2) == 0x0001C6, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_IsDedicatedServer_ReturnValue5) == 0x0001C7, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, K2Node_CreateDelegate_OutputDelegate) == 0x0001C8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D8, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud, CallFunc_GetWorldDeltaSeconds_ReturnValue1) == 0x0001E0, "Member 'BP_AJBTorrentialRainCloud_C_ExecuteUbergraph_BP_AJBTorrentialRainCloud::CallFunc_GetWorldDeltaSeconds_ReturnValue1' has a wrong offset!");
