#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBZipperInteractAnimator

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBZipperInteractAnimator.BP_AJBZipperInteractAnimator_C.ExecuteUbergraph_BP_AJBZipperInteractAnimator
// 0x0410 (0x0410 - 0x0000)
struct BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x011C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult1;      // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue1;         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult2;      // 0x01C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue2;         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue1;                       // 0x024C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult3;      // 0x0258(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue3;         // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult4;      // 0x02E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue4;         // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373[0x5];                                      // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult5;      // 0x0380(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue5;         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator) == 0x000008, "Wrong alignment on BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator");
static_assert(sizeof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator) == 0x000410, "Wrong size on BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, EntryPoint) == 0x000000, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue1) == 0x000010, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue2) == 0x000018, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000029, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x00002A, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue3) == 0x000030, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue4) == 0x000038, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue5) == 0x000040, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000048, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue6) == 0x000058, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_IsClosed_Variable) == 0x000060, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_Operator) == 0x000068, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_Time) == 0x000070, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_Timing) == 0x000074, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_bEnable) == 0x000075, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_bOperatorIsEmpty) == 0x000076, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000080, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000090, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000118, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_VLerp_ReturnValue) == 0x00011C, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult1) == 0x000128, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue1) == 0x0001B0, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0001B4, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x0001B8, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult2) == 0x0001C0, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue2) == 0x000248, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_VLerp_ReturnValue1) == 0x00024C, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_VLerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult3) == 0x000258, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue3) == 0x0002E0, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult4) == 0x0002E8, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult4' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue4) == 0x000370, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_Has_Been_Initd_Variable1) == 0x000371, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, Temp_bool_IsClosed_Variable1) == 0x000372, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_GetOwner_ReturnValue7) == 0x000378, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_SweepHitResult5) == 0x000380, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_SweepHitResult5' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator, CallFunc_K2_SetActorLocation_ReturnValue5) == 0x000408, "Member 'BP_AJBZipperInteractAnimator_C_ExecuteUbergraph_BP_AJBZipperInteractAnimator::CallFunc_K2_SetActorLocation_ReturnValue5' has a wrong offset!");

// Function BP_AJBZipperInteractAnimator.BP_AJBZipperInteractAnimator_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBZipperInteractAnimator_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBZipperInteractAnimator_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBZipperInteractAnimator_C_ReceiveTick");
static_assert(sizeof(BP_AJBZipperInteractAnimator_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBZipperInteractAnimator_C_ReceiveTick");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBZipperInteractAnimator_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBZipperInteractAnimator.BP_AJBZipperInteractAnimator_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBZipperInteractAnimator_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBZipperInteractAnimator_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBZipperInteractAnimator_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBZipperInteractAnimator_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBZipperInteractAnimator_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBZipperInteractAnimator_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBZipperInteractAnimator_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBZipperInteractAnimator_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBZipperInteractAnimator_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

}

