#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.OnComsume__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItem_C_OnComsume__DelegateSignature final
{
public:
	class AAJBInGameCharacter*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_C_OnComsume__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_OnComsume__DelegateSignature");
static_assert(sizeof(BP_AJBInGameItem_C_OnComsume__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameItem_C_OnComsume__DelegateSignature");
static_assert(offsetof(BP_AJBInGameItem_C_OnComsume__DelegateSignature, Character) == 0x000000, "Member 'BP_AJBInGameItem_C_OnComsume__DelegateSignature::Character' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.ExecuteUbergraph_BP_AJBInGameItem
// 0x0148 (0x0148 - 0x0000)
struct BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_HitCharacter;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_HitCharacter1;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0078(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue1;    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Character;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation; // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem");
static_assert(sizeof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem) == 0x000148, "Wrong size on BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_HitCharacter) == 0x000008, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_PlayerIndex) == 0x000010, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000014, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000028, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller) == 0x000040, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_HitCharacter1) == 0x000050, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_HitCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000058, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherActor) == 0x000060, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherComp) == 0x000068, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000070, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_bFromSweep) == 0x000074, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_SweepResult) == 0x000078, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000100, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_bSuccess1) == 0x000108, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_CharacterBehaviorMatches_ReturnValue1) == 0x000109, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_CharacterBehaviorMatches_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_HasLocalSharedController_ReturnValue) == 0x00010A, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue) == 0x00010B, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_Character) == 0x000110, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue1) == 0x000118, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000120, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation) == 0x000128, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsValid_ReturnValue) == 0x000134, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000138, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.MC_RequestConsumeEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItem_C_MC_RequestConsumeEffect final
{
public:
	class ABP_AJBInGameCharacter_C*               Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_C_MC_RequestConsumeEffect) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_MC_RequestConsumeEffect");
static_assert(sizeof(BP_AJBInGameItem_C_MC_RequestConsumeEffect) == 0x000008, "Wrong size on BP_AJBInGameItem_C_MC_RequestConsumeEffect");
static_assert(offsetof(BP_AJBInGameItem_C_MC_RequestConsumeEffect, Character) == 0x000000, "Member 'BP_AJBInGameItem_C_MC_RequestConsumeEffect::Character' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.TryConsume
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_TryConsume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_C_TryConsume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_TryConsume");
static_assert(sizeof(BP_AJBInGameItem_C_TryConsume) == 0x000010, "Wrong size on BP_AJBInGameItem_C_TryConsume");
static_assert(offsetof(BP_AJBInGameItem_C_TryConsume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_TryConsume::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_TryConsume, PlayerIndex) == 0x000008, "Member 'BP_AJBInGameItem_C_TryConsume::PlayerIndex' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.OnROS_Consume
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItem_C_OnROS_Consume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_C_OnROS_Consume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_OnROS_Consume");
static_assert(sizeof(BP_AJBInGameItem_C_OnROS_Consume) == 0x000008, "Wrong size on BP_AJBInGameItem_C_OnROS_Consume");
static_assert(offsetof(BP_AJBInGameItem_C_OnROS_Consume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_OnROS_Consume::HitCharacter' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

