#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStand_SFG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_StencilDigit_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.ExecuteUbergraph_BP_AJBInGameStand_SFG
// 0x01D0 (0x01D0 - 0x0000)
struct BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LaunchPart_PairOfOne_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStandPart_SFGArm_C*        CallFunc_FinishSpawningActor_ReturnValue1;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LaunchPart_PairOfOne_C*             CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStandPart_SFGArm_C*        CallFunc_FinishSpawningActor_ReturnValue3;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldDestroy;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_Event_StandName;                            // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_SkinId;                               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG) == 0x000010, "Wrong alignment on BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG) == 0x0001D0, "Wrong size on BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, EntryPoint) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CustomEvent_NotifyName1) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CustomEvent_NotifyName) == 0x000020, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, Temp_name_Variable) == 0x000038, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_MakeTransform_ReturnValue1) == 0x000070, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_MakeTransform_ReturnValue2) == 0x0000A0, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_MakeTransform_ReturnValue3) == 0x0000D0, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue1) == 0x000101, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue2) == 0x000102, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue3) == 0x000103, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue4) == 0x000104, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsServer_ReturnValue) == 0x000105, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue5) == 0x000106, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000108, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_IsValid_ReturnValue6) == 0x000110, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_GetOwner_ReturnValue) == 0x000118, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CustomEvent_NotifyName3) == 0x000128, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_FinishSpawningActor_ReturnValue) == 0x000130, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000138, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_FinishSpawningActor_ReturnValue1) == 0x000140, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_GetOwner_ReturnValue1) == 0x000148, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CreateDelegate_OutputDelegate2) == 0x000150, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000160, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000168, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CreateDelegate_OutputDelegate3) == 0x000170, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3) == 0x000180, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, CallFunc_FinishSpawningActor_ReturnValue3) == 0x000188, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::CallFunc_FinishSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_Event_bShouldDestroy) == 0x000190, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_Event_bShouldDestroy' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CustomEvent_NotifyName4) == 0x000198, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CreateDelegate_OutputDelegate4) == 0x0001A0, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_Event_StandName) == 0x0001B0, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_Event_StandName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_Event_SkinId) == 0x0001C0, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_Event_SkinId' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG, K2Node_CustomEvent_NotifyName2) == 0x0001C8, "Member 'BP_AJBInGameStand_SFG_C_ExecuteUbergraph_BP_AJBInGameStand_SFG::K2Node_CustomEvent_NotifyName2' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.OnCompleted_7DE86E914FDE681FA83395A66CE14B71
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong size on BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_OnCompleted_7DE86E914FDE681FA83395A66CE14B71::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.OnBlendOut_7DE86E914FDE681FA83395A66CE14B71
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong size on BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_OnBlendOut_7DE86E914FDE681FA83395A66CE14B71::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.OnInterrupted_7DE86E914FDE681FA83395A66CE14B71
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong size on BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_OnInterrupted_7DE86E914FDE681FA83395A66CE14B71::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong size on BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_OnNotifyBegin_7DE86E914FDE681FA83395A66CE14B71::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71) == 0x000008, "Wrong size on BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_OnNotifyEnd_7DE86E914FDE681FA83395A66CE14B71::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetDamageActorTargetLocation
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation) == 0x000004, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation) == 0x00000C, "Wrong size on BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation, Location) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetDamageActorTargetLocation::Location' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetAttackRange
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetAttackRange final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetAttackRange) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetAttackRange");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetAttackRange) == 0x000030, "Wrong size on BP_AJBInGameStand_SFG_C_GetAttackRange");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, AttackRange) == 0x000004, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::AttackRange' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackRange, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_AJBInGameStand_SFG_C_GetAttackRange::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetAttackCollisionRadius
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius) == 0x000030, "Wrong size on BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, Radius) == 0x000004, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::Radius' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBInGameStand_SFG_C_GetAttackCollisionRadius::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetAttackLocation
// 0x0024 (0x0024 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetAttackLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchedActorHomeLocation_Location;    // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetAttackLocation) == 0x000004, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetAttackLocation");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetAttackLocation) == 0x000024, "Wrong size on BP_AJBInGameStand_SFG_C_GetAttackLocation");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackLocation, TargetLocation) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetAttackLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackLocation, Location) == 0x00000C, "Member 'BP_AJBInGameStand_SFG_C_GetAttackLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetAttackLocation, CallFunc_GetLaunchedActorHomeLocation_Location) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_GetAttackLocation::CallFunc_GetLaunchedActorHomeLocation_Location' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetStandAttackOffset
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetStandAttackOffset final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StandAttackOffset;                                 // 0x0004(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetStandAttackOffset) == 0x000004, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetStandAttackOffset");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetStandAttackOffset) == 0x000010, "Wrong size on BP_AJBInGameStand_SFG_C_GetStandAttackOffset");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetStandAttackOffset, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetStandAttackOffset::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetStandAttackOffset, StandAttackOffset) == 0x000004, "Member 'BP_AJBInGameStand_SFG_C_GetStandAttackOffset::StandAttackOffset' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetLaunchedActorHomeLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation) == 0x000030, "Wrong size on BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation, Location) == 0x000004, "Member 'BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation, Temp_bool_Variable) == 0x000010, "Member 'BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation, K2Node_Select_Default) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_SFG_C_GetLaunchedActorHomeLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetCloseRangeLaunchedActor
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LaunchedActor;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor) == 0x000020, "Wrong size on BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor, LaunchedActor) == 0x000008, "Member 'BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor::LaunchedActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor, Temp_bool_Variable) == 0x000010, "Member 'BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor, K2Node_Select_Default) == 0x000018, "Member 'BP_AJBInGameStand_SFG_C_GetCloseRangeLaunchedActor::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.ChangeSkin
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInGameStand_SFG_C_ChangeSkin final
{
public:
	class FString                                 StandName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         SkinID;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_ChangeSkin) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_ChangeSkin");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_ChangeSkin) == 0x000018, "Wrong size on BP_AJBInGameStand_SFG_C_ChangeSkin");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ChangeSkin, StandName) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_ChangeSkin::StandName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_ChangeSkin, SkinID) == 0x000010, "Member 'BP_AJBInGameStand_SFG_C_ChangeSkin::SkinID' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.CleanUp
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameStand_SFG_C_CleanUp final
{
public:
	bool                                          bShouldDestroy;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_CleanUp) == 0x000001, "Wrong alignment on BP_AJBInGameStand_SFG_C_CleanUp");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_CleanUp) == 0x000001, "Wrong size on BP_AJBInGameStand_SFG_C_CleanUp");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_CleanUp, bShouldDestroy) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_CleanUp::bShouldDestroy' has a wrong offset!");

// Function BP_AJBInGameStand_SFG.BP_AJBInGameStand_SFG_C.GetPrimitivesToChangeStencil
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil final
{
public:
	E_StencilDigit                                StencilDigit;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            PrimitiveComponents;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class UPrimitiveComponent*>            Temp_Results;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPrimitiveComponent*>            CallFunc_GetPrimitivesToChangeStencil_PrimitiveComponents; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil) == 0x000008, "Wrong alignment on BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil");
static_assert(sizeof(BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil) == 0x000048, "Wrong size on BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil, StencilDigit) == 0x000000, "Member 'BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil::StencilDigit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil, PrimitiveComponents) == 0x000008, "Member 'BP_AJBInGameStand_SFG_C_GetPrimitivesToChangeStencil::PrimitiveComponents' has a wrong offset!");
