#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectile_Straight

#include "Basic.hpp"

#include "BP_AJBInGameProjectile_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameProjectile_Straight.BP_AJBInGameProjectile_Straight_C
// 0x0018 (0x0490 - 0x0478)
class ABP_AJBInGameProjectile_Straight_C : public ABP_AJBInGameProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameProjectile_Straight_C;  // 0x0478(0x0008)(Transient, DuplicateTransient)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpeedScale;                                    // 0x048C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameProjectile_Straight(int32 EntryPoint);
	void PlayHitSECharacter(class AActor* HitActor, const struct FVector& HitLocation_0, bool bHeadShot, EPhysicalSurface SurfaceType, float CuttingRate, bool bBlockedByAAP, const struct FGameplayTag& SETagBlockedByAAP);
	void PlayHitSENonCharacter(class AActor* HitActor, const struct FVector& HitLocation_0, bool bHeadShot, EPhysicalSurface SurfaceType, float CuttingRate);
	void DelayedDestroy(float DelaySec);
	void MC_OnBlocking(class AActor* BlockedActor, const struct FVector& HitLocation_0, bool bReflect, bool bSeparateStandAttack);
	void ROC_CallOnSkillBlockedLocal(bool bAvoidSkill);
	void Blocking(class AActor* BlockedActor, class AActor* OtherActor, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, int32 CuttingProjectile___, int32 CuttingOther___, bool bInvincible, bool bReflectProjectile, const struct FRotator& ReflectRotation, bool bAvoidSkill, bool bSeparateStandAttack, const struct FGameplayTag& ReflectSkillTag_0);
	void SetSpeed(float NewSpeed);
	void GetScaledSpeed(float* Speed_0);
	void CheckGravityLoadAffected(bool* bAffected);
	void AddGravityScale();
	void CheckIgnoreBlocking(class AActor* TargetActor, bool* bIgnore);
	void CheckPassiveOnly(bool* bIsPassiveOnly);
	void OnMC_ProjectileHit(class AActor* HitActor, const struct FVector& HitLocation_0, bool bHeadShot, EPhysicalSurface SurfaceType, bool bDisableDamage, float CuttingRate, bool bBlockedByAAP, bool bReflect);
	void ReceiveBeginPlay();
	void OnROS_ProjectileHit(class AActor* HitActor, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, bool bHeadShot, bool bPenetrate_0, bool bFirstHit, float CuttingRate, bool bDisableDamage, bool bReflect, const struct FRotator& ReflectRotation, bool bBlocking, const struct FGameplayTag& ReflectSkillTag_0);
	void OnProjectileHit(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool FromSweep, const struct FHitResult& SweepResult, bool bHeadShot, bool bPenetrate_0, bool bFirstHit);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void PlayHitSE(class AActor* HitActor, const struct FVector& HitLocation_0, bool bHeadShot, EPhysicalSurface SurfaceType, float CuttingRate, bool bBlockedByAAP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameProjectile_Straight_C">();
	}
	static class ABP_AJBInGameProjectile_Straight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameProjectile_Straight_C>();
	}
};
static_assert(alignof(ABP_AJBInGameProjectile_Straight_C) == 0x000008, "Wrong alignment on ABP_AJBInGameProjectile_Straight_C");
static_assert(sizeof(ABP_AJBInGameProjectile_Straight_C) == 0x000490, "Wrong size on ABP_AJBInGameProjectile_Straight_C");
static_assert(offsetof(ABP_AJBInGameProjectile_Straight_C, UberGraphFrame_BP_AJBInGameProjectile_Straight_C) == 0x000478, "Member 'ABP_AJBInGameProjectile_Straight_C::UberGraphFrame_BP_AJBInGameProjectile_Straight_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_Straight_C, ProjectileMovement) == 0x000480, "Member 'ABP_AJBInGameProjectile_Straight_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_Straight_C, Speed) == 0x000488, "Member 'ABP_AJBInGameProjectile_Straight_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectile_Straight_C, bUseSpeedScale) == 0x00048C, "Member 'ABP_AJBInGameProjectile_Straight_C::bUseSpeedScale' has a wrong offset!");

}

