#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGamePlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C
// 0x0040 (0x2630 - 0x25F0)
class ABP_AJBInGamePlayerCameraManager_C final : public AAJBPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x25F0(0x0008)(Transient, DuplicateTransient)
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x25F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_DamageArea;                               // 0x2600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_TheWorld_TimeStop;                        // 0x2604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_TheWorld_RadialBlur;                      // 0x2608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_CrimsonDimension;                         // 0x260C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDamageAreaEffectOpacity;                    // 0x2610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2614[0x4];                                     // 0x2614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_DamageAreaPostProcess;                         // 0x2618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInDamageArea;                                   // 0x2620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DamageAreaExists;                                  // 0x2621(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGamePlayerCameraManager(int32 EntryPoint);
	void ChangeCrimsonDimensionEffect(bool bEnable);
	void OnResetPostProcess();
	void ChangeTheWorldEffect(bool Enable);
	void OpenTickGate();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetPostProcessMaterialBlendWeight(int32 MaterialIndex, float Weight);
	void SetPostProcessMaterialObject(int32 MaterialIndex, class UObject* Object, bool bInsert);
	void SetPostProcessMaterial(class UMaterialInterface* PostProcessMaterial, int32& PostProcesIndex, bool IsEnable);
	void PrepareDamageAreaDynamicMaterialInstance();
	void RequestDestroyDefaultListener();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGamePlayerCameraManager_C">();
	}
	static class ABP_AJBInGamePlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGamePlayerCameraManager_C>();
	}
};
static_assert(alignof(ABP_AJBInGamePlayerCameraManager_C) == 0x000010, "Wrong alignment on ABP_AJBInGamePlayerCameraManager_C");
static_assert(sizeof(ABP_AJBInGamePlayerCameraManager_C) == 0x002630, "Wrong size on ABP_AJBInGamePlayerCameraManager_C");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, UberGraphFrame) == 0x0025F0, "Member 'ABP_AJBInGamePlayerCameraManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, PostProcessVolume) == 0x0025F8, "Member 'ABP_AJBInGamePlayerCameraManager_C::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, PPMIndex_DamageArea) == 0x002600, "Member 'ABP_AJBInGamePlayerCameraManager_C::PPMIndex_DamageArea' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, PPMIndex_TheWorld_TimeStop) == 0x002604, "Member 'ABP_AJBInGamePlayerCameraManager_C::PPMIndex_TheWorld_TimeStop' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, PPMIndex_TheWorld_RadialBlur) == 0x002608, "Member 'ABP_AJBInGamePlayerCameraManager_C::PPMIndex_TheWorld_RadialBlur' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, PPMIndex_CrimsonDimension) == 0x00260C, "Member 'ABP_AJBInGamePlayerCameraManager_C::PPMIndex_CrimsonDimension' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, CurrentDamageAreaEffectOpacity) == 0x002610, "Member 'ABP_AJBInGamePlayerCameraManager_C::CurrentDamageAreaEffectOpacity' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, DMI_DamageAreaPostProcess) == 0x002618, "Member 'ABP_AJBInGamePlayerCameraManager_C::DMI_DamageAreaPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, bIsInDamageArea) == 0x002620, "Member 'ABP_AJBInGamePlayerCameraManager_C::bIsInDamageArea' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGamePlayerCameraManager_C, DamageAreaExists) == 0x002621, "Member 'ABP_AJBInGamePlayerCameraManager_C::DamageAreaExists' has a wrong offset!");

}

