#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIDummyPlayerInputComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBAIDummyPlayerInputComponent.BP_AJBAIDummyPlayerInputComponent_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBAIDummyPlayerInputComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	int32                                         PlayerIndex;                                       // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  DummyPawn;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          AIController;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	class APawn* GetPlayerPawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBAIDummyPlayerInputComponent_C">();
	}
	static class UBP_AJBAIDummyPlayerInputComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBAIDummyPlayerInputComponent_C>();
	}
};
static_assert(alignof(UBP_AJBAIDummyPlayerInputComponent_C) == 0x000008, "Wrong alignment on UBP_AJBAIDummyPlayerInputComponent_C");
static_assert(sizeof(UBP_AJBAIDummyPlayerInputComponent_C) == 0x000118, "Wrong size on UBP_AJBAIDummyPlayerInputComponent_C");
static_assert(offsetof(UBP_AJBAIDummyPlayerInputComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBAIDummyPlayerInputComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBAIDummyPlayerInputComponent_C, PlayerIndex) == 0x0000F8, "Member 'UBP_AJBAIDummyPlayerInputComponent_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UBP_AJBAIDummyPlayerInputComponent_C, PlayerController) == 0x000100, "Member 'UBP_AJBAIDummyPlayerInputComponent_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UBP_AJBAIDummyPlayerInputComponent_C, DummyPawn) == 0x000108, "Member 'UBP_AJBAIDummyPlayerInputComponent_C::DummyPawn' has a wrong offset!");
static_assert(offsetof(UBP_AJBAIDummyPlayerInputComponent_C, AIController) == 0x000110, "Member 'UBP_AJBAIDummyPlayerInputComponent_C::AIController' has a wrong offset!");

}

