#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSkillBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "E_SidlingFinishTiming_structs.hpp"
#include "Engine_structs.hpp"
#include "E_VoiceProcessType_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSkillBase.BP_AJBSkillBase_C.ExecuteUbergraph_BP_AJBSkillBase
// 0x0438 (0x0438 - 0x0000)
struct BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_LeftUseNum;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_GamePlayTagContainer;           // 0x0028(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value3;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Num2;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value2;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Num1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Num;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue1;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag1;                                 // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Operator;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Target;                               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CauserType;                           // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue2;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SidlingFinishTiming                         Temp_byte_Variable;                                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_Event_Operator1;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag2;                                 // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatValue;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ReadySkill1;                    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ReadySkill;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue2;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue3;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSkillBase_C*                     CallFunc_GetBasicSkill_BasicSkill;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue3;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue2;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAnyActiveSkillActive_bActive;        // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     CallFunc_GetBasicSkill_BasicSkill1;                // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue4;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bShouldRestore1;                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNPC_ReturnValue;                        // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue4;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand4;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue5;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand5;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bShouldRestore;                 // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue9;           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue10;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue11;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue12;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue13;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue14;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue15;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue16;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue7;    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue5;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue3;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue1;               // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue8;                 // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillState_bMatch;                   // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue9;                 // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue17;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue18;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue8;    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue10;                 // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue19;          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue10;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character10;    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue20;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue21;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character11;    // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character12;    // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess19;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value1;                         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue11;                // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue12;                // 0x03E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6[0x2];                                      // 0x03E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue22;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character13;    // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess20;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue13;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue6;               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue14;                // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand6;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess21;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue23;          // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character14;    // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess22;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase) == 0x000008, "Wrong alignment on BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase");
static_assert(sizeof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase) == 0x000438, "Wrong size on BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, EntryPoint) == 0x000000, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_ClassIsChildOf_ReturnValue) == 0x000020, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_LeftUseNum) == 0x000024, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_LeftUseNum' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_GamePlayTagContainer) == 0x000028, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_GamePlayTagContainer' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Not_PreBool_ReturnValue1) == 0x000048, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetObjectClass_ReturnValue1) == 0x000050, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Not_PreBool_ReturnValue2) == 0x000058, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerStand_ReturnValue) == 0x000060, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000068, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_Value3) == 0x00007C, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_Value3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_Num2) == 0x000080, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_Num2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_Value2) == 0x000084, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_Value2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_Num1) == 0x000088, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_Num1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Tag) == 0x000090, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_Num) == 0x000098, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_Num' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_RemoveGameplayTag_ReturnValue) == 0x00009C, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_RemoveGameplayTag_ReturnValue1) == 0x00009D, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_RemoveGameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Tag1) == 0x0000A0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Tag1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Operator) == 0x0000A8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Target) == 0x0000B0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_CauserType) == 0x0000B8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_CauserType' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_SerialNumber) == 0x0000C0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000C4, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0000C8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_HasLocalSharedController_ReturnValue) == 0x0000D0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_SwitchEnum_CmpSuccess) == 0x0000D1, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_IsValid_ReturnValue) == 0x0000D2, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_BooleanAND_ReturnValue) == 0x0000D3, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetObjectClass_ReturnValue2) == 0x0000D8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetObjectClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_ClassIsChildOf_ReturnValue1) == 0x0000E0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, Temp_byte_Variable) == 0x0000E1, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Not_PreBool_ReturnValue3) == 0x0000E2, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Select_Default) == 0x0000E4, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0000E8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000F0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess1) == 0x0000F8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerStand_ReturnValue1) == 0x000100, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Operator1) == 0x000108, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Operator1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Time) == 0x000110, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Timing) == 0x000114, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_bEnable) == 0x000115, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_bOperatorIsEmpty) == 0x000116, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000118, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess2) == 0x000120, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_Tag2) == 0x000128, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_Tag2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_Event_FloatValue) == 0x000130, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_Event_FloatValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_ReadySkill1) == 0x000138, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_ReadySkill1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CustomEvent_ReadySkill) == 0x000140, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CustomEvent_ReadySkill' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerStand_ReturnValue2) == 0x000148, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerStand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2) == 0x000150, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess3) == 0x000158, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_CreateDelegate_OutputDelegate1) == 0x000160, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerStand_ReturnValue3) == 0x000178, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerStand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000180, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3) == 0x000188, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess4) == 0x000190, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000198, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, K2Node_DynamicCast_bSuccess5) == 0x0001A0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetAJBGameInstance_bSuccess) == 0x0001A1, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0001A8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetBasicSkill_BasicSkill) == 0x0001B0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetBasicSkill_BasicSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_IsPlayingReplay_ReturnValue) == 0x0001B8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetObjectClass_ReturnValue3) == 0x0001C0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetObjectClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_ClassIsChildOf_ReturnValue2) == 0x0001C8, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_ClassIsChildOf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_IsValid_ReturnValue1) == 0x0001C9, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_IsSkillActive_ReturnValue) == 0x0001CA, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_IsSkillActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_CheckAnyActiveSkillActive_bActive) == 0x0001CB, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_CheckAnyActiveSkillActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_Not_PreBool_ReturnValue4) == 0x0001CC, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase, CallFunc_GetBasicSkill_BasicSkill1) == 0x0001D0, "Member 'BP_AJBSkillBase_C_ExecuteUbergraph_BP_AJBSkillBase::CallFunc_GetBasicSkill_BasicSkill1' has a wrong offset!");
