#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOutGameProxy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetCommon_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnSelectedStartLocation__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature final
{
public:
	EResultStartLocation                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         X;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GameServerUserID;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature) == 0x000020, "Wrong size on BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature, Result) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature, X) == 0x000004, "Member 'BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature::X' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature, Y) == 0x000008, "Member 'BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature::Y' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature, GameServerUserID) == 0x000010, "Member 'BP_AJBOutGameProxy_C_OnSelectedStartLocation__DelegateSignature::GameServerUserID' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnLoginOtherPlayer__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature final
{
public:
	int32                                         PlayerNum;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature) == 0x000004, "Wrong size on BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature, PlayerNum) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnLoginOtherPlayer__DelegateSignature::PlayerNum' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnCreatedRoom__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnCreatedRoom__DelegateSignature::bSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnDeletedRoom__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnDeletedRoom__DelegateSignature::bSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnPairMatched__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    PairMatchingPlayerInfo;                            // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature) == 0x000090, "Wrong size on BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature, PairMatchingPlayerInfo) == 0x000008, "Member 'BP_AJBOutGameProxy_C_OnPairMatched__DelegateSignature::PairMatchingPlayerInfo' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnResponseRandomPairMatch__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    PearMatchingPlayerInfo;                            // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature) == 0x000090, "Wrong size on BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature, PearMatchingPlayerInfo) == 0x000008, "Member 'BP_AJBOutGameProxy_C_OnResponseRandomPairMatch__DelegateSignature::PearMatchingPlayerInfo' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnEnterRoom__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnEnterRoom__DelegateSignature::bSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnTenpoEnterRoom__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature, bSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnTenpoEnterRoom__DelegateSignature::bSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnTenpoDeleteRoom__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature final
{
public:
	bool                                          bIsHost;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSuccess;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature) == 0x000002, "Wrong size on BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature, bIsHost) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature::bIsHost' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature, bSuccess) == 0x000001, "Member 'BP_AJBOutGameProxy_C_OnTenpoDeleteRoom__DelegateSignature::bSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnChangedSelectCharacter__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature final
{
public:
	struct FMatchingPlayerInfo                    PairPlayerInfo;                                    // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsFinished;                                        // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature) == 0x000090, "Wrong size on BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature, PairPlayerInfo) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature::PairPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature, IsFinished) == 0x000088, "Member 'BP_AJBOutGameProxy_C_OnChangedSelectCharacter__DelegateSignature::IsFinished' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnUpdateTenpoGameSettings__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature final
{
public:
	bool                                          IsExchangeMode;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature, IsExchangeMode) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnUpdateTenpoGameSettings__DelegateSignature::IsExchangeMode' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnStartTenpoMatchingHost__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature final
{
public:
	bool                                          bIsSuccess;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature) == 0x000001, "Wrong size on BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature, bIsSuccess) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnStartTenpoMatchingHost__DelegateSignature::bIsSuccess' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.OnStartWaitPairIDMatching__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature final
{
public:
	float                                         RemainTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature");
static_assert(sizeof(BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature) == 0x000004, "Wrong size on BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature");
static_assert(offsetof(BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature, RemainTime) == 0x000000, "Member 'BP_AJBOutGameProxy_C_OnStartWaitPairIDMatching__DelegateSignature::RemainTime' has a wrong offset!");

// Function BP_AJBOutGameProxy.BP_AJBOutGameProxy_C.ExecuteUbergraph_BP_AJBOutGameProxy
// 0x0CB8 (0x0CB8 - 0x0000)
struct BP_AJBOutGameProxy_C_ExecuteUbergraph_BP_AJBOutGameProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTenpoHost_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTenpoBattleDamageAreaType_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CPUNum;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ExchangeMode;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTenpoHost_ReturnValue1;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess4;             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance4;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTenpoHost_ReturnValue2;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess5;             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance5;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess6;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance6;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors1;           // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess7;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance7;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETenpoMatchingResult                          K2Node_Event_Result1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConnected_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFinished;                            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRoomPlayerInfo                        K2Node_Event_RoomPlayerInfo;                       // 0x00D8(0x0110)()
	bool                                          K2Node_Event_bSuccess3;                            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccess2;                            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccess1;                            // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess8;             // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance8;    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccessMatching2;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    K2Node_Event_PairMatchingPlayerInfo;               // 0x0200(0x0088)()
	bool                                          K2Node_Event_bSuccessMatching1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    K2Node_MakeStruct_MatchingPlayerInfo;              // 0x0290(0x0088)()
	bool                                          CallFunc_GetAJBGameInstance_bSuccess9;             // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance9;    // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue1;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccessMatching;                     // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_RemainTime;                           // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    K2Node_Select_Default;                             // 0x0338(0x0088)()
	bool                                          K2Node_Event_bSuccess;                             // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EResultStartLocation                          K2Node_Event_Result;                               // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_X;                                    // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Y;                                    // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_UserID;                               // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bComplete;                            // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess10;            // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance10;   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess11;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance11;   // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue1;                         // 0x0408(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess4;                            // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0428(0x0008)(NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x0438(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance1;         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinishSelectStartLocation_ReturnValue;  // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeStateFromGameMode_ReturnValue;      // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue2;                 // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_496[0x2];                                      // 0x0496(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcMatchingTimeoutSecond_ReturnValue;    // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccess5;                            // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRandomRequestSocekt_StartLocation_GetPlayerInfo_bCan; // 0x049E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuccess6;                            // 0x049F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETenpoRoomEnterResult                         K2Node_Event_Result2;                              // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A2[0x2];                                      // 0x04A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x04A4(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_PlayerID1;                      // 0x04AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_X1;                             // 0x04AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Y1;                             // 0x04AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStartLocation                         K2Node_MakeStruct_StartLocation;                   // 0x04B0(0x0002)(IsPlainOldData, NoDestructor)
	EResultStartLocation                          K2Node_CustomEvent_Result;                         // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Player_ID;                      // 0x04B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_X;                              // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Y;                              // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResultStartLocation                          CallFunc_TrySelectStartLocation_Result;            // 0x04B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStartLocation                         K2Node_MakeStruct_StartLocation1;                  // 0x04B7(0x0002)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x2];                                      // 0x04BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_CheckIndex3;                    // 0x04C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C6[0x2];                                      // 0x04C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PlayerID;                       // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Team_ID1;                       // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE[0x2];                                      // 0x04CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Name;                           // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Charactor_ID1;                  // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CheckIndex2;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue2;             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance2;         // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0508(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue1;           // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMatchingPlayerInfoFromPlayerName_Result; // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_FindMatchingPlayerInfoFromPlayerName_Value; // 0x0538(0x0088)()
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CheckIndex1;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Team_ID;                        // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Charactor_ID;                   // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_StartLocationX;                 // 0x05D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_StartLocationY;                 // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CheckIndex;                     // 0x05D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue1;                // 0x05D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStartLocation                         K2Node_MakeStruct_StartLocation2;                  // 0x05D7(0x0002)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    K2Node_MakeStruct_MatchingPlayerInfo1;             // 0x05E0(0x0088)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue3;              // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue3;             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance3;         // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue4;             // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance4;         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item1;                          // 0x06A0(0x0088)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue5;             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance5;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x3];                                      // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnected_ReturnValue3;                 // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess12;            // 0x074A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74B[0x5];                                      // 0x074B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance12;   // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMatchingPlayerInfo>            CallFunc_Map_Values_Values;                        // 0x0758(0x0010)(ZeroConstructor, ReferenceParm)
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item2;                          // 0x0768(0x0088)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue6;             // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance6;         // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_CustomEvent_CharacterID;                    // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishMatching_ReturnValue;             // 0x080A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80B[0x1];                                      // 0x080B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue7;             // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance7;         // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822[0x2];                                      // 0x0822(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_EndTime;                        // 0x0828(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue8;             // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue9;             // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance8;         // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance9;         // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_CustomEvent_MatchEndTime;                   // 0x0860(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue10;            // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance10;        // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0880(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0894(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerNum;                      // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess13;            // 0x089C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89D[0x3];                                      // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance13;   // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue1;                  // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AreaTypeID;                     // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_DamageAreaCenter;               // 0x08B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DamageAreaRadius;               // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SelectAreaSize;                 // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
