#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBClairvoyance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.ExecuteUbergraph_BP_AJBClairvoyance
// 0x0118 (0x0118 - 0x0000)
struct BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_ANS_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_ANS;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_CurrentTime_Variable;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_bReverse_Variable;                       // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_bShouldUpdate_Variable;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue1;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Time;                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Distance;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_Causer;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base3;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable3;                              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance) == 0x000008, "Wrong alignment on BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance");
static_assert(sizeof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance) == 0x000118, "Wrong size on BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, EntryPoint) == 0x000000, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000018, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_HasLocalSharedController_ReturnValue) == 0x000021, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue1) == 0x000028, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000039, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsValidClass_ReturnValue) == 0x00003B, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_ANS) == 0x000040, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_ANS' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsValid_ReturnValue1) == 0x000049, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsValid_ReturnValue2) == 0x00004A, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue2) == 0x000050, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000068, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsPlayerController_ReturnValue) == 0x000080, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_float_CurrentTime_Variable) == 0x000084, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_float_CurrentTime_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetFloatValue_ReturnValue) == 0x000090, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_float_Variable) == 0x000098, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_bool_bReverse_Variable) == 0x00009C, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_bool_bReverse_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_bool_bShouldUpdate_Variable) == 0x00009D, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_bool_bShouldUpdate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_Not_PreBool_ReturnValue) == 0x00009E, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_bool_Variable) == 0x00009F, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue3) == 0x0000A0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x0000A8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess4) == 0x0000B0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_Event_bTriggeredByStand1) == 0x0000B1, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_IsPlayerController_ReturnValue1) == 0x0000B2, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_IsPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_Event_bTriggeredByStand) == 0x0000B3, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_CustomEvent_Time) == 0x0000B4, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_CustomEvent_Distance) == 0x0000B8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_CustomEvent_Distance' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_CustomEvent_bEnable) == 0x0000BC, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_float_Variable1) == 0x0000C0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000C4, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_float_Variable2) == 0x0000C8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue4) == 0x0000D0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_Event_Causer) == 0x0000E0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_GetOwner_ReturnValue5) == 0x0000E8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_AsAJBIn_Game_Character_Base3) == 0x0000F0, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_AsAJBIn_Game_Character_Base3' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_DynamicCast_bSuccess5) == 0x0000F8, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0000F9, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_bool_Variable1) == 0x0000FA, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, Temp_float_Variable3) == 0x0000FC, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_Select_Default) == 0x000100, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, K2Node_Select1_Default) == 0x000104, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000108, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_Add_FloatFloat_ReturnValue) == 0x00010C, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance, CallFunc_FClamp_ReturnValue) == 0x000110, "Member 'BP_AJBClairvoyance_C_ExecuteUbergraph_BP_AJBClairvoyance::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.ChangeEnablePPMaterials
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBClairvoyance_C_ChangeEnablePPMaterials final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBClairvoyance_C_ChangeEnablePPMaterials) == 0x000001, "Wrong alignment on BP_AJBClairvoyance_C_ChangeEnablePPMaterials");
static_assert(sizeof(BP_AJBClairvoyance_C_ChangeEnablePPMaterials) == 0x000001, "Wrong size on BP_AJBClairvoyance_C_ChangeEnablePPMaterials");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterials, bEnable) == 0x000000, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterials::bEnable' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.SetParameter_Server
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBClairvoyance_C_SetParameter_Server final
{
public:
	float                                         Time_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_0;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBClairvoyance_C_SetParameter_Server) == 0x000004, "Wrong alignment on BP_AJBClairvoyance_C_SetParameter_Server");
static_assert(sizeof(BP_AJBClairvoyance_C_SetParameter_Server) == 0x000008, "Wrong size on BP_AJBClairvoyance_C_SetParameter_Server");
static_assert(offsetof(BP_AJBClairvoyance_C_SetParameter_Server, Time_0) == 0x000000, "Member 'BP_AJBClairvoyance_C_SetParameter_Server::Time_0' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_SetParameter_Server, Distance_0) == 0x000004, "Member 'BP_AJBClairvoyance_C_SetParameter_Server::Distance_0' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.ChangeEnablePPMaterial
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBClairvoyance_C_ChangeEnablePPMaterial final
{
public:
	class AAJBInGameCharacterBase*                CharacterBase;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaterialIndexRef;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       TempCameraComponent;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial) == 0x000008, "Wrong alignment on BP_AJBClairvoyance_C_ChangeEnablePPMaterial");
static_assert(sizeof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial) == 0x000030, "Wrong size on BP_AJBClairvoyance_C_ChangeEnablePPMaterial");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, CharacterBase) == 0x000000, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::CharacterBase' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, bEnable) == 0x000008, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, MaterialIndexRef) == 0x00000C, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::MaterialIndexRef' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, TempCameraComponent) == 0x000010, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::TempCameraComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, CallFunc_IsValid_ReturnValue1) == 0x000028, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_ChangeEnablePPMaterial, CallFunc_IsValid_ReturnValue2) == 0x000029, "Member 'BP_AJBClairvoyance_C_ChangeEnablePPMaterial::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.OnRep_Distance
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBClairvoyance_C_OnRep_Distance final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBClairvoyance_C_OnRep_Distance) == 0x000001, "Wrong alignment on BP_AJBClairvoyance_C_OnRep_Distance");
static_assert(sizeof(BP_AJBClairvoyance_C_OnRep_Distance) == 0x000001, "Wrong size on BP_AJBClairvoyance_C_OnRep_Distance");
static_assert(offsetof(BP_AJBClairvoyance_C_OnRep_Distance, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_AJBClairvoyance_C_OnRep_Distance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.TryCreateDMI
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBClairvoyance_C_TryCreateDMI final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetExistsUnderwater_Is_Exists_Underwater; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBClairvoyance_C_TryCreateDMI) == 0x000008, "Wrong alignment on BP_AJBClairvoyance_C_TryCreateDMI");
static_assert(sizeof(BP_AJBClairvoyance_C_TryCreateDMI) == 0x000018, "Wrong size on BP_AJBClairvoyance_C_TryCreateDMI");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, CallFunc_GetExistsUnderwater_Is_Exists_Underwater) == 0x000001, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::CallFunc_GetExistsUnderwater_Is_Exists_Underwater' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, Temp_bool_Variable) == 0x000002, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, CallFunc_IsDedicatedServer_ReturnValue) == 0x000003, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, K2Node_Select_Default) == 0x000008, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBClairvoyance_C_TryCreateDMI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_AJBClairvoyance_C_TryCreateDMI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.PlaySE
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBClairvoyance_C_PlaySE final
{
public:
	class UObject*                                Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBClairvoyance_C_PlaySE) == 0x000008, "Wrong alignment on BP_AJBClairvoyance_C_PlaySE");
static_assert(sizeof(BP_AJBClairvoyance_C_PlaySE) == 0x000008, "Wrong size on BP_AJBClairvoyance_C_PlaySE");
static_assert(offsetof(BP_AJBClairvoyance_C_PlaySE, Causer) == 0x000000, "Member 'BP_AJBClairvoyance_C_PlaySE::Causer' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.OnActionInactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBClairvoyance_C_OnActionInactivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBClairvoyance_C_OnActionInactivate) == 0x000001, "Wrong alignment on BP_AJBClairvoyance_C_OnActionInactivate");
static_assert(sizeof(BP_AJBClairvoyance_C_OnActionInactivate) == 0x000001, "Wrong size on BP_AJBClairvoyance_C_OnActionInactivate");
static_assert(offsetof(BP_AJBClairvoyance_C_OnActionInactivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBClairvoyance_C_OnActionInactivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBClairvoyance.BP_AJBClairvoyance_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBClairvoyance_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBClairvoyance_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBClairvoyance_C_OnActionActivate");
static_assert(sizeof(BP_AJBClairvoyance_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBClairvoyance_C_OnActionActivate");
static_assert(offsetof(BP_AJBClairvoyance_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBClairvoyance_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

}

