#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_ANS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_ANS.BP_AJBInGameCharacter_ANS_C
// 0x0040 (0x1670 - 0x1630)
class ABP_AJBInGameCharacter_ANS_C final : public ABP_AJBInGameCharacter_C
{
public:
	uint8                                         Pad_1621[0x7];                                     // 0x1621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_ANS_C;        // 0x1628(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBAccompanyDDWSkill_C*             BP_AJBAccompanyDDWSkill;                           // 0x1630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBWallClimb_C*                     BP_AJBWallClimb;                                   // 0x1638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAssaultDiveSkill_C*              BP_AJBAssaultDiveSkill;                            // 0x1640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDiverShootSkill_C*               BP_AJBDiverShootSkill;                             // 0x1648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDiverRushSkill_C*                BP_AJBDiverRushSkill;                              // 0x1650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        WallClimbOffset;                                   // 0x1658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_DDW_C*           DDWCharacterBP;                                    // 0x1660(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bJumpButtonIsDown;                                 // 0x1668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMovementMode                                 MovementModeBeforeTimeStop;                        // 0x1669(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_ANS(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ROS_ForceFlying();
	void ChangeStealth(bool bEnable);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void PressedButton_ActiveBase();
	void OnPressedInteract();
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void OnReleasedJump();
	void OnPressedJump();
	void ChangeMovementModeOnTimeStop(bool bEnable, bool bOperatorIsEmpty);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnGainSupportSkillServer();
	void UserConstructionScript();
	void SetupSharedController();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_ANS_C">();
	}
	static class ABP_AJBInGameCharacter_ANS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_ANS_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_ANS_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_ANS_C");
static_assert(sizeof(ABP_AJBInGameCharacter_ANS_C) == 0x001670, "Wrong size on ABP_AJBInGameCharacter_ANS_C");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, UberGraphFrame_BP_AJBInGameCharacter_ANS_C) == 0x001628, "Member 'ABP_AJBInGameCharacter_ANS_C::UberGraphFrame_BP_AJBInGameCharacter_ANS_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, BP_AJBAccompanyDDWSkill) == 0x001630, "Member 'ABP_AJBInGameCharacter_ANS_C::BP_AJBAccompanyDDWSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, BP_AJBWallClimb) == 0x001638, "Member 'ABP_AJBInGameCharacter_ANS_C::BP_AJBWallClimb' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, BP_AJBAssaultDiveSkill) == 0x001640, "Member 'ABP_AJBInGameCharacter_ANS_C::BP_AJBAssaultDiveSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, BP_AJBDiverShootSkill) == 0x001648, "Member 'ABP_AJBInGameCharacter_ANS_C::BP_AJBDiverShootSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, BP_AJBDiverRushSkill) == 0x001650, "Member 'ABP_AJBInGameCharacter_ANS_C::BP_AJBDiverRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, WallClimbOffset) == 0x001658, "Member 'ABP_AJBInGameCharacter_ANS_C::WallClimbOffset' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, DDWCharacterBP) == 0x001660, "Member 'ABP_AJBInGameCharacter_ANS_C::DDWCharacterBP' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, bJumpButtonIsDown) == 0x001668, "Member 'ABP_AJBInGameCharacter_ANS_C::bJumpButtonIsDown' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ANS_C, MovementModeBeforeTimeStop) == 0x001669, "Member 'ABP_AJBInGameCharacter_ANS_C::MovementModeBeforeTimeStop' has a wrong offset!");

}

