#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPistolsStrikeAffecter

#include "Basic.hpp"

#include "BP_AJBDamageAffecterBase_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBPistolsStrikeAffecter.BP_AJBPistolsStrikeAffecter_C
// 0x0040 (0x0468 - 0x0428)
class ABP_AJBPistolsStrikeAffecter_C final : public ABP_AJBDamageAffecterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBPistolsStrikeAffecter_C;      // 0x0428(0x0008)(Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   ImpactGionTags;                                    // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   CurrentRemainImpactGionTags;                       // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LastSelectedGionIndex;                             // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGionCount;                                  // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionInterval;                                      // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomStreamForSelectGion;                         // 0x045C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         GionCount;                                         // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPistolsStrikeAffecter(int32 EntryPoint);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnTheWorldChanged(bool bEnableTheWorld_0);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ShouldEnableInitialTheWorld_Server(bool* Should);
	void CalcAttackDistance(class AActor* DamagedActor, float* AttackDistance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBPistolsStrikeAffecter_C">();
	}
	static class ABP_AJBPistolsStrikeAffecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBPistolsStrikeAffecter_C>();
	}
};
static_assert(alignof(ABP_AJBPistolsStrikeAffecter_C) == 0x000008, "Wrong alignment on ABP_AJBPistolsStrikeAffecter_C");
static_assert(sizeof(ABP_AJBPistolsStrikeAffecter_C) == 0x000468, "Wrong size on ABP_AJBPistolsStrikeAffecter_C");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, UberGraphFrame_BP_AJBPistolsStrikeAffecter_C) == 0x000428, "Member 'ABP_AJBPistolsStrikeAffecter_C::UberGraphFrame_BP_AJBPistolsStrikeAffecter_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, ImpactGionTags) == 0x000430, "Member 'ABP_AJBPistolsStrikeAffecter_C::ImpactGionTags' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, CurrentRemainImpactGionTags) == 0x000440, "Member 'ABP_AJBPistolsStrikeAffecter_C::CurrentRemainImpactGionTags' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, LastSelectedGionIndex) == 0x000450, "Member 'ABP_AJBPistolsStrikeAffecter_C::LastSelectedGionIndex' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, CurrentGionCount) == 0x000454, "Member 'ABP_AJBPistolsStrikeAffecter_C::CurrentGionCount' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, GionInterval) == 0x000458, "Member 'ABP_AJBPistolsStrikeAffecter_C::GionInterval' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, RandomStreamForSelectGion) == 0x00045C, "Member 'ABP_AJBPistolsStrikeAffecter_C::RandomStreamForSelectGion' has a wrong offset!");
static_assert(offsetof(ABP_AJBPistolsStrikeAffecter_C, GionCount) == 0x000464, "Member 'ABP_AJBPistolsStrikeAffecter_C::GionCount' has a wrong offset!");

}

