#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileTrailBase

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameProjectileTrailBase.BP_AJBInGameProjectileTrailBase_C.ExecuteUbergraph_BP_AJBInGameProjectileTrailBase
// 0x0088 (0x0088 - 0x0000)
struct BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectile_Straight_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Straight; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGravityLoadAffected_bAffected;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase");
static_assert(sizeof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase) == 0x000088, "Wrong size on BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, EntryPoint) == 0x000000, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, Temp_float_Variable) == 0x000004, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, Temp_float_Variable1) == 0x000008, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00000C, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, Temp_float_Variable2) == 0x000014, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Event_Operator) == 0x000020, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Event_Time) == 0x000028, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Event_Timing) == 0x00002C, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Event_bEnable) == 0x00002D, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Event_bOperatorIsEmpty) == 0x00002E, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Straight) == 0x000050, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Straight' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_CheckGravityLoadAffected_bAffected) == 0x000059, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_CheckGravityLoadAffected_bAffected' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, Temp_bool_Variable) == 0x000070, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_Select_Default) == 0x000074, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, K2Node_CustomEvent_DestroyedActor) == 0x000078, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase, CallFunc_IsValid_ReturnValue1) == 0x000080, "Member 'BP_AJBInGameProjectileTrailBase_C_ExecuteUbergraph_BP_AJBInGameProjectileTrailBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_AJBInGameProjectileTrailBase.BP_AJBInGameProjectileTrailBase_C.OnOwnerDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed");
static_assert(sizeof(BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed) == 0x000008, "Wrong size on BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed, DestroyedActor) == 0x000000, "Member 'BP_AJBInGameProjectileTrailBase_C_OnOwnerDestroyed::DestroyedActor' has a wrong offset!");

// Function BP_AJBInGameProjectileTrailBase.BP_AJBInGameProjectileTrailBase_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBInGameProjectileTrailBase_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

}

