#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSignalPinBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSignalPinBase.BP_AJBSignalPinBase_C.ExecuteUbergraph_BP_AJBSignalPinBase
// 0x00E8 (0x00E8 - 0x0000)
struct BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBUIMapManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBUIMapManager_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBSignalPin_C*                     CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_InGameMain_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsTimeUp;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBSignalPin_C>    K2Node_DynamicCast_AsBI_AJBSignal_Pin;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayVanishAnimation_AnimationLength;      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBUIMapManager_C*>          CallFunc_GetAllActorsOfClass_OutActors1;           // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBUIMapManager_C*                  CallFunc_Array_Get_Item1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C0(0x0020)()
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase) == 0x000008, "Wrong alignment on BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase");
static_assert(sizeof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase) == 0x0000E8, "Wrong size on BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, EntryPoint) == 0x000000, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_Add_VectorVector_ReturnValue) == 0x000014, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_Create_ReturnValue) == 0x000038, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x00004C, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000052, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000058, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x000070, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, K2Node_CustomEvent_bIsTimeUp) == 0x000078, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::K2Node_CustomEvent_bIsTimeUp' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, K2Node_DynamicCast_AsBI_AJBSignal_Pin) == 0x000088, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::K2Node_DynamicCast_AsBI_AJBSignal_Pin' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_PlayVanishAnimation_AnimationLength) == 0x00009C, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_PlayVanishAnimation_AnimationLength' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_GetAllActorsOfClass_OutActors1) == 0x0000A0, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_Array_Get_Item1) == 0x0000B0, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C0, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase, CallFunc_MatchesAnyTags_ReturnValue) == 0x0000E0, "Member 'BP_AJBSignalPinBase_C_ExecuteUbergraph_BP_AJBSignalPinBase::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");

// Function BP_AJBSignalPinBase.BP_AJBSignalPinBase_C.RemoveWithFade
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBSignalPinBase_C_RemoveWithFade final
{
public:
	bool                                          bIsTimeUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSignalPinBase_C_RemoveWithFade) == 0x000001, "Wrong alignment on BP_AJBSignalPinBase_C_RemoveWithFade");
static_assert(sizeof(BP_AJBSignalPinBase_C_RemoveWithFade) == 0x000001, "Wrong size on BP_AJBSignalPinBase_C_RemoveWithFade");
static_assert(offsetof(BP_AJBSignalPinBase_C_RemoveWithFade, bIsTimeUp) == 0x000000, "Member 'BP_AJBSignalPinBase_C_RemoveWithFade::bIsTimeUp' has a wrong offset!");

// Function BP_AJBSignalPinBase.BP_AJBSignalPinBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBSignalPinBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSignalPinBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBSignalPinBase_C_ReceiveTick");
static_assert(sizeof(BP_AJBSignalPinBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBSignalPinBase_C_ReceiveTick");
static_assert(offsetof(BP_AJBSignalPinBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBSignalPinBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBSignalPinBase.BP_AJBSignalPinBase_C.SetIsPair
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBSignalPinBase_C_SetIsPair final
{
public:
	bool                                          Pair;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBSignalPin_C>    K2Node_DynamicCast_AsBI_AJBSignal_Pin;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSignalPinBase_C_SetIsPair) == 0x000008, "Wrong alignment on BP_AJBSignalPinBase_C_SetIsPair");
static_assert(sizeof(BP_AJBSignalPinBase_C_SetIsPair) == 0x000020, "Wrong size on BP_AJBSignalPinBase_C_SetIsPair");
static_assert(offsetof(BP_AJBSignalPinBase_C_SetIsPair, Pair) == 0x000000, "Member 'BP_AJBSignalPinBase_C_SetIsPair::Pair' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_SetIsPair, K2Node_DynamicCast_AsBI_AJBSignal_Pin) == 0x000008, "Member 'BP_AJBSignalPinBase_C_SetIsPair::K2Node_DynamicCast_AsBI_AJBSignal_Pin' has a wrong offset!");
static_assert(offsetof(BP_AJBSignalPinBase_C_SetIsPair, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBSignalPinBase_C_SetIsPair::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

