#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBringItOn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBBringItOn.BP_AJBBringItOn_C
// 0x0020 (0x0210 - 0x01F0)
class UBP_AJBBringItOn_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBBringItOn_C;                  // 0x01F0(0x0008)(Transient, DuplicateTransient)
	float                                         HealingMPSpeedScale;                               // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Attack___;                                         // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Defence___;                                        // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EndParticleTag;                                    // 0x0208(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBBringItOn(int32 EntryPoint);
	void ActiveBringItOnUI();
	void SpawnEndEffect();
	void ChangeBringItOnStatus(bool bEnable);
	void OnContinuedParticleActivated();
	void ReceiveBeginPlay();
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBBringItOn_C">();
	}
	static class UBP_AJBBringItOn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBBringItOn_C>();
	}
};
static_assert(alignof(UBP_AJBBringItOn_C) == 0x000008, "Wrong alignment on UBP_AJBBringItOn_C");
static_assert(sizeof(UBP_AJBBringItOn_C) == 0x000210, "Wrong size on UBP_AJBBringItOn_C");
static_assert(offsetof(UBP_AJBBringItOn_C, UberGraphFrame_BP_AJBBringItOn_C) == 0x0001F0, "Member 'UBP_AJBBringItOn_C::UberGraphFrame_BP_AJBBringItOn_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, HealingMPSpeedScale) == 0x0001F8, "Member 'UBP_AJBBringItOn_C::HealingMPSpeedScale' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, Attack___) == 0x0001FC, "Member 'UBP_AJBBringItOn_C::Attack___' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, Defence___) == 0x000200, "Member 'UBP_AJBBringItOn_C::Defence___' has a wrong offset!");
static_assert(offsetof(UBP_AJBBringItOn_C, EndParticleTag) == 0x000208, "Member 'UBP_AJBBringItOn_C::EndParticleTag' has a wrong offset!");

}

