#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPairInfoUIFollowerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C
// 0x0078 (0x02B0 - 0x0238)
class UBP_AJBPairInfoUIFollowerComponent_C : public USceneComponent
{
public:
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UWB_UI_FollowPairInfo_C*                PairInfoWidget;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         CurrentWidgetScale;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0xC];                                      // 0x0254(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedSlefTransform;                               // 0x0260(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MinWidgetScaleSize;                                // 0x0290(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetScaleChangeStartDistance;                    // 0x0294(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetScaleOffsetLocation;                         // 0x0298(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetScaleChangeEndDistance;                      // 0x029C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetScaleChangeInterpSpeed;                      // 0x02A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheRepCriticalElapsedTime;                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalCriticalElapsedTime;                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent(int32 EntryPoint);
	void Destroy();
	void SetPairName(const class FText& PairName);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UpdateFollowWidget(float Delta);
	void GetTargetWidgetScale(const struct FTransform& InTransform, float* Scale);
	class AActor* GetViewTarget();
	void SetCharacterHPAndAPAndSP(class ABP_AJBInGameCharacter_C* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBPairInfoUIFollowerComponent_C">();
	}
	static class UBP_AJBPairInfoUIFollowerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBPairInfoUIFollowerComponent_C>();
	}
};
static_assert(alignof(UBP_AJBPairInfoUIFollowerComponent_C) == 0x000010, "Wrong alignment on UBP_AJBPairInfoUIFollowerComponent_C");
static_assert(sizeof(UBP_AJBPairInfoUIFollowerComponent_C) == 0x0002B0, "Wrong size on UBP_AJBPairInfoUIFollowerComponent_C");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, UberGraphFrame) == 0x000240, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, PairInfoWidget) == 0x000248, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::PairInfoWidget' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, CurrentWidgetScale) == 0x000250, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::CurrentWidgetScale' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, CachedSlefTransform) == 0x000260, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::CachedSlefTransform' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, MinWidgetScaleSize) == 0x000290, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::MinWidgetScaleSize' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, WidgetScaleChangeStartDistance) == 0x000294, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::WidgetScaleChangeStartDistance' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, WidgetScaleOffsetLocation) == 0x000298, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::WidgetScaleOffsetLocation' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, WidgetScaleChangeEndDistance) == 0x00029C, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::WidgetScaleChangeEndDistance' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, WidgetScaleChangeInterpSpeed) == 0x0002A0, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::WidgetScaleChangeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, CacheRepCriticalElapsedTime) == 0x0002A4, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::CacheRepCriticalElapsedTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBPairInfoUIFollowerComponent_C, LocalCriticalElapsedTime) == 0x0002A8, "Member 'UBP_AJBPairInfoUIFollowerComponent_C::LocalCriticalElapsedTime' has a wrong offset!");

}

