#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTutorialTriggerSender_GameState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBTutorialTriggerSender_GameState.BP_AJBTutorialTriggerSender_GameState_C.ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Count, float LivingPlayerRate, int32 PairCount)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Count;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_LivingPlayerRate;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairCount;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState) == 0x000008, "Wrong alignment on BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState");
static_assert(sizeof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState) == 0x000068, "Wrong size on BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, EntryPoint) == 0x000000, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000010, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, CallFunc_GetOwner_ReturnValue1) == 0x000040, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_DynamicCast_AsBP_AJBBattle_Game_State1) == 0x000048, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_DynamicCast_AsBP_AJBBattle_Game_State1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_CustomEvent_Count) == 0x000054, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_CustomEvent_LivingPlayerRate) == 0x000058, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_CustomEvent_LivingPlayerRate' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, K2Node_CustomEvent_PairCount) == 0x00005C, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::K2Node_CustomEvent_PairCount' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_AJBTutorialTriggerSender_GameState_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_GameState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBTutorialTriggerSender_GameState.BP_AJBTutorialTriggerSender_GameState_C.OnChangeLivingPlayerCount
// 0x000C (0x000C - 0x0000)
struct BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LivingPlayerRate;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PairCount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount) == 0x000004, "Wrong alignment on BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount");
static_assert(sizeof(BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount) == 0x00000C, "Wrong size on BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount, Count) == 0x000000, "Member 'BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount::Count' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount, LivingPlayerRate) == 0x000004, "Member 'BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount::LivingPlayerRate' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount, PairCount) == 0x000008, "Member 'BP_AJBTutorialTriggerSender_GameState_C_OnChangeLivingPlayerCount::PairCount' has a wrong offset!");

}

