#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBMiddleRangeSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.ExecuteUbergraph_BP_AJBMiddleRangeSkill
// 0x00D0 (0x00D0 - 0x0000)
struct BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill) == 0x0000D0, "Wrong size on BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, EntryPoint) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CustomEvent_NotifyName3) == 0x000008, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CustomEvent_NotifyName2) == 0x000010, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CustomEvent_NotifyName1) == 0x000028, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CustomEvent_NotifyName) == 0x000040, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, Temp_name_Variable) == 0x000058, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000068, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CustomEvent_NotifyName4) == 0x000070, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000078, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000088, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000090, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_DynamicCast_bSuccess1) == 0x000098, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B0, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000C0, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill, CallFunc_IsValid_ReturnValue1) == 0x0000C8, "Member 'BP_AJBMiddleRangeSkill_C_ExecuteUbergraph_BP_AJBMiddleRangeSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong size on BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA, NotifyName) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_OnBlendOut_26B5F2EB43E6A0E07FE6AD9D1D291CFA::NotifyName' has a wrong offset!");

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong size on BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA, NotifyName) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_OnCompleted_26B5F2EB43E6A0E07FE6AD9D1D291CFA::NotifyName' has a wrong offset!");

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong size on BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA, NotifyName) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_OnInterrupted_26B5F2EB43E6A0E07FE6AD9D1D291CFA::NotifyName' has a wrong offset!");

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong size on BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA, NotifyName) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_OnNotifyBegin_26B5F2EB43E6A0E07FE6AD9D1D291CFA::NotifyName' has a wrong offset!");

// Function BP_AJBMiddleRangeSkill.BP_AJBMiddleRangeSkill_C.OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong alignment on BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(sizeof(BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA) == 0x000008, "Wrong size on BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA");
static_assert(offsetof(BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA, NotifyName) == 0x000000, "Member 'BP_AJBMiddleRangeSkill_C_OnNotifyEnd_26B5F2EB43E6A0E07FE6AD9D1D291CFA::NotifyName' has a wrong offset!");

}

