#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrimsonDimensionAffecter

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCrimsonDimensionAffecter.BP_AJBCrimsonDimensionAffecter_C.ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter
// 0x0370 (0x0370 - 0x0000)
struct BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnableDamage_bEnabled;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerCameraManager_C*     K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_CustomEvent_NotOwnerCharacters1;            // 0x00E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_CustomEvent_NotOwnerCharacters;             // 0x0108(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue6;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue7;           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue8;           // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue9;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue10;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCrimsonDimensionSkill_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCrimsonDimensionSkill_C*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCapsuleRadius_CapsuleRadius;           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight;   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDamageDetectionCD_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters; // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters1; // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item1;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_DVL_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_DVL;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue11;          // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue12;          // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue13;          // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue14;          // 0x026E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x026F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue15;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue16;          // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue17;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor2;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor3;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& RemoveCondition, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetNotOwnerCharacters_NowOwnerCharacters2; // 0x0358(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter) == 0x000010, "Wrong alignment on BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter");
static_assert(sizeof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter) == 0x000370, "Wrong size on BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, EntryPoint) == 0x000000, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_CheckEnableDamage_bEnabled) == 0x00000D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_CheckEnableDamage_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_delegate_Variable) == 0x000030, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_bool_Variable) == 0x000040, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Operator) == 0x000048, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Time) == 0x000050, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_Timing) == 0x000054, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_bEnable) == 0x000055, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Event_bOperatorIsEmpty) == 0x000056, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_RemoveItem_ReturnValue) == 0x000057, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue) == 0x00005C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000060, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue1) == 0x000064, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000065, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_float_Variable) == 0x000068, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00006C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_float_Variable1) == 0x000070, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000074, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_Select_Default) == 0x000078, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsServer_ReturnValue2) == 0x00007C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue4) == 0x00007D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000080, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager) == 0x000088, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess1) == 0x000090, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue1) == 0x000098, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1) == 0x0000A0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess2) == 0x0000A8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetPlayerCameraManager_ReturnValue2) == 0x0000B0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetPlayerCameraManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue1) == 0x0000B8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2) == 0x0000C0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Camera_Manager2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess3) == 0x0000C8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000D0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess4) == 0x0000D8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue2) == 0x0000E0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_NotOwnerCharacters1) == 0x0000E8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_NotOwnerCharacters1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0000F8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess5) == 0x000100, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_HasLocalSharedController_ReturnValue) == 0x000101, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_CustomEvent_NotOwnerCharacters) == 0x000108, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_CustomEvent_NotOwnerCharacters' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue5) == 0x000118, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue6) == 0x000119, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue7) == 0x00011A, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue3) == 0x000120, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000128, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess6) == 0x000130, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000131, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue8) == 0x000132, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000138, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000140, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue1) == 0x000148, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue9) == 0x000149, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue2) == 0x00014A, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue4) == 0x000150, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000158, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess7) == 0x000160, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue10) == 0x000161, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetComponentByClass_ReturnValue) == 0x000168, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue3) == 0x000170, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue5) == 0x000178, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000180, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess8) == 0x000188, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetComponentByClass_ReturnValue1) == 0x000190, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue4) == 0x000198, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetOwner_ReturnValue6) == 0x0001A0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x0001A8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess9) == 0x0001B0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetTransform_ReturnValue) == 0x0001C0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetCapsuleRadius_CapsuleRadius) == 0x0001F0, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetCapsuleRadius_CapsuleRadius' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001F8, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight) == 0x000200, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetCapsuleHalfHeight_CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_FinishSpawningActor_ReturnValue) == 0x000208, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_int_Array_Index_Variable) == 0x000210, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Get_Item) == 0x000218, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_int_Array_Index_Variable1) == 0x000220, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetNotOwnerCharacters_NowOwnerCharacters) == 0x000228, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetNotOwnerCharacters_NowOwnerCharacters' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_GetNotOwnerCharacters_NowOwnerCharacters1) == 0x000238, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_GetNotOwnerCharacters_NowOwnerCharacters1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Get_Item1) == 0x000248, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_DVL) == 0x000250, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_DVL' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, K2Node_DynamicCast_bSuccess10) == 0x000258, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Array_Length_ReturnValue1) == 0x00025C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, Temp_int_Loop_Counter_Variable) == 0x000260, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue11) == 0x000264, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Less_IntInt_ReturnValue) == 0x000265, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_Add_IntInt_ReturnValue) == 0x000268, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue12) == 0x00026C, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue13) == 0x00026D, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsDedicatedServer_ReturnValue14) == 0x00026E, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsDedicatedServer_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter, CallFunc_IsValid_ReturnValue5) == 0x00026F, "Member 'BP_AJBCrimsonDimensionAffecter_C_ExecuteUbergraph_BP_AJBCrimsonDimensionAffecter::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
