#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItemSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.ExecuteUbergraph_BP_AJBInGameItemSpawner
// 0x02E0 (0x02E0 - 0x0000)
struct BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_ItemClass;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0xE];                                       // 0x0082(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue1;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x00CC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemValid_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00F4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor1;                    // 0x0104(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFixedItemToSpawn_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0118(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x0128(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x0138(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x014C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_AJBInGameItem_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameItem_C*                    CallFunc_FinishSpawningActor_ReturnValue1;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemValid_ReturnValue1;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        CallFunc_GetOrCreateArrowComponent_ReturnValue;    // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFixedItemToSpawn_ReturnValue1;         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0220(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0238(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0250(0x0040)(HasGetValueTypeHash)
	class UTextRenderComponent*                   CallFunc_GetOrCreateTextRenderComponent_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A8(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x02C0(0x0018)()
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner) == 0x000010, "Wrong alignment on BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner) == 0x0002E0, "Wrong size on BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, Temp_bool_Variable) == 0x000004, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, Temp_bool_Variable1) == 0x000005, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, Temp_bool_Variable2) == 0x000006, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsShipping_ReturnValue) == 0x000007, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsShipping_ReturnValue1) == 0x000008, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsShipping_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Not_PreBool_ReturnValue1) == 0x00000A, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_CustomEvent_ItemClass) == 0x000010, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_CustomEvent_ItemClass' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_X) == 0x000074, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_Z) == 0x00007C, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsValid_ReturnValue1) == 0x000081, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_GetTransform_ReturnValue1) == 0x000090, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_GetTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Location1) == 0x0000C0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Rotation1) == 0x0000CC, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakTransform_Scale1) == 0x0000D8, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_X1) == 0x0000E4, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_Y1) == 0x0000E8, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BreakVector_Z1) == 0x0000EC, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsItemValid_ReturnValue) == 0x0000F0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsItemValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_MakeStruct_LinearColor) == 0x0000F4, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_MakeStruct_LinearColor1) == 0x000104, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_MakeStruct_LinearColor1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_HasFixedItemToSpawn_ReturnValue) == 0x000114, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_HasFixedItemToSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_Select_Default) == 0x000118, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_MakeStruct_LinearColor2) == 0x000128, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_MakeStruct_LinearColor2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_Select1_Default) == 0x000138, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Add_FloatFloat_ReturnValue) == 0x000148, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_MakeVector_ReturnValue) == 0x00014C, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000158, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_MakeVector_ReturnValue1) == 0x000190, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001A0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_MakeTransform_ReturnValue1) == 0x0001B0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001E0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x0001E8, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_FinishSpawningActor_ReturnValue1) == 0x0001F0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_IsItemValid_ReturnValue1) == 0x0001F8, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_IsItemValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_GetOrCreateArrowComponent_ReturnValue) == 0x000200, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_GetOrCreateArrowComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_HasFixedItemToSpawn_ReturnValue1) == 0x000208, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_HasFixedItemToSpawn_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_GetClassDisplayName_ReturnValue) == 0x000210, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Conv_StringToText_ReturnValue) == 0x000220, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_MakeLiteralText_ReturnValue) == 0x000238, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_MakeStruct_FormatArgumentData) == 0x000250, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_GetOrCreateTextRenderComponent_ReturnValue) == 0x000290, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_GetOrCreateTextRenderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_MakeArray_Array) == 0x000298, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, CallFunc_Format_ReturnValue) == 0x0002A8, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner, K2Node_Select2_Default) == 0x0002C0, "Member 'BP_AJBInGameItemSpawner_C_ExecuteUbergraph_BP_AJBInGameItemSpawner::K2Node_Select2_Default' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.SpawnItem
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItemSpawner_C_SpawnItem final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_SpawnItem) == 0x000008, "Wrong alignment on BP_AJBInGameItemSpawner_C_SpawnItem");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_SpawnItem) == 0x000008, "Wrong size on BP_AJBInGameItemSpawner_C_SpawnItem");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_SpawnItem, ItemClass) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_SpawnItem::ItemClass' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct BP_AJBInGameItemSpawner_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_AJBInGameItemSpawner_C_UserConstructionScript");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_UserConstructionScript) == 0x000003, "Wrong size on BP_AJBInGameItemSpawner_C_UserConstructionScript");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_UserConstructionScript, CallFunc_IsEditor_ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_UserConstructionScript::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_AJBInGameItemSpawner_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'BP_AJBInGameItemSpawner_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.HasFixedItemToSpawn
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn) == 0x000001, "Wrong alignment on BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn) == 0x000002, "Wrong size on BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn, ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'BP_AJBInGameItemSpawner_C_HasFixedItemToSpawn::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.IsItemValid
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameItemSpawner_C_IsItemValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_IsItemValid) == 0x000001, "Wrong alignment on BP_AJBInGameItemSpawner_C_IsItemValid");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_IsItemValid) == 0x000002, "Wrong size on BP_AJBInGameItemSpawner_C_IsItemValid");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_IsItemValid, ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_IsItemValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_IsItemValid, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_AJBInGameItemSpawner_C_IsItemValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.GetOrCreateArrowComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent final
{
public:
	class UArrowComponent*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UArrowComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent) == 0x000010, "Wrong alignment on BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent) == 0x000060, "Wrong size on BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent, ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateArrowComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.GetOrCreateTextRenderComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent final
{
public:
	class UTextRenderComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UTextRenderComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent) == 0x000010, "Wrong alignment on BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent) == 0x000060, "Wrong size on BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent, ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AJBInGameItemSpawner_C_GetOrCreateTextRenderComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C.GetSpawnedItem
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItemSpawner_C_GetSpawnedItem final
{
public:
	class ABP_AJBInGameItem_C*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItemSpawner_C_GetSpawnedItem) == 0x000008, "Wrong alignment on BP_AJBInGameItemSpawner_C_GetSpawnedItem");
static_assert(sizeof(BP_AJBInGameItemSpawner_C_GetSpawnedItem) == 0x000008, "Wrong size on BP_AJBInGameItemSpawner_C_GetSpawnedItem");
static_assert(offsetof(BP_AJBInGameItemSpawner_C_GetSpawnedItem, ReturnValue) == 0x000000, "Member 'BP_AJBInGameItemSpawner_C_GetSpawnedItem::ReturnValue' has a wrong offset!");

}

