#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBEmphasizeActorBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.ExecuteUbergraph_BP_AJBEmphasizeActorBase
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckParticleActivate_bActivate;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewVisibility;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase) == 0x000008, "Wrong alignment on BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase) == 0x000028, "Wrong size on BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, EntryPoint) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_Operator) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_Time) == 0x000010, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_Timing) == 0x000014, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_bEnable) == 0x000015, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_bOperatorIsEmpty) == 0x000016, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, CallFunc_IsValid_ReturnValue) == 0x000017, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_EndPlayReason) == 0x000020, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, CallFunc_CheckParticleActivate_bActivate) == 0x000021, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::CallFunc_CheckParticleActivate_bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, K2Node_Event_bNewVisibility) == 0x000022, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::K2Node_Event_bNewVisibility' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000023, "Member 'BP_AJBEmphasizeActorBase_C_ExecuteUbergraph_BP_AJBEmphasizeActorBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.ChangeVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_ChangeVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_ChangeVisibility) == 0x000001, "Wrong alignment on BP_AJBEmphasizeActorBase_C_ChangeVisibility");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_ChangeVisibility) == 0x000001, "Wrong size on BP_AJBEmphasizeActorBase_C_ChangeVisibility");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeVisibility, bNewVisibility) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_ChangeVisibility::bNewVisibility' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AJBEmphasizeActorBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AJBEmphasizeActorBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBEmphasizeActorBase_C_ReceiveTick");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBEmphasizeActorBase_C_ReceiveTick");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBEmphasizeActorBase_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBEmphasizeActorBase_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBEmphasizeActorBase_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBEmphasizeActorBase_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBEmphasizeActorBase_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.TrySpawnParticle
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_TrySpawnParticle final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_Location;                 // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0080(0x0020)()
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle) == 0x000008, "Wrong alignment on BP_AJBEmphasizeActorBase_C_TrySpawnParticle");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle) == 0x0000B8, "Wrong size on BP_AJBEmphasizeActorBase_C_TrySpawnParticle");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, Temp_struct_Variable) == 0x000014, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_GetFootLocation_Location) == 0x000034, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_GetFootLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_GetOwner_ReturnValue1) == 0x000050, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000058, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000068, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000080, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_MatchesAnyTags_ReturnValue) == 0x0000A0, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, Temp_bool_Variable) == 0x0000A2, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, K2Node_Select_Default) == 0x0000A4, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TrySpawnParticle, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x0000B0, "Member 'BP_AJBEmphasizeActorBase_C_TrySpawnParticle::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.TryDestroyParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_TryDestroyParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_TryDestroyParticle) == 0x000001, "Wrong alignment on BP_AJBEmphasizeActorBase_C_TryDestroyParticle");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_TryDestroyParticle) == 0x000001, "Wrong size on BP_AJBEmphasizeActorBase_C_TryDestroyParticle");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_TryDestroyParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_TryDestroyParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.CheckParticleActivate
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_CheckParticleActivate final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate) == 0x000008, "Wrong alignment on BP_AJBEmphasizeActorBase_C_CheckParticleActivate");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate) == 0x000048, "Wrong size on BP_AJBEmphasizeActorBase_C_CheckParticleActivate");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, bActivate) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000020, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_IsVisible_ReturnValue) == 0x000029, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_GetViewTargetActor_ViewTargetActor1) == 0x000030, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_GetViewTargetActor_ViewTargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000038, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000040, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_CheckParticleActivate, CallFunc_BooleanAND_ReturnValue1) == 0x000042, "Member 'BP_AJBEmphasizeActorBase_C_CheckParticleActivate::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.GetViewTargetActor
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_GetViewTargetActor final
{
public:
	class AActor*                                 ViewTargetActor;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBHighlightManager*                   CallFunc_GetHighlightManager_HighlightManager;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFocusActor_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor) == 0x000008, "Wrong alignment on BP_AJBEmphasizeActorBase_C_GetViewTargetActor");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor) == 0x000040, "Wrong size on BP_AJBEmphasizeActorBase_C_GetViewTargetActor");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, ViewTargetActor) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, Temp_bool_Variable) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, CallFunc_GetHighlightManager_HighlightManager) == 0x000010, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::CallFunc_GetHighlightManager_HighlightManager' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, CallFunc_IsPlayingReplay_ReturnValue) == 0x000020, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, CallFunc_GetFocusActor_ReturnValue) == 0x000030, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::CallFunc_GetFocusActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_GetViewTargetActor, K2Node_Select_Default) == 0x000038, "Member 'BP_AJBEmphasizeActorBase_C_GetViewTargetActor::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.ChangeParticleDilationEnable
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable) == 0x000004, "Wrong alignment on BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable) == 0x000010, "Wrong size on BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, bEnable) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, Temp_bool_Variable) == 0x000001, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, Temp_float_Variable) == 0x000004, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, Temp_float_Variable1) == 0x000008, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable, K2Node_Select_Default) == 0x00000C, "Member 'BP_AJBEmphasizeActorBase_C_ChangeParticleDilationEnable::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBEmphasizeActorBase.BP_AJBEmphasizeActorBase_C.DuringTheWorld
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBEmphasizeActorBase_C_DuringTheWorld final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBEmphasizeActorBase_C_DuringTheWorld) == 0x000001, "Wrong alignment on BP_AJBEmphasizeActorBase_C_DuringTheWorld");
static_assert(sizeof(BP_AJBEmphasizeActorBase_C_DuringTheWorld) == 0x000001, "Wrong size on BP_AJBEmphasizeActorBase_C_DuringTheWorld");
static_assert(offsetof(BP_AJBEmphasizeActorBase_C_DuringTheWorld, bResult) == 0x000000, "Member 'BP_AJBEmphasizeActorBase_C_DuringTheWorld::bResult' has a wrong offset!");

}

