#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_DDW

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_DDW.BP_AJBInGameCharacter_DDW_C
// 0x0040 (0x1670 - 0x1630)
class ABP_AJBInGameCharacter_DDW_C final : public ABP_AJBInGameCharacter_C
{
public:
	uint8                                         Pad_1621[0x7];                                     // 0x1621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_DDW_C;        // 0x1628(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBWallClimb_C*                     BP_AJBWallClimb;                                   // 0x1630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ParticlePreview;                                   // 0x1638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightDefault;                              // 0x1640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightIndoor;                               // 0x1644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleDefault;                         // 0x1648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleIndoor;                          // 0x164C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeshLocationOffset;                                // 0x1650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPreviewParticleOnPairEnv;                     // 0x1654(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1655[0x3];                                     // 0x1655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          ParticlePreviewNG;                                 // 0x1658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 MovementModeBeforeTimeStop;                        // 0x1660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepShouldShowPreviewParticle;                     // 0x1661(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRepEnable;                                        // 0x1662(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bMeshVisible;                                      // 0x1663(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_DDW(int32 EntryPoint);
	void SetupInteract();
	void TryDestroyPreviewParticle();
	void TrySpawnPreviewParticle();
	void ChangeVisual(bool bPossiblePlacement);
	void SetSerialNumber(int32 SerialNumber);
	void ROS_AdjustmentLocation(const struct FVector& Location, const struct FRotator& Rotation);
	void FollowCharacterWhenUnpossessed_OnServer();
	void ChangeEnable(bool bEnable);
	void SetVisibility(bool NewVisibility);
	void GetCurrentNormal(struct FVector* Normal);
	void GetCurrentRotate(struct FRotator* Rotation);
	void GetCurrentMeshOffset(struct FVector* Offset);
	void ShouldSpawnPreviewParticle(bool* bShouldSpawn);
	void UpdateParameters();
	void CheckWallClimbStateAction(bool* bStateAction);
	void CreateDMIFlow();
	void ChangeParticlesTransform(const struct FTransform& NewTransform);
	void UpdateParticlesVisibility();
	void UpdateParticlesSpawn();
	void OnRep_bRepEnable();
	void OnRep_bMeshVisible();
	void GetPropertyOwnerCharacterBP(class ABP_AJBInGameCharacter_C** CharacterBP);
	void GetPropertyType(EAJBCharacterPropertyType* PropertyType);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnReleasedEmote();
	void OnPressedEmote();
	void OnReleasedCrouch();
	void OnPressedCrouch();
	void OnPressedR2();
	void OnReleasedJump();
	void OnPressedJump();
	void OnSpectated_Local();
	void ChangeMovementModeOnTimeStop(bool bEnable, bool bOperatorIsEmpty);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void ChangeSystemDisable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void ChangeSystemEnable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void ResetSystemEnable(bool bRestore);
	void CheckAnyCharacterMovementSkillActive(bool* bWithCharacterMovement);
	void CheckPossibleDash(bool* bPossible);
	void CheckDisableDamage(class AActor* DamageCauser, bool* bDisableDamage_0);
	void CheckTargetSelf(class AActor* DamageCauser, bool bForDamageOverlap, bool bIgnoreMovableStand, bool* bTarget);
	void CheckDisablePassive(class AActor* PassiveCauser, const struct FGameplayTag& PassiveTag, bool* bDisablePassive_0);
	void CheckDisableAreaDamage(bool* bDisableAreadamage_0);
	void InteractableOperator(class AActor* InteractActor, bool* bReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_DDW_C">();
	}
	static class ABP_AJBInGameCharacter_DDW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_DDW_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_DDW_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_DDW_C");
static_assert(sizeof(ABP_AJBInGameCharacter_DDW_C) == 0x001670, "Wrong size on ABP_AJBInGameCharacter_DDW_C");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, UberGraphFrame_BP_AJBInGameCharacter_DDW_C) == 0x001628, "Member 'ABP_AJBInGameCharacter_DDW_C::UberGraphFrame_BP_AJBInGameCharacter_DDW_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, BP_AJBWallClimb) == 0x001630, "Member 'ABP_AJBInGameCharacter_DDW_C::BP_AJBWallClimb' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, ParticlePreview) == 0x001638, "Member 'ABP_AJBInGameCharacter_DDW_C::ParticlePreview' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, MaxStepHeightDefault) == 0x001640, "Member 'ABP_AJBInGameCharacter_DDW_C::MaxStepHeightDefault' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, MaxStepHeightIndoor) == 0x001644, "Member 'ABP_AJBInGameCharacter_DDW_C::MaxStepHeightIndoor' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, WalkableFloorAngleDefault) == 0x001648, "Member 'ABP_AJBInGameCharacter_DDW_C::WalkableFloorAngleDefault' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, WalkableFloorAngleIndoor) == 0x00164C, "Member 'ABP_AJBInGameCharacter_DDW_C::WalkableFloorAngleIndoor' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, MeshLocationOffset) == 0x001650, "Member 'ABP_AJBInGameCharacter_DDW_C::MeshLocationOffset' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, bShowPreviewParticleOnPairEnv) == 0x001654, "Member 'ABP_AJBInGameCharacter_DDW_C::bShowPreviewParticleOnPairEnv' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, ParticlePreviewNG) == 0x001658, "Member 'ABP_AJBInGameCharacter_DDW_C::ParticlePreviewNG' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, MovementModeBeforeTimeStop) == 0x001660, "Member 'ABP_AJBInGameCharacter_DDW_C::MovementModeBeforeTimeStop' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, bRepShouldShowPreviewParticle) == 0x001661, "Member 'ABP_AJBInGameCharacter_DDW_C::bRepShouldShowPreviewParticle' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, bRepEnable) == 0x001662, "Member 'ABP_AJBInGameCharacter_DDW_C::bRepEnable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DDW_C, bMeshVisible) == 0x001663, "Member 'ABP_AJBInGameCharacter_DDW_C::bMeshVisible' has a wrong offset!");

}

