#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIObjectPoolObservedCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_AJBInGameAIObservedCharacter_C* ObservedCharacter)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInitialAddition;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0xA];                                       // 0x0026(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIObservedCharacter_C*     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIObservedCharacter_C*     K2Node_CustomEvent_ObservedCharacter;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter) == 0x000010, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter) == 0x0000B0, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, EntryPoint) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, Temp_int_Variable) == 0x000018, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, K2Node_CustomEvent_bInitialAddition) == 0x000025, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::K2Node_CustomEvent_bInitialAddition' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Array_Add_ReturnValue1) == 0x000074, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, K2Node_CustomEvent_ObservedCharacter) == 0x000078, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::K2Node_CustomEvent_ObservedCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Array_Add_ReturnValue2) == 0x000084, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Conv_IntToString_ReturnValue) == 0x000088, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_ExecuteUbergraph_BP_AJBAIObjectPoolObservedCharacter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.OnObjectLifeTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed final
{
public:
	class ABP_AJBInGameAIObservedCharacter_C*     ObservedCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed) == 0x000008, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed) == 0x000008, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed, ObservedCharacter) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_OnObjectLifeTimeElapsed::ObservedCharacter' has a wrong offset!");

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.AddNewObject
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject final
{
public:
	bool                                          bInitialAddition;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject) == 0x000001, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject) == 0x000001, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject, bInitialAddition) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_AddNewObject::bInitialAddition' has a wrong offset!");

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.GetUnusedObject
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject final
{
public:
	class ABP_AJBInGameAIObservedCharacter_C*     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIObservedCharacter_C*     Result;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIObservedCharacter_C*     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject) == 0x000008, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject) == 0x000020, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject, Result) == 0x000008, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObject::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.GetTotalObjectCount
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount) == 0x000004, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount) == 0x000008, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetTotalObjectCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_AJBAIObjectPoolObservedCharacter.BP_AJBAIObjectPoolObservedCharacter_C.GetUnusedObjectCount
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount) == 0x000004, "Wrong alignment on BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount");
static_assert(sizeof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount) == 0x000008, "Wrong size on BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_AJBAIObjectPoolObservedCharacter_C_GetUnusedObjectCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

}

