#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBIronsandCamouflage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBIronsandCamouflage.BP_AJBIronsandCamouflage_C.ExecuteUbergraph_BP_AJBIronsandCamouflage
// 0x02B0 (0x02B0 - 0x0000)
struct BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBIronsandCamouflageSkill_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& DamageType)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base3;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType1;                    // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBP_AJBIronsandCamouflageSkill_C*       CallFunc_GetIronsandCamouflageSkill_SkillComponent; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue11;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBIronsandCamouflageSkill_C*       CallFunc_GetIronsandCamouflageSkill_SkillComponent1; // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue12;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base4;   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue13;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base5;   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue14;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2; // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue15;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage) == 0x000008, "Wrong alignment on BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage");
static_assert(sizeof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage) == 0x0002B0, "Wrong size on BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, EntryPoint) == 0x000000, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_bSuccess) == 0x000004, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsPlayingReplay_ReturnValue) == 0x000010, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, Temp_float_Variable) == 0x000020, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, Temp_float_Variable1) == 0x000040, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue1) == 0x000048, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue2) == 0x000050, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000058, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000068, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue) == 0x000080, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000088, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, Temp_bool_Variable) == 0x000090, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue3) == 0x000098, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x0000A0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess3) == 0x0000A8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0000C0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_Operator) == 0x0000C8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_Time) == 0x0000D0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_Timing) == 0x0000D4, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_bEnable) == 0x0000D5, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_bOperatorIsEmpty) == 0x0000D6, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_bTriggeredByStand1) == 0x0000D7, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Select_Default) == 0x0000D8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_bTriggeredByStand) == 0x0000DC, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_Event_DeltaSeconds) == 0x0000E0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue4) == 0x0000E8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x0000F8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess4) == 0x000100, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000101, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsServer_ReturnValue) == 0x000102, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsValid_ReturnValue1) == 0x000103, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000104, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000108, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsServer_ReturnValue1) == 0x000110, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000111, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_Not_PreBool_ReturnValue) == 0x000112, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000113, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000118, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsPlayingReplay_ReturnValue2) == 0x000120, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue5) == 0x000128, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000130, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess5) == 0x000138, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000140, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue6) == 0x000148, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base3) == 0x000150, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess6) == 0x000158, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsDedicatedServer_ReturnValue) == 0x000159, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue3) == 0x00015A, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue7) == 0x000160, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000168, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess7) == 0x000170, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsValid_ReturnValue2) == 0x000171, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue8) == 0x000178, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue9) == 0x000180, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000188, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess8) == 0x000190, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000198, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess9) == 0x0001A0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0001A8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess10) == 0x0001B8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001B9, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0001BA, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue10) == 0x0001C0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0001C8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess11) == 0x0001D0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x0001D8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess12) == 0x0001E8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_CustomEvent_DamageType1) == 0x0001F0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_CustomEvent_DamageType1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_CustomEvent_DamageType) == 0x0001F8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetIronsandCamouflageSkill_SkillComponent) == 0x000200, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetIronsandCamouflageSkill_SkillComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue11) == 0x000208, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x000210, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess13) == 0x000218, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsValid_ReturnValue3) == 0x000219, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetIronsandCamouflageSkill_SkillComponent1) == 0x000220, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetIronsandCamouflageSkill_SkillComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_CheckActive_bActive) == 0x000228, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_IsValid_ReturnValue4) == 0x000229, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue12) == 0x000230, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base4) == 0x000238, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess14) == 0x000240, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue4) == 0x000241, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue13) == 0x000248, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsAJBIn_Game_Character_Base5) == 0x000250, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsAJBIn_Game_Character_Base5' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess15) == 0x000258, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue14) == 0x000260, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_HasLocalSharedController_ReturnValue5) == 0x000268, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x000270, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess16) == 0x000278, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2) == 0x000280, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess17) == 0x000290, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, CallFunc_GetOwner_ReturnValue15) == 0x000298, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::CallFunc_GetOwner_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x0002A0, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage, K2Node_DynamicCast_bSuccess18) == 0x0002A8, "Member 'BP_AJBIronsandCamouflage_C_ExecuteUbergraph_BP_AJBIronsandCamouflage::K2Node_DynamicCast_bSuccess18' has a wrong offset!");

// Function BP_AJBIronsandCamouflage.BP_AJBIronsandCamouflage_C.OnCanceledByReceiveCore
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore) == 0x000008, "Wrong alignment on BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore");
static_assert(sizeof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore) == 0x000008, "Wrong size on BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore, DamageType) == 0x000000, "Member 'BP_AJBIronsandCamouflage_C_OnCanceledByReceiveCore::DamageType' has a wrong offset!");

// Function BP_AJBIronsandCamouflage.BP_AJBIronsandCamouflage_C.OnCanceledByReceiveDamage
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage) == 0x000008, "Wrong alignment on BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage");
static_assert(sizeof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage) == 0x000008, "Wrong size on BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage, DamageType) == 0x000000, "Member 'BP_AJBIronsandCamouflage_C_OnCanceledByReceiveDamage::DamageType' has a wrong offset!");

// Function BP_AJBIronsandCamouflage.BP_AJBIronsandCamouflage_C.ConsumeMP
// 0x0078 (0x0078 - 0x0000)
struct BP_AJBIronsandCamouflage_C_ConsumeMP final
{
public:
	class UBP_AJBIronsandCamouflageSkill_C*       TempSkillComponent;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_GetGameplayTags_self_CastInput;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0040(0x0020)()
	bool                                          CallFunc_IsRemainMP_IsRemain;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBIronsandCamouflageSkill_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBIronsandCamouflage_C_ConsumeMP) == 0x000008, "Wrong alignment on BP_AJBIronsandCamouflage_C_ConsumeMP");
static_assert(sizeof(BP_AJBIronsandCamouflage_C_ConsumeMP) == 0x000078, "Wrong size on BP_AJBIronsandCamouflage_C_ConsumeMP");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, TempSkillComponent) == 0x000000, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::TempSkillComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, CallFunc_GetOwner_ReturnValue1) == 0x000010, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBIronsandCamouflage_C_ConsumeMP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBIronsandCamouflage_C_ConsumeMP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
