#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBShotNGPointHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBShotNGPointHUD.BP_AJBShotNGPointHUD_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBShotNGPointHUD_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	float                                         TargetTracedDistance;                              // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDeviationDistance3D;                            // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShutTracedDistance;                                // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDeviationDistance2D;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    TargetInGameCharacter;                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ShotNG_C*                           TargetWidget;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBShotNGPointHUD(int32 EntryPoint);
	void OnStartLastSurvivorScene();
	void ReceiveTick(float DeltaSeconds);
	void OnEndInGameOpeningCountDown();
	void OnStartInGameOpeningCountDown();
	void ReceiveBeginPlay();
	void ShouldTickEnable(bool* bShouldTickEnable);
	void GetShotPointComponent(class USceneComponent** ShotPointComp);
	void GetShutTracedObjectTypes(TArray<EObjectTypeQuery>* ObjectTypes);
	void UpdateUI(class AAJBInGameCharacter* TargetCharacter);
	void ChangeActivate(bool bEnable);
	void Initialize();
	void SetNGPointVisibility(bool bNewVisibility);
	void SetupInGameCharacter(class AAJBInGameCharacter* TargetCharacter);
	void SetupTargetWidget(class UWB_ShotNG_C* TargetWidget_0);
	void CheckEnableElement(int32 Index_0, bool* bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBShotNGPointHUD_C">();
	}
	static class UBP_AJBShotNGPointHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBShotNGPointHUD_C>();
	}
};
static_assert(alignof(UBP_AJBShotNGPointHUD_C) == 0x000008, "Wrong alignment on UBP_AJBShotNGPointHUD_C");
static_assert(sizeof(UBP_AJBShotNGPointHUD_C) == 0x000118, "Wrong size on UBP_AJBShotNGPointHUD_C");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBShotNGPointHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, TargetTracedDistance) == 0x0000F8, "Member 'UBP_AJBShotNGPointHUD_C::TargetTracedDistance' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, HitDeviationDistance3D) == 0x0000FC, "Member 'UBP_AJBShotNGPointHUD_C::HitDeviationDistance3D' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, ShutTracedDistance) == 0x000100, "Member 'UBP_AJBShotNGPointHUD_C::ShutTracedDistance' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, HitDeviationDistance2D) == 0x000104, "Member 'UBP_AJBShotNGPointHUD_C::HitDeviationDistance2D' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, TargetInGameCharacter) == 0x000108, "Member 'UBP_AJBShotNGPointHUD_C::TargetInGameCharacter' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotNGPointHUD_C, TargetWidget) == 0x000110, "Member 'UBP_AJBShotNGPointHUD_C::TargetWidget' has a wrong offset!");

}

