#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPistolsMoveSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AJBSnipeSkill_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBPistolsMoveSkill.BP_AJBPistolsMoveSkill_C
// 0x00D0 (0x0340 - 0x0270)
class UBP_AJBPistolsMoveSkill_C : public UBP_AJBSnipeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBPistolsMoveSkill_C;           // 0x0270(0x0008)(Transient, DuplicateTransient)
	struct FRotator                               Rep_PrevRotation;                                  // 0x0278(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMesh*>                  SXPMeshList;                                       // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bEnableHeadShot_Only_RodeoShot_;                   // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxHP;                                             // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   SXPLoiteringAnimList;                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAnimMontage*                           SXPKickingAnim_Only_PistolsStrike_;                // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SXPSpecialBreakDownAnim;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EffectLoiteringTag;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EffectHitTag;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SELoiteringTag;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SEHitTag;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeedOnAccel;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeedDefault;                                   // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeedOnDeaccel;                                 // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoiteringTime;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KickingTime_Only_PistolsStrike_;                   // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitingTime;                                       // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitDamage_Only_RodeoShot_;                         // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitDamageOnHeadShot_Only_RodeoShot_;               // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadShotTraceLength_Only_RodeoShot_;               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GionHitTag;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PostProcessMaterial;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PostProcessIndex;                                  // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntencityOnAccel;                                  // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntencityDefault;                                  // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntencityOnDeaccel;                                // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_SpeedDst;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DMIParam_IntencityName;                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedStandPossess;                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCompletedCharacterPossess;                        // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PPMaterialIndex;                                   // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPistolsMoveSkill(int32 EntryPoint);
	void ROS_CheckCancelFlinch();
	void OnDisconnected();
	void TryEndSkill_Local();
	void OnPawnClientRestarted();
	void ROS_EndSkill();
	void BindEventToOnMaxSpeedChanged();
	void OnMaxSpeedChanged(EMovableSXPFlyingState FlyingState);
	void OnStateChanged(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnClientMovableStandRestarted();
	void OnCharacterClientRestarted();
	void MC_EndSkill();
	void EndSkill_Server();
	void OnCompleted();
	void AdjustStandTransform(const struct FVector& Loation, const struct FRotator& Rotation);
	void GetMeshAndAnimSeq(class USkeletalMesh** Mesh, class UAnimMontage** AnimSeq);
	void SetEnablePostProcess(bool bEnable);
	void ChengePPParam(float Intencity);
	void ApplySkillSettings();
	void ReceiveBeginPlay();
	void OnMCShot(const struct FVector& Location, const struct FRotator& Rotation);
	void OnROSShot(const struct FVector& Location, const struct FRotator& Rotation);
	void OnShot(const struct FVector& Location, const struct FRotator& Rotation);
	void OnCancel();
	void OnInactive();
	void OnActive();
	void InitializeVariables();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBPistolsMoveSkill_C">();
	}
	static class UBP_AJBPistolsMoveSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBPistolsMoveSkill_C>();
	}
};
static_assert(alignof(UBP_AJBPistolsMoveSkill_C) == 0x000008, "Wrong alignment on UBP_AJBPistolsMoveSkill_C");
static_assert(sizeof(UBP_AJBPistolsMoveSkill_C) == 0x000340, "Wrong size on UBP_AJBPistolsMoveSkill_C");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, UberGraphFrame_BP_AJBPistolsMoveSkill_C) == 0x000270, "Member 'UBP_AJBPistolsMoveSkill_C::UberGraphFrame_BP_AJBPistolsMoveSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, Rep_PrevRotation) == 0x000278, "Member 'UBP_AJBPistolsMoveSkill_C::Rep_PrevRotation' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SXPMeshList) == 0x000288, "Member 'UBP_AJBPistolsMoveSkill_C::SXPMeshList' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, bEnableHeadShot_Only_RodeoShot_) == 0x000298, "Member 'UBP_AJBPistolsMoveSkill_C::bEnableHeadShot_Only_RodeoShot_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, MaxHP) == 0x00029C, "Member 'UBP_AJBPistolsMoveSkill_C::MaxHP' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SXPLoiteringAnimList) == 0x0002A0, "Member 'UBP_AJBPistolsMoveSkill_C::SXPLoiteringAnimList' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SXPKickingAnim_Only_PistolsStrike_) == 0x0002B0, "Member 'UBP_AJBPistolsMoveSkill_C::SXPKickingAnim_Only_PistolsStrike_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SXPSpecialBreakDownAnim) == 0x0002B8, "Member 'UBP_AJBPistolsMoveSkill_C::SXPSpecialBreakDownAnim' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, EffectLoiteringTag) == 0x0002C0, "Member 'UBP_AJBPistolsMoveSkill_C::EffectLoiteringTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, EffectHitTag) == 0x0002C8, "Member 'UBP_AJBPistolsMoveSkill_C::EffectHitTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SELoiteringTag) == 0x0002D0, "Member 'UBP_AJBPistolsMoveSkill_C::SELoiteringTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, SEHitTag) == 0x0002D8, "Member 'UBP_AJBPistolsMoveSkill_C::SEHitTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, MaxSpeedOnAccel) == 0x0002E0, "Member 'UBP_AJBPistolsMoveSkill_C::MaxSpeedOnAccel' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, MaxSpeedDefault) == 0x0002E4, "Member 'UBP_AJBPistolsMoveSkill_C::MaxSpeedDefault' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, MaxSpeedOnDeaccel) == 0x0002E8, "Member 'UBP_AJBPistolsMoveSkill_C::MaxSpeedOnDeaccel' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, LoiteringTime) == 0x0002EC, "Member 'UBP_AJBPistolsMoveSkill_C::LoiteringTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, KickingTime_Only_PistolsStrike_) == 0x0002F0, "Member 'UBP_AJBPistolsMoveSkill_C::KickingTime_Only_PistolsStrike_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, WaitingTime) == 0x0002F4, "Member 'UBP_AJBPistolsMoveSkill_C::WaitingTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, HitDamage_Only_RodeoShot_) == 0x0002F8, "Member 'UBP_AJBPistolsMoveSkill_C::HitDamage_Only_RodeoShot_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, HitDamageOnHeadShot_Only_RodeoShot_) == 0x0002FC, "Member 'UBP_AJBPistolsMoveSkill_C::HitDamageOnHeadShot_Only_RodeoShot_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, HeadShotTraceLength_Only_RodeoShot_) == 0x000300, "Member 'UBP_AJBPistolsMoveSkill_C::HeadShotTraceLength_Only_RodeoShot_' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, GionHitTag) == 0x000308, "Member 'UBP_AJBPistolsMoveSkill_C::GionHitTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, PostProcessMaterial) == 0x000310, "Member 'UBP_AJBPistolsMoveSkill_C::PostProcessMaterial' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, PostProcessIndex) == 0x000318, "Member 'UBP_AJBPistolsMoveSkill_C::PostProcessIndex' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, IntencityOnAccel) == 0x00031C, "Member 'UBP_AJBPistolsMoveSkill_C::IntencityOnAccel' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, IntencityDefault) == 0x000320, "Member 'UBP_AJBPistolsMoveSkill_C::IntencityDefault' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, IntencityOnDeaccel) == 0x000324, "Member 'UBP_AJBPistolsMoveSkill_C::IntencityOnDeaccel' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, DMI_SpeedDst) == 0x000328, "Member 'UBP_AJBPistolsMoveSkill_C::DMI_SpeedDst' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, DMIParam_IntencityName) == 0x000330, "Member 'UBP_AJBPistolsMoveSkill_C::DMIParam_IntencityName' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, bCompletedStandPossess) == 0x000338, "Member 'UBP_AJBPistolsMoveSkill_C::bCompletedStandPossess' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, bCompletedCharacterPossess) == 0x000339, "Member 'UBP_AJBPistolsMoveSkill_C::bCompletedCharacterPossess' has a wrong offset!");
static_assert(offsetof(UBP_AJBPistolsMoveSkill_C, PPMaterialIndex) == 0x00033C, "Member 'UBP_AJBPistolsMoveSkill_C::PPMaterialIndex' has a wrong offset!");

}

