#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBThreeFreezeSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.ExecuteUbergraph_BP_AJBThreeFreezeSkill
// 0x02D8 (0x02D8 - 0x0000)
struct BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable1;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor1;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation1;                         // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_SurfaceType1;                         // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBlockedByAAP1;                       // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHeadShot1;                           // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_187[0x1];                                      // 0x0187(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_ECH_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue2;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHitCharacter;                        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue3;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0260(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x026C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CuttingRate;                          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_SurfaceType;                          // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInvincible;                          // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPenetration;                       // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlockedByAAP;                        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHeadShot;                            // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill) == 0x0002D8, "Wrong size on BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, EntryPoint) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName13) == 0x000008, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName10) == 0x000010, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, Temp_name_Variable) == 0x000018, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName9) == 0x000030, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName8) == 0x000038, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000040, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName7) == 0x000050, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName6) == 0x000068, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000070, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName5) == 0x000080, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x000088, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, Temp_name_Variable1) == 0x000098, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x0000A0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName4) == 0x0000B0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName3) == 0x0000B8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate6) == 0x0000C0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName2) == 0x0000D0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate7) == 0x0000D8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName1) == 0x0000E8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate8) == 0x0000F0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName) == 0x000100, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate9) == 0x000108, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, Temp_name_Variable2) == 0x000118, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate10) == 0x000120, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000130, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000138, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_BooleanAND_ReturnValue) == 0x00013A, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000140, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000148, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName14) == 0x000158, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName14' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000160, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsValid_ReturnValue1) == 0x000168, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_HitActor1) == 0x000170, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_HitActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_HitLocation1) == 0x000178, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_HitLocation1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_SurfaceType1) == 0x000184, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_SurfaceType1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bBlockedByAAP1) == 0x000185, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bBlockedByAAP1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bHeadShot1) == 0x000186, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bHeadShot1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate11) == 0x000188, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000198, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001A0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0001AC, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0001B0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0001B8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsValid_ReturnValue2) == 0x0001B9, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName11) == 0x0001C0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_BooleanAND_ReturnValue1) == 0x0001C8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x0001D0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x0001D8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess1) == 0x0001E0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x0001E8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x0001F0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH) == 0x0001F8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess2) == 0x000200, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate12) == 0x000208, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerStand_ReturnValue2) == 0x000218, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerStand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2) == 0x000220, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess3) == 0x000228, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000229, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000230, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bHitCharacter) == 0x000238, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bHitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsValid_ReturnValue3) == 0x000239, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x00023A, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_GetOwnerStand_ReturnValue3) == 0x000240, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_GetOwnerStand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3) == 0x000248, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand3' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess4) == 0x000250, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_HitActor) == 0x000258, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_HitLocation) == 0x000260, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_HitNormal) == 0x00026C, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_CuttingRate) == 0x000278, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_SurfaceType) == 0x00027C, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bDisableDamage) == 0x00027D, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bInvincible) == 0x00027E, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bInvincible' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bIsPenetration) == 0x00027F, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bIsPenetration' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bBlockedByAAP) == 0x000280, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_Event_bHeadShot) == 0x000281, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_Event_bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2) == 0x000288, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000290, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_IsValid_ReturnValue4) == 0x000291, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000298, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_DynamicCast_bSuccess5) == 0x0002A0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x0002A8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate13) == 0x0002B0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CustomEvent_NotifyName12) == 0x0002C0, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill, K2Node_CreateDelegate_OutputDelegate14) == 0x0002C8, "Member 'BP_AJBThreeFreezeSkill_C_ExecuteUbergraph_BP_AJBThreeFreezeSkill::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnBlendOut_BEFA2923414DC224A9BD78B7DA62B905::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnBlendOut_DDCE22314B77AFC2C84AE5A308F84050::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnBlendOut_F0562D6F493783D93EF277AF73E0EB61
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnBlendOut_F0562D6F493783D93EF277AF73E0EB61::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnCompleted_BEFA2923414DC224A9BD78B7DA62B905
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnCompleted_BEFA2923414DC224A9BD78B7DA62B905::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnCompleted_DDCE22314B77AFC2C84AE5A308F84050
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnCompleted_DDCE22314B77AFC2C84AE5A308F84050::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnCompleted_F0562D6F493783D93EF277AF73E0EB61
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnCompleted_F0562D6F493783D93EF277AF73E0EB61::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnInterrupted_BEFA2923414DC224A9BD78B7DA62B905::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnInterrupted_DDCE22314B77AFC2C84AE5A308F84050::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnInterrupted_F0562D6F493783D93EF277AF73E0EB61
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnInterrupted_F0562D6F493783D93EF277AF73E0EB61::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyBegin_BEFA2923414DC224A9BD78B7DA62B905::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyBegin_DDCE22314B77AFC2C84AE5A308F84050::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyBegin_F0562D6F493783D93EF277AF73E0EB61::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyEnd_BEFA2923414DC224A9BD78B7DA62B905::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyEnd_DDCE22314B77AFC2C84AE5A308F84050::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong alignment on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61");
static_assert(sizeof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61) == 0x000008, "Wrong size on BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61");
static_assert(offsetof(BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61, NotifyName) == 0x000000, "Member 'BP_AJBThreeFreezeSkill_C_OnNotifyEnd_F0562D6F493783D93EF277AF73E0EB61::NotifyName' has a wrong offset!");

// Function BP_AJBThreeFreezeSkill.BP_AJBThreeFreezeSkill_C.SpeakRushHitVoice
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBThreeFreezeSkill_C_SpeakRushHitVoice final
{
public:
	bool                                          bHitCharacter;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBThreeFreezeSkill_C_SpeakRushHitVoice) == 0x000001, "Wrong alignment on BP_AJBThreeFreezeSkill_C_SpeakRushHitVoice");
