#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIHouseInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.TargetActorFound__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature final
{
public:
	class AActor*                                 HouseInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 FoundActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature");
static_assert(sizeof(BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature) == 0x000010, "Wrong size on BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature");
static_assert(offsetof(BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature, HouseInfo) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature::HouseInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature, FoundActor) == 0x000008, "Member 'BP_AJBAIHouseInfo_C_TargetActorFound__DelegateSignature::FoundActor' has a wrong offset!");

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.SetupFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature final
{
public:
	class ABP_AJBAIHouseInfo_C*                   HouseInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature");
static_assert(sizeof(BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature) == 0x000008, "Wrong size on BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature");
static_assert(offsetof(BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature, HouseInfo) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_SetupFinished__DelegateSignature::HouseInfo' has a wrong offset!");

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.ExecuteUbergraph_BP_AJBAIHouseInfo
// 0x0228 (0x0228 - 0x0000)
struct BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_House;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_StartPointLocation;             // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_GetComponentsByClass_ReturnValue;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameGate*                         CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGateInteractLocations_Location1;       // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGateInteractLocations_Location2;       // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGateInteractLocations_bIsLocation1InHouse; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGateInteractLocations_bIsLocation2InHouse; // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item1;                          // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           CallFunc_GetComponentsByClass_ReturnValue1;        // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UChildActorComponent*>           Temp_wildcard_Variable;                            // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UChildActorComponent*                   CallFunc_Array_Get_Item2;                          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameIndoorVolume_C*            K2Node_DynamicCast_AsBP_AJBIn_Game_Indoor_Volume;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_Array_Get_Item3;                          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameWindow*                       CallFunc_Array_Get_Item4;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameItemSpawner_C*             K2Node_DynamicCast_AsBP_AJBIn_Game_Item_Spawner;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameGate*                         K2Node_DynamicCast_AsAJBIn_Game_Gate;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x019C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue1; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemValid_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue1;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item5;                          // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue1;             // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameWindow*                       K2Node_DynamicCast_AsAJBIn_Game_Window;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue10;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue4;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSmallWindow_ReturnValue;                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue11;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue12;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0204(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue5;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo");
static_assert(sizeof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo) == 0x000228, "Wrong size on BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, EntryPoint) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Loop_Counter_Variable1) == 0x000008, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Add_IntInt_ReturnValue1) == 0x000010, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_CustomEvent_House) == 0x000018, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_CustomEvent_House' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_CustomEvent_StartPointLocation) == 0x000020, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_CustomEvent_StartPointLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Loop_Counter_Variable2) == 0x000040, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Add_IntInt_ReturnValue2) == 0x000044, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Length_ReturnValue1) == 0x00004C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Array_Index_Variable1) == 0x000050, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetGateInteractLocations_Location1) == 0x000060, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetGateInteractLocations_Location1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetGateInteractLocations_Location2) == 0x00006C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetGateInteractLocations_Location2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetGateInteractLocations_bIsLocation1InHouse) == 0x000078, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetGateInteractLocations_bIsLocation1InHouse' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetGateInteractLocations_bIsLocation2InHouse) == 0x000079, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetGateInteractLocations_bIsLocation2InHouse' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00007C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x000090, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00009C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_LastIndex_ReturnValue) == 0x0000A0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item1) == 0x0000A4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000B0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x0000BC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_X) == 0x0000C0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Y) == 0x0000C4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000CC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue1) == 0x0000D4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0000D8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue2) == 0x0000DC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue3) == 0x0000E0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_GetComponentsByClass_ReturnValue1) == 0x0000E8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_GetComponentsByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_wildcard_Variable) == 0x0000F8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item2) == 0x000108, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Length_ReturnValue2) == 0x000110, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_IntInt_ReturnValue1) == 0x000114, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_AsBP_AJBIn_Game_Indoor_Volume) == 0x000118, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_AsBP_AJBIn_Game_Indoor_Volume' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue4) == 0x000124, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Length_ReturnValue3) == 0x000128, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Loop_Counter_Variable3) == 0x00012C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_IntInt_ReturnValue2) == 0x000130, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_IntInt_ReturnValue3) == 0x000131, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Add_IntInt_ReturnValue3) == 0x000134, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Array_Index_Variable2) == 0x000138, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, Temp_int_Array_Index_Variable3) == 0x00013C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item3) == 0x000140, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item4) == 0x000148, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue5) == 0x000150, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_AsBP_AJBIn_Game_Item_Spawner) == 0x000158, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_AsBP_AJBIn_Game_Item_Spawner' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_bSuccess1) == 0x000160, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_AsAJBIn_Game_Gate) == 0x000168, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_AsAJBIn_Game_Gate' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_bSuccess2) == 0x000170, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue6) == 0x000174, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000178, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue7) == 0x000184, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_X1) == 0x000188, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Y1) == 0x00018C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Z1) == 0x000190, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue8) == 0x000194, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000198, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00019C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_FindPathToLocationSynchronously_ReturnValue1) == 0x0001A8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_FindPathToLocationSynchronously_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_IsItemValid_ReturnValue) == 0x0001B0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_IsItemValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_IsValidIndex_ReturnValue1) == 0x0001B1, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_IsValidIndex_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_LastIndex_ReturnValue1) == 0x0001B4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_LastIndex_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Get_Item5) == 0x0001B8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue9) == 0x0001C4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_AI_VectorDiffSq_ReturnValue1) == 0x0001C8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_AI_VectorDiffSq_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_AsAJBIn_Game_Window) == 0x0001D0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_AsAJBIn_Game_Window' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, K2Node_DynamicCast_bSuccess3) == 0x0001D8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue3) == 0x0001D9, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0001DC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_X2) == 0x0001E8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Y2) == 0x0001EC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Z2) == 0x0001F0, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue10) == 0x0001F4, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue4) == 0x0001F8, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_IsSmallWindow_ReturnValue) == 0x0001F9, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_IsSmallWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue11) == 0x0001FC, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Array_Add_ReturnValue12) == 0x000200, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Array_Add_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000204, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_X3) == 0x000210, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Y3) == 0x000214, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_BreakVector_Z3) == 0x000218, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x00021C, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo, CallFunc_Less_FloatFloat_ReturnValue5) == 0x000220, "Member 'BP_AJBAIHouseInfo_C_ExecuteUbergraph_BP_AJBAIHouseInfo::CallFunc_Less_FloatFloat_ReturnValue5' has a wrong offset!");

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.Setup
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBAIHouseInfo_C_Setup final
{
public:
	class AActor*                                 House;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartPointLocation_0;                              // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_Setup) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_Setup");
static_assert(sizeof(BP_AJBAIHouseInfo_C_Setup) == 0x000018, "Wrong size on BP_AJBAIHouseInfo_C_Setup");
static_assert(offsetof(BP_AJBAIHouseInfo_C_Setup, House) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_Setup::House' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_Setup, StartPointLocation_0) == 0x000008, "Member 'BP_AJBAIHouseInfo_C_Setup::StartPointLocation_0' has a wrong offset!");

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.IsHouseInfoOf
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBAIHouseInfo_C_IsHouseInfoOf final
{
public:
	class AActor*                                 HouseActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_IsHouseInfoOf) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_IsHouseInfoOf");
static_assert(sizeof(BP_AJBAIHouseInfo_C_IsHouseInfoOf) == 0x000010, "Wrong size on BP_AJBAIHouseInfo_C_IsHouseInfoOf");
static_assert(offsetof(BP_AJBAIHouseInfo_C_IsHouseInfoOf, HouseActor) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_IsHouseInfoOf::HouseActor' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_IsHouseInfoOf, ReturnValue) == 0x000008, "Member 'BP_AJBAIHouseInfo_C_IsHouseInfoOf::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_IsHouseInfoOf, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'BP_AJBAIHouseInfo_C_IsHouseInfoOf::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_AJBAIHouseInfo.BP_AJBAIHouseInfo_C.GetNearestGate1F
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBAIHouseInfo_C_GetNearestGate1F final
{
public:
	struct FVector                                BaseLocation;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DiffSqCache;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NearestGateActor;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearestDistanceSq;                                 // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameWindow*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameGate*                         CallFunc_Array_Get_Item1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue1;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIHouseInfo_C_GetNearestGate1F) == 0x000008, "Wrong alignment on BP_AJBAIHouseInfo_C_GetNearestGate1F");
static_assert(sizeof(BP_AJBAIHouseInfo_C_GetNearestGate1F) == 0x000090, "Wrong size on BP_AJBAIHouseInfo_C_GetNearestGate1F");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, BaseLocation) == 0x000000, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::BaseLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, ReturnValue) == 0x000010, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, DiffSqCache) == 0x000018, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::DiffSqCache' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, NearestGateActor) == 0x000020, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::NearestGateActor' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, NearestDistanceSq) == 0x000028, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::NearestDistanceSq' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, Temp_int_Array_Index_Variable1) == 0x000038, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Less_FloatFloat_ReturnValue) == 0x00003D, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Not_PreBool_ReturnValue) == 0x00003E, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_BooleanOR_ReturnValue) == 0x00003F, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_IsValid_ReturnValue1) == 0x000040, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Not_PreBool_ReturnValue1) == 0x000041, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, Temp_int_Loop_Counter_Variable1) == 0x000044, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Add_IntInt_ReturnValue1) == 0x00005C, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x000060, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIHouseInfo_C_GetNearestGate1F, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_AJBAIHouseInfo_C_GetNearestGate1F::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
