#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBMetallica

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBMetallica.BP_AJBMetallica_C.ExecuteUbergraph_BP_AJBMetallica
// 0x02E0 (0x02E0 - 0x0000)
struct BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self_CastInput;         // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue1;      // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateIntervalTimeServer_DamageCount;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue2;      // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self1_CastInput;        // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldUpdateLeftActiveTime_bShould;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue3;      // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTagWithFloat_self_CastInput;   // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTagWithFloat_self1_CastInput;  // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_GetGameplayTags_self_CastInput;           // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0170(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldUpdateLeftActiveTime;          // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue1;          // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue4;                    // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue5;                    // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue6;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_IsAlive;                          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewVisibility;                       // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x025C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation; // 0x029C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue4;      // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue5;      // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTagWithFloat_self2_CastInput;  // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self2_CastInput;        // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica) == 0x000008, "Wrong alignment on BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica");
static_assert(sizeof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica) == 0x0002E0, "Wrong size on BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, EntryPoint) == 0x000000, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000010, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RemoveGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RemoveGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue1) == 0x000038, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_UpdateIntervalTimeServer_DamageCount) == 0x000044, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_UpdateIntervalTimeServer_DamageCount' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue2) == 0x000048, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RemoveGameplayTag_self1_CastInput) == 0x000050, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RemoveGameplayTag_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_ShouldUpdateLeftActiveTime_bShould) == 0x000061, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_ShouldUpdateLeftActiveTime_bShould' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue1) == 0x000068, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Conv_IntToString_ReturnValue) == 0x000070, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000080, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess1) == 0x000088, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue3) == 0x0000A0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000A8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_AddGameplayTagWithFloat_self_CastInput) == 0x0000B8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_AddGameplayTagWithFloat_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000C8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000D8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_AddGameplayTagWithFloat_self1_CastInput) == 0x0000E8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_AddGameplayTagWithFloat_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_Event_bTriggeredByStand) == 0x0000F8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_Event_bTriggeredByStand1) == 0x0000F9, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Not_PreBool_ReturnValue) == 0x0000FA, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000FB, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue2) == 0x000100, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000108, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess2) == 0x000110, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Not_PreBool_ReturnValue1) == 0x000111, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x000112, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_BooleanAND_ReturnValue1) == 0x000113, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue) == 0x000114, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue3) == 0x000118, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue1) == 0x000120, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000128, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess3) == 0x000130, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetObjectClass_ReturnValue) == 0x000138, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue2) == 0x000140, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue4) == 0x000148, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000150, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess4) == 0x000158, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetGameplayTags_self_CastInput) == 0x000160, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000170, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_HasTag_ReturnValue) == 0x000190, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_Event_bShouldUpdateLeftActiveTime) == 0x000191, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_Event_bShouldUpdateLeftActiveTime' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_Not_PreBool_ReturnValue2) == 0x000192, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsDedicatedServer_ReturnValue) == 0x000193, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue5) == 0x000198, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue3) == 0x0001A0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x0001A8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess5) == 0x0001B0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001B8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x0001C0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsActive_ReturnValue) == 0x0001C8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x0001C9, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x0001CA, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0001CB, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0001CC, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, Temp_bool_Has_Been_Initd_Variable) == 0x0001CD, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_HasLocalSharedController_ReturnValue) == 0x0001CE, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsPlayerController_ReturnValue) == 0x0001CF, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetPlayerController_ReturnValue) == 0x0001D0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue6) == 0x0001D8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetViewTarget_ReturnValue) == 0x0001E0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0001E8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess6) == 0x0001F0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x0001F8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000200, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000208, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000210, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000218, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000220, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_BooleanOR_ReturnValue) == 0x000221, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsPlayerController_ReturnValue1) == 0x000222, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_BooleanAND_ReturnValue2) == 0x000223, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000224, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue4) == 0x000225, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue5) == 0x000226, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000227, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue7) == 0x000228, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsServer_ReturnValue6) == 0x000230, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsServer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x000238, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess7) == 0x000240, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsAlive_IsAlive) == 0x000241, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsAlive_IsAlive' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000242, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_Event_bNewVisibility) == 0x000243, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_Event_bNewVisibility' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue8) == 0x000248, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x000250, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess8) == 0x000258, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_IsDedicatedServer_ReturnValue4) == 0x000259, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00025C, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000268, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000270, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetOwner_ReturnValue9) == 0x000278, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x000280, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, K2Node_DynamicCast_bSuccess9) == 0x000288, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_K2_GetRootComponent_ReturnValue2) == 0x000290, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_K2_GetRootComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_BooleanAND_ReturnValue3) == 0x000298, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation) == 0x00029C, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1) == 0x0002A8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue4) == 0x0002B0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_MakeLiteralGameplayTag_ReturnValue5) == 0x0002B8, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_MakeLiteralGameplayTag_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_AddGameplayTagWithFloat_self2_CastInput) == 0x0002C0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_AddGameplayTagWithFloat_self2_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica, CallFunc_RemoveGameplayTag_self2_CastInput) == 0x0002D0, "Member 'BP_AJBMetallica_C_ExecuteUbergraph_BP_AJBMetallica::CallFunc_RemoveGameplayTag_self2_CastInput' has a wrong offset!");

// Function BP_AJBMetallica.BP_AJBMetallica_C.MC_SetShouldUpdateLectActiveTime
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime final
{
public:
	bool                                          bShouldUpdateLeftActiveTime;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime) == 0x000001, "Wrong alignment on BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime");
static_assert(sizeof(BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime) == 0x000001, "Wrong size on BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime");
static_assert(offsetof(BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime, bShouldUpdateLeftActiveTime) == 0x000000, "Member 'BP_AJBMetallica_C_MC_SetShouldUpdateLectActiveTime::bShouldUpdateLeftActiveTime' has a wrong offset!");

// Function BP_AJBMetallica.BP_AJBMetallica_C.UpdateIntervalTimeServer
// 0x0158 (0x0158 - 0x0000)
struct BP_AJBMetallica_C_UpdateIntervalTimeServer final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageCount;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempPreIntervalTime;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempDamageCount;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue2;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue3;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue4;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue5;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMetallica_C_UpdateIntervalTimeServer) == 0x000008, "Wrong alignment on BP_AJBMetallica_C_UpdateIntervalTimeServer");
static_assert(sizeof(BP_AJBMetallica_C_UpdateIntervalTimeServer) == 0x000158, "Wrong size on BP_AJBMetallica_C_UpdateIntervalTimeServer");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, DeltaSeconds) == 0x000000, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, DamageCount) == 0x000004, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::DamageCount' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, TempPreIntervalTime) == 0x000008, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::TempPreIntervalTime' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, TempDamageCount) == 0x00000C, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::TempDamageCount' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMetallica_C_UpdateIntervalTimeServer, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000018, "Member 'BP_AJBMetallica_C_UpdateIntervalTimeServer::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
