#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem_AP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItem_AP.BP_AJBInGameItem_AP_C.ExecuteUbergraph_BP_AJBInGameItem_AP
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_Event_HitCharacter;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamContent*                       CallFunc_GetParamDefaultContent_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP) == 0x000008, "Wrong alignment on BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP");
static_assert(sizeof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP) == 0x000020, "Wrong size on BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP");
static_assert(offsetof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP, K2Node_Event_HitCharacter) == 0x000008, "Member 'BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP::K2Node_Event_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP, CallFunc_GetParamDefaultContent_ReturnValue) == 0x000010, "Member 'BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP::CallFunc_GetParamDefaultContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP, CallFunc_FTrunc_ReturnValue) == 0x00001C, "Member 'BP_AJBInGameItem_AP_C_ExecuteUbergraph_BP_AJBInGameItem_AP::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItem_AP.BP_AJBInGameItem_AP_C.OnROS_Consume
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItem_AP_C_OnROS_Consume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_AP_C_OnROS_Consume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_AP_C_OnROS_Consume");
static_assert(sizeof(BP_AJBInGameItem_AP_C_OnROS_Consume) == 0x000008, "Wrong size on BP_AJBInGameItem_AP_C_OnROS_Consume");
static_assert(offsetof(BP_AJBInGameItem_AP_C_OnROS_Consume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_AP_C_OnROS_Consume::HitCharacter' has a wrong offset!");

}

