#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStartPoint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameStartPoint.BP_AJBInGameStartPoint_C
// 0x0028 (0x0350 - 0x0328)
class ABP_AJBInGameStartPoint_C final : public AActor
{
public:
	class UArrowComponent*                        Arrow1;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   CharacterStart;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         StartPointIndex;                                   // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameStartPoint_C">();
	}
	static class ABP_AJBInGameStartPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameStartPoint_C>();
	}
};
static_assert(alignof(ABP_AJBInGameStartPoint_C) == 0x000008, "Wrong alignment on ABP_AJBInGameStartPoint_C");
static_assert(sizeof(ABP_AJBInGameStartPoint_C) == 0x000350, "Wrong size on ABP_AJBInGameStartPoint_C");
static_assert(offsetof(ABP_AJBInGameStartPoint_C, Arrow1) == 0x000328, "Member 'ABP_AJBInGameStartPoint_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStartPoint_C, CharacterStart) == 0x000330, "Member 'ABP_AJBInGameStartPoint_C::CharacterStart' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStartPoint_C, Arrow) == 0x000338, "Member 'ABP_AJBInGameStartPoint_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStartPoint_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_AJBInGameStartPoint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStartPoint_C, StartPointIndex) == 0x000348, "Member 'ABP_AJBInGameStartPoint_C::StartPointIndex' has a wrong offset!");

}

