#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOnlineBeaconClient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBOnlineBeaconClient.BP_AJBOnlineBeaconClient_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_AJBOnlineBeaconClient_C final : public AAJBOnlineBeaconClient
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepJoined;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBOnlineBeaconClient(int32 EntryPoint);
	void ROS_Pong();
	void ROC_Ping();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void IsJoinBeacon(bool* bRepJoined_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBOnlineBeaconClient_C">();
	}
	static class ABP_AJBOnlineBeaconClient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBOnlineBeaconClient_C>();
	}
};
static_assert(alignof(ABP_AJBOnlineBeaconClient_C) == 0x000008, "Wrong alignment on ABP_AJBOnlineBeaconClient_C");
static_assert(sizeof(ABP_AJBOnlineBeaconClient_C) == 0x0003B8, "Wrong size on ABP_AJBOnlineBeaconClient_C");
static_assert(offsetof(ABP_AJBOnlineBeaconClient_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_AJBOnlineBeaconClient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBOnlineBeaconClient_C, DefaultSceneRoot) == 0x0003A8, "Member 'ABP_AJBOnlineBeaconClient_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBOnlineBeaconClient_C, bRepJoined) == 0x0003B0, "Member 'ABP_AJBOnlineBeaconClient_C::bRepJoined' has a wrong offset!");

}

