#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIObjectPoolGionSource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.ExecuteUbergraph_BP_AJBAIObjectPoolGionSource
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInitialAddition;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  K2Node_CustomEvent_AI_GionSource;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_AJBAIGionSource_C* AI_GionSource)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource) == 0x000010, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource) == 0x0000B0, "Wrong size on BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, EntryPoint) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, Temp_int_Variable) == 0x000028, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, K2Node_CustomEvent_bInitialAddition) == 0x000034, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::K2Node_CustomEvent_bInitialAddition' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Array_Add_ReturnValue1) == 0x000084, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, K2Node_CustomEvent_AI_GionSource) == 0x000088, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::K2Node_CustomEvent_AI_GionSource' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, CallFunc_Array_Add_ReturnValue2) == 0x000090, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'BP_AJBAIObjectPoolGionSource_C_ExecuteUbergraph_BP_AJBAIObjectPoolGionSource::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.OnAIGionSourceLifeTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed final
{
public:
	class ABP_AJBAIGionSource_C*                  AI_GionSource;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed) == 0x000008, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed) == 0x000008, "Wrong size on BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed, AI_GionSource) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_OnAIGionSourceLifeTimeElapsed::AI_GionSource' has a wrong offset!");

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.AddNewObject
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_AddNewObject final
{
public:
	bool                                          bInitialAddition;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_AddNewObject) == 0x000001, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_AddNewObject");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_AddNewObject) == 0x000001, "Wrong size on BP_AJBAIObjectPoolGionSource_C_AddNewObject");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_AddNewObject, bInitialAddition) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_AddNewObject::bInitialAddition' has a wrong offset!");

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.GetUnusedObject
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_GetUnusedObject final
{
public:
	class ABP_AJBAIGionSource_C*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  Result;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject) == 0x000008, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_GetUnusedObject");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject) == 0x000020, "Wrong size on BP_AJBAIObjectPoolGionSource_C_GetUnusedObject");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject, Result) == 0x000008, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObject::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObject, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObject::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.GetTotalObjectCount
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount) == 0x000004, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount) == 0x000008, "Wrong size on BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_AJBAIObjectPoolGionSource_C_GetTotalObjectCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_AJBAIObjectPoolGionSource.BP_AJBAIObjectPoolGionSource_C.GetUnusedObjectCount
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount) == 0x000004, "Wrong alignment on BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount");
static_assert(sizeof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount) == 0x000008, "Wrong size on BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount, ReturnValue) == 0x000000, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_AJBAIObjectPoolGionSource_C_GetUnusedObjectCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

}

