#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRunAway

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRunAway.BP_AJBRunAway_C.ExecuteUbergraph_BP_AJBRunAway
// 0x01E8 (0x01E8 - 0x0000)
struct BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBRunAwayBuff_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Damage;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNotUseCollision;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& RemoveCondition, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGravityLoad_C*                   CallFunc_GetComponentByClass_ReturnValue1;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue2;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bCausedByDamageArea)>     K2Node_CreateDelegate_OutputDelegate2;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBPinkDarkFlinch_C*                CallFunc_GetComponentByClass_ReturnValue2;         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive1;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBRunAwayBuff_C*                   CallFunc_GetComponentByClass_ReturnValue3;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCausedByDamageArea;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway) == 0x000008, "Wrong alignment on BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway");
static_assert(sizeof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway) == 0x0001E8, "Wrong size on BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, EntryPoint) == 0x000000, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_Event_bTriggeredByStand) == 0x000028, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_Damage) == 0x00002C, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_DamageType) == 0x000030, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_DamageCauser) == 0x000038, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_bRemainHP) == 0x000040, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_bDamageIsCut) == 0x000041, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_bNotUseCollision) == 0x000042, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_MatchesTag_ReturnValue) == 0x000043, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_MatchesTag_ReturnValue1) == 0x000044, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_MatchesTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, Temp_bool_Has_Been_Initd_Variable) == 0x000045, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, Temp_bool_IsClosed_Variable) == 0x000058, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue1) == 0x000060, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000068, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess1) == 0x000070, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000078, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetComponentByClass_ReturnValue1) == 0x000090, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_CheckActive_bActive) == 0x000099, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_Not_PreBool_ReturnValue) == 0x00009A, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, Temp_bool_Has_Been_Initd_Variable1) == 0x00009B, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_RemoveCondition) == 0x0000A0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_CharacterBP) == 0x0000A8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue2) == 0x0000B0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_MatchesTag_ReturnValue2) == 0x0000B8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_MatchesTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000C0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess3) == 0x0000C8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, Temp_bool_IsClosed_Variable1) == 0x0000C9, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CreateDelegate_OutputDelegate2) == 0x0000E0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_IsServer_ReturnValue) == 0x0000F0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue3) == 0x0000F8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue4) == 0x000100, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000108, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess4) == 0x000110, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000118, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess5) == 0x000120, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000128, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetComponentByClass_ReturnValue2) == 0x000130, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000138, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_IsValid_ReturnValue1) == 0x000140, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_CheckActive_bActive1) == 0x000141, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_CheckActive_bActive1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000142, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue5) == 0x000148, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue6) == 0x000150, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000158, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess6) == 0x000160, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000168, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess7) == 0x000170, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_HasLocalSharedController_ReturnValue) == 0x000171, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetComponentByClass_ReturnValue3) == 0x000178, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue7) == 0x000180, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue8) == 0x000188, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x000190, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess8) == 0x000198, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x0001A0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess9) == 0x0001A8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x0001B0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess10) == 0x0001C0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, CallFunc_GetOwner_ReturnValue9) == 0x0001C8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_CustomEvent_bCausedByDamageArea) == 0x0001D0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_CustomEvent_bCausedByDamageArea' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x0001D8, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway, K2Node_DynamicCast_bSuccess11) == 0x0001E0, "Member 'BP_AJBRunAway_C_ExecuteUbergraph_BP_AJBRunAway::K2Node_DynamicCast_bSuccess11' has a wrong offset!");

// Function BP_AJBRunAway.BP_AJBRunAway_C.OnPlayDamageVoice_Local
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRunAway_C_OnPlayDamageVoice_Local final
{
public:
	bool                                          bCausedByDamageArea;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAway_C_OnPlayDamageVoice_Local) == 0x000001, "Wrong alignment on BP_AJBRunAway_C_OnPlayDamageVoice_Local");
static_assert(sizeof(BP_AJBRunAway_C_OnPlayDamageVoice_Local) == 0x000001, "Wrong size on BP_AJBRunAway_C_OnPlayDamageVoice_Local");
static_assert(offsetof(BP_AJBRunAway_C_OnPlayDamageVoice_Local, bCausedByDamageArea) == 0x000000, "Member 'BP_AJBRunAway_C_OnPlayDamageVoice_Local::bCausedByDamageArea' has a wrong offset!");

// Function BP_AJBRunAway.BP_AJBRunAway_C.OnPassiveRemoved
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRunAway_C_OnPassiveRemoved final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRunAway_C_OnPassiveRemoved) == 0x000008, "Wrong alignment on BP_AJBRunAway_C_OnPassiveRemoved");
static_assert(sizeof(BP_AJBRunAway_C_OnPassiveRemoved) == 0x000010, "Wrong size on BP_AJBRunAway_C_OnPassiveRemoved");
static_assert(offsetof(BP_AJBRunAway_C_OnPassiveRemoved, RemoveCondition) == 0x000000, "Member 'BP_AJBRunAway_C_OnPassiveRemoved::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnPassiveRemoved, CharacterBP) == 0x000008, "Member 'BP_AJBRunAway_C_OnPassiveRemoved::CharacterBP' has a wrong offset!");

// Function BP_AJBRunAway.BP_AJBRunAway_C.OnReceiveDamage_Server
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBRunAway_C_OnReceiveDamage_Server final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAway_C_OnReceiveDamage_Server) == 0x000008, "Wrong alignment on BP_AJBRunAway_C_OnReceiveDamage_Server");
static_assert(sizeof(BP_AJBRunAway_C_OnReceiveDamage_Server) == 0x000020, "Wrong size on BP_AJBRunAway_C_OnReceiveDamage_Server");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, Damage) == 0x000000, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, DamageType) == 0x000008, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, DamageCauser) == 0x000010, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, bRemainHP) == 0x000018, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, bDamageIsCut) == 0x000019, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAway_C_OnReceiveDamage_Server, bNotUseCollision) == 0x00001A, "Member 'BP_AJBRunAway_C_OnReceiveDamage_Server::bNotUseCollision' has a wrong offset!");

// Function BP_AJBRunAway.BP_AJBRunAway_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRunAway_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAway_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBRunAway_C_OnActionActivate");
static_assert(sizeof(BP_AJBRunAway_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBRunAway_C_OnActionActivate");
static_assert(offsetof(BP_AJBRunAway_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBRunAway_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

}

