#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCharacterInfoUIFollowerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent
// 0x01E0 (0x01E0 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_UI_FollowPairInfo_C*                CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0020(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BattleRecord_C*                     CallFunc_GetBattleRecord_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0180(0x0018)()
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x01A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_FollowingPlayer;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0018)()
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent) == 0x000008, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent) == 0x0001E0, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, EntryPoint) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000005, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000008, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue) == 0x000010, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue1) == 0x000018, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000020, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000A8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x0000AC, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000DC, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000E0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000168, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000169, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000170, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetBattleRecord_ReturnValue) == 0x000178, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetBattleRecord_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, Temp_text_Variable) == 0x000180, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetParent_ReturnValue) == 0x000198, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetDesiredSize_ReturnValue) == 0x0001A0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_BreakVector2D_X) == 0x0001A8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_BreakVector2D_Y) == 0x0001AC, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001B0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue3) == 0x0001B1, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_Event_DeltaSeconds) == 0x0001B4, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_CustomEvent_FollowingPlayer) == 0x0001B8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_CustomEvent_FollowingPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, Temp_bool_Variable) == 0x0001C0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_Select_Default) == 0x0001C8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.TryActiveComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent final
{
public:
	class ABP_AJBInGameCharacter_C*               FollowingPlayer_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent) == 0x000008, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent) == 0x000008, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent, FollowingPlayer_0) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent::FollowingPlayer_0' has a wrong offset!");

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

