#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCloudBarrierCloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBCloudBarrierCloud.BP_AJBCloudBarrierCloud_C
// 0x0058 (0x0388 - 0x0330)
class ABP_AJBCloudBarrierCloud_C final : public ABP_AJBActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TextRendererRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0350(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveInterpSpeedXY;                                 // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowCloudPoint;                              // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveInterpSpeedZ;                                  // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveInterpSpeedZOnFalling;                         // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudBarrierHeightPercentageOnUncrouch___;         // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudBarrierHeightPercentageOnCrouch___;           // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRotationYaw;                               // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMeshLocationAsChestLocation;                   // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SETagDisappear;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCloudBarrierCloud(int32 EntryPoint);
	void TeleportParticle();
	void ChangeVisibility(bool bNewVisibility);
	void OnChangeTimeStop(bool bEnable);
	void PlayDisappearSE();
	void SpawnDisappearParticle();
	void UpdateDebug(int32 CloudPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateVisual(float ValueRate);
	void UserConstructionScript();
	void GetCharacterChestLocation(struct FVector* ChestLocation);
	void FollowToOwner();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBCloudBarrierCloud_C">();
	}
	static class ABP_AJBCloudBarrierCloud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCloudBarrierCloud_C>();
	}
};
static_assert(alignof(ABP_AJBCloudBarrierCloud_C) == 0x000008, "Wrong alignment on ABP_AJBCloudBarrierCloud_C");
static_assert(sizeof(ABP_AJBCloudBarrierCloud_C) == 0x000388, "Wrong size on ABP_AJBCloudBarrierCloud_C");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, UberGraphFrame) == 0x000330, "Member 'ABP_AJBCloudBarrierCloud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, TextRender) == 0x000338, "Member 'ABP_AJBCloudBarrierCloud_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, TextRendererRoot) == 0x000340, "Member 'ABP_AJBCloudBarrierCloud_C::TextRendererRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, ParticleSystem) == 0x000348, "Member 'ABP_AJBCloudBarrierCloud_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, TargetLocation) == 0x000350, "Member 'ABP_AJBCloudBarrierCloud_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, MoveInterpSpeedXY) == 0x00035C, "Member 'ABP_AJBCloudBarrierCloud_C::MoveInterpSpeedXY' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, bDebugShowCloudPoint) == 0x000360, "Member 'ABP_AJBCloudBarrierCloud_C::bDebugShowCloudPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, MoveInterpSpeedZ) == 0x000364, "Member 'ABP_AJBCloudBarrierCloud_C::MoveInterpSpeedZ' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, MoveInterpSpeedZOnFalling) == 0x000368, "Member 'ABP_AJBCloudBarrierCloud_C::MoveInterpSpeedZOnFalling' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, CloudBarrierHeightPercentageOnUncrouch___) == 0x00036C, "Member 'ABP_AJBCloudBarrierCloud_C::CloudBarrierHeightPercentageOnUncrouch___' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, CloudBarrierHeightPercentageOnCrouch___) == 0x000370, "Member 'ABP_AJBCloudBarrierCloud_C::CloudBarrierHeightPercentageOnCrouch___' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, ParticleRotationYaw) == 0x000374, "Member 'ABP_AJBCloudBarrierCloud_C::ParticleRotationYaw' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, bUseMeshLocationAsChestLocation) == 0x000378, "Member 'ABP_AJBCloudBarrierCloud_C::bUseMeshLocationAsChestLocation' has a wrong offset!");
static_assert(offsetof(ABP_AJBCloudBarrierCloud_C, SETagDisappear) == 0x000380, "Member 'ABP_AJBCloudBarrierCloud_C::SETagDisappear' has a wrong offset!");

}

