#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameWindow

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.ExecuteUbergraph_BP_AJBInGameWindow
// 0x0248 (0x0248 - 0x0000)
struct BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamagedActor;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DamageForHPAP;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DamageForAAP;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CutDamage;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_DamageType;                           // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePriority                               K2Node_Event_DamagePriority;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AttackDistance;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageCauser1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WithSeparatedStandAttack;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_HitEnemysSeparatedStand;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrateAP;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNotUseCollision;                     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPenetrating;                         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_FactorTag;                            // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractActor;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor1;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_CustomEvent_Operator;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_CustomEvent_Timing;                         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOperatorIsEmpty;               // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Temp_wildcard_Variable;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Character;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfEnteringOriginToCounterpart_ReturnValue; // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ServerIsInteractingPlayer;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue1;          // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue2;          // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue3;          // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Temp_wildcard_Variable1;                           // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Breaker1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractCenter_ReturnValue;            // 0x0164(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Breaker;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Temp_wildcard_Variable2;                           // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBDamageActor_C*                   K2Node_DynamicCast_AsBP_AJBDamage_Actor;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable1;                              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item1;                          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Temp_wildcard_Variable3;                           // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item2;                          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInteractCenter_ReturnValue1;           // 0x0218(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item3;                          // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow");
static_assert(sizeof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow) == 0x000248, "Wrong size on BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, EntryPoint) == 0x000000, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamagedActor) == 0x000010, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamagedActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamageForHPAP) == 0x000018, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamageForHPAP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamageForAAP) == 0x00001C, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamageForAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_CutDamage) == 0x000020, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_CutDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamageType) == 0x000028, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_SerialNumber) == 0x000030, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamagePriority) == 0x000034, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamagePriority' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_AttackDistance) == 0x000038, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_AttackDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamageCauser1) == 0x000040, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_WithSeparatedStandAttack) == 0x000048, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_WithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_HitEnemysSeparatedStand) == 0x000049, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_HitEnemysSeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_bPenetrateAP) == 0x00004A, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_bPenetrateAP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_bNotUseCollision) == 0x00004B, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_DamageCauser) == 0x000050, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_HitLocation) == 0x000058, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_bPenetrating) == 0x000064, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_bPenetrating' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_FactorTag) == 0x000068, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_FactorTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_InteractActor) == 0x000070, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_InteractActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_InteractingActor1) == 0x000078, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_InteractingActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_bool_Variable) == 0x000080, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_bool_IsClosed_Variable) == 0x000081, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Operator) == 0x000088, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Time) == 0x000090, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Timing) == 0x000094, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_bEnable) == 0x000095, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_bOperatorIsEmpty) == 0x000096, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_wildcard_Variable) == 0x000098, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Character) == 0x0000A8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_IfEnteringOriginToCounterpart_ReturnValue) == 0x0000B4, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_IfEnteringOriginToCounterpart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_InteractingActor) == 0x0000B8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_ServerIsInteractingPlayer) == 0x0000C0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_ServerIsInteractingPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000C8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetComponentsByTag_ReturnValue) == 0x0000D8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetComponentsByTag_ReturnValue1) == 0x0000E8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetComponentsByTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Loop_Counter_Variable1) == 0x0000FC, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_float_Variable) == 0x000100, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Add_IntInt_ReturnValue1) == 0x000108, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetComponentsByTag_ReturnValue2) == 0x000110, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetComponentsByTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetComponentsByTag_ReturnValue3) == 0x000120, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetComponentsByTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Array_Index_Variable) == 0x000130, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000134, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_wildcard_Variable1) == 0x000138, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_wildcard_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Array_Index_Variable1) == 0x000148, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Length_ReturnValue1) == 0x00014C, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Get_Item) == 0x000150, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Breaker1) == 0x000158, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Breaker1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue1) == 0x000160, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_BooleanAND_ReturnValue) == 0x000161, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetInteractCenter_ReturnValue) == 0x000164, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetInteractCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000170, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_CustomEvent_Breaker) == 0x000178, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_CustomEvent_Breaker' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue2) == 0x000180, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_HasLocalSharedController_ReturnValue) == 0x000181, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Event_OtherActor) == 0x000188, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_wildcard_Variable2) == 0x000190, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_wildcard_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Length_ReturnValue2) == 0x0001A4, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetOwner_ReturnValue) == 0x0001A8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_DynamicCast_AsBP_AJBDamage_Actor) == 0x0001B0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_DynamicCast_AsBP_AJBDamage_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_DynamicCast_bSuccess1) == 0x0001B8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x0001C0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x0001C8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue3) == 0x0001C9, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_HasLocalSharedController_ReturnValue1) == 0x0001CA, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue4) == 0x0001CB, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_float_Variable1) == 0x0001CC, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Array_Index_Variable2) == 0x0001D0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, K2Node_Select_Default) == 0x0001D4, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Get_Item1) == 0x0001D8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Loop_Counter_Variable2) == 0x0001E0, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_wildcard_Variable3) == 0x0001E8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_wildcard_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Get_Item2) == 0x0001F8, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Length_ReturnValue3) == 0x000200, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Less_IntInt_ReturnValue1) == 0x000204, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Less_IntInt_ReturnValue2) == 0x000205, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Add_IntInt_ReturnValue2) == 0x000208, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Loop_Counter_Variable3) == 0x00020C, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Less_IntInt_ReturnValue3) == 0x000210, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_IsValid_ReturnValue1) == 0x000211, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Add_IntInt_ReturnValue3) == 0x000214, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_GetInteractCenter_ReturnValue1) == 0x000218, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_GetInteractCenter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, Temp_int_Array_Index_Variable3) == 0x000224, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000228, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000230, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Array_Get_Item3) == 0x000238, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue5) == 0x000240, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_Not_PreBool_ReturnValue6) == 0x000241, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_BooleanAND_ReturnValue1) == 0x000242, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_IsValid_ReturnValue2) == 0x000243, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow, CallFunc_BooleanAND_ReturnValue2) == 0x000244, "Member 'BP_AJBInGameWindow_C_ExecuteUbergraph_BP_AJBInGameWindow::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_AJBInGameWindow_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_AJBInGameWindow_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_AJBInGameWindow_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.SpawnBreakEffectWithAttack
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack final
{
public:
	class ABP_AJBInGameCharacter_C*               Breaker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack");
static_assert(sizeof(BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack");
static_assert(offsetof(BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack, Breaker) == 0x000000, "Member 'BP_AJBInGameWindow_C_SpawnBreakEffectWithAttack::Breaker' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.BreakWindowOnAttack_OnAll
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll final
{
public:
	class ABP_AJBInGameCharacter_C*               Breaker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll");
static_assert(sizeof(BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll");
static_assert(offsetof(BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll, Breaker) == 0x000000, "Member 'BP_AJBInGameWindow_C_BreakWindowOnAttack_OnAll::Breaker' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.OnROSInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameWindow_C_OnROSInteract final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ServerIsInteractingPlayer;                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameWindow_C_OnROSInteract) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_OnROSInteract");
static_assert(sizeof(BP_AJBInGameWindow_C_OnROSInteract) == 0x000010, "Wrong size on BP_AJBInGameWindow_C_OnROSInteract");
static_assert(offsetof(BP_AJBInGameWindow_C_OnROSInteract, InteractingActor) == 0x000000, "Member 'BP_AJBInGameWindow_C_OnROSInteract::InteractingActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_OnROSInteract, ServerIsInteractingPlayer) == 0x000008, "Member 'BP_AJBInGameWindow_C_OnROSInteract::ServerIsInteractingPlayer' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.NotifyToPassThruWindow
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_NotifyToPassThruWindow final
{
public:
	class ABP_AJBInGameCharacter_C*               Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_NotifyToPassThruWindow) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_NotifyToPassThruWindow");
static_assert(sizeof(BP_AJBInGameWindow_C_NotifyToPassThruWindow) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_NotifyToPassThruWindow");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyToPassThruWindow, Character) == 0x000000, "Member 'BP_AJBInGameWindow_C_NotifyToPassThruWindow::Character' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameWindow_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameWindow_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBInGameWindow_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBInGameWindow_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBInGameWindow_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBInGameWindow_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBInGameWindow_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBInGameWindow_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBInGameWindow_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.OnInteractionBlocked
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_OnInteractionBlocked final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_OnInteractionBlocked) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_OnInteractionBlocked");
static_assert(sizeof(BP_AJBInGameWindow_C_OnInteractionBlocked) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_OnInteractionBlocked");
static_assert(offsetof(BP_AJBInGameWindow_C_OnInteractionBlocked, InteractingActor) == 0x000000, "Member 'BP_AJBInGameWindow_C_OnInteractionBlocked::InteractingActor' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameWindow_C_OnInteract final
{
public:
	class AActor*                                 InteractActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_OnInteract) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_OnInteract");
static_assert(sizeof(BP_AJBInGameWindow_C_OnInteract) == 0x000008, "Wrong size on BP_AJBInGameWindow_C_OnInteract");
static_assert(offsetof(BP_AJBInGameWindow_C_OnInteract, InteractActor) == 0x000000, "Member 'BP_AJBInGameWindow_C_OnInteract::InteractActor' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.DamageOverlapped
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameWindow_C_DamageOverlapped final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPenetrating;                                      // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FactorTag;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameWindow_C_DamageOverlapped) == 0x000008, "Wrong alignment on BP_AJBInGameWindow_C_DamageOverlapped");
static_assert(sizeof(BP_AJBInGameWindow_C_DamageOverlapped) == 0x000020, "Wrong size on BP_AJBInGameWindow_C_DamageOverlapped");
static_assert(offsetof(BP_AJBInGameWindow_C_DamageOverlapped, DamageCauser) == 0x000000, "Member 'BP_AJBInGameWindow_C_DamageOverlapped::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_DamageOverlapped, HitLocation) == 0x000008, "Member 'BP_AJBInGameWindow_C_DamageOverlapped::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_DamageOverlapped, bPenetrating) == 0x000014, "Member 'BP_AJBInGameWindow_C_DamageOverlapped::bPenetrating' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameWindow_C_DamageOverlapped, FactorTag) == 0x000018, "Member 'BP_AJBInGameWindow_C_DamageOverlapped::FactorTag' has a wrong offset!");

// Function BP_AJBInGameWindow.BP_AJBInGameWindow_C.AJBDamage
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBInGameWindow_C_AJBDamage final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageForHPAP;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageForAAP;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CutDamage;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePriority                               DamagePriority;                                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackDistance;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithSeparatedStandAttack;                          // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HitEnemysSeparatedStand;                           // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
