#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBStoneHookJump

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.ExecuteUbergraph_BP_AJBStoneHookJump
// 0x0440 (0x0440 - 0x0000)
struct BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_LastLaunchVelocity;             // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_AJBStoneHook_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckOnGround_ReturnValue;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue1;         // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue1;                    // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base2;   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue11;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PassiveTag;                     // 0x02E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PassiveGameplayTagContainer;    // 0x0300(0x0020)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue12;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue13;                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character10;    // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0378(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue14;                   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue15;                   // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character11;    // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character12;    // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate1;             // 0x03E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue16;                   // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base3;   // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_413[0x5];                                      // 0x0413(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor2;      // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump) == 0x000010, "Wrong alignment on BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump");
static_assert(sizeof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump) == 0x000440, "Wrong size on BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, EntryPoint) == 0x000000, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_IsActive_ReturnValue) == 0x000004, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_Operator) == 0x000008, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_Time) == 0x000010, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_Timing) == 0x000014, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_bEnable) == 0x000015, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_bOperatorIsEmpty) == 0x000016, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue1) == 0x000030, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue2) == 0x000038, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000040, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000050, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue3) == 0x000060, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CustomEvent_LastLaunchVelocity) == 0x000068, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CustomEvent_LastLaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CustomEvent_Transform) == 0x000080, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x0000B0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess3) == 0x0000B8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Conv_VectorToString_ReturnValue) == 0x0000C0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetTransform_ReturnValue) == 0x0000F0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue4) == 0x000120, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000128, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess4) == 0x000130, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue5) == 0x000138, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_CheckOnGround_ReturnValue) == 0x000140, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_CheckOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000148, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess5) == 0x000150, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000158, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Not_PreBool_ReturnValue) == 0x0001E1, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue6) == 0x0001E8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue7) == 0x0001F0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0001F8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess6) == 0x000200, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x000208, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess7) == 0x000210, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_HasLocalSharedController_ReturnValue) == 0x000211, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CreateDelegate_OutputDelegate) == 0x000218, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Conv_VectorToString_ReturnValue1) == 0x000228, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Conv_VectorToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Concat_StrStr_ReturnValue1) == 0x000238, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_CheckActive_bActive) == 0x000248, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_BreakVector_X) == 0x00024C, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_BreakVector_Y) == 0x000250, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_BreakVector_Z) == 0x000254, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue8) == 0x000258, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000260, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000268, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess8) == 0x000270, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000271, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_DeltaSeconds) == 0x000274, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_bTriggeredByStand1) == 0x000278, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_Event_bTriggeredByStand) == 0x000279, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_IsActive_ReturnValue1) == 0x00027A, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_IsActive_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue9) == 0x000280, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x000288, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess9) == 0x000290, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000291, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000298, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetViewTargetActor_ViewTargetActor1) == 0x0002A0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetViewTargetActor_ViewTargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002A8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue10) == 0x0002B0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsAJBIn_Game_Character_Base2) == 0x0002B8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsAJBIn_Game_Character_Base2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess10) == 0x0002C0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_HasLocalSharedController_ReturnValue2) == 0x0002C1, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Not_PreBool_ReturnValue1) == 0x0002C2, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue11) == 0x0002C8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_IsServer_ReturnValue) == 0x0002D0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x0002D8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess11) == 0x0002E0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0002E1, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CustomEvent_PassiveTag) == 0x0002E8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CustomEvent_PassiveTag' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CustomEvent_AddCondition) == 0x0002F0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0002F8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x0002F9, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CustomEvent_PassiveGameplayTagContainer) == 0x000300, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CustomEvent_PassiveGameplayTagContainer' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_BooleanOR_ReturnValue) == 0x000320, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue12) == 0x000328, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x000330, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess12) == 0x000338, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue13) == 0x000340, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000348, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character10) == 0x000350, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character10' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess13) == 0x000358, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000360, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess14) == 0x000370, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000378, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_HasAnyTags_ReturnValue) == 0x000398, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue14) == 0x0003A0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue15) == 0x0003A8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character11) == 0x0003B0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character11' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess15) == 0x0003B8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBP_AJBIn_Game_Character12) == 0x0003C0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBP_AJBIn_Game_Character12' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess16) == 0x0003C8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x0003D0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess17) == 0x0003E0, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0003E1, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CreateDelegate_OutputDelegate1) == 0x0003E8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_Not_PreBool_ReturnValue2) == 0x0003F8, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetOwner_ReturnValue16) == 0x000400, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetOwner_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_AsAJBIn_Game_Character_Base3) == 0x000408, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_AsAJBIn_Game_Character_Base3' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_DynamicCast_bSuccess18) == 0x000410, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_DynamicCast_bSuccess18' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_HasLocalSharedController_ReturnValue3) == 0x000411, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000412, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000418, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, K2Node_CreateDelegate_OutputDelegate2) == 0x000420, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_GetViewTargetActor_ViewTargetActor2) == 0x000430, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_GetViewTargetActor_ViewTargetActor2' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000438, "Member 'BP_AJBStoneHookJump_C_ExecuteUbergraph_BP_AJBStoneHookJump::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.CheckPassiveContainer
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBStoneHookJump_C_CheckPassiveContainer final
{
public:
	struct FGameplayTagContainer                  PassiveGameplayTagContainer;                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBStoneHookJump_C_CheckPassiveContainer) == 0x000008, "Wrong alignment on BP_AJBStoneHookJump_C_CheckPassiveContainer");
static_assert(sizeof(BP_AJBStoneHookJump_C_CheckPassiveContainer) == 0x000020, "Wrong size on BP_AJBStoneHookJump_C_CheckPassiveContainer");
static_assert(offsetof(BP_AJBStoneHookJump_C_CheckPassiveContainer, PassiveGameplayTagContainer) == 0x000000, "Member 'BP_AJBStoneHookJump_C_CheckPassiveContainer::PassiveGameplayTagContainer' has a wrong offset!");

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.OnPassiveAdded
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBStoneHookJump_C_OnPassiveAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBStoneHookJump_C_OnPassiveAdded) == 0x000008, "Wrong alignment on BP_AJBStoneHookJump_C_OnPassiveAdded");
static_assert(sizeof(BP_AJBStoneHookJump_C_OnPassiveAdded) == 0x000008, "Wrong size on BP_AJBStoneHookJump_C_OnPassiveAdded");
static_assert(offsetof(BP_AJBStoneHookJump_C_OnPassiveAdded, AddCondition) == 0x000000, "Member 'BP_AJBStoneHookJump_C_OnPassiveAdded::AddCondition' has a wrong offset!");

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.CheckPassive
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBStoneHookJump_C_CheckPassive final
{
public:
	struct FGameplayTag                           PassiveTag_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBStoneHookJump_C_CheckPassive) == 0x000008, "Wrong alignment on BP_AJBStoneHookJump_C_CheckPassive");
static_assert(sizeof(BP_AJBStoneHookJump_C_CheckPassive) == 0x000008, "Wrong size on BP_AJBStoneHookJump_C_CheckPassive");
static_assert(offsetof(BP_AJBStoneHookJump_C_CheckPassive, PassiveTag_0) == 0x000000, "Member 'BP_AJBStoneHookJump_C_CheckPassive::PassiveTag_0' has a wrong offset!");

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.ROS_ReLaunch
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBStoneHookJump_C_ROS_ReLaunch final
{
public:
	struct FVector                                LastLaunchVelocity;                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBStoneHookJump_C_ROS_ReLaunch) == 0x000010, "Wrong alignment on BP_AJBStoneHookJump_C_ROS_ReLaunch");
static_assert(sizeof(BP_AJBStoneHookJump_C_ROS_ReLaunch) == 0x000040, "Wrong size on BP_AJBStoneHookJump_C_ROS_ReLaunch");
static_assert(offsetof(BP_AJBStoneHookJump_C_ROS_ReLaunch, LastLaunchVelocity) == 0x000000, "Member 'BP_AJBStoneHookJump_C_ROS_ReLaunch::LastLaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_AJBStoneHookJump_C_ROS_ReLaunch, Transform) == 0x000010, "Member 'BP_AJBStoneHookJump_C_ROS_ReLaunch::Transform' has a wrong offset!");

// Function BP_AJBStoneHookJump.BP_AJBStoneHookJump_C.SetEnablePostProcess
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBStoneHookJump_C_SetEnablePostProcess final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
