#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDamageDetectionCD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DamageDetectionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBDamageDetectionCD.BP_AJBDamageDetectionCD_C
// 0x0018 (0x0368 - 0x0350)
class ABP_AJBDamageDetectionCD_C final : public ABP_DamageDetectionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBDamageDetectionCD_C;          // 0x0350(0x0008)(Transient, DuplicateTransient)
	struct FTimerHandle                           DetectionEffectTimerHandle;                        // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         DetectionEffectSpan;                               // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBDamageDetectionCD(int32 EntryPoint);
	void OnCompletedDetectionEffectTimer();
	void OnDetection();
	void ReadyDetectionEffect();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBDamageDetectionCD_C">();
	}
	static class ABP_AJBDamageDetectionCD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBDamageDetectionCD_C>();
	}
};
static_assert(alignof(ABP_AJBDamageDetectionCD_C) == 0x000008, "Wrong alignment on ABP_AJBDamageDetectionCD_C");
static_assert(sizeof(ABP_AJBDamageDetectionCD_C) == 0x000368, "Wrong size on ABP_AJBDamageDetectionCD_C");
static_assert(offsetof(ABP_AJBDamageDetectionCD_C, UberGraphFrame_BP_AJBDamageDetectionCD_C) == 0x000350, "Member 'ABP_AJBDamageDetectionCD_C::UberGraphFrame_BP_AJBDamageDetectionCD_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBDamageDetectionCD_C, DetectionEffectTimerHandle) == 0x000358, "Member 'ABP_AJBDamageDetectionCD_C::DetectionEffectTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_AJBDamageDetectionCD_C, DetectionEffectSpan) == 0x000360, "Member 'ABP_AJBDamageDetectionCD_C::DetectionEffectSpan' has a wrong offset!");

}

