#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAllPlayerAffectedSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBAllPlayerAffectedSkill.BP_AJBAllPlayerAffectedSkill_C
// 0x0020 (0x01F8 - 0x01D8)
class UBP_AJBAllPlayerAffectedSkill_C : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBAllPlayerAffectedSkill_C;     // 0x01D8(0x0008)(Transient, DuplicateTransient)
	class ABP_AJBSkillAffecterBase_C*             SkillAffecter;                                     // 0x01E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AffecterStateTimeReady;                            // 0x01E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AffecterStateTimeAction;                           // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AffecterStateTimeClearing;                         // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalAffecterStateTimeActionServer;           // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAllPlayerAffectedSkill(int32 EntryPoint);
	void GetSkillAffecterServer(class UClass* AffecterClass, class ABP_AJBSkillAffecterBase_C** SkillAffecter_0);
	void CheckPossibleAction(bool* bPossibleAction);
	void SetSkillAffecterSettings();
	void SpawnSkillAffecterCore(class UClass* AffecterClass, class ABP_AJBSkillAffecterBase_C** SkillAffecterBase);
	void OnRelatedCharacterBecomeLastSurvivor();
	void TimeExtension_Server(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBAllPlayerAffectedSkill_C">();
	}
	static class UBP_AJBAllPlayerAffectedSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBAllPlayerAffectedSkill_C>();
	}
};
static_assert(alignof(UBP_AJBAllPlayerAffectedSkill_C) == 0x000008, "Wrong alignment on UBP_AJBAllPlayerAffectedSkill_C");
static_assert(sizeof(UBP_AJBAllPlayerAffectedSkill_C) == 0x0001F8, "Wrong size on UBP_AJBAllPlayerAffectedSkill_C");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, UberGraphFrame_BP_AJBAllPlayerAffectedSkill_C) == 0x0001D8, "Member 'UBP_AJBAllPlayerAffectedSkill_C::UberGraphFrame_BP_AJBAllPlayerAffectedSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, SkillAffecter) == 0x0001E0, "Member 'UBP_AJBAllPlayerAffectedSkill_C::SkillAffecter' has a wrong offset!");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, AffecterStateTimeReady) == 0x0001E8, "Member 'UBP_AJBAllPlayerAffectedSkill_C::AffecterStateTimeReady' has a wrong offset!");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, AffecterStateTimeAction) == 0x0001EC, "Member 'UBP_AJBAllPlayerAffectedSkill_C::AffecterStateTimeAction' has a wrong offset!");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, AffecterStateTimeClearing) == 0x0001F0, "Member 'UBP_AJBAllPlayerAffectedSkill_C::AffecterStateTimeClearing' has a wrong offset!");
static_assert(offsetof(UBP_AJBAllPlayerAffectedSkill_C, AdditionalAffecterStateTimeActionServer) == 0x0001F4, "Member 'UBP_AJBAllPlayerAffectedSkill_C::AdditionalAffecterStateTimeActionServer' has a wrong offset!");

}

