#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRunAwayBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRunAwayBuff.BP_AJBRunAwayBuff_C.ExecuteUbergraph_BP_AJBRunAwayBuff
// 0x01B0 (0x01B0 - 0x0000)
struct BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x0118(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0130(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff) == 0x000008, "Wrong alignment on BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff");
static_assert(sizeof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff) == 0x0001B0, "Wrong size on BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, EntryPoint) == 0x000000, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetOwner_ReturnValue1) == 0x000028, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000030, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_Event_bTriggeredByStand1) == 0x000039, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetOwner_ReturnValue2) == 0x000040, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000048, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess2) == 0x000050, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_Event_bTriggeredByStand) == 0x000051, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000058, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetOwner_ReturnValue3) == 0x000070, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000078, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess4) == 0x000080, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x000088, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess5) == 0x000098, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_Conv_NameToText_ReturnValue) == 0x0000A0, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetOwner_ReturnValue4) == 0x0000F8, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000100, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_DynamicCast_bSuccess6) == 0x000108, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_GetCharacterName_CharacterName) == 0x000110, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_Conv_NameToText_ReturnValue1) == 0x000118, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_MakeStruct_FormatArgumentData1) == 0x000130, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, K2Node_MakeArray_Array) == 0x000170, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_Format_ReturnValue) == 0x000180, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_Conv_TextToString_ReturnValue) == 0x000198, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff, CallFunc_Conv_StringToName_ReturnValue) == 0x0001A8, "Member 'BP_AJBRunAwayBuff_C_ExecuteUbergraph_BP_AJBRunAwayBuff::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_AJBRunAwayBuff.BP_AJBRunAwayBuff_C.OnActionInactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRunAwayBuff_C_OnActionInactivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAwayBuff_C_OnActionInactivate) == 0x000001, "Wrong alignment on BP_AJBRunAwayBuff_C_OnActionInactivate");
static_assert(sizeof(BP_AJBRunAwayBuff_C_OnActionInactivate) == 0x000001, "Wrong size on BP_AJBRunAwayBuff_C_OnActionInactivate");
static_assert(offsetof(BP_AJBRunAwayBuff_C_OnActionInactivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBRunAwayBuff_C_OnActionInactivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBRunAwayBuff.BP_AJBRunAwayBuff_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRunAwayBuff_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRunAwayBuff_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBRunAwayBuff_C_OnActionActivate");
static_assert(sizeof(BP_AJBRunAwayBuff_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBRunAwayBuff_C_OnActionActivate");
static_assert(offsetof(BP_AJBRunAwayBuff_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBRunAwayBuff_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

}

