#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_SkillInfo_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"
#include "ST_ContinuedDamageKeepInfo_structs.hpp"
#include "E_StencilDigit_structs.hpp"
#include "ST_GrowupInfo_Processed_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "ST_CameraParam_structs.hpp"
#include "E_VoiceProcessType_structs.hpp"
#include "ST_ActionSkillInfo_structs.hpp"
#include "ST_FXVisibilityInfo_structs.hpp"
#include "ST_CharaSkin_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillGrownup__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature, GameplayTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature, Value) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillGrownup__DelegateSignature::Value' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnCharacterDead_Server__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature) == 0x000018, "Wrong size on BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature, DamageType) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature, DeadActor) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature, DamageCauser) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnCharacterDead_Server__DelegateSignature::DamageCauser' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillConsumed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillConsumed__DelegateSignature::SkillTag' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnPassiveAdded__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature, AddCondition) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnPassiveAdded__DelegateSignature::AddCondition' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnPassiveRemoved__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature, RemoveCondition) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature, CharacterBP) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnPassiveRemoved__DelegateSignature::CharacterBP' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillActivated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature final
{
public:
	class UBP_AJBSkillBase_C*                     ActivatedSkill;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature, ActivatedSkill) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillActivated__DelegateSignature::ActivatedSkill' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillInactivated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature final
{
public:
	class UBP_AJBSkillBase_C*                     InactivatedSkill;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature, InactivatedSkill) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillInactivated__DelegateSignature::InactivatedSkill' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnCharacterActiveBehaviorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature final
{
public:
	class AAJBInGameCharacter*                    TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActiveBehavior                      OldBehavior;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActiveBehavior                      NextBehavior;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpecialBreakDown;                                 // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature, TargetCharacter) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature, OldBehavior) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature::OldBehavior' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature, NextBehavior) == 0x000009, "Member 'BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature::NextBehavior' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature, bSpecialBreakDown) == 0x00000A, "Member 'BP_AJBInGameCharacter_C_OnCharacterActiveBehaviorChanged__DelegateSignature::bSpecialBreakDown' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnAttackHit__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature final
{
public:
	bool                                          bHeadShot;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFInishBlow;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature) == 0x000002, "Wrong size on BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature, bHeadShot) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature, bFInishBlow) == 0x000001, "Member 'BP_AJBInGameCharacter_C_OnAttackHit__DelegateSignature::bFInishBlow' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnReceiveDamage_Local__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCutByStatus;                              // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCutByAAP;                                 // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature) == 0x000020, "Wrong size on BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, Damage) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, DamageType) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, DamageCauser) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, bRemainHP) == 0x000018, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, bDamageIsCutByStatus) == 0x000019, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::bDamageIsCutByStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature, bDamageIsCutByAAP) == 0x00001A, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Local__DelegateSignature::bDamageIsCutByAAP' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnGiveDamage_Local__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageReceiver;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SerialNumber;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DamageReceiverIsPlayer;                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWithSeparatedStandAttack;                         // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnemysSeparateStand;                              // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature) == 0x000028, "Wrong size on BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, Damage) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, DamageType) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, DamageReceiver) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::DamageReceiver' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, bRemainHP) == 0x000018, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, bDamageIsCut) == 0x000019, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, SerialNumber) == 0x00001C, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, DamageReceiverIsPlayer) == 0x000020, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::DamageReceiverIsPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, bWithSeparatedStandAttack) == 0x000021, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::bWithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature, bEnemysSeparateStand) == 0x000022, "Member 'BP_AJBInGameCharacter_C_OnGiveDamage_Local__DelegateSignature::bEnemysSeparateStand' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnGetItem__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature final
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature, ItemTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnGetItem__DelegateSignature::ItemTag' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnPossessTargetChenged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature final
{
public:
	class AAJBInGameCharacterBase*                SeparateFrom;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                SeparateTo;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature, SeparateFrom) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature::SeparateFrom' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature, SeparateTo) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnPossessTargetChenged__DelegateSignature::SeparateTo' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillUnlocked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature final
{
public:
	EAJBSkillType                                 SkillType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature) == 0x000001, "Wrong size on BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature, SkillType) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillUnlocked__DelegateSignature::SkillType' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnHPChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature final
{
public:
	int32                                         HP;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature) == 0x000004, "Wrong size on BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature, HP) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnHPChanged__DelegateSignature::HP' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillMissed_Local__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bHitObject;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature, bHitObject) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillMissed_Local__DelegateSignature::bHitObject' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnShotPossibilityChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature) == 0x000001, "Wrong size on BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature, bEnable) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnShotPossibilityChanged__DelegateSignature::bEnable' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnEmote__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameCharacter_C_OnEmote__DelegateSignature final
{
public:
	int32                                         VoiceIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnEmote__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBInGameCharacter_C_OnEmote__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnEmote__DelegateSignature) == 0x000004, "Wrong size on BP_AJBInGameCharacter_C_OnEmote__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnEmote__DelegateSignature, VoiceIndex) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnEmote__DelegateSignature::VoiceIndex' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnKill_Local__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         KilledCharacterId;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithSeparatedStandAttack;                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHitEnemysSeparatedStand;                          // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstBlood;                                       // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         UltimateSkillSerialNumberIfInEffect;               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeadPlayerID;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLastDefeated;                                   // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayerKill;                                       // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSpecialKill;                                      // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature) == 0x000028, "Wrong size on BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, SerialNumber) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, AttackDistance) == 0x00000C, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::AttackDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, KilledCharacterId) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::KilledCharacterId' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bWithSeparatedStandAttack) == 0x000011, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bWithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bHitEnemysSeparatedStand) == 0x000012, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bHitEnemysSeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bFirstBlood) == 0x000013, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bFirstBlood' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, UltimateSkillSerialNumberIfInEffect) == 0x000014, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::UltimateSkillSerialNumberIfInEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, ElapsedTime) == 0x000018, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, DeadPlayerID) == 0x00001C, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::DeadPlayerID' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bIsLastDefeated) == 0x000020, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bIsLastDefeated' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bPlayerKill) == 0x000021, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bPlayerKill' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature, bSpecialKill) == 0x000022, "Member 'BP_AJBInGameCharacter_C_OnKill_Local__DelegateSignature::bSpecialKill' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnDie_Local__DelegateSignature
// 0x0003 (0x0003 - 0x0000)
struct BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature final
{
public:
	bool                                          bWillRessurect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLastDefeated;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDiedOfKillZ;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature) == 0x000003, "Wrong size on BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature, bWillRessurect) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature::bWillRessurect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature, bIsLastDefeated) == 0x000001, "Member 'BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature::bIsLastDefeated' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature, bDiedOfKillZ) == 0x000002, "Member 'BP_AJBInGameCharacter_C_OnDie_Local__DelegateSignature::bDiedOfKillZ' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillGiveHeadShot_Local__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillGiveHeadShot_Local__DelegateSignature::SkillTag' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillBlocked_Local__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bAvoidSkill;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature, bAvoidSkill) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillBlocked_Local__DelegateSignature::bAvoidSkill' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnReceiveDamage_Server__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature) == 0x000020, "Wrong size on BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, Damage) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, DamageType) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, DamageCauser) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, bRemainHP) == 0x000018, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, bDamageIsCut) == 0x000019, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature, bNotUseCollision) == 0x00001A, "Member 'BP_AJBInGameCharacter_C_OnReceiveDamage_Server__DelegateSignature::bNotUseCollision' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnOtherGrowup__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         Value01;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value02;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value03;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature) == 0x000018, "Wrong size on BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature, GameplayTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature, Value01) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature::Value01' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature, Value02) == 0x00000C, "Member 'BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature::Value02' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature, Value03) == 0x000010, "Member 'BP_AJBInGameCharacter_C_OnOtherGrowup__DelegateSignature::Value03' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnDown_Local__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature final
{
public:
	int32                                         DownedMachingPlayerIndex;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature) == 0x000004, "Wrong size on BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature, DownedMachingPlayerIndex) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnDown_Local__DelegateSignature::DownedMachingPlayerIndex' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnRevive_Local__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature final
{
public:
	class AActor*                                 Rescuer;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature, Rescuer) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnRevive_Local__DelegateSignature::Rescuer' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnWindowBroken_Local__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature final
{
public:
	bool                                          bBrokenByAttack;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature) == 0x000001, "Wrong alignment on BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature) == 0x000001, "Wrong size on BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature, bBrokenByAttack) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnWindowBroken_Local__DelegateSignature::bBrokenByAttack' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillNumUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature, LeftNum) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillNumUpdated__DelegateSignature::LeftNum' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillSucceeded_Local__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillSucceeded_Local__DelegateSignature::SkillTag' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillEffectiveTimeDetermined_Local__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         EffectiveTimeSec;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateEvenIfNotInGameplay;                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature, EffectiveTimeSec) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature::EffectiveTimeSec' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature, bUpdateEvenIfNotInGameplay) == 0x00000C, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveTimeDetermined_Local__DelegateSignature::bUpdateEvenIfNotInGameplay' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillReady_Local__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature final
{
public:
	class UBP_AJBSkillBase_C*                     ReadySkill;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature, ReadySkill) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillReady_Local__DelegateSignature::ReadySkill' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillEffectiveValueDetermined_Local__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectiveValue;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateEvenIfNotInGameplay;                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature, SkillTag) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature, EffectiveValue) == 0x000008, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature::EffectiveValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature, bUpdateEvenIfNotInGameplay) == 0x00000C, "Member 'BP_AJBInGameCharacter_C_OnSkillEffectiveValueDetermined_Local__DelegateSignature::bUpdateEvenIfNotInGameplay' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnCutDamage_Local__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature final
{
public:
	int32                                         CutDamage;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature) == 0x000004, "Wrong size on BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature, CutDamage) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnCutDamage_Local__DelegateSignature::CutDamage' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnSkillFailedToUse_Local__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature final
{
public:
	struct FGameplayTagContainer                  FactorTags;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature) == 0x000020, "Wrong size on BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature, FactorTags) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnSkillFailedToUse_Local__DelegateSignature::FactorTags' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnUltimateSkillEffectStarted_Server__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature final
{
public:
	int32                                         SerialNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature) == 0x000004, "Wrong size on BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature");
static_assert(offsetof(BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature, SerialNumber) == 0x000000, "Member 'BP_AJBInGameCharacter_C_OnUltimateSkillEffectStarted_Server__DelegateSignature::SerialNumber' has a wrong offset!");

// Function BP_AJBInGameCharacter.BP_AJBInGameCharacter_C.OnLastKill_Local__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameCharacter_C_OnLastKill_Local__DelegateSignature final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameCharacter_C_OnLastKill_Local__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameCharacter_C_OnLastKill_Local__DelegateSignature");
static_assert(sizeof(BP_AJBInGameCharacter_C_OnLastKill_Local__DelegateSignature) == 0x000008, "Wrong size on BP_AJBInGameCharacter_C_OnLastKill_Local__DelegateSignature");
