#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDamageAreaMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_DamageAreaInterval_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C.ExecuteUbergraph_BP_AJBDamageAreaMaster
// 0x0208 (0x0208 - 0x0000)
struct BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBDamageArea_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBDamageArea_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDamageAreaContext_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageAreaInterval                 CallFunc_GetInterval_ReturnValue;                  // 0x0078(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReductionCompleted_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item1;                          // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentTickEnabled_ReturnValue;       // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPause;                        // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimespan                              CallFunc_GetTimespanFromBattleStart_ReturnValue;   // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTimespanFromBattleStart_ReturnValue1;  // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue1;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x00D8(0x0020)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ContentNum_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInitialDamageAreaCenter_ReturnValue;   // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInitialDamageAreaRadius_ReturnValue;   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInitialDamageAreaRadius_ReturnValue1;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x018C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue1;             // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInitialDamageAreaCenter_ReturnValue1;  // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInitialDamageAreaRadius_ReturnValue2;  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDamageAreaParamInitialized_bDamageAreaParamInitialized; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster) == 0x000008, "Wrong alignment on BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster");
static_assert(sizeof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster) == 0x000208, "Wrong size on BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, EntryPoint) == 0x000000, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Less_IntInt_ReturnValue1) == 0x00001D, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetGameState_ReturnValue) == 0x000040, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_RotateAngleAxis_ReturnValue) == 0x000058, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_Has_Been_Initd_Variable) == 0x000068, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00006C, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInterval_ReturnValue) == 0x000078, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInterval_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_IsClosed_Variable) == 0x000090, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_ReductionCompleted_ReturnValue) == 0x000091, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_ReductionCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Less_IntInt_ReturnValue2) == 0x000092, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Array_Get_Item1) == 0x000098, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Array_IsValidIndex_ReturnValue1) == 0x0000A4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Array_IsValidIndex_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000A5, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsComponentTickEnabled_ReturnValue) == 0x0000A6, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsComponentTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, K2Node_CustomEvent_IsPause) == 0x0000A7, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::K2Node_CustomEvent_IsPause' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetTimespanFromBattleStart_ReturnValue) == 0x0000A8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetTimespanFromBattleStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000B0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetTimespanFromBattleStart_ReturnValue1) == 0x0000B8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetTimespanFromBattleStart_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetTotalSeconds_ReturnValue1) == 0x0000C0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetTotalSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsValid_ReturnValue) == 0x0000CC, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_RandomFloatInRange_ReturnValue1) == 0x0000D0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x0000D4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetDebugTags_ReturnValue) == 0x0000D8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000F8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_HasTag_ReturnValue) == 0x0000FC, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsServer_ReturnValue) == 0x0000FD, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsShipping_ReturnValue) == 0x0000FE, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_ContentNum_ReturnValue) == 0x000100, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_ContentNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Not_PreBool_ReturnValue) == 0x000104, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_BooleanAND_ReturnValue) == 0x000105, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_bSuccess) == 0x000106, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000108, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInitialDamageAreaCenter_ReturnValue) == 0x000110, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInitialDamageAreaCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInitialDamageAreaRadius_ReturnValue) == 0x00011C, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInitialDamageAreaRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000120, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000128, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInitialDamageAreaRadius_ReturnValue1) == 0x000130, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInitialDamageAreaRadius_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Conv_FloatToString_ReturnValue) == 0x000138, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Conv_FloatToString_ReturnValue1) == 0x000148, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Conv_FloatToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Concat_StrStr_ReturnValue) == 0x000158, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Concat_StrStr_ReturnValue1) == 0x000168, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Concat_StrStr_ReturnValue2) == 0x000178, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x000188, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Add_VectorVector_ReturnValue) == 0x00018C, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000198, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Abs_ReturnValue) == 0x00019C, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001A0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_RandomFloatInRange_ReturnValue2) == 0x0001A4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_RotateAngleAxis_ReturnValue1) == 0x0001A8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_RotateAngleAxis_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_Has_Been_Initd_Variable1) == 0x0001B4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Normal_ReturnValue) == 0x0001B8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0001D0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0001D8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInitialDamageAreaCenter_ReturnValue1) == 0x0001E0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInitialDamageAreaCenter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetInitialDamageAreaRadius_ReturnValue2) == 0x0001EC, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetInitialDamageAreaRadius_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsValid_ReturnValue1) == 0x0001F0, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0001F1, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_PlayModeEquals_bResult) == 0x0001F2, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_Not_PreBool_ReturnValue1) == 0x0001F3, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, Temp_bool_IsClosed_Variable1) == 0x0001F4, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_bSuccess3) == 0x0001F5, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_GetAJBGameInstance_AJB_Game_Instance3) == 0x0001F8, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_GetAJBGameInstance_AJB_Game_Instance3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster, CallFunc_IsDamageAreaParamInitialized_bDamageAreaParamInitialized) == 0x000200, "Member 'BP_AJBDamageAreaMaster_C_ExecuteUbergraph_BP_AJBDamageAreaMaster::CallFunc_IsDamageAreaParamInitialized_bDamageAreaParamInitialized' has a wrong offset!");

// Function BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C.ToggleDebugPauseDamageArea
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea final
{
public:
	bool                                          IsPause;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea) == 0x000001, "Wrong alignment on BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea");
static_assert(sizeof(BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea) == 0x000001, "Wrong size on BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea, IsPause) == 0x000000, "Member 'BP_AJBDamageAreaMaster_C_ToggleDebugPauseDamageArea::IsPause' has a wrong offset!");

// Function BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBDamageAreaMaster_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDamageAreaMaster_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBDamageAreaMaster_C_ReceiveTick");
static_assert(sizeof(BP_AJBDamageAreaMaster_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBDamageAreaMaster_C_ReceiveTick");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBDamageAreaMaster_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C.GetInterval
// 0x00C0 (0x00C0 - 0x0000)
struct BP_AJBDamageAreaMaster_C_GetInterval final
{
public:
	int32                                         IntervalIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageAreaInterval                 ReturnValue;                                       // 0x0004(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBParamContent*                       UseContent;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBParamContent*                       CallFunc_GetContentArray_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	struct FST_DamageAreaInterval                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue2;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue3;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue4;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue5;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue2;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue3;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_DamageAreaInterval                 K2Node_MakeStruct_ST_DamageAreaInterval;           // 0x00A8(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDamageAreaMaster_C_GetInterval) == 0x000008, "Wrong alignment on BP_AJBDamageAreaMaster_C_GetInterval");
static_assert(sizeof(BP_AJBDamageAreaMaster_C_GetInterval) == 0x0000C0, "Wrong size on BP_AJBDamageAreaMaster_C_GetInterval");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, IntervalIndex) == 0x000000, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::IntervalIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, ReturnValue) == 0x000004, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, UseContent) == 0x000020, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::UseContent' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, K2Node_DynamicCast_AsBP_AJBGame_Instance) == 0x000030, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::K2Node_DynamicCast_AsBP_AJBGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetContentArray_ReturnValue) == 0x000040, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetContentArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000050, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue) == 0x00007C, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_Not_PreBool_ReturnValue1) == 0x000081, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue1) == 0x000084, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue2) == 0x000088, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue3) == 0x00008C, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_FTrunc_ReturnValue) == 0x000090, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_FTrunc_ReturnValue1) == 0x000094, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_FTrunc_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue4) == 0x000098, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_GetFloatValue_ReturnValue5) == 0x00009C, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_GetFloatValue_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_FTrunc_ReturnValue2) == 0x0000A0, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_FTrunc_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, CallFunc_FTrunc_ReturnValue3) == 0x0000A4, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::CallFunc_FTrunc_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_GetInterval, K2Node_MakeStruct_ST_DamageAreaInterval) == 0x0000A8, "Member 'BP_AJBDamageAreaMaster_C_GetInterval::K2Node_MakeStruct_ST_DamageAreaInterval' has a wrong offset!");

// Function BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C.InitializeDamageAreaIntervalParam
// 0x0120 (0x0120 - 0x0000)
struct BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam final
{
public:
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0010(0x0020)()
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntOption_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInitialDamageAreaRadius_ReturnValue;   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDamegeAreaFileNameBase_File_Name_Base; // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue1;                // 0x00A8(0x0020)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamFile*                          CallFunc_GetParamFile_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableRedis_ReturnValue;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBParamRepos*                         CallFunc_GetParamRepos_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam) == 0x000008, "Wrong alignment on BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam");
static_assert(sizeof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam) == 0x000120, "Wrong size on BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetAJBGameInstance_bSuccess) == 0x000000, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetDebugTags_ReturnValue) == 0x000010, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetAreaTypeID_ReturnValue) == 0x000030, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_HasTag_ReturnValue) == 0x000034, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000040, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000048, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetIntOption_ReturnValue) == 0x000050, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetIntOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam, CallFunc_GetInitialDamageAreaRadius_ReturnValue) == 0x000054, "Member 'BP_AJBDamageAreaMaster_C_InitializeDamageAreaIntervalParam::CallFunc_GetInitialDamageAreaRadius_ReturnValue' has a wrong offset!");
