#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOutGameHUD

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "ERewardDisplayType_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.ExecuteUbergraph_BP_AJBOutGameHUD
// 0x0280 (0x0280 - 0x0000)
struct BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeInActionProxy*                     CallFunc_FadeIn_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeOutActionProxy*                    CallFunc_FadeOut_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_C*                       CallFunc_Create_ReturnValue1;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_StandBy_C*                          CallFunc_Create_ReturnValue2;                      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_GameOver_C*                         CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeOutActionProxy*                    CallFunc_FadeOut_ReturnValue1;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeTime1;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_FadeTime;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharacterSelect_C*                  CallFunc_FindAJBWidgetOfClass_OutWidget1;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_StartPointSelect_C*                 CallFunc_FindAJBWidgetOfClass_OutWidget2;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_StartPointSelect_C*                 CallFunc_FindAJBWidgetOfClass_OutWidget3;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_WaitingOtherPlayers_C*              CallFunc_FindAJBWidgetOfClass_OutWidget4;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_WaitingOtherPlayers_C*              CallFunc_FindAJBWidgetOfClass_OutWidget5;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Matching_C*                         CallFunc_FindAJBWidgetOfClass_OutWidget6;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Matching_C*                         CallFunc_FindAJBWidgetOfClass_OutWidget7;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Fade_C*                             CallFunc_FindAJBWidgetOfClass_OutWidget8;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Fade_C*                             CallFunc_FindAJBWidgetOfClass_OutWidget9;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Credit_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget10;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Credit_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget11;         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxTime;                              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget12;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBWwiseManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_WaitingOtherPlayers_C*              CallFunc_FindAJBWidgetOfClass_OutWidget13;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Training_C*                         CallFunc_FindAJBWidgetOfClass_OutWidget14;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_RoomSelect_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget15;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TakeOverElapsedTime_ModeSelect; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_StartPointChipAlert_C*              CallFunc_FindAJBWidgetOfClass_OutWidget16;         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsWB_Test_Mode_Menu_Base;  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess1;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuBase_C*                 CallFunc_FindAJBWidgetOfClass_OutWidget17;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue1;   // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharacterSelect_C*                  CallFunc_FindAJBWidgetOfClass_OutWidget18;         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CharacterSelect_C*                  CallFunc_FindAJBWidgetOfClass_OutWidget19;         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CharacterSelect_C*                  CallFunc_FindAJBWidgetOfClass_OutWidget20;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CharacterSelect_C*                  CallFunc_FindAJBWidgetOfClass_OutWidget21;         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBUserWidget*                         CallFunc_Create_ReturnValue3;                      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Connecting_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget22;         // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Connecting_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget23;         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAJBGameRewardInfo>             K2Node_CustomEvent_RewardInfos;                    // 0x0248(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	ERewardDisplayType                            K2Node_CustomEvent_RewardDisplayType;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Reward_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget24;         // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_StandBy_C*                          CallFunc_FindAJBWidgetOfClass_OutWidget25;         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD) == 0x000008, "Wrong alignment on BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD");
static_assert(sizeof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD) == 0x000280, "Wrong size on BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, EntryPoint) == 0x000000, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FadeIn_ReturnValue) == 0x000008, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FadeIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FadeOut_ReturnValue) == 0x000028, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue1) == 0x000038, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, Temp_class_Variable) == 0x000040, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000048, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_ClassDynamicCast_bSuccess) == 0x000050, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Create_ReturnValue) == 0x000058, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Create_ReturnValue1) == 0x000060, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Create_ReturnValue2) == 0x000068, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_GetAJBGameInstance_bSuccess) == 0x000070, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000078, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x000080, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000088, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CustomEvent_TargetWidget) == 0x000090, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_DynamicCast_AsAJBPlayer_Controller_Base) == 0x000098, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_DynamicCast_AsAJBPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate1) == 0x0000A8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FadeOut_ReturnValue1) == 0x0000C0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FadeOut_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_Event_FadeTime1) == 0x0000C8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_Event_FadeTime1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue2) == 0x0000CC, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_Event_FadeTime) == 0x0000D0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_Event_FadeTime' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget1) == 0x0000D8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget2) == 0x0000E0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget2' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget3) == 0x0000E8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget3' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget4) == 0x0000F0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget4' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget5) == 0x0000F8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget5' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget6) == 0x000100, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget6' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget7) == 0x000108, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget7' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget8) == 0x000110, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget8' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget9) == 0x000118, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget9' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget10) == 0x000120, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget10' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue3) == 0x000128, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget11) == 0x000130, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget11' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue4) == 0x000138, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, Temp_int_Loop_Counter_Variable) == 0x00013C, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_Event_bVisible) == 0x000140, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Less_IntInt_ReturnValue) == 0x000141, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_Event_Time) == 0x000148, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_Event_MaxTime) == 0x00014C, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_Event_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget12) == 0x000150, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget12' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue5) == 0x000158, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_GetAllActorsOfClass_OutActors) == 0x000160, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000170, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget13) == 0x000178, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget13' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget14) == 0x000180, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget14' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate2) == 0x000188, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget15) == 0x000198, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget15' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CustomEvent_TakeOverElapsedTime_ModeSelect) == 0x0001A0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CustomEvent_TakeOverElapsedTime_ModeSelect' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget16) == 0x0001A8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget16' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsShipping_ReturnValue) == 0x0001B0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Not_PreBool_ReturnValue) == 0x0001B1, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0001B2, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x0001B8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate3) == 0x0001C0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_ClassDynamicCast_AsWB_Test_Mode_Menu_Base) == 0x0001D0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_ClassDynamicCast_AsWB_Test_Mode_Menu_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_ClassDynamicCast_bSuccess1) == 0x0001D8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_ClassDynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValidClass_ReturnValue) == 0x0001D9, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget17) == 0x0001E0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget17' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValid_ReturnValue6) == 0x0001E8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_IsValidSoftClassReference_ReturnValue1) == 0x0001E9, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_IsValidSoftClassReference_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget18) == 0x0001F0, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget18' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget19) == 0x0001F8, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget19' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget20) == 0x000200, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget20' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget21) == 0x000208, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget21' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, Temp_int_Array_Index_Variable) == 0x000210, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Array_Get_Item) == 0x000218, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate4) == 0x000220, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_Create_ReturnValue3) == 0x000230, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget22) == 0x000238, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget22' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget23) == 0x000240, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget23' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CustomEvent_RewardInfos) == 0x000248, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CustomEvent_RewardInfos' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CustomEvent_RewardDisplayType) == 0x000258, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CustomEvent_RewardDisplayType' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget24) == 0x000260, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget24' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, K2Node_CreateDelegate_OutputDelegate5) == 0x000268, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD, CallFunc_FindAJBWidgetOfClass_OutWidget25) == 0x000278, "Member 'BP_AJBOutGameHUD_C_ExecuteUbergraph_BP_AJBOutGameHUD::CallFunc_FindAJBWidgetOfClass_OutWidget25' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.ShowReward
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBOutGameHUD_C_ShowReward final
{
public:
	TArray<struct FAJBGameRewardInfo>             RewardInfos;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	ERewardDisplayType                            RewardDisplayType;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_ShowReward) == 0x000008, "Wrong alignment on BP_AJBOutGameHUD_C_ShowReward");
static_assert(sizeof(BP_AJBOutGameHUD_C_ShowReward) == 0x000018, "Wrong size on BP_AJBOutGameHUD_C_ShowReward");
static_assert(offsetof(BP_AJBOutGameHUD_C_ShowReward, RewardInfos) == 0x000000, "Member 'BP_AJBOutGameHUD_C_ShowReward::RewardInfos' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_ShowReward, RewardDisplayType) == 0x000010, "Member 'BP_AJBOutGameHUD_C_ShowReward::RewardDisplayType' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.ShowStoreBattleStandby
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBOutGameHUD_C_ShowStoreBattleStandby final
{
public:
	float                                         TakeOverElapsedTime_ModeSelect_0;                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_ShowStoreBattleStandby) == 0x000004, "Wrong alignment on BP_AJBOutGameHUD_C_ShowStoreBattleStandby");
static_assert(sizeof(BP_AJBOutGameHUD_C_ShowStoreBattleStandby) == 0x000004, "Wrong size on BP_AJBOutGameHUD_C_ShowStoreBattleStandby");
static_assert(offsetof(BP_AJBOutGameHUD_C_ShowStoreBattleStandby, TakeOverElapsedTime_ModeSelect_0) == 0x000000, "Member 'BP_AJBOutGameHUD_C_ShowStoreBattleStandby::TakeOverElapsedTime_ModeSelect_0' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.UpdateTimeCountDown
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBOutGameHUD_C_UpdateTimeCountDown final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTime;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_UpdateTimeCountDown) == 0x000004, "Wrong alignment on BP_AJBOutGameHUD_C_UpdateTimeCountDown");
static_assert(sizeof(BP_AJBOutGameHUD_C_UpdateTimeCountDown) == 0x000008, "Wrong size on BP_AJBOutGameHUD_C_UpdateTimeCountDown");
static_assert(offsetof(BP_AJBOutGameHUD_C_UpdateTimeCountDown, Time) == 0x000000, "Member 'BP_AJBOutGameHUD_C_UpdateTimeCountDown::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_UpdateTimeCountDown, MaxTime) == 0x000004, "Member 'BP_AJBOutGameHUD_C_UpdateTimeCountDown::MaxTime' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.SetVisibilityTimeCountDown
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown) == 0x000001, "Wrong alignment on BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown");
static_assert(sizeof(BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown) == 0x000001, "Wrong size on BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown");
static_assert(offsetof(BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown, bVisible) == 0x000000, "Member 'BP_AJBOutGameHUD_C_SetVisibilityTimeCountDown::bVisible' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.OnStartFadeOut
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBOutGameHUD_C_OnStartFadeOut final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_OnStartFadeOut) == 0x000004, "Wrong alignment on BP_AJBOutGameHUD_C_OnStartFadeOut");
static_assert(sizeof(BP_AJBOutGameHUD_C_OnStartFadeOut) == 0x000004, "Wrong size on BP_AJBOutGameHUD_C_OnStartFadeOut");
static_assert(offsetof(BP_AJBOutGameHUD_C_OnStartFadeOut, FadeTime) == 0x000000, "Member 'BP_AJBOutGameHUD_C_OnStartFadeOut::FadeTime' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.OnStartFadeIn
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBOutGameHUD_C_OnStartFadeIn final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_OnStartFadeIn) == 0x000004, "Wrong alignment on BP_AJBOutGameHUD_C_OnStartFadeIn");
static_assert(sizeof(BP_AJBOutGameHUD_C_OnStartFadeIn) == 0x000004, "Wrong size on BP_AJBOutGameHUD_C_OnStartFadeIn");
static_assert(offsetof(BP_AJBOutGameHUD_C_OnStartFadeIn, FadeTime) == 0x000000, "Member 'BP_AJBOutGameHUD_C_OnStartFadeIn::FadeTime' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.OnOpenGameOver
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBOutGameHUD_C_OnOpenGameOver final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_OnOpenGameOver) == 0x000008, "Wrong alignment on BP_AJBOutGameHUD_C_OnOpenGameOver");
static_assert(sizeof(BP_AJBOutGameHUD_C_OnOpenGameOver) == 0x000008, "Wrong size on BP_AJBOutGameHUD_C_OnOpenGameOver");
static_assert(offsetof(BP_AJBOutGameHUD_C_OnOpenGameOver, TargetWidget) == 0x000000, "Member 'BP_AJBOutGameHUD_C_OnOpenGameOver::TargetWidget' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B final
{
public:
	class UClass*                                 Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B) == 0x000008, "Wrong alignment on BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B");
static_assert(sizeof(BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B) == 0x000008, "Wrong size on BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B");
static_assert(offsetof(BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B, Loaded) == 0x000000, "Member 'BP_AJBOutGameHUD_C_OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B::Loaded' has a wrong offset!");

// Function BP_AJBOutGameHUD.BP_AJBOutGameHUD_C.GetGionScreenWidget
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBOutGameHUD_C_GetGionScreenWidget final
{
public:
	class UWB_AJBInGameGionScreen_C*              GionScreen;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBInGameGionScreen_C*              CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBOutGameHUD_C_GetGionScreenWidget) == 0x000008, "Wrong alignment on BP_AJBOutGameHUD_C_GetGionScreenWidget");
static_assert(sizeof(BP_AJBOutGameHUD_C_GetGionScreenWidget) == 0x000010, "Wrong size on BP_AJBOutGameHUD_C_GetGionScreenWidget");
static_assert(offsetof(BP_AJBOutGameHUD_C_GetGionScreenWidget, GionScreen) == 0x000000, "Member 'BP_AJBOutGameHUD_C_GetGionScreenWidget::GionScreen' has a wrong offset!");
static_assert(offsetof(BP_AJBOutGameHUD_C_GetGionScreenWidget, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x000008, "Member 'BP_AJBOutGameHUD_C_GetGionScreenWidget::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");

}

