#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSimpleMatchPlayerController

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.ExecuteUbergraph_BP_AJBSimpleMatchPlayerController
// 0x0498 (0x0498 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item;                           // 0x0018(0x00B8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UAmwEmoneyCancel*                       CallFunc_AmwEmoneyCancel_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState3;                     // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult1; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState2;                     // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NextState1;                     // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeStateFromPlayerController_ReturnValue; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue2; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult2; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState1;                     // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult3;                  // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult4;                  // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult5;                  // 0x019F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFindSessionsCallbackProxy*             CallFunc_FindSessions_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate5;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x01E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_ChangeStateFromPlayerController_ReturnValue1; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue3; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult3; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState;                      // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NextState;                      // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item1;                          // 0x0240(0x00B8)()
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance1;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results1;                       // 0x0330(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDistribution_ReturnValue1;              // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDistribution_ReturnValue2;              // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue1;               // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBOutGameProxyInterface_C> K2Node_DynamicCast_AsBI_AJBOut_Game_Proxy_Interface; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameProxy_C*                  CallFunc_GetAJBOutGameProxy_Object;                // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0450(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTenpoHost_ReturnValue;                  // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedCompensation_bCompensationCredit;   // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNeedCompensation_bCompensationPP;       // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNeedCompensation_ReturnValue;           // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_473[0x5];                                      // 0x0473(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0478(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController) == 0x000498, "Wrong size on BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, EntryPoint) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, Temp_struct_Variable) == 0x000008, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000E4, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate1) == 0x0000E8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate2) == 0x0000F8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate3) == 0x000108, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate4) == 0x000118, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_AmwEmoneyCancel_ReturnValue) == 0x000128, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_AmwEmoneyCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_ReturnValue) == 0x000130, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_FindResult) == 0x000138, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_FindResult' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_PrevState3) == 0x000140, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_PrevState3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_ReturnValue1) == 0x000148, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_FindResult1) == 0x000150, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_FindResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_PrevState2) == 0x000158, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_PrevState2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_NextState1) == 0x000160, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_NextState1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_ChangeStateFromPlayerController_ReturnValue) == 0x000168, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_ChangeStateFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_ReturnValue2) == 0x000170, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_FindResult2) == 0x000178, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_FindResult2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_PrevState1) == 0x000180, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_PrevState1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetGameInstance_ReturnValue) == 0x000188, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_AsBP_AJBGame_Instance) == 0x000190, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_AsBP_AJBGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult) == 0x000199, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult1) == 0x00019A, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult2) == 0x00019B, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_BooleanOR_ReturnValue) == 0x00019C, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult3) == 0x00019D, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult4) == 0x00019E, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult4' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_PlayModeEquals_bResult5) == 0x00019F, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_PlayModeEquals_bResult5' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_BooleanOR_ReturnValue1) == 0x0001A0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetPlayerController_ReturnValue) == 0x0001A8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindSessions_ReturnValue) == 0x0001B0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate5) == 0x0001B8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsValid_ReturnValue1) == 0x0001C8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetPlayerController_ReturnValue1) == 0x0001D0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_JoinSession_ReturnValue) == 0x0001D8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_JoinSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsValid_ReturnValue2) == 0x0001E0, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_Results) == 0x0001E8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_ChangeStateFromPlayerController_ReturnValue1) == 0x0001F8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_ChangeStateFromPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate6) == 0x000200, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_ReturnValue3) == 0x000210, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_FindStateFromPlayerController_FindResult3) == 0x000218, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_FindStateFromPlayerController_FindResult3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_PrevState) == 0x000220, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_PrevState' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_NextState) == 0x000228, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_NextState' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetPlayerController_ReturnValue2) == 0x000230, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, Temp_int_Array_Index_Variable) == 0x000238, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Array_Get_Item1) == 0x000240, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetServerName_ReturnValue) == 0x0002F8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetServerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue) == 0x000308, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetGameInstance_ReturnValue1) == 0x000318, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_AsBP_AJBGame_Instance1) == 0x000320, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_AsBP_AJBGame_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_bSuccess1) == 0x000328, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CustomEvent_Results1) == 0x000330, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CustomEvent_Results1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate7) == 0x000340, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate8) == 0x000350, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Conv_IntToString_ReturnValue) == 0x000360, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsDistribution_ReturnValue) == 0x000370, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsDistribution_ReturnValue1) == 0x000371, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsDistribution_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsDistribution_ReturnValue2) == 0x000372, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsDistribution_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_bSuccess) == 0x000373, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000378, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000380, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000388, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAreaTypeID_ReturnValue) == 0x000390, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAreaTypeID_ReturnValue1) == 0x000394, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAreaTypeID_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Conv_IntToString_ReturnValue1) == 0x000398, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Conv_IntToString_ReturnValue2) == 0x0003A8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue1) == 0x0003B8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue2) == 0x0003C8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue3) == 0x0003D8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue4) == 0x0003E8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue5) == 0x0003F8, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Conv_IntToString_ReturnValue3) == 0x000408, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetPlayerController_ReturnValue3) == 0x000418, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Concat_StrStr_ReturnValue6) == 0x000420, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_AsBI_AJBOut_Game_Proxy_Interface) == 0x000430, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_AsBI_AJBOut_Game_Proxy_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_DynamicCast_bSuccess2) == 0x000440, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBOutGameProxy_Object) == 0x000448, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBOutGameProxy_Object' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate9) == 0x000450, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsTenpoHost_ReturnValue) == 0x000460, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsTenpoHost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000461, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000468, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsNeedCompensation_bCompensationCredit) == 0x000470, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsNeedCompensation_bCompensationCredit' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsNeedCompensation_bCompensationPP) == 0x000471, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsNeedCompensation_bCompensationPP' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_IsNeedCompensation_ReturnValue) == 0x000472, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_IsNeedCompensation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, K2Node_CreateDelegate_OutputDelegate10) == 0x000478, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, Temp_int_Loop_Counter_Variable) == 0x000488, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Less_IntInt_ReturnValue) == 0x00048C, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController, CallFunc_Add_IntInt_ReturnValue) == 0x000490, "Member 'BP_AJBSimpleMatchPlayerController_C_ExecuteUbergraph_BP_AJBSimpleMatchPlayerController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnEnd_ServerSettings
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings final
{
public:
	struct FGameplayTag                           NextState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings, NextState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnEnd_ServerSettings::NextState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnBegin_ServerSettings
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings, PrevState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnBegin_ServerSettings::PrevState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnBegin_Exit
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit, PrevState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnBegin_Exit::PrevState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnEnd_SelectMode
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode final
{
public:
	struct FGameplayTag                           NextState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode, NextState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnEnd_SelectMode::NextState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnBegin_SelectMode
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode, PrevState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectMode::PrevState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnBegin_SelectCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter) == 0x000008, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter, PrevState) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnBegin_SelectCharacter::PrevState' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnSuccess_793F26A345C76B0366C4839A89F4C450
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450) == 0x000010, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450, Results) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnSuccess_793F26A345C76B0366C4839A89F4C450::Results' has a wrong offset!");

// Function BP_AJBSimpleMatchPlayerController.BP_AJBSimpleMatchPlayerController_C.OnFailure_793F26A345C76B0366C4839A89F4C450
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450) == 0x000008, "Wrong alignment on BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450");
static_assert(sizeof(BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450) == 0x000010, "Wrong size on BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450");
static_assert(offsetof(BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450, Results) == 0x000000, "Member 'BP_AJBSimpleMatchPlayerController_C_OnFailure_793F26A345C76B0366C4839A89F4C450::Results' has a wrong offset!");

}

