#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDebugAIStartPoint

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDebugAIStartPoint.BP_AJBDebugAIStartPoint_C.OnFinishedDelayForStartBehavior__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature final
{
public:
	class ABP_AJBInGameAIController_C*            AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBDebugAIStartPoint_C*             DebugAIStartPoint;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature");
static_assert(sizeof(BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature) == 0x000010, "Wrong size on BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature, AI_Controller) == 0x000000, "Member 'BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature::AI_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature, DebugAIStartPoint) == 0x000008, "Member 'BP_AJBDebugAIStartPoint_C_OnFinishedDelayForStartBehavior__DelegateSignature::DebugAIStartPoint' has a wrong offset!");

// Function BP_AJBDebugAIStartPoint.BP_AJBDebugAIStartPoint_C.ExecuteUbergraph_BP_AJBDebugAIStartPoint
// 0x0138 (0x0138 - 0x0000)
struct BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowStateGameplayTag_CurrentState; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState1;           // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue2;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowStateGameplayTag_CurrentState1; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess2; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP2; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue3;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState2;           // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue4;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIController_C*            K2Node_CustomEvent_AI_Controller;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue2;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode2;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowStateGameplayTag_CurrentState2; // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue5;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue3;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint) == 0x000008, "Wrong alignment on BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint");
static_assert(sizeof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint) == 0x000138, "Wrong size on BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, EntryPoint) == 0x000000, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode) == 0x000010, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowStateGameplayTag_CurrentState) == 0x000020, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowStateGameplayTag_CurrentState' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000028, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000030, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000038, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowState_FlowState) == 0x000040, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x000048, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1) == 0x000049, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1) == 0x000050, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_IsDedicatedServer_ReturnValue) == 0x000058, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowState_FlowState1) == 0x000060, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowState_FlowState1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue2) == 0x000068, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetGameMode_ReturnValue1) == 0x000070, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetGameMode_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode1) == 0x000078, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_bSuccess1) == 0x000080, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowStateGameplayTag_CurrentState1) == 0x000088, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowStateGameplayTag_CurrentState1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess2) == 0x000090, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP2) == 0x000098, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue3) == 0x0000A0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowState_FlowState2) == 0x0000A8, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowState_FlowState2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue4) == 0x0000B0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_CustomEvent_AI_Controller) == 0x0000B8, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_CustomEvent_AI_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000C0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetGameMode_ReturnValue2) == 0x0000C8, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetGameMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode2) == 0x0000D0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_DynamicCast_bSuccess2) == 0x0000D8, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_IsServer_ReturnValue) == 0x0000D9, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetCurrentFlowStateGameplayTag_CurrentState2) == 0x0000E0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetCurrentFlowStateGameplayTag_CurrentState2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_EqualEqual_GameplayTag_ReturnValue5) == 0x0000E8, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_EqualEqual_GameplayTag_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0000E9, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBGameInstance_bSuccess) == 0x000108, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000110, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetGameMode_ReturnValue3) == 0x000118, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetGameMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, K2Node_SwitchEnum_CmpSuccess) == 0x000120, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_GetComponentByClass_ReturnValue) == 0x000128, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_HasTag_ReturnValue) == 0x000130, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'BP_AJBDebugAIStartPoint_C_ExecuteUbergraph_BP_AJBDebugAIStartPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBDebugAIStartPoint.BP_AJBDebugAIStartPoint_C.Server_DelayForStartBehavior
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior final
{
public:
	class ABP_AJBInGameAIController_C*            AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior) == 0x000008, "Wrong alignment on BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior");
static_assert(sizeof(BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior) == 0x000008, "Wrong size on BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior");
static_assert(offsetof(BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior, AI_Controller) == 0x000000, "Member 'BP_AJBDebugAIStartPoint_C_Server_DelayForStartBehavior::AI_Controller' has a wrong offset!");

}

