#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOutGameHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"
#include "ERewardDisplayType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBOutGameHUD.BP_AJBOutGameHUD_C
// 0x0060 (0x0578 - 0x0518)
class ABP_AJBOutGameHUD_C : public AAJBHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBDevMouseCursorController_C*      BP_AJBDevMouseCursorController;                    // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DebugMenuOutGameClassPtr;                          // 0x0530(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UClass*>                         CreateWidgets;                                     // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAkComponent*                           MenuBGM;                                           // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakeOverElapsedTime_ModeSelect;                    // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakeOverRemainTime_ShopStandby;                    // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBOutGameHUD(int32 EntryPoint);
	void BeginplayFadeInOut();
	void ShowReward(const TArray<struct FAJBGameRewardInfo>& RewardInfos, ERewardDisplayType RewardDisplayType);
	void HideConnectingWindow();
	void ShowConnectingWindow();
	void OnInputStandSkinIncrement();
	void OnInputStandSkinDecrement();
	void OnInputCharaSkinIncrement();
	void OnInputCharaSkinDecrement();
	void ShowStartPointChipAlert();
	void ShowStoreBattleStandby(float TakeOverElapsedTime_ModeSelect_0);
	void ShowRoomSelect();
	void ShowTraining();
	void ShowWaitSelectedChip();
	void PlayGameOverBGM();
	void StopMenuBGM();
	void PlayMenuBGM();
	void OnShowDebugMenu();
	void ShowModeSelect();
	void UpdateTimeCountDown(float Time, float MaxTime);
	void SetVisibilityTimeCountDown(bool bVisible);
	void OnStartFadeOut(float FadeTime);
	void OnStartFadeIn(float FadeTime);
	void HideMatching();
	void ShowMatching();
	void HideWaitingOtherPlayers();
	void ShowWaitingOtherPlayers();
	void HideStartPointSelect();
	void ShowStartPointSelect();
	void ShowCharacterSelect();
	void ReceiveBeginPlay();
	void OnOpenGameOver(class UAJBWindowWidget* TargetWidget);
	void OnGameOver();
	void BindWindowEvents();
	void OnLoaded_123AFB8B4187277BB012C9A7F9DCB63B(class UClass* Loaded);
	void Finished_37A3F0554CF9350F822546B925E12059();
	void Finished_630D931F4BF9B83A34FD70A9CA6B8D33();
	void Finished_744C7D874EF080CB72F4E7895F816D72();
	void GetGionScreenWidget(class UWB_AJBInGameGionScreen_C** GionScreen);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBOutGameHUD_C">();
	}
	static class ABP_AJBOutGameHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBOutGameHUD_C>();
	}
};
static_assert(alignof(ABP_AJBOutGameHUD_C) == 0x000008, "Wrong alignment on ABP_AJBOutGameHUD_C");
static_assert(sizeof(ABP_AJBOutGameHUD_C) == 0x000578, "Wrong size on ABP_AJBOutGameHUD_C");
static_assert(offsetof(ABP_AJBOutGameHUD_C, UberGraphFrame) == 0x000518, "Member 'ABP_AJBOutGameHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, BP_AJBDevMouseCursorController) == 0x000520, "Member 'ABP_AJBOutGameHUD_C::BP_AJBDevMouseCursorController' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, DefaultSceneRoot) == 0x000528, "Member 'ABP_AJBOutGameHUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, DebugMenuOutGameClassPtr) == 0x000530, "Member 'ABP_AJBOutGameHUD_C::DebugMenuOutGameClassPtr' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, CreateWidgets) == 0x000558, "Member 'ABP_AJBOutGameHUD_C::CreateWidgets' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, MenuBGM) == 0x000568, "Member 'ABP_AJBOutGameHUD_C::MenuBGM' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, TakeOverElapsedTime_ModeSelect) == 0x000570, "Member 'ABP_AJBOutGameHUD_C::TakeOverElapsedTime_ModeSelect' has a wrong offset!");
static_assert(offsetof(ABP_AJBOutGameHUD_C, TakeOverRemainTime_ShopStandby) == 0x000574, "Member 'ABP_AJBOutGameHUD_C::TakeOverRemainTime_ShopStandby' has a wrong offset!");

}

