#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBVampireHealing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBSupportSkillBase_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBVampireHealing.BP_AJBVampireHealing_C
// 0x0030 (0x0188 - 0x0158)
class UBP_AJBVampireHealing_C final : public UBP_AJBSupportSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBVampireHealing_C;             // 0x0158(0x0008)(Transient, DuplicateTransient)
	float                                         HealingInterval;                                   // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealingValue;                                      // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealingStopTime_s_;                                // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugPrintActiveHeal;                             // 0x016C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugPrintStopHeal;                               // 0x016D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           HealingParticleTag;                                // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          HealingParticle;                                   // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHealingIsContinuing_Server_;                      // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HealingMaxPercentage___;                           // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBVampireHealing(int32 EntryPoint);
	void MC_ChangeState(EAutoHealingState NewState);
	void ChangeState_Server(EAutoHealingState NewState);
	void OnReceiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision);
	void ROC_Heal(int32 EffectiveValue, bool bIsFullHP, bool bHealingJustStarted);
	void MC_Heal();
	void TickStateStopping();
	void TickStateContinuation();
	void StateTick_Server();
	void DebugPrint();
	void CheckNecessaryHealing(bool* bNecessary);
	void UpdateContinuationParticle();
	void TryDestroyParticle();
	void TrySpawnParticle();
	void CalcHealingMaxHP(int32* MaxHP);
	void ReceiveTick(float DeltaSeconds);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBVampireHealing_C">();
	}
	static class UBP_AJBVampireHealing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBVampireHealing_C>();
	}
};
static_assert(alignof(UBP_AJBVampireHealing_C) == 0x000008, "Wrong alignment on UBP_AJBVampireHealing_C");
static_assert(sizeof(UBP_AJBVampireHealing_C) == 0x000188, "Wrong size on UBP_AJBVampireHealing_C");
static_assert(offsetof(UBP_AJBVampireHealing_C, UberGraphFrame_BP_AJBVampireHealing_C) == 0x000158, "Member 'UBP_AJBVampireHealing_C::UberGraphFrame_BP_AJBVampireHealing_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingInterval) == 0x000160, "Member 'UBP_AJBVampireHealing_C::HealingInterval' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingValue) == 0x000164, "Member 'UBP_AJBVampireHealing_C::HealingValue' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingStopTime_s_) == 0x000168, "Member 'UBP_AJBVampireHealing_C::HealingStopTime_s_' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, bDebugPrintActiveHeal) == 0x00016C, "Member 'UBP_AJBVampireHealing_C::bDebugPrintActiveHeal' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, bDebugPrintStopHeal) == 0x00016D, "Member 'UBP_AJBVampireHealing_C::bDebugPrintStopHeal' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingParticleTag) == 0x000170, "Member 'UBP_AJBVampireHealing_C::HealingParticleTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingParticle) == 0x000178, "Member 'UBP_AJBVampireHealing_C::HealingParticle' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, bHealingIsContinuing_Server_) == 0x000180, "Member 'UBP_AJBVampireHealing_C::bHealingIsContinuing_Server_' has a wrong offset!");
static_assert(offsetof(UBP_AJBVampireHealing_C, HealingMaxPercentage___) == 0x000184, "Member 'UBP_AJBVampireHealing_C::HealingMaxPercentage___' has a wrong offset!");

}

