#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIGionSource

#include "Basic.hpp"

#include "ST_GionInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.OnLifeTimeElapsed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature final
{
public:
	class ABP_AJBAIGionSource_C*                  AI_GionSource;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature");
static_assert(sizeof(BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature) == 0x000008, "Wrong size on BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature");
static_assert(offsetof(BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature, AI_GionSource) == 0x000000, "Member 'BP_AJBAIGionSource_C_OnLifeTimeElapsed__DelegateSignature::AI_GionSource' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.ExecuteUbergraph_BP_AJBAIGionSource
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyingActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DestroyingActor;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource");
static_assert(sizeof(BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource) == 0x000020, "Wrong size on BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource");
static_assert(offsetof(BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource, EntryPoint) == 0x000000, "Member 'BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource, K2Node_CustomEvent_DestroyingActor) == 0x000018, "Member 'BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource::K2Node_CustomEvent_DestroyingActor' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.OnInGameLifeTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed final
{
public:
	class AActor*                                 DestroyingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed");
static_assert(sizeof(BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed) == 0x000008, "Wrong size on BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed");
static_assert(offsetof(BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed, DestroyingActor) == 0x000000, "Member 'BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed::DestroyingActor' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetFarDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBAIGionSource_C_GetFarDistance final
{
public:
	float                                         Gion_Info_Far_Distance;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_GetFarDistance) == 0x000004, "Wrong alignment on BP_AJBAIGionSource_C_GetFarDistance");
static_assert(sizeof(BP_AJBAIGionSource_C_GetFarDistance) == 0x000004, "Wrong size on BP_AJBAIGionSource_C_GetFarDistance");
static_assert(offsetof(BP_AJBAIGionSource_C_GetFarDistance, Gion_Info_Far_Distance) == 0x000000, "Member 'BP_AJBAIGionSource_C_GetFarDistance::Gion_Info_Far_Distance' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetNearDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBAIGionSource_C_GetNearDistance final
{
public:
	float                                         Gion_Info_Far_Distance;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_GetNearDistance) == 0x000004, "Wrong alignment on BP_AJBAIGionSource_C_GetNearDistance");
static_assert(sizeof(BP_AJBAIGionSource_C_GetNearDistance) == 0x000004, "Wrong size on BP_AJBAIGionSource_C_GetNearDistance");
static_assert(offsetof(BP_AJBAIGionSource_C_GetNearDistance, Gion_Info_Far_Distance) == 0x000000, "Member 'BP_AJBAIGionSource_C_GetNearDistance::Gion_Info_Far_Distance' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.CanActorHear
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBAIGionSource_C_CanActorHear final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIGionSource_C_CanActorHear) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_CanActorHear");
static_assert(sizeof(BP_AJBAIGionSource_C_CanActorHear) == 0x000030, "Wrong size on BP_AJBAIGionSource_C_CanActorHear");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, Actor) == 0x000000, "Member 'BP_AJBAIGionSource_C_CanActorHear::Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, ReturnValue) == 0x000008, "Member 'BP_AJBAIGionSource_C_CanActorHear::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000018, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000024, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x000028, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002C, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002D, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_CanActorHear, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'BP_AJBAIGionSource_C_CanActorHear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetAIEventTag
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_GetAIEventTag final
{
public:
	struct FGameplayTag                           Gion_Info_AIEvent_Tag;                             // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_GetAIEventTag) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_GetAIEventTag");
static_assert(sizeof(BP_AJBAIGionSource_C_GetAIEventTag) == 0x000008, "Wrong size on BP_AJBAIGionSource_C_GetAIEventTag");
static_assert(offsetof(BP_AJBAIGionSource_C_GetAIEventTag, Gion_Info_AIEvent_Tag) == 0x000000, "Member 'BP_AJBAIGionSource_C_GetAIEventTag::Gion_Info_AIEvent_Tag' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsAIEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBAIGionSource_C_IsAIEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetAIEventTag_Gion_Info_AIEvent_Tag;      // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIGionSource_C_IsAIEvent) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_IsAIEvent");
static_assert(sizeof(BP_AJBAIGionSource_C_IsAIEvent) == 0x000018, "Wrong size on BP_AJBAIGionSource_C_IsAIEvent");
static_assert(offsetof(BP_AJBAIGionSource_C_IsAIEvent, ReturnValue) == 0x000000, "Member 'BP_AJBAIGionSource_C_IsAIEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_IsAIEvent, CallFunc_GetAIEventTag_Gion_Info_AIEvent_Tag) == 0x000008, "Member 'BP_AJBAIGionSource_C_IsAIEvent::CallFunc_GetAIEventTag_Gion_Info_AIEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_IsAIEvent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000010, "Member 'BP_AJBAIGionSource_C_IsAIEvent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_IsAIEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_AJBAIGionSource_C_IsAIEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetGionOwnerActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_GetGionOwnerActor final
{
public:
	class AActor*                                 GionOwnerActor_0;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_GetGionOwnerActor) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_GetGionOwnerActor");
static_assert(sizeof(BP_AJBAIGionSource_C_GetGionOwnerActor) == 0x000008, "Wrong size on BP_AJBAIGionSource_C_GetGionOwnerActor");
static_assert(offsetof(BP_AJBAIGionSource_C_GetGionOwnerActor, GionOwnerActor_0) == 0x000000, "Member 'BP_AJBAIGionSource_C_GetGionOwnerActor::GionOwnerActor_0' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsValidObject
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIGionSource_C_IsValidObject final
{
public:
	bool                                          bValid_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIGionSource_C_IsValidObject) == 0x000001, "Wrong alignment on BP_AJBAIGionSource_C_IsValidObject");
static_assert(sizeof(BP_AJBAIGionSource_C_IsValidObject) == 0x000001, "Wrong size on BP_AJBAIGionSource_C_IsValidObject");
static_assert(offsetof(BP_AJBAIGionSource_C_IsValidObject, bValid_0) == 0x000000, "Member 'BP_AJBAIGionSource_C_IsValidObject::bValid_0' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.ActivateObject
// 0x0118 (0x0118 - 0x0000)
struct BP_AJBAIGionSource_C_ActivateObject final
{
public:
	struct FST_GionInfo                           GionInfo_0;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 GionOwnerActor_0;                                  // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GionLocation;                                      // 0x0068(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_DynamicCast_AsAJBIn_Game_Character;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNPC_ReturnValue;                        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Square_ReturnValue;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIGionSource_C_ActivateObject) == 0x000008, "Wrong alignment on BP_AJBAIGionSource_C_ActivateObject");
static_assert(sizeof(BP_AJBAIGionSource_C_ActivateObject) == 0x000118, "Wrong size on BP_AJBAIGionSource_C_ActivateObject");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, GionInfo_0) == 0x000000, "Member 'BP_AJBAIGionSource_C_ActivateObject::GionInfo_0' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, GionOwnerActor_0) == 0x000060, "Member 'BP_AJBAIGionSource_C_ActivateObject::GionOwnerActor_0' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, GionLocation) == 0x000068, "Member 'BP_AJBAIGionSource_C_ActivateObject::GionLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000078, "Member 'BP_AJBAIGionSource_C_ActivateObject::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000100, "Member 'BP_AJBAIGionSource_C_ActivateObject::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, K2Node_DynamicCast_AsAJBIn_Game_Character) == 0x000108, "Member 'BP_AJBAIGionSource_C_ActivateObject::K2Node_DynamicCast_AsAJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_AJBAIGionSource_C_ActivateObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, CallFunc_IsNPC_ReturnValue) == 0x000111, "Member 'BP_AJBAIGionSource_C_ActivateObject::CallFunc_IsNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIGionSource_C_ActivateObject, CallFunc_Square_ReturnValue) == 0x000114, "Member 'BP_AJBAIGionSource_C_ActivateObject::CallFunc_Square_ReturnValue' has a wrong offset!");

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsOwnerNPC
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIGionSource_C_IsOwnerNPC final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBAIGionSource_C_IsOwnerNPC) == 0x000001, "Wrong alignment on BP_AJBAIGionSource_C_IsOwnerNPC");
static_assert(sizeof(BP_AJBAIGionSource_C_IsOwnerNPC) == 0x000001, "Wrong size on BP_AJBAIGionSource_C_IsOwnerNPC");
static_assert(offsetof(BP_AJBAIGionSource_C_IsOwnerNPC, ReturnValue) == 0x000000, "Member 'BP_AJBAIGionSource_C_IsOwnerNPC::ReturnValue' has a wrong offset!");

}

