#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBattleGameState

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBattleGameState.BP_AJBBattleGameState_C.OnChangeLivingPlayerCount__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LivingPlayerRate;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PairCount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature");
static_assert(sizeof(BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature) == 0x00000C, "Wrong size on BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature");
static_assert(offsetof(BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature, Count) == 0x000000, "Member 'BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature::Count' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature, LivingPlayerRate) == 0x000004, "Member 'BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature::LivingPlayerRate' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature, PairCount) == 0x000008, "Member 'BP_AJBBattleGameState_C_OnChangeLivingPlayerCount__DelegateSignature::PairCount' has a wrong offset!");

// Function BP_AJBBattleGameState.BP_AJBBattleGameState_C.OnSetLivingPlayerCountForHighlight__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature final
{
public:
	int32                                         LivingPlayerCount_0;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LivingPairCount_0;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature) == 0x000004, "Wrong alignment on BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature");
static_assert(sizeof(BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature) == 0x000008, "Wrong size on BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature");
static_assert(offsetof(BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature, LivingPlayerCount_0) == 0x000000, "Member 'BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature::LivingPlayerCount_0' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature, LivingPairCount_0) == 0x000004, "Member 'BP_AJBBattleGameState_C_OnSetLivingPlayerCountForHighlight__DelegateSignature::LivingPairCount_0' has a wrong offset!");

// Function BP_AJBBattleGameState.BP_AJBBattleGameState_C.ExecuteUbergraph_BP_AJBBattleGameState
// 0x0420 (0x0420 - 0x0000)
struct BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_______________Variable;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_BattleStartGameTime;            // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_CustomEvent_PlayerController;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LivingPlayerCount;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LivingPlayerCountWithoutCPU;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue1;                         // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RemainingTime;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns;                    // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetElapsedInGameTimespan_ReturnValue;     // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Private_IsPlayingReplay_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameTimeRecorder_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Private_IsPlayingReplay_ReturnValue1;     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_FinishSpawningActor_ReturnValue1;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesCharacterHavePlayerController_ReturnValue; // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerMatchingIndexIdByActor_PlayerMatchingIndex; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue3;                         // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerCount;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairCount;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPairCount_Svr__Num;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Array_Get_Item1;                          // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue1;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorMainCharacter1;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorPairCharacter1;     // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastDefeatedCharacter1;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastDefeatedMatchingPlayerIndex; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldPayAttentionTo2ndOnCut1; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_CurrentFlowState;     // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns1;                   // 0x0268(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue1;    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorMainCharacter;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorPairCharacter;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastDefeatedCharacter;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_LastDamageCauser;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_MakeArray_Array;                            // 0x02B0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item2;                          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeathAndEnd_ReturnValue;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB[0x1];                                      // 0x02CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       Temp_wildcard_Variable;                            // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item3;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_______________Variable1;                  // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers; // 0x0310(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_Array_Get_Item4;                          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsPair_ReturnValue;               // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable6;                                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue2;    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue4;                         // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfoByPlayerIDPureFunction_Out; // 0x0368(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfoByPlayerIDPureFunction_ReturnValue; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState) == 0x000010, "Wrong alignment on BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState");
static_assert(sizeof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState) == 0x000420, "Wrong size on BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, EntryPoint) == 0x000000, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Variable) == 0x000004, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_______________Variable) == 0x000014, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_______________Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable1) == 0x000018, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue1) == 0x00001C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable1) == 0x000020, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Variable1) == 0x000024, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable2) == 0x000028, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue2) == 0x00002C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Conv_FloatToString_ReturnValue) == 0x000030, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable) == 0x000050, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_IsClosed_Variable) == 0x000054, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue3) == 0x000058, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Has_Been_Initd_Variable) == 0x00005C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Operator) == 0x000060, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Time) == 0x000068, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Timing) == 0x00006C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_bEnable) == 0x00006D, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_bOperatorIsEmpty) == 0x00006E, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue) == 0x000070, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable1) == 0x00007C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Has_Been_Initd_Variable1) == 0x000085, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_IsClosed_Variable1) == 0x000086, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000087, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000088, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_BattleStartGameTime) == 0x000090, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_BattleStartGameTime' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PlayerController) == 0x000098, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_DeltaSeconds) == 0x0000A0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue4) == 0x0000A4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LivingPlayerCount) == 0x0000A8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LivingPlayerCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LivingPlayerCountWithoutCPU) == 0x0000AC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LivingPlayerCountWithoutCPU' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable2) == 0x0000B0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue1) == 0x0000B8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue2) == 0x0000C0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_RemainingTime) == 0x0000C8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_RemainingTime' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue) == 0x0000D0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000D8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetJoinPawns_OutPawns) == 0x0000E0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetJoinPawns_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue1) == 0x0000F0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue2) == 0x0000F4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Subtract_IntInt_ReturnValue1) == 0x0000FC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetElapsedInGameTimespan_ReturnValue) == 0x000100, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetElapsedInGameTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Private_IsPlayingReplay_ReturnValue) == 0x000108, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Private_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAllActorsOfClass_OutActors) == 0x000110, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Get_Item) == 0x000120, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000128, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable2) == 0x00012C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsServer_ReturnValue) == 0x000168, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_FinishSpawningActor_ReturnValue) == 0x000170, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Private_IsPlayingReplay_ReturnValue1) == 0x000178, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Private_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_MakeTransform_ReturnValue1) == 0x000180, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x0001B8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_FinishSpawningActor_ReturnValue1) == 0x0001C0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable3) == 0x0001C8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable4) == 0x0001CC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable3) == 0x0001D0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_DoesCharacterHavePlayerController_ReturnValue) == 0x0001D4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_DoesCharacterHavePlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetPlayerMatchingIndexIdByActor_PlayerMatchingIndex) == 0x0001D8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetPlayerMatchingIndexIdByActor_PlayerMatchingIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x0001DC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue5) == 0x0001E0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue6) == 0x0001E8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsServer_ReturnValue1) == 0x0001EC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable5) == 0x0001F0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue3) == 0x0001F8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PlayerCount) == 0x000200, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PlayerCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PairCount) == 0x000204, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PairCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetPairCount_Svr__Num) == 0x000208, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetPairCount_Svr__Num' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable3) == 0x00020C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Get_Item1) == 0x000210, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetTotalSeconds_ReturnValue1) == 0x000218, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetTotalSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_FloatFloat_ReturnValue) == 0x00021C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastSurvivorMainCharacter1) == 0x000220, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastSurvivorMainCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex) == 0x000228, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastSurvivorPairCharacter1) == 0x000230, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastSurvivorPairCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastDefeatedCharacter1) == 0x000238, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastDefeatedCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastDefeatedMatchingPlayerIndex) == 0x000240, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastDefeatedMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_bShouldPayAttentionTo2ndOnCut1) == 0x000244, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_bShouldPayAttentionTo2ndOnCut1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetGameMode_ReturnValue) == 0x000248, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
