#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem_HP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameItem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameItem_HP.BP_AJBInGameItem_HP_C
// 0x0018 (0x0398 - 0x0380)
class ABP_AJBInGameItem_HP_C : public ABP_AJBInGameItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameItem_HP_C;              // 0x0380(0x0008)(Transient, DuplicateTransient)
	int32                                         IncreaseHP;                                        // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   IncreaseHPParamName;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameItem_HP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnROS_Consume(class ABP_AJBInGameCharacter_C* HitCharacter);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameItem_HP_C">();
	}
	static class ABP_AJBInGameItem_HP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameItem_HP_C>();
	}
};
static_assert(alignof(ABP_AJBInGameItem_HP_C) == 0x000008, "Wrong alignment on ABP_AJBInGameItem_HP_C");
static_assert(sizeof(ABP_AJBInGameItem_HP_C) == 0x000398, "Wrong size on ABP_AJBInGameItem_HP_C");
static_assert(offsetof(ABP_AJBInGameItem_HP_C, UberGraphFrame_BP_AJBInGameItem_HP_C) == 0x000380, "Member 'ABP_AJBInGameItem_HP_C::UberGraphFrame_BP_AJBInGameItem_HP_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_HP_C, IncreaseHP) == 0x000388, "Member 'ABP_AJBInGameItem_HP_C::IncreaseHP' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_HP_C, IncreaseHPParamName) == 0x000390, "Member 'ABP_AJBInGameItem_HP_C::IncreaseHPParamName' has a wrong offset!");

}

