#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameItem.BP_AJBInGameItem_C
// 0x0058 (0x0380 - 0x0328)
class ABP_AJBInGameItem_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConsume;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ItemTag;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GettingParticleTag;                                // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumeEffectTag;                                  // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumeSETag;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnComsume;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnComsume__DelegateSignature(class AAJBInGameCharacter* Character);
	void ExecuteUbergraph_BP_AJBInGameItem(int32 EntryPoint);
	void MC_RequestConsumeEffect(class ABP_AJBInGameCharacter_C* Character);
	void TryConsume(class ABP_AJBInGameCharacter_C* HitCharacter, int32 PlayerIndex);
	void OnROS_Consume(class ABP_AJBInGameCharacter_C* HitCharacter);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameItem_C">();
	}
	static class ABP_AJBInGameItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameItem_C>();
	}
};
static_assert(alignof(ABP_AJBInGameItem_C) == 0x000008, "Wrong alignment on ABP_AJBInGameItem_C");
static_assert(sizeof(ABP_AJBInGameItem_C) == 0x000380, "Wrong size on ABP_AJBInGameItem_C");
static_assert(offsetof(ABP_AJBInGameItem_C, UberGraphFrame) == 0x000328, "Member 'ABP_AJBInGameItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, ParticleSystem) == 0x000330, "Member 'ABP_AJBInGameItem_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, Mesh) == 0x000338, "Member 'ABP_AJBInGameItem_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, Sphere) == 0x000340, "Member 'ABP_AJBInGameItem_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, IsConsume) == 0x000348, "Member 'ABP_AJBInGameItem_C::IsConsume' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, ItemTag) == 0x000350, "Member 'ABP_AJBInGameItem_C::ItemTag' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, GettingParticleTag) == 0x000358, "Member 'ABP_AJBInGameItem_C::GettingParticleTag' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, ConsumeEffectTag) == 0x000360, "Member 'ABP_AJBInGameItem_C::ConsumeEffectTag' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, ConsumeSETag) == 0x000368, "Member 'ABP_AJBInGameItem_C::ConsumeSETag' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameItem_C, OnComsume) == 0x000370, "Member 'ABP_AJBInGameItem_C::OnComsume' has a wrong offset!");

}

