#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPlacementSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.ExecuteUbergraph_BP_AJBPlacementSkill
// 0x0310 (0x0310 - 0x0000)
struct BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCancel3;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCancel2;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel1;                       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCancel;                        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue5;    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue6;    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActionStateEnd_bActionStateEnd;      // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHidePreviewGuide;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform1;                     // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_TargetActor1;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckArriveLimit_bArriveLimit;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementBase_C*                 CallFunc_SpawnObjectCore_SpawnObject;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementBase_C*                 K2Node_CustomEvent_SelfObject;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue7;    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_CalcMostOldestObject_Object;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue8;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnPreviewObjectCore_SpawnObject;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue8;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue10;                 // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue9;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue9;    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue11;                 // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Num1;                                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Num;                                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview;             // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_Preview_C*                    K2Node_DynamicCast_AsWB_Skill_Preview1;            // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceObjectTransform_bPossiblePlacement;  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0xF];                                      // 0x0231(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TraceObjectTransform_Transform;           // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_TraceObjectTransform_TargetActor;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue10;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue10;   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPlacement1;                    // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ABP_AJBPlacementBase_C* SelfObject)> K2Node_CreateDelegate_OutputDelegate4;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlacement;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill) == 0x000010, "Wrong alignment on BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill");
static_assert(sizeof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill) == 0x000310, "Wrong size on BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, EntryPoint) == 0x000000, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel3) == 0x000004, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetValidValue_ReturnValue) == 0x000005, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000010, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000018, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000020, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue1) == 0x000021, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue1) == 0x000022, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000028, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000030, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue2) == 0x000032, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000038, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue3) == 0x000040, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue3) == 0x000041, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue3) == 0x000042, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsServer_ReturnValue) == 0x000043, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x000059, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue4) == 0x00005A, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue2) == 0x00005B, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue5) == 0x00005C, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess) == 0x00005D, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000060, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel2) == 0x000068, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue) == 0x000069, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel1) == 0x00006A, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bCancel) == 0x00006B, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName4) == 0x000070, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000078, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000080, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000089, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000090, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000098, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000A0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue4) == 0x0000A8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue4) == 0x0000A9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName3) == 0x0000B0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue6) == 0x0000B8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue5) == 0x0000C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue5) == 0x0000C9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue7) == 0x0000CA, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x0000D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue6) == 0x0000D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue6) == 0x0000D9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue8) == 0x0000DA, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CheckActionStateEnd_bActionStateEnd) == 0x0000DB, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CheckActionStateEnd_bActionStateEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_DeltaSeconds) == 0x0000DC, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bHidePreviewGuide) == 0x0000E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bHidePreviewGuide' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Transform1) == 0x0000F0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Transform1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_TargetActor1) == 0x000120, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_TargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000128, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CheckArriveLimit_bArriveLimit) == 0x000138, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CheckArriveLimit_bArriveLimit' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Transform) == 0x000140, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_TargetActor) == 0x000170, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_SpawnObjectCore_SpawnObject) == 0x000178, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_SpawnObjectCore_SpawnObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_SelfObject) == 0x000180, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_SelfObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue7) == 0x000188, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Array_RemoveItem_ReturnValue) == 0x000190, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue7) == 0x000191, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue7) == 0x000192, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue9) == 0x000193, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000198, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CalcMostOldestObject_Object) == 0x0001A8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CalcMostOldestObject_Object' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue8) == 0x0001B0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_SpawnPreviewObjectCore_SpawnObject) == 0x0001B8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_SpawnPreviewObjectCore_SpawnObject' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue8) == 0x0001C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue8) == 0x0001C1, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue10) == 0x0001C2, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue9) == 0x0001C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x0001D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue9) == 0x0001D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x0001E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess1) == 0x0001E8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue9) == 0x0001E9, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue11) == 0x0001EA, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001F0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue10) == 0x0001F8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num1) == 0x0001FC, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_Event_Num) == 0x000200, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_Event_Num' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsWB_Skill_Preview) == 0x000208, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsWB_Skill_Preview' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess2) == 0x000210, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_AsWB_Skill_Preview1) == 0x000218, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_AsWB_Skill_Preview1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_DynamicCast_bSuccess3) == 0x000220, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName2) == 0x000228, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_bPossiblePlacement) == 0x000230, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_Transform) == 0x000240, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_TraceObjectTransform_TargetActor) == 0x000270, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_TraceObjectTransform_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000278, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetOwnerCharacter_ReturnValue10) == 0x000280, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetOwnerCharacter_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_HasLocalSharedController_ReturnValue10) == 0x000288, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_HasLocalSharedController_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsValid_ReturnValue11) == 0x000289, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bPlacement1) == 0x00028A, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bPlacement1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Target) == 0x000290, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_BooleanAND_ReturnValue12) == 0x000298, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_BooleanAND_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x0002A0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x0002B0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Array_Find_ReturnValue) == 0x0002C0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002C4, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002C5, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue1) == 0x0002C6, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0002C7, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0002C8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_IsPlayingReplay_ReturnValue2) == 0x0002D0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_MakeLiteralByte_ReturnValue2) == 0x0002D1, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, CallFunc_Not_PreBool_ReturnValue3) == 0x0002D2, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, Temp_name_Variable) == 0x0002D8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName) == 0x0002E0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_bPlacement) == 0x0002E8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_Actor) == 0x0002F0, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x0002F8, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill, K2Node_CustomEvent_NotifyName1) == 0x000308, "Member 'BP_AJBPlacementSkill_C_ExecuteUbergraph_BP_AJBPlacementSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.OnSpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBPlacementSkill_C_OnSpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_OnSpawnObject) == 0x000008, "Wrong alignment on BP_AJBPlacementSkill_C_OnSpawnObject");
static_assert(sizeof(BP_AJBPlacementSkill_C_OnSpawnObject) == 0x000010, "Wrong size on BP_AJBPlacementSkill_C_OnSpawnObject");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnSpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBPlacementSkill_C_OnSpawnObject::bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementSkill_C_OnSpawnObject, Actor) == 0x000008, "Member 'BP_AJBPlacementSkill_C_OnSpawnObject::Actor' has a wrong offset!");

// Function BP_AJBPlacementSkill.BP_AJBPlacementSkill_C.MC_SpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBPlacementSkill_C_MC_SpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementSkill_C_MC_SpawnObject) == 0x000008, "Wrong alignment on BP_AJBPlacementSkill_C_MC_SpawnObject");
