#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBMemoryLeakEmphasizerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBComponentBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBMemoryLeakEmphasizerComponent.BP_AJBMemoryLeakEmphasizerComponent_C
// 0x0018 (0x0108 - 0x00F0)
class UBP_AJBMemoryLeakEmphasizerComponent_C final : public UBP_AJBComponentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class ABP_AJBInGameParticleEffect_C*          EmphasisParticle;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EmphasisParticleTag;                               // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBMemoryLeakEmphasizerComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void TrySpawnParticle();
	void TryDestroyParticle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBMemoryLeakEmphasizerComponent_C">();
	}
	static class UBP_AJBMemoryLeakEmphasizerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBMemoryLeakEmphasizerComponent_C>();
	}
};
static_assert(alignof(UBP_AJBMemoryLeakEmphasizerComponent_C) == 0x000008, "Wrong alignment on UBP_AJBMemoryLeakEmphasizerComponent_C");
static_assert(sizeof(UBP_AJBMemoryLeakEmphasizerComponent_C) == 0x000108, "Wrong size on UBP_AJBMemoryLeakEmphasizerComponent_C");
static_assert(offsetof(UBP_AJBMemoryLeakEmphasizerComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBMemoryLeakEmphasizerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBMemoryLeakEmphasizerComponent_C, EmphasisParticle) == 0x0000F8, "Member 'UBP_AJBMemoryLeakEmphasizerComponent_C::EmphasisParticle' has a wrong offset!");
static_assert(offsetof(UBP_AJBMemoryLeakEmphasizerComponent_C, EmphasisParticleTag) == 0x000100, "Member 'UBP_AJBMemoryLeakEmphasizerComponent_C::EmphasisParticleTag' has a wrong offset!");

}

