#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDamageImpulseBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDamageImpulseBase.BP_AJBDamageImpulseBase_C.ExecuteUbergraph_BP_AJBDamageImpulseBase
// 0x0388 (0x0388 - 0x0000)
struct BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds3;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue1;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_BlockingRushOperatorInterface_C> K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface; // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface;              // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckTargetSelf_bTarget;                  // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface1;             // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDisableDamage_bDisableDamage;        // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface2;             // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInteractAction_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDamage_bNoDamage;                    // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInRange_bInRange;                    // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DamageProcessCore_bRemainHP;              // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x02B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDamageOverlap_bShouldOverlap;       // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckState_bMatch;                        // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EB[0x1];                                      // 0x02EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_KillNum;                        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x02FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue3;              // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0328(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0378(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase) == 0x000008, "Wrong alignment on BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase");
static_assert(sizeof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase) == 0x000388, "Wrong size on BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, EntryPoint) == 0x000000, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds3) == 0x000004, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds2) == 0x000008, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds1) == 0x00000C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds) == 0x000014, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x000019, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x00001A, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000028, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000030, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Operator) == 0x000038, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Time) == 0x000040, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Timing) == 0x000044, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_bEnable) == 0x000045, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_bOperatorIsEmpty) == 0x000046, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000048, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000058, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_bool_Variable) == 0x000070, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue) == 0x000071, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable) == 0x000074, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable1) == 0x000078, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Variable) == 0x00007C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000088, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00008C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable2) == 0x000098, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00009C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Select_Default) == 0x0000A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000A8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0000AC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x0000B8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0000BC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetOwner_ReturnValue1) == 0x0000D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000D8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x0000E0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x0000E8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue1) == 0x0000E9, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000EC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x0000F0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x0000F4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue1) == 0x000108, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue1) == 0x000118, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue2) == 0x000120, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue) == 0x000130, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue1) == 0x000140, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue1) == 0x000160, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue2) == 0x000170, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue3) == 0x000180, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue4) == 0x000190, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue5) == 0x0001A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001B0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue2) == 0x0001B8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x0001C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue6) == 0x0001D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue7) == 0x0001E8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue8) == 0x0001F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable3) == 0x000208, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue2) == 0x00020C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_TargetActor) == 0x000210, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface) == 0x000218, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000229, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000230, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Array_Index_Variable) == 0x000240, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Array_Length_ReturnValue) == 0x000244, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Array_Get_Item) == 0x000248, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Less_IntInt_ReturnValue) == 0x000250, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface) == 0x000258, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess1) == 0x000268, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckTargetSelf_bTarget) == 0x000269, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckTargetSelf_bTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface1) == 0x000270, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess2) == 0x000280, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckDisableDamage_bDisableDamage) == 0x000281, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckDisableDamage_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface2) == 0x000288, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess3) == 0x000298, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue) == 0x000299, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetComponentByClass_ReturnValue) == 0x0002A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_BooleanAND_ReturnValue) == 0x0002A8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue2) == 0x0002A9, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckDamage_bNoDamage) == 0x0002AA, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckDamage_bNoDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckInRange_bInRange) == 0x0002AB, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckInRange_bInRange' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_DamageProcessCore_bRemainHP) == 0x0002AC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_DamageProcessCore_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue1) == 0x0002AD, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue2) == 0x0002AE, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0002B0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_ShouldDamageOverlap_bShouldOverlap) == 0x0002BC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_ShouldDamageOverlap_bShouldOverlap' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue1) == 0x0002C0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_bool_Variable1) == 0x0002C4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Variable1) == 0x0002C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Select1_Default) == 0x0002CC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetPlayerController_ReturnValue) == 0x0002D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002D8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetViewTarget_ReturnValue) == 0x0002E0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002E8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckState_bMatch) == 0x0002E9, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckState_bMatch' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue3) == 0x0002EA, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_KillNum) == 0x0002EC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_KillNum' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0002F0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Greater_IntInt_ReturnValue) == 0x0002F1, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue2) == 0x0002F4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_EndPlayReason) == 0x0002F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x0002FC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue3) == 0x000308, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue3) == 0x000318, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000328, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue9) == 0x000338, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue10) == 0x000348, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x000358, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue11) == 0x000360, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue11' has a wrong offset!");
