#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHeavensLockSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.ExecuteUbergraph_BP_AJBHeavensLockSkill
// 0x0230 (0x0230 - 0x0000)
struct BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable1;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor1;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation1;                         // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x015C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CuttingRate;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_SurfaceType1;                         // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInvincible;                          // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPenetration;                       // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlockedByAAP1;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHeadShot1;                           // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_SurfaceType;                          // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBlockedByAAP;                        // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHeadShot;                            // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill) == 0x000230, "Wrong size on BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, EntryPoint) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName3) == 0x000008, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName2) == 0x000010, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName1) == 0x000028, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName) == 0x000040, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, Temp_name_Variable) == 0x000058, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName8) == 0x000060, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName4) == 0x000068, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x000070, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, Temp_name_Variable1) == 0x000080, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x000088, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000098, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x0000A0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000B0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0000C0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000C8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000D0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName9) == 0x0000E0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x0000E8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0000F0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x0000F8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate6) == 0x000100, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000118, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_BooleanAND_ReturnValue) == 0x000120, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000121, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_IsValid_ReturnValue1) == 0x000122, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_BooleanAND_ReturnValue1) == 0x000123, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000128, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000130, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_bSuccess2) == 0x000138, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000140, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_HitActor1) == 0x000148, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_HitActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_HitLocation1) == 0x000150, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_HitLocation1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_HitNormal) == 0x00015C, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_CuttingRate) == 0x000168, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_SurfaceType1) == 0x00016C, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_SurfaceType1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bDisableDamage) == 0x00016D, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bInvincible) == 0x00016E, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bInvincible' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bIsPenetration) == 0x00016F, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bIsPenetration' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bBlockedByAAP1) == 0x000170, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bBlockedByAAP1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bHeadShot1) == 0x000171, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bHeadShot1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000172, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000178, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_bSuccess3) == 0x000180, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_IsValid_ReturnValue2) == 0x000181, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000188, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName5) == 0x000190, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate7) == 0x000198, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName6) == 0x0001A8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_HitActor) == 0x0001B0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_HitLocation) == 0x0001B8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_SurfaceType) == 0x0001C4, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bBlockedByAAP) == 0x0001C5, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_Event_bHeadShot) == 0x0001C6, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_Event_bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate8) == 0x0001C8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x0001D8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x0001E0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1) == 0x0001E8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CustomEvent_NotifyName7) == 0x0001F0, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_CreateDelegate_OutputDelegate9) == 0x0001F8, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000208, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000210, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, K2Node_DynamicCast_bSuccess4) == 0x000218, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000220, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill, CallFunc_IsValid_ReturnValue3) == 0x000228, "Member 'BP_AJBHeavensLockSkill_C_ExecuteUbergraph_BP_AJBHeavensLockSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnBlendOut_7B45FB9D406D5826C78546BC85040F13
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC85040F13::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnCompleted_7B45FB9D406D5826C78546BC03A82A9E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC03A82A9E::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnCompleted_7B45FB9D406D5826C78546BC85040F13
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnCompleted_7B45FB9D406D5826C78546BC85040F13::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnInterrupted_7B45FB9D406D5826C78546BC85040F13
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC85040F13::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13) == 0x000008, "Wrong size on BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13, NotifyName) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13::NotifyName' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.HitWait
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBHeavensLockSkill_C_HitWait final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CuttingRate;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableDamage;                                    // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInvincible;                                       // 0x0026(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPenetration;                                    // 0x0027(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBlockedByAAP;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHeadShot;                                         // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_HitWait) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_HitWait");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_HitWait) == 0x000030, "Wrong size on BP_AJBHeavensLockSkill_C_HitWait");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, HitActor) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_HitWait::HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, HitLocation) == 0x000008, "Member 'BP_AJBHeavensLockSkill_C_HitWait::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, HitNormal) == 0x000014, "Member 'BP_AJBHeavensLockSkill_C_HitWait::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, CuttingRate) == 0x000020, "Member 'BP_AJBHeavensLockSkill_C_HitWait::CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, SurfaceType) == 0x000024, "Member 'BP_AJBHeavensLockSkill_C_HitWait::SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, bDisableDamage) == 0x000025, "Member 'BP_AJBHeavensLockSkill_C_HitWait::bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, bInvincible) == 0x000026, "Member 'BP_AJBHeavensLockSkill_C_HitWait::bInvincible' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, bIsPenetration) == 0x000027, "Member 'BP_AJBHeavensLockSkill_C_HitWait::bIsPenetration' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, bBlockedByAAP) == 0x000028, "Member 'BP_AJBHeavensLockSkill_C_HitWait::bBlockedByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_HitWait, bHeadShot) == 0x000029, "Member 'BP_AJBHeavensLockSkill_C_HitWait::bHeadShot' has a wrong offset!");

// Function BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C.PlayHitSE
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBHeavensLockSkill_C_PlayHitSE final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlockedByAAP;                                     // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHeadShot;                                         // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHeavensLockSkill_C_PlayHitSE) == 0x000008, "Wrong alignment on BP_AJBHeavensLockSkill_C_PlayHitSE");
static_assert(sizeof(BP_AJBHeavensLockSkill_C_PlayHitSE) == 0x000018, "Wrong size on BP_AJBHeavensLockSkill_C_PlayHitSE");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_PlayHitSE, HitActor) == 0x000000, "Member 'BP_AJBHeavensLockSkill_C_PlayHitSE::HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_PlayHitSE, HitLocation) == 0x000008, "Member 'BP_AJBHeavensLockSkill_C_PlayHitSE::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBHeavensLockSkill_C_PlayHitSE, SurfaceType) == 0x000014, "Member 'BP_AJBHeavensLockSkill_C_PlayHitSE::SurfaceType' has a wrong offset!");
