#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_AkEventLocalPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimNotify_AkEventLocalPlayer.BP_AnimNotify_AkEventLocalPlayer_C.Received_Notify
// 0x0038 (0x0038 - 0x0000)
struct BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Received_Notify_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_TryGetOwnerOfClass_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify) == 0x000008, "Wrong alignment on BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify");
static_assert(sizeof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify) == 0x000038, "Wrong size on BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, MeshComp) == 0x000000, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, Animation) == 0x000008, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, ReturnValue) == 0x000010, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_Received_Notify_ReturnValue) == 0x000011, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_Received_Notify_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_TryGetOwnerOfClass_ReturnValue) == 0x000020, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_TryGetOwnerOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000028, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_HasLocalSharedController_ReturnValue) == 0x000032, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_IsPlayerController_ReturnValue) == 0x000033, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'BP_AnimNotify_AkEventLocalPlayer_C_Received_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

