#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBReticle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBReticle.BP_AJBReticle_C
// 0x0048 (0x0138 - 0x00F0)
class UBP_AJBReticle_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UWB_ReticleGunner_C*                    CachedGunnerReticle;                               // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ReticleFighter_C*                   CachedFighterReticle;                              // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ReticleBase_C*                      ActiveReticle;                                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCharacterBehaviorInVisible;                       // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    TargetCharacter;                                   // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               TargetReticleRootWidget;                           // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInteractActionProgressBar_C*     RefInteractProgressBarComponent;                   // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedVisibleProgressBarWidget;                   // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBReticle(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCharacterActiveBehaviorChanged(ECharacterActiveBehavior NextBehavior);
	void OnHit(bool bHeadShot, bool bFInishBlow);
	void SetupReticleTargetCharacter(class AAJBInGameCharacter* Character);
	void Initialize();
	void SetupWidget(class UOverlay* ReticleRootWidget);
	void ClearReticleWidget();
	void UpdateVisibleReticleWidget();
	void SetupInteractProgressBarComponent(class UBP_AJBInteractActionProgressBar_C* InteractProgressBarComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBReticle_C">();
	}
	static class UBP_AJBReticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBReticle_C>();
	}
};
static_assert(alignof(UBP_AJBReticle_C) == 0x000008, "Wrong alignment on UBP_AJBReticle_C");
static_assert(sizeof(UBP_AJBReticle_C) == 0x000138, "Wrong size on UBP_AJBReticle_C");
static_assert(offsetof(UBP_AJBReticle_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBReticle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, CachedGunnerReticle) == 0x0000F8, "Member 'UBP_AJBReticle_C::CachedGunnerReticle' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, CachedFighterReticle) == 0x000100, "Member 'UBP_AJBReticle_C::CachedFighterReticle' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, ActiveReticle) == 0x000108, "Member 'UBP_AJBReticle_C::ActiveReticle' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, bCharacterBehaviorInVisible) == 0x000110, "Member 'UBP_AJBReticle_C::bCharacterBehaviorInVisible' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, TargetCharacter) == 0x000118, "Member 'UBP_AJBReticle_C::TargetCharacter' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, TargetReticleRootWidget) == 0x000120, "Member 'UBP_AJBReticle_C::TargetReticleRootWidget' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, RefInteractProgressBarComponent) == 0x000128, "Member 'UBP_AJBReticle_C::RefInteractProgressBarComponent' has a wrong offset!");
static_assert(offsetof(UBP_AJBReticle_C, bCachedVisibleProgressBarWidget) == 0x000130, "Member 'UBP_AJBReticle_C::bCachedVisibleProgressBarWidget' has a wrong offset!");

}

