#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameEffectPoolManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_GionInfo_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_ParticleEffectInfo_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameEffectPoolManager.BP_AJBInGameEffectPoolManager_C.ExecuteUbergraph_BP_AJBInGameEffectPoolManager
// 0x0430 (0x0430 - 0x0000)
struct BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_ParticleType3;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location5;                      // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation3;                      // 0x0034(0x000C)(IsPlainOldData, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_ParticleType2;                  // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location4;                      // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation2;                      // 0x0054(0x000C)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_EmitParticleEffect_ParticleEffect;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_GionInfo                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames1;        // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EffectType1;                    // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Owner1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInOwnersEnv1;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpawnedSpaceInNotOwnersEnv;     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location3;                      // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_WwiseEventTag1;                 // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWwiseAutoPost1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWwiseAutoDestroy1;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_SceneComponentToAttachWwise1;   // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bGionDryRun1;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWwiseDryRun1;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EffectType;                     // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Owner;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInOwnersEnv;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv;     // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location2;                      // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_WwiseEventTag;                  // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWwiseAutoPost;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWwiseAutoDestroy;              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_SceneComponentToAttachWwise;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bGionDryRun;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWwiseDryRun;                   // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_LocalGionEffect_AkComponent_LocalOnly_;   // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LocalGionEffect_bFullfilGionDisplayingCondition; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ParticleType1;                  // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location1;                      // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation1;                      // 0x01C4(0x000C)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        K2Node_CustomEvent_SceneComponentToAttach;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SocketName1;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ParticleType;                   // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x01E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x01F4(0x000C)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        K2Node_CustomEvent_AttachToComponent;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SocketName;                     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_EmitParticleEffectAttached_ParticleEffect; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item1;                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_GionInfo                           CallFunc_Map_Find_Value;                           // 0x0230(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ParticleEffectInfo                 CallFunc_GetDataTableRowFromName_OutRow1;          // 0x0298(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue1;     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers; // 0x02C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers1; // 0x02D8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item2;                          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item3;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller1; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x033C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue1;           // 0x034C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x035C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue1;                // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameEffectPoolManager_C*> CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers2; // 0x0380(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameEffectPoolManager_C*       CallFunc_Array_Get_Item4;                          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_InGameMain_C*                       CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue2;       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller2; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue2;           // 0x03EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x03F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue2;                // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutedReplay_ReturnValue;             // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager) == 0x000008, "Wrong alignment on BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager");
static_assert(sizeof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager) == 0x000430, "Wrong size on BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, EntryPoint) == 0x000000, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_ParticleType3) == 0x000020, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_ParticleType3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location5) == 0x000028, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Rotation3) == 0x000034, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Rotation3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_ParticleType2) == 0x000040, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_ParticleType2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location4) == 0x000048, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Rotation2) == 0x000054, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Rotation2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_EmitParticleEffect_ParticleEffect) == 0x000068, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_EmitParticleEffect_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Array_Index_Variable1) == 0x0000E0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowNames_OutRowNames1) == 0x0000E8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowNames_OutRowNames1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Length_ReturnValue1) == 0x0000F8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_EffectType1) == 0x000100, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_EffectType1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Owner1) == 0x000108, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Owner1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SpanwedSpaceInOwnersEnv1) == 0x000110, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SpanwedSpaceInOwnersEnv1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SpawnedSpaceInNotOwnersEnv) == 0x000111, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SpawnedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location3) == 0x000114, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_WwiseEventTag1) == 0x000120, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_WwiseEventTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseAutoPost1) == 0x000128, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseAutoPost1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseAutoDestroy1) == 0x000129, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseAutoDestroy1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SceneComponentToAttachWwise1) == 0x000130, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SceneComponentToAttachWwise1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bGionDryRun1) == 0x000138, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bGionDryRun1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseDryRun1) == 0x000139, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseDryRun1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_EffectType) == 0x000140, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_EffectType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Owner) == 0x000148, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SpanwedSpaceInOwnersEnv) == 0x000150, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SpanwedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv) == 0x000151, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location2) == 0x000154, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_WwiseEventTag) == 0x000160, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_WwiseEventTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseAutoPost) == 0x000168, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseAutoPost' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseAutoDestroy) == 0x000169, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseAutoDestroy' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SceneComponentToAttachWwise) == 0x000170, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SceneComponentToAttachWwise' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bGionDryRun) == 0x000178, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bGionDryRun' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_bWwiseDryRun) == 0x000179, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_bWwiseDryRun' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_LocalGionEffect_AkComponent_LocalOnly_) == 0x000180, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_LocalGionEffect_AkComponent_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_LocalGionEffect_bFullfilGionDisplayingCondition) == 0x000188, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_LocalGionEffect_bFullfilGionDisplayingCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Loop_Counter_Variable) == 0x00018C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Loop_Counter_Variable1) == 0x000190, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Add_IntInt_ReturnValue1) == 0x000198, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Loop_Counter_Variable2) == 0x00019C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001A0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_IntInt_ReturnValue) == 0x0001A1, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Add_IntInt_ReturnValue2) == 0x0001A4, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001A8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Array_Index_Variable2) == 0x0001AC, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_ParticleType1) == 0x0001B0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_ParticleType1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location1) == 0x0001B8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Rotation1) == 0x0001C4, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Rotation1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SceneComponentToAttach) == 0x0001D0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SceneComponentToAttach' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SocketName1) == 0x0001D8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SocketName1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_ParticleType) == 0x0001E0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_ParticleType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Location) == 0x0001E8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_Rotation) == 0x0001F4, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_AttachToComponent) == 0x000200, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_AttachToComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CustomEvent_SocketName) == 0x000208, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CustomEvent_SocketName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_EmitParticleEffectAttached_ParticleEffect) == 0x000210, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_EmitParticleEffectAttached_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Loop_Counter_Variable3) == 0x000218, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Array_Index_Variable3) == 0x00021C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Add_IntInt_ReturnValue3) == 0x000220, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Array_Index_Variable4) == 0x000224, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Get_Item1) == 0x000228, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Map_Find_Value) == 0x000230, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Map_Find_ReturnValue) == 0x000290, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowFromName_OutRow1) == 0x000298, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowFromName_OutRow1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetDataTableRowFromName_ReturnValue1) == 0x0002A8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetDataTableRowFromName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, Temp_int_Loop_Counter_Variable4) == 0x0002AC, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_CreateDelegate_OutputDelegate) == 0x0002B0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_IntInt_ReturnValue1) == 0x0002C0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Add_IntInt_ReturnValue4) == 0x0002C4, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers) == 0x0002C8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers1) == 0x0002D8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Get_Item2) == 0x0002E8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Get_Item3) == 0x0002F0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetOwner_ReturnValue) == 0x0002F8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000300, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_DynamicCast_AsAJBIn_Game_Player_Controller) == 0x000308, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_DynamicCast_AsAJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_DynamicCast_bSuccess) == 0x000310, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetOwner_ReturnValue1) == 0x000318, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetCameraLocation_ReturnValue) == 0x000320, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_DynamicCast_AsAJBIn_Game_Player_Controller1) == 0x000330, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_DynamicCast_AsAJBIn_Game_Player_Controller1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, K2Node_DynamicCast_bSuccess1) == 0x000338, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00033C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_VSizeSquared_ReturnValue) == 0x000348, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetCameraLocation_ReturnValue1) == 0x00034C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetCameraLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_FloatFloat_ReturnValue) == 0x000358, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x00035C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_VSizeSquared_ReturnValue1) == 0x000368, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_VSizeSquared_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_NotEqual_ObjectObject_ReturnValue1) == 0x00036C, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_NotEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_FloatFloat_ReturnValue1) == 0x00036D, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Length_ReturnValue2) == 0x000370, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Length_ReturnValue3) == 0x000374, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_IntInt_ReturnValue2) == 0x000378, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Less_IntInt_ReturnValue3) == 0x000379, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers2) == 0x000380, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetInGameEffectPoolManagers_OutEffectPoolManagers2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000390, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000398, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_Array_Get_Item4) == 0x0003A0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x0003A8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_IsValid_ReturnValue) == 0x0003B0, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager, CallFunc_GetOwner_ReturnValue2) == 0x0003B8, "Member 'BP_AJBInGameEffectPoolManager_C_ExecuteUbergraph_BP_AJBInGameEffectPoolManager::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
