#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBGlimpseOfForceSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBGlimpseOfForceSkill.BP_AJBGlimpseOfForceSkill_C.ExecuteUbergraph_BP_AJBGlimpseOfForceSkill
// 0x0070 (0x0070 - 0x0000)
struct BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBGlimpseOfForceEffect_C*          K2Node_DynamicCast_AsBP_AJBGlimpse_Of_Force_Effect; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill) == 0x000010, "Wrong alignment on BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill");
static_assert(sizeof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill) == 0x000070, "Wrong size on BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, EntryPoint) == 0x000000, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, K2Node_DynamicCast_AsBP_AJBGlimpse_Of_Force_Effect) == 0x000058, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::K2Node_DynamicCast_AsBP_AJBGlimpse_Of_Force_Effect' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_AJBGlimpseOfForceSkill_C_ExecuteUbergraph_BP_AJBGlimpseOfForceSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

