#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPairInfoUIFollowerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent
// 0x01F8 (0x01F8 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_PairName;                       // 0x0010(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue1;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue2;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_UI_FollowPairInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue3;               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent) == 0x000008, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent) == 0x0001F8, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, EntryPoint) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue1) == 0x00000C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_CustomEvent_PairName) == 0x000010, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_CustomEvent_PairName' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetOwner_ReturnValue1) == 0x000030, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000038, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_DynamicCast_AsCharacter) == 0x000048, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue2) == 0x000051, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000054, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetObjectName_ReturnValue) == 0x000060, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000080, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x000108, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x000110, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetObjectName_ReturnValue1) == 0x000118, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetObjectName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue) == 0x000128, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetObjectName_ReturnValue2) == 0x000138, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetObjectName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue3) == 0x000148, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue1) == 0x000150, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000160, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000168, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000170, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000178, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x000180, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Create_ReturnValue) == 0x000188, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue4) == 0x000190, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000198, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x0001A0, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A1, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_GetObjectName_ReturnValue3) == 0x0001A8, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_GetObjectName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue2) == 0x0001B8, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue3) == 0x0001C8, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue4) == 0x0001D8, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent, CallFunc_Concat_StrStr_ReturnValue5) == 0x0001E8, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBPairInfoUIFollowerComponent::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.SetPairName
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_SetPairName final
{
public:
	class FText                                   PairName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_SetPairName) == 0x000008, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_SetPairName");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_SetPairName) == 0x000018, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_SetPairName");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_SetPairName, PairName) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_SetPairName::PairName' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.UpdateFollowWidget
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetWidgetScale_Scale;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingRescued_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget) == 0x000010, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget) == 0x0000A0, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, Delta) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::Delta' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000008, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_GetTargetWidgetScale_Scale) == 0x00000C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_GetTargetWidgetScale_Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_FInterpTo_ReturnValue) == 0x000010, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_IsBeingRescued_ReturnValue) == 0x000029, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_IsBeingRescued_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000034, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x00003C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000040, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Abs_ReturnValue) == 0x000044, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000049, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_GetOwner_ReturnValue1) == 0x000050, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000058, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'BP_AJBPairInfoUIFollowerComponent_C_UpdateFollowWidget::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.GetTargetWidgetScale
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale final
{
public:
	struct FTransform                             InTransform;                                       // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	float                                         Scale;                                             // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale) == 0x000010, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale) == 0x000090, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, InTransform) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::InTransform' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, Scale) == 0x000030, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_BreakTransform_Location) == 0x000040, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_GetCameraLocation_ReturnValue) == 0x000064, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_VSize_ReturnValue) == 0x00007C, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale, CallFunc_MapRangeClamped_ReturnValue) == 0x000080, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetTargetWidgetScale::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.GetViewTarget
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget) == 0x000008, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget) == 0x000010, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget, ReturnValue) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBPairInfoUIFollowerComponent_C_GetViewTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBPairInfoUIFollowerComponent.BP_AJBPairInfoUIFollowerComponent_C.SetCharacterHPAndAPAndSP
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP final
{
public:
	class ABP_AJBInGameCharacter_C*               Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP1;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueMax_AAPValueMax;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_AAPValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue5;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP) == 0x000008, "Wrong alignment on BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP");
static_assert(sizeof(BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP) == 0x0000A0, "Wrong size on BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP, Character) == 0x000000, "Member 'BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP::Character' has a wrong offset!");
static_assert(offsetof(BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP, Temp_float_Variable) == 0x000008, "Member 'BP_AJBPairInfoUIFollowerComponent_C_SetCharacterHPAndAPAndSP::Temp_float_Variable' has a wrong offset!");
