#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_RequestParticleEffect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ST_ParticleEffectInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimNotify_RequestParticleEffect.BP_AnimNotify_RequestParticleEffect_C.Received_Notify
// 0x0170 (0x0170 - 0x0000)
struct BP_AnimNotify_RequestParticleEffect_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditorPreview_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x0084(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystem*                        CallFunc_GetParticleSystemFromTag_NewParam;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x00E4(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0108(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify) == 0x000010, "Wrong alignment on BP_AnimNotify_RequestParticleEffect_C_Received_Notify");
static_assert(sizeof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify) == 0x000170, "Wrong size on BP_AnimNotify_RequestParticleEffect_C_Received_Notify");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, MeshComp) == 0x000000, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, Animation) == 0x000008, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, ReturnValue) == 0x000010, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, RelativeTransform) == 0x000020, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::RelativeTransform' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_IsEditorPreview_ReturnValue) == 0x000050, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_IsEditorPreview_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Location) == 0x000054, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Scale) == 0x00006C, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Location1) == 0x000078, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Rotation1) == 0x000084, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Scale1) == 0x000090, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_GetSocketTransform_ReturnValue) == 0x0000A0, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_GetParticleSystemFromTag_NewParam) == 0x0000D0, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_GetParticleSystemFromTag_NewParam' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Location2) == 0x0000D8, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Rotation2) == 0x0000E4, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_BreakTransform_Scale2) == 0x0000F0, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000100, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_ComposeRotators_ReturnValue) == 0x000108, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue) == 0x000114, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000120, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000160, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_Received_Notify, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000168, "Member 'BP_AnimNotify_RequestParticleEffect_C_Received_Notify::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");

// Function BP_AnimNotify_RequestParticleEffect.BP_AnimNotify_RequestParticleEffect_C.GetParticleSystemFromTag
// 0x0068 (0x0068 - 0x0000)
struct BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag final
{
public:
	struct FGameplayTag                           ParticleType_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             ParticleDatatable;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ParticleEffectInfo                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag) == 0x000008, "Wrong alignment on BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag");
static_assert(sizeof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag) == 0x000068, "Wrong size on BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, ParticleType_0) == 0x000000, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::ParticleType_0' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, NewParam) == 0x000008, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::NewParam' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, ParticleDatatable) == 0x000010, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::ParticleDatatable' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000061, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetParticleSystemFromTag::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function BP_AnimNotify_RequestParticleEffect.BP_AnimNotify_RequestParticleEffect_C.GetNotifyName
// 0x0028 (0x0028 - 0x0000)
struct BP_AnimNotify_RequestParticleEffect_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimNotify_RequestParticleEffect_C_GetNotifyName) == 0x000008, "Wrong alignment on BP_AnimNotify_RequestParticleEffect_C_GetNotifyName");
static_assert(sizeof(BP_AnimNotify_RequestParticleEffect_C_GetNotifyName) == 0x000028, "Wrong size on BP_AnimNotify_RequestParticleEffect_C_GetNotifyName");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetNotifyName, CallFunc_GetTagName_ReturnValue) == 0x000010, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetNotifyName::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_RequestParticleEffect_C_GetNotifyName, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_AnimNotify_RequestParticleEffect_C_GetNotifyName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

}

