#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrimsonDimensionSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBAllPlayerAffectedSkill_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C
// 0x0040 (0x0238 - 0x01F8)
class UBP_AJBCrimsonDimensionSkill_C final : public UBP_AJBAllPlayerAffectedSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCrimsonDimensionSkill_C;      // 0x01F8(0x0008)(Transient, DuplicateTransient)
	float                                         StateTimeAction;                                   // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           StandMontageAction;                                // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         LockSkillClassList;                                // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FTimerHandle                           TimerHandleAffecterActivate;                       // 0x0220(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         DimensionDistance;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedDownScaleNotOwnerEnv;                         // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterMoveSpeedScaleByStandNotOwnerEnv;         // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCrimsonDimensionSkill(int32 EntryPoint);
	void EndSkillUI();
	void StartSkillUI();
	void DuringAffecterActivate();
	void OnSkillEffectiveTimeDetermined(const struct FGameplayTag& SkillTag_0, float EffectiveTimeSec, bool bUpdateEvenIfNotInGameplay);
	void OnSkillSucceeded_Local(const struct FGameplayTag& SkillTag_0);
	void MC_OnActive(bool bPossibleAction);
	void EndState();
	void StateBeginAction();
	void StateTickAction();
	void StateTick();
	void OnCompleted_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void ReceiveBeginPlay();
	void OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void SpawnSkillAffecterCore(class UClass* AffecterClass, class ABP_AJBSkillAffecterBase_C** SkillAffecterBase);
	void OnCancel();
	void ReceiveTick(float DeltaSeconds);
	void OnActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBCrimsonDimensionSkill_C">();
	}
	static class UBP_AJBCrimsonDimensionSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBCrimsonDimensionSkill_C>();
	}
};
static_assert(alignof(UBP_AJBCrimsonDimensionSkill_C) == 0x000008, "Wrong alignment on UBP_AJBCrimsonDimensionSkill_C");
static_assert(sizeof(UBP_AJBCrimsonDimensionSkill_C) == 0x000238, "Wrong size on UBP_AJBCrimsonDimensionSkill_C");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, UberGraphFrame_BP_AJBCrimsonDimensionSkill_C) == 0x0001F8, "Member 'UBP_AJBCrimsonDimensionSkill_C::UberGraphFrame_BP_AJBCrimsonDimensionSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, StateTimeAction) == 0x000200, "Member 'UBP_AJBCrimsonDimensionSkill_C::StateTimeAction' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, StandMontageAction) == 0x000208, "Member 'UBP_AJBCrimsonDimensionSkill_C::StandMontageAction' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, LockSkillClassList) == 0x000210, "Member 'UBP_AJBCrimsonDimensionSkill_C::LockSkillClassList' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, TimerHandleAffecterActivate) == 0x000220, "Member 'UBP_AJBCrimsonDimensionSkill_C::TimerHandleAffecterActivate' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, DimensionDistance) == 0x000228, "Member 'UBP_AJBCrimsonDimensionSkill_C::DimensionDistance' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, SpeedDownScaleNotOwnerEnv) == 0x00022C, "Member 'UBP_AJBCrimsonDimensionSkill_C::SpeedDownScaleNotOwnerEnv' has a wrong offset!");
static_assert(offsetof(UBP_AJBCrimsonDimensionSkill_C, CharacterMoveSpeedScaleByStandNotOwnerEnv) == 0x000230, "Member 'UBP_AJBCrimsonDimensionSkill_C::CharacterMoveSpeedScaleByStandNotOwnerEnv' has a wrong offset!");

}

