#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileMTLBlade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameProjectileMTLBlade.BP_AJBInGameProjectileMTLBlade_C.ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade
// 0x0014 (0x0014 - 0x0000)
struct BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGravityLoadAffected_bAffected;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade) == 0x000004, "Wrong alignment on BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade");
static_assert(sizeof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade) == 0x000014, "Wrong size on BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade");
static_assert(offsetof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade, EntryPoint) == 0x000000, "Member 'BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade, CallFunc_CheckGravityLoadAffected_bAffected) == 0x000010, "Member 'BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade::CallFunc_CheckGravityLoadAffected_bAffected' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade, CallFunc_IsValid_ReturnValue1) == 0x000012, "Member 'BP_AJBInGameProjectileMTLBlade_C_ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

}

