#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem_SP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItem_SP.BP_AJBInGameItem_SP_C.ExecuteUbergraph_BP_AJBInGameItem_SP
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameAIEnvironmentComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_Event_HitCharacter;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBParamContent*                       CallFunc_GetParamDefaultContent_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP");
static_assert(sizeof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP) == 0x000038, "Wrong size on BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, K2Node_Event_HitCharacter) == 0x000020, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::K2Node_Event_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_GetParamDefaultContent_ReturnValue) == 0x000028, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_GetParamDefaultContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_GetFloatValue_ReturnValue) == 0x000030, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'BP_AJBInGameItem_SP_C_ExecuteUbergraph_BP_AJBInGameItem_SP::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItem_SP.BP_AJBInGameItem_SP_C.OnROS_Consume
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameItem_SP_C_OnROS_Consume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SP_C_OnROS_Consume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SP_C_OnROS_Consume");
static_assert(sizeof(BP_AJBInGameItem_SP_C_OnROS_Consume) == 0x000008, "Wrong size on BP_AJBInGameItem_SP_C_OnROS_Consume");
static_assert(offsetof(BP_AJBInGameItem_SP_C_OnROS_Consume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_SP_C_OnROS_Consume::HitCharacter' has a wrong offset!");

}

