#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTutorialTriggerSender_Character

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTutorialTriggerSender_Character.BP_AJBTutorialTriggerSender_Character_C.ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character
// 0x02F0 (0x02F0 - 0x0000)
struct BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBTutorialTriggerAggregator_C*     CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerController_ReturnValue1;          // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& FactorTags)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_AJBSkillBase_C* ActivatedSkill)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag, bool bHitObject)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBTutorialTriggerAggregator_C*     CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator1; // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageReceiver, bool bRemainHP, bool bDamageIsCut, int32 SerialNumber, bool DamageReceiverIsPlayer, bool bWithSeparatedStandAttack, bool bEnemysSeparateStand)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 HP)>                     K2Node_CreateDelegate_OutputDelegate5;             // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType2;                    // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP1;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAJBSkillType SkillType)>      K2Node_CreateDelegate_OutputDelegate6;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& ItemTag)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Damage1;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType1;                    // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP1;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByStatus;           // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByAAP;              // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_ItemTag;                        // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBSkillType                                 K2Node_CustomEvent_SkillType;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_HP;                             // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SerialNumber;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DamageReceiverIsPlayer;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWithSeparatedStandAttack;      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnemysSeparateStand;           // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag;                       // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHitObject;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_CustomEvent_ActivatedSkill;                 // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  K2Node_CustomEvent_FactorTags;                     // 0x02C8(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character) == 0x000008, "Wrong alignment on BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character");
static_assert(sizeof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character) == 0x0002F0, "Wrong size on BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, EntryPoint) == 0x000000, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000008, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000038, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsLocalController_ReturnValue) == 0x000050, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsPlayerController_ReturnValue) == 0x000051, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsValid_ReturnValue1) == 0x000052, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator) == 0x000058, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000060, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsValid_ReturnValue2) == 0x00006C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_VSize_ReturnValue) == 0x00007C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DeltaSeconds1) == 0x000084, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DeltaSeconds1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Add_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_int_Array_Index_Variable1) == 0x0000A4, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DeltaSeconds) == 0x0000A8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000AC, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000B0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsPlayerController_ReturnValue1) == 0x0000CD, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Not_PreBool_ReturnValue1) == 0x0000CE, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsValid_ReturnValue3) == 0x0000CF, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Array_Get_Item1) == 0x0000D8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate1) == 0x0000E0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000F0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x0000FC, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_IsValid_ReturnValue4) == 0x0000FD, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Array_Length_ReturnValue1) == 0x000100, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Less_IntInt_ReturnValue1) == 0x000104, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetActorForwardVector_ReturnValue) == 0x000108, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_BooleanAND_ReturnValue) == 0x000114, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000118, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x000124, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_VSize_ReturnValue1) == 0x000130, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_VSize_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate2) == 0x000138, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Normal_ReturnValue) == 0x000148, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Dot_VectorVector_ReturnValue) == 0x000154, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000158, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000159, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate3) == 0x000160, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_BooleanAND_ReturnValue1) == 0x000170, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator1) == 0x000178, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000180, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate4) == 0x000188, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_bool_Has_Been_Initd_Variable) == 0x000198, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate5) == 0x0001A0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, Temp_bool_IsClosed_Variable) == 0x0001B0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageType2) == 0x0001B8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageType2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DeadActor) == 0x0001C0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageCauser1) == 0x0001C8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001D0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_CharacterBP1) == 0x0001D8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001E0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_CharacterBP) == 0x0001E8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate6) == 0x0001F0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate7) == 0x000200, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_Damage1) == 0x000210, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_Damage1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageType1) == 0x000218, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageType1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageCauser) == 0x000220, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bRemainHP1) == 0x000228, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bRemainHP1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bDamageIsCutByStatus) == 0x000229, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bDamageIsCutByStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bDamageIsCutByAAP) == 0x00022A, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bDamageIsCutByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate8) == 0x000230, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_ItemTag) == 0x000240, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_ItemTag' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000248, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_SkillType) == 0x000249, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_SkillType' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_HP) == 0x00024C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_HP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000250, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_Damage) == 0x000254, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageType) == 0x000258, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageReceiver) == 0x000260, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bRemainHP) == 0x000268, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bDamageIsCut) == 0x000269, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_SerialNumber) == 0x00026C, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_DamageReceiverIsPlayer) == 0x000270, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_DamageReceiverIsPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bWithSeparatedStandAttack) == 0x000271, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bWithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bEnemysSeparateStand) == 0x000272, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bEnemysSeparateStand' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Not_PreBool_ReturnValue2) == 0x000273, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate9) == 0x000278, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_SkillTag) == 0x000288, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_bHitObject) == 0x000290, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_bHitObject' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_ActivatedSkill) == 0x000298, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_ActivatedSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_Not_PreBool_ReturnValue3) == 0x0002A0, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_SwitchEnum_CmpSuccess) == 0x0002A1, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate10) == 0x0002A8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CreateDelegate_OutputDelegate11) == 0x0002B8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, K2Node_CustomEvent_FactorTags) == 0x0002C8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::K2Node_CustomEvent_FactorTags' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character, CallFunc_HasTag_ReturnValue) == 0x0002E8, "Member 'BP_AJBTutorialTriggerSender_Character_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender_Character::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function BP_AJBTutorialTriggerSender_Character.BP_AJBTutorialTriggerSender_Character_C.OnSkillFailedToUse
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse final
{
public:
	struct FGameplayTagContainer                  FactorTags;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse) == 0x000008, "Wrong alignment on BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse");
static_assert(sizeof(BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse) == 0x000020, "Wrong size on BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse");
static_assert(offsetof(BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse, FactorTags) == 0x000000, "Member 'BP_AJBTutorialTriggerSender_Character_C_OnSkillFailedToUse::FactorTags' has a wrong offset!");

// Function BP_AJBTutorialTriggerSender_Character.BP_AJBTutorialTriggerSender_Character_C.OnSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTutorialTriggerSender_Character_C_OnSkillActivated final
{
public:
