#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileMTLBlade

#include "Basic.hpp"

#include "BP_AJBInGameProjectile_Straight_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameProjectileMTLBlade.BP_AJBInGameProjectileMTLBlade_C
// 0x0028 (0x04B8 - 0x0490)
class ABP_AJBInGameProjectileMTLBlade_C final : public ABP_AJBInGameProjectile_Straight_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameProjectileMTLBlade_C;   // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_RST_BladeGeneration_Idle;                       // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_BladeBeamGL;                                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_BladeBeam;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BladeMesh;                                         // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameProjectileMTLBlade_C">();
	}
	static class ABP_AJBInGameProjectileMTLBlade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameProjectileMTLBlade_C>();
	}
};
static_assert(alignof(ABP_AJBInGameProjectileMTLBlade_C) == 0x000008, "Wrong alignment on ABP_AJBInGameProjectileMTLBlade_C");
static_assert(sizeof(ABP_AJBInGameProjectileMTLBlade_C) == 0x0004B8, "Wrong size on ABP_AJBInGameProjectileMTLBlade_C");
static_assert(offsetof(ABP_AJBInGameProjectileMTLBlade_C, UberGraphFrame_BP_AJBInGameProjectileMTLBlade_C) == 0x000490, "Member 'ABP_AJBInGameProjectileMTLBlade_C::UberGraphFrame_BP_AJBInGameProjectileMTLBlade_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileMTLBlade_C, PS_RST_BladeGeneration_Idle) == 0x000498, "Member 'ABP_AJBInGameProjectileMTLBlade_C::PS_RST_BladeGeneration_Idle' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileMTLBlade_C, PS_BladeBeamGL) == 0x0004A0, "Member 'ABP_AJBInGameProjectileMTLBlade_C::PS_BladeBeamGL' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileMTLBlade_C, PS_BladeBeam) == 0x0004A8, "Member 'ABP_AJBInGameProjectileMTLBlade_C::PS_BladeBeam' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameProjectileMTLBlade_C, BladeMesh) == 0x0004B0, "Member 'ABP_AJBInGameProjectileMTLBlade_C::BladeMesh' has a wrong offset!");

}

