#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInvasionOfMetallicaSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill
// 0x0250 (0x0250 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& RemoveCondition, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBIronsandCamouflage_C*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors;          // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             K2Node_Event_Transform;                            // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_TargetActor1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateSerialNumber_SerialNumber;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPossiblePlacement;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors1;         // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item1;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Damage;                         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNotUseCollision;               // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors2;         // 0x01B8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition)> K2Node_CreateDelegate_OutputDelegate1;             // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlacement;                           // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill) == 0x000010, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill) == 0x000250, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, EntryPoint) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000021, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000028, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable1) == 0x000050, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue1) == 0x000054, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_CheckActive_bActive) == 0x000059, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_bool_Has_Been_Initd_Variable) == 0x00005A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000060, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000068, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsValid_ReturnValue1) == 0x000069, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Operator) == 0x000070, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Time) == 0x000078, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Timing) == 0x00007C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bEnable) == 0x00007D, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bOperatorIsEmpty) == 0x00007E, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Not_PreBool_ReturnValue) == 0x00007F, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors) == 0x000080, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Transform) == 0x000090, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_TargetActor1) == 0x0000C0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_TargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0000D0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0000E0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess2) == 0x0000F0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable1) == 0x0000F4, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GenerateSerialNumber_SerialNumber) == 0x0000F8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GenerateSerialNumber_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x0000FC, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000100, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwner_ReturnValue1) == 0x000108, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bPossiblePlacement) == 0x000110, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_TargetActor) == 0x000118, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Add_ReturnValue) == 0x000120, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_RemoveCondition) == 0x000128, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_CharacterBP) == 0x000130, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable2) == 0x000138, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_MatchesTag_ReturnValue) == 0x00013C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue2) == 0x000140, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Find_ReturnValue) == 0x000144, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_RemoveItem_ReturnValue) == 0x000148, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000149, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_BooleanAND_ReturnValue1) == 0x00014A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_AddCondition) == 0x000150, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_bool_IsClosed_Variable) == 0x000158, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_MatchesTag_ReturnValue1) == 0x000159, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_MatchesTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors1) == 0x000160, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue1) == 0x000178, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue1) == 0x00017C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable2) == 0x000180, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item1) == 0x000188, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000190, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess3) == 0x000198, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_Damage) == 0x00019C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_DamageType) == 0x0001A0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_DamageCauser) == 0x0001A8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bRemainHP) == 0x0001B0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bDamageIsCut) == 0x0001B1, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bNotUseCollision) == 0x0001B2, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors2) == 0x0001B8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x0001C8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item2) == 0x0001D0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue2) == 0x0001D8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue2) == 0x0001DC, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x0001E0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsServer_ReturnValue1) == 0x0001F0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0001F8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000200, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess4) == 0x000208, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bPlacement) == 0x000209, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Actor) == 0x000210, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x000218, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000228, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000240, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000248, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnSpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject) == 0x000010, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject::bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject, Actor) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject::Actor' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.ReceiveDamageServer
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer final
{
public:
	int32                                         Damage_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer) == 0x000020, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, Damage_0) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::Damage_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, DamageType) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, DamageCauser) == 0x000010, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bRemainHP) == 0x000018, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bDamageIsCut) == 0x000019, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bNotUseCollision) == 0x00001A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bNotUseCollision' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnPassiveAdded
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded) == 0x000008, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded, AddCondition) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded::AddCondition' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnPassiveRemoved
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved) == 0x000010, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved, RemoveCondition) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved::RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved, CharacterBP) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved::CharacterBP' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.SpawnNewObject
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 TargetActor;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject) == 0x000010, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject) == 0x000040, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject, Transform) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject::Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject, TargetActor) == 0x000030, "Member 'BP_AJBInvasionOfMetallicaSkill_C_SpawnNewObject::TargetActor' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.ChangeEnableShouldUpdateMetallicaServer
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreActiveCheck;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBMetallica_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer) == 0x000020, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, CharacterBP) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, bEnable) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, bIgnoreActiveCheck) == 0x000009, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::bIgnoreActiveCheck' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, Temp_bool_Variable) == 0x00000A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, Temp_bool_Variable1) == 0x000018, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, CallFunc_CheckActive_bActive) == 0x000019, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, K2Node_Select_Default) == 0x00001B, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ChangeEnableShouldUpdateMetallicaServer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.GetValidatedActorsServer
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_GetValidatedActorsServer final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class UObject*>                        TempReturnObjects;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
