#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBVanishingOfTimeArrowPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AJBPreviewBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBVanishingOfTimeArrowPreview.BP_AJBVanishingOfTimeArrowPreview_C
// 0x0018 (0x0380 - 0x0368)
class ABP_AJBVanishingOfTimeArrowPreview_C final : public ABP_AJBPreviewBase_C
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowPositions;                               // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshScale;                                         // 0x0374(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateGuide(TArray<struct FVector>& Positions);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBVanishingOfTimeArrowPreview_C">();
	}
	static class ABP_AJBVanishingOfTimeArrowPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBVanishingOfTimeArrowPreview_C>();
	}
};
static_assert(alignof(ABP_AJBVanishingOfTimeArrowPreview_C) == 0x000008, "Wrong alignment on ABP_AJBVanishingOfTimeArrowPreview_C");
static_assert(sizeof(ABP_AJBVanishingOfTimeArrowPreview_C) == 0x000380, "Wrong size on ABP_AJBVanishingOfTimeArrowPreview_C");
static_assert(offsetof(ABP_AJBVanishingOfTimeArrowPreview_C, InstancedStaticMesh) == 0x000368, "Member 'ABP_AJBVanishingOfTimeArrowPreview_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_AJBVanishingOfTimeArrowPreview_C, bDebugShowPositions) == 0x000370, "Member 'ABP_AJBVanishingOfTimeArrowPreview_C::bDebugShowPositions' has a wrong offset!");
static_assert(offsetof(ABP_AJBVanishingOfTimeArrowPreview_C, MeshScale) == 0x000374, "Member 'ABP_AJBVanishingOfTimeArrowPreview_C::MeshScale' has a wrong offset!");

}

