#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTrainingSequence

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.ExecuteUbergraph_BP_AJBTrainingSequence
// 0x0270 (0x0270 - 0x0000)
struct BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0038(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	class UWB_PpBuyWindow_C*                      CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0100(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0128(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdatePPCheckTimer_bTimerZero;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveUI_bActive;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget3;                  // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget2;                  // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectedBuy_bSelected;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate1;             // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue1;                      // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBConfirmResult                             CallFunc_GetButtonResult_Result;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue2;                      // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAJBArcadeTerminateGame_ReturnValue;     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBConfirmResult                             CallFunc_GetButtonResult_Result1;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence");
static_assert(sizeof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence) == 0x000270, "Wrong size on BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, EntryPoint) == 0x000000, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_PlayModeEquals_bResult) == 0x000004, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Variable) == 0x000005, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_text_Variable) == 0x000008, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_text_Variable1) == 0x000020, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_text_Variable2) == 0x000038, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_Select_Default) == 0x000050, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_Create_ReturnValue) == 0x000068, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_MakeArray_Array) == 0x0000B0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000C0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_IsClosed_Variable) == 0x0000E0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000F8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_text_Variable3) == 0x000100, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Variable1) == 0x000118, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000119, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue) == 0x00011A, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00011C, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetCacheInteger_OutValue) == 0x000120, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetCacheInteger_ReturnValue) == 0x000124, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000125, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_Select1_Default) == 0x000128, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue1) == 0x000140, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_Event_DeltaSeconds) == 0x000144, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_UpdatePPCheckTimer_bTimerZero) == 0x000148, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_UpdatePPCheckTimer_bTimerZero' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBGameInstance_bSuccess) == 0x000149, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000150, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000158, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000160, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetCurrentFlowState_FlowState) == 0x000168, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000170, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000171, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000172, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000178, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsActiveUI_bActive) == 0x000180, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsActiveUI_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CustomEvent_TargetWidget3) == 0x000188, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CustomEvent_TargetWidget3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_MakeLiteralByte_ReturnValue2) == 0x000190, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CustomEvent_TargetWidget2) == 0x000198, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CustomEvent_TargetWidget2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Has_Been_Initd_Variable) == 0x0001A0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CustomEvent_TargetWidget1) == 0x0001A8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CustomEvent_TargetWidget1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x0001B0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x0001B8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x0001C0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x0001C8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsSelectedBuy_bSelected) == 0x0001D0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsSelectedBuy_bSelected' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue2) == 0x0001D1, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CreateDelegate_OutputDelegate1) == 0x0001D8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue3) == 0x0001E8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue4) == 0x0001E9, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue5) == 0x0001EA, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_Create_ReturnValue1) == 0x0001F0, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetButtonResult_Result) == 0x0001F8, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetButtonResult_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_SwitchEnum_CmpSuccess) == 0x0001F9, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Has_Been_Initd_Variable1) == 0x0001FA, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue6) == 0x0001FB, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_Create_ReturnValue2) == 0x000200, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsValid_ReturnValue7) == 0x000208, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_PlayModeEquals_bResult1) == 0x000209, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_PlayModeEquals_bResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x00020A, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x000210, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CreateDelegate_OutputDelegate2) == 0x000218, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_IsAJBArcadeTerminateGame_ReturnValue) == 0x000228, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_IsAJBArcadeTerminateGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CreateDelegate_OutputDelegate3) == 0x000230, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_IsClosed_Variable1) == 0x000240, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CustomEvent_TargetWidget) == 0x000248, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_GetButtonResult_Result1) == 0x000250, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_GetButtonResult_Result1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_SwitchEnum1_CmpSuccess) == 0x000251, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, K2Node_CreateDelegate_OutputDelegate4) == 0x000258, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_MakeLiteralByte_ReturnValue3) == 0x000268, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_MakeLiteralByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x000269, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_PlayModeEquals_bResult2) == 0x00026A, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_PlayModeEquals_bResult2' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence, CallFunc_MakeLiteralByte_ReturnValue4) == 0x00026B, "Member 'BP_AJBTrainingSequence_C_ExecuteUbergraph_BP_AJBTrainingSequence::CallFunc_MakeLiteralByte_ReturnValue4' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.OnClosedTrainingEndConfirm
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm");
static_assert(sizeof(BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm) == 0x000008, "Wrong size on BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm");
static_assert(offsetof(BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm, TargetWidget) == 0x000000, "Member 'BP_AJBTrainingSequence_C_OnClosedTrainingEndConfirm::TargetWidget' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.OnClosedGameEndConfirm
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTrainingSequence_C_OnClosedGameEndConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_OnClosedGameEndConfirm) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_OnClosedGameEndConfirm");
static_assert(sizeof(BP_AJBTrainingSequence_C_OnClosedGameEndConfirm) == 0x000008, "Wrong size on BP_AJBTrainingSequence_C_OnClosedGameEndConfirm");
static_assert(offsetof(BP_AJBTrainingSequence_C_OnClosedGameEndConfirm, TargetWidget) == 0x000000, "Member 'BP_AJBTrainingSequence_C_OnClosedGameEndConfirm::TargetWidget' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.OnClosedPPBuyWindow
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTrainingSequence_C_OnClosedPPBuyWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_OnClosedPPBuyWindow) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_OnClosedPPBuyWindow");
static_assert(sizeof(BP_AJBTrainingSequence_C_OnClosedPPBuyWindow) == 0x000008, "Wrong size on BP_AJBTrainingSequence_C_OnClosedPPBuyWindow");
static_assert(offsetof(BP_AJBTrainingSequence_C_OnClosedPPBuyWindow, TargetWidget) == 0x000000, "Member 'BP_AJBTrainingSequence_C_OnClosedPPBuyWindow::TargetWidget' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.OnClosedPPCheckConfirm
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm");
static_assert(sizeof(BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm) == 0x000008, "Wrong size on BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm");
static_assert(offsetof(BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm, TargetWidget) == 0x000000, "Member 'BP_AJBTrainingSequence_C_OnClosedPPCheckConfirm::TargetWidget' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBTrainingSequence_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBTrainingSequence_C_ReceiveTick");
static_assert(sizeof(BP_AJBTrainingSequence_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBTrainingSequence_C_ReceiveTick");
static_assert(offsetof(BP_AJBTrainingSequence_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBTrainingSequence_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.UpdatePPCheckTimer
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBTrainingSequence_C_UpdatePPCheckTimer final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTimerZero;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_UpdatePPCheckTimer");
static_assert(sizeof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer) == 0x000020, "Wrong size on BP_AJBTrainingSequence_C_UpdatePPCheckTimer");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, Delta) == 0x000000, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::Delta' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, bTimerZero) == 0x000004, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::bTimerZero' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, CallFunc_FMax_ReturnValue) == 0x00000C, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000010, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_UpdatePPCheckTimer, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000018, "Member 'BP_AJBTrainingSequence_C_UpdatePPCheckTimer::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");

// Function BP_AJBTrainingSequence.BP_AJBTrainingSequence_C.FinalizeSequence
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBTrainingSequence_C_FinalizeSequence final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTrainingSequence_C_FinalizeSequence) == 0x000008, "Wrong alignment on BP_AJBTrainingSequence_C_FinalizeSequence");
static_assert(sizeof(BP_AJBTrainingSequence_C_FinalizeSequence) == 0x000010, "Wrong size on BP_AJBTrainingSequence_C_FinalizeSequence");
static_assert(offsetof(BP_AJBTrainingSequence_C_FinalizeSequence, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBTrainingSequence_C_FinalizeSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTrainingSequence_C_FinalizeSequence, CallFunc_IsValid_ReturnValue1) == 0x000001, "Member 'BP_AJBTrainingSequence_C_FinalizeSequence::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
