#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CS_SpreadCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CS_SpreadCard.BP_CS_SpreadCard_C
// 0x0040 (0x0368 - 0x0328)
class ABP_CS_SpreadCard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CardCount;                                         // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Cards;                                             // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         AnimationTime;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetValue;                                       // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZOffset;                                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CS_SpreadCard(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Construct();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CS_SpreadCard_C">();
	}
	static class ABP_CS_SpreadCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CS_SpreadCard_C>();
	}
};
static_assert(alignof(ABP_CS_SpreadCard_C) == 0x000008, "Wrong alignment on ABP_CS_SpreadCard_C");
static_assert(sizeof(ABP_CS_SpreadCard_C) == 0x000368, "Wrong size on ABP_CS_SpreadCard_C");
static_assert(offsetof(ABP_CS_SpreadCard_C, UberGraphFrame) == 0x000328, "Member 'ABP_CS_SpreadCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, Spline) == 0x000330, "Member 'ABP_CS_SpreadCard_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_CS_SpreadCard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, CardCount) == 0x000340, "Member 'ABP_CS_SpreadCard_C::CardCount' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, Cards) == 0x000348, "Member 'ABP_CS_SpreadCard_C::Cards' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, AnimationTime) == 0x000358, "Member 'ABP_CS_SpreadCard_C::AnimationTime' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, OffsetValue) == 0x00035C, "Member 'ABP_CS_SpreadCard_C::OffsetValue' has a wrong offset!");
static_assert(offsetof(ABP_CS_SpreadCard_C, ZOffset) == 0x000360, "Member 'ABP_CS_SpreadCard_C::ZOffset' has a wrong offset!");

}

