#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CS_SpreadCard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CS_SpreadCard.BP_CS_SpreadCard_C.ExecuteUbergraph_BP_CS_SpreadCard
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item1;                          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue1;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00FC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard) == 0x000010, "Wrong alignment on BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard");
static_assert(sizeof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard) == 0x0001B0, "Wrong size on BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, EntryPoint) == 0x000000, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_struct_Variable) == 0x000010, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_int_Loop_Counter_Variable1) == 0x000054, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Add_IntInt_ReturnValue1) == 0x000058, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_int_Array_Index_Variable1) == 0x00005C, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000060, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Array_Get_Item1) == 0x000090, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Array_Length_ReturnValue1) == 0x000098, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, Temp_int_Variable) == 0x00009C, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Less_IntInt_ReturnValue1) == 0x0000A0, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A1, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Add_IntInt_ReturnValue2) == 0x0000A4, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_GetSplineLength_ReturnValue) == 0x0000AC, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B0, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Multiply_IntFloat_ReturnValue1) == 0x0000B8, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Multiply_IntFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000BC, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x0000C0, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_BreakTransform_Location) == 0x0000F0, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_BreakTransform_Rotation) == 0x0000FC, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_BreakTransform_Scale) == 0x000108, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_Add_VectorVector_ReturnValue) == 0x000114, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000120, "Member 'BP_CS_SpreadCard_C_ExecuteUbergraph_BP_CS_SpreadCard::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_CS_SpreadCard.BP_CS_SpreadCard_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CS_SpreadCard_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CS_SpreadCard_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CS_SpreadCard_C_ReceiveTick");
static_assert(sizeof(BP_CS_SpreadCard_C_ReceiveTick) == 0x000004, "Wrong size on BP_CS_SpreadCard_C_ReceiveTick");
static_assert(offsetof(BP_CS_SpreadCard_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CS_SpreadCard_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

