#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door

#include "Basic.hpp"

#include "BP_AJBGate_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door.BP_Door_C
// 0x0018 (0x0398 - 0x0380)
class ABP_Door_C final : public ABP_AJBGate_C
{
public:
	class UStaticMeshComponent*                   SM_ENV_common_Door1_01;                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MeshPivot;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SimpleCurveAnimation_C*             BP_SimpleCurveAnimation;                           // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Door_C">();
	}
	static class ABP_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_C>();
	}
};
static_assert(alignof(ABP_Door_C) == 0x000008, "Wrong alignment on ABP_Door_C");
static_assert(sizeof(ABP_Door_C) == 0x000398, "Wrong size on ABP_Door_C");
static_assert(offsetof(ABP_Door_C, SM_ENV_common_Door1_01) == 0x000380, "Member 'ABP_Door_C::SM_ENV_common_Door1_01' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, MeshPivot) == 0x000388, "Member 'ABP_Door_C::MeshPivot' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, BP_SimpleCurveAnimation) == 0x000390, "Member 'ABP_Door_C::BP_SimpleCurveAnimation' has a wrong offset!");

}

