#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageDecal.BP_DamageDecal_C
// 0x0040 (0x0368 - 0x0328)
class ABP_DamageDecal_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _______0___Track_1_107DD6CA47799E33FB7A15AAF78469AC; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0___Track_0_107DD6CA47799E33FB7A15AAF78469AC; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _______0__Direction_107DD6CA47799E33FB7A15AAF78469AC; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     _______0;                                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI;                                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxScale;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinScale;                                          // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DamageDecal(int32 EntryPoint);
	void PlayAnimationTimeline();
	void ReceiveBeginPlay();
	void StopAnimationTimeline();
	void UserConstructionScript();
	void _______0__FinishedFunc();
	void _______0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageDecal_C">();
	}
	static class ABP_DamageDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageDecal_C>();
	}
};
static_assert(alignof(ABP_DamageDecal_C) == 0x000008, "Wrong alignment on ABP_DamageDecal_C");
static_assert(sizeof(ABP_DamageDecal_C) == 0x000368, "Wrong size on ABP_DamageDecal_C");
static_assert(offsetof(ABP_DamageDecal_C, UberGraphFrame) == 0x000328, "Member 'ABP_DamageDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, Decal) == 0x000330, "Member 'ABP_DamageDecal_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_DamageDecal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, _______0___Track_1_107DD6CA47799E33FB7A15AAF78469AC) == 0x000340, "Member 'ABP_DamageDecal_C::_______0___Track_1_107DD6CA47799E33FB7A15AAF78469AC' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, _______0___Track_0_107DD6CA47799E33FB7A15AAF78469AC) == 0x000344, "Member 'ABP_DamageDecal_C::_______0___Track_0_107DD6CA47799E33FB7A15AAF78469AC' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, _______0__Direction_107DD6CA47799E33FB7A15AAF78469AC) == 0x000348, "Member 'ABP_DamageDecal_C::_______0__Direction_107DD6CA47799E33FB7A15AAF78469AC' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, _______0) == 0x000350, "Member 'ABP_DamageDecal_C::_______0' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, DMI) == 0x000358, "Member 'ABP_DamageDecal_C::DMI' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, MaxScale) == 0x000360, "Member 'ABP_DamageDecal_C::MaxScale' has a wrong offset!");
static_assert(offsetof(ABP_DamageDecal_C, MinScale) == 0x000364, "Member 'ABP_DamageDecal_C::MinScale' has a wrong offset!");

}

