#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectPool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EffectPool.BP_EffectPool_C.ExecuteUbergraph_BP_EffectPool
// 0x0028 (0x0028 - 0x0000)
struct BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool) == 0x000008, "Wrong alignment on BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool");
static_assert(sizeof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool) == 0x000028, "Wrong size on BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, EntryPoint) == 0x000000, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, CallFunc_GetOwner_ReturnValue1) == 0x000010, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, K2Node_DynamicCast_AsAJBIn_Game_Player_Controller) == 0x000018, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::K2Node_DynamicCast_AsAJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool, CallFunc_IsLocalController_ReturnValue) == 0x000021, "Member 'BP_EffectPool_C_ExecuteUbergraph_BP_EffectPool::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");

// Function BP_EffectPool.BP_EffectPool_C.FindEffectActor
// 0x00C8 (0x00C8 - 0x0000)
struct BP_EffectPool_C_FindEffectActor final
{
public:
	bool                                          bIsFound;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameEffectActor*                  UseEffectActor;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_Index;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_PoolBufferLastIndex;                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameEffectActor*                  Temp_EffectActor;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingUsed_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameEffectActor*                  CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue1;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectPool_C_FindEffectActor) == 0x000008, "Wrong alignment on BP_EffectPool_C_FindEffectActor");
static_assert(sizeof(BP_EffectPool_C_FindEffectActor) == 0x0000C8, "Wrong size on BP_EffectPool_C_FindEffectActor");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, bIsFound) == 0x000000, "Member 'BP_EffectPool_C_FindEffectActor::bIsFound' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, UseEffectActor) == 0x000008, "Member 'BP_EffectPool_C_FindEffectActor::UseEffectActor' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, Temp_Index) == 0x000010, "Member 'BP_EffectPool_C_FindEffectActor::Temp_Index' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, Temp_PoolBufferLastIndex) == 0x000014, "Member 'BP_EffectPool_C_FindEffectActor::Temp_PoolBufferLastIndex' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, Temp_EffectActor) == 0x000018, "Member 'BP_EffectPool_C_FindEffectActor::Temp_EffectActor' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_IsBeingUsed_ReturnValue) == 0x000020, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_IsBeingUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000021, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Add_IntInt_ReturnValue1) == 0x000028, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Percent_IntInt_ReturnValue) == 0x000040, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Conv_IntToString_ReturnValue1) == 0x000048, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, Temp_int_Variable) == 0x000068, "Member 'BP_EffectPool_C_FindEffectActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Concat_StrStr_ReturnValue1) == 0x000070, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Concat_StrStr_ReturnValue2) == 0x000080, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Concat_StrStr_ReturnValue3) == 0x000098, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Add_IntInt_ReturnValue2) == 0x0000A8, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Add_IntInt_ReturnValue3) == 0x0000AC, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Percent_IntInt_ReturnValue1) == 0x0000B8, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Percent_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_Array_LastIndex_ReturnValue) == 0x0000C0, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_FindEffectActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_EffectPool_C_FindEffectActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EffectPool.BP_EffectPool_C.InitializePool
// 0x0060 (0x0060 - 0x0000)
struct BP_EffectPool_C_InitializePool final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameEffectActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectPool_C_InitializePool) == 0x000010, "Wrong alignment on BP_EffectPool_C_InitializePool");
static_assert(sizeof(BP_EffectPool_C_InitializePool) == 0x000060, "Wrong size on BP_EffectPool_C_InitializePool");
static_assert(offsetof(BP_EffectPool_C_InitializePool, Temp_int_Variable) == 0x000000, "Member 'BP_EffectPool_C_InitializePool::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_EffectPool_C_InitializePool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_EffectPool_C_InitializePool::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_EffectPool_C_InitializePool::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_EffectPool_C_InitializePool::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BP_EffectPool_C_InitializePool::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_InitializePool, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_EffectPool_C_InitializePool::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_EffectPool.BP_EffectPool_C.CalcAvailableEffectActorNum
// 0x0030 (0x0030 - 0x0000)
struct BP_EffectPool_C_CalcAvailableEffectActorNum final
{
public:
	int32                                         AvailableNum;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_AvailableNum;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameEffectActor*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingUsed_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectPool_C_CalcAvailableEffectActorNum) == 0x000008, "Wrong alignment on BP_EffectPool_C_CalcAvailableEffectActorNum");
static_assert(sizeof(BP_EffectPool_C_CalcAvailableEffectActorNum) == 0x000030, "Wrong size on BP_EffectPool_C_CalcAvailableEffectActorNum");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, AvailableNum) == 0x000000, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::AvailableNum' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, Temp_AvailableNum) == 0x000004, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::Temp_AvailableNum' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_IsBeingUsed_ReturnValue) == 0x000029, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_IsBeingUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_CalcAvailableEffectActorNum, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'BP_EffectPool_C_CalcAvailableEffectActorNum::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_EffectPool.BP_EffectPool_C.AddEffectsInPool
// 0x0060 (0x0060 - 0x0000)
struct BP_EffectPool_C_AddEffectsInPool final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameEffectActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectPool_C_AddEffectsInPool) == 0x000010, "Wrong alignment on BP_EffectPool_C_AddEffectsInPool");
static_assert(sizeof(BP_EffectPool_C_AddEffectsInPool) == 0x000060, "Wrong size on BP_EffectPool_C_AddEffectsInPool");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, Num) == 0x000000, "Member 'BP_EffectPool_C_AddEffectsInPool::Num' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, Temp_int_Variable) == 0x000004, "Member 'BP_EffectPool_C_AddEffectsInPool::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_Add_IntInt_ReturnValue1) == 0x000048, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectPool_C_AddEffectsInPool, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'BP_EffectPool_C_AddEffectsInPool::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

