#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HouseBase.BP_HouseBase_C.ExecuteUbergraph_BP_HouseBase
// 0x00F0 (0x00F0 - 0x0000)
struct BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllChildActors_ChildActors;            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Door_C*                             K2Node_DynamicCast_AsBP_Door;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllChildActors_ChildActors1;           // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnhancementItemSpawnPoint_C*        K2Node_DynamicCast_AsBP_Enhancement_Item_Spawn_Point; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item2;                          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue1; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item3;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item4;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewSeed;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase) == 0x000008, "Wrong alignment on BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase");
static_assert(sizeof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase) == 0x0000F0, "Wrong size on BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, EntryPoint) == 0x000000, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Array_Index_Variable1) == 0x000014, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Add_IntInt_ReturnValue1) == 0x000018, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Array_Index_Variable2) == 0x00001C, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_GetAllChildActors_ChildActors) == 0x000020, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_GetAllChildActors_ChildActors' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_AsBP_Door) == 0x000040, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_AsBP_Door' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_GetAllChildActors_ChildActors1) == 0x000050, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_GetAllChildActors_ChildActors1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, Temp_int_Loop_Counter_Variable2) == 0x000060, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Get_Item1) == 0x000068, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_AsBP_Enhancement_Item_Spawn_Point) == 0x000070, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_AsBP_Enhancement_Item_Spawn_Point' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Add_IntInt_ReturnValue2) == 0x00007C, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Length_ReturnValue1) == 0x000080, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Less_IntInt_ReturnValue1) == 0x000084, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_GetChildrenComponents_Children) == 0x000088, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Length_ReturnValue2) == 0x000098, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Get_Item2) == 0x0000A0, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000B0, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Length_ReturnValue3) == 0x0000BC, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Less_IntInt_ReturnValue2) == 0x0000C0, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Length_ReturnValue4) == 0x0000C4, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Subtract_IntInt_ReturnValue1) == 0x0000C8, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x0000CC, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_RandomIntegerInRangeFromStream_ReturnValue1) == 0x0000D0, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_RandomIntegerInRangeFromStream_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Get_Item3) == 0x0000D8, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, CallFunc_Array_Get_Item4) == 0x0000E0, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase, K2Node_CustomEvent_NewSeed) == 0x0000E8, "Member 'BP_HouseBase_C_ExecuteUbergraph_BP_HouseBase::K2Node_CustomEvent_NewSeed' has a wrong offset!");

// Function BP_HouseBase.BP_HouseBase_C.ChangeColor_Seed
// 0x0004 (0x0004 - 0x0000)
struct BP_HouseBase_C_ChangeColor_Seed final
{
public:
	int32                                         NewSeed;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseBase_C_ChangeColor_Seed) == 0x000004, "Wrong alignment on BP_HouseBase_C_ChangeColor_Seed");
static_assert(sizeof(BP_HouseBase_C_ChangeColor_Seed) == 0x000004, "Wrong size on BP_HouseBase_C_ChangeColor_Seed");
static_assert(offsetof(BP_HouseBase_C_ChangeColor_Seed, NewSeed) == 0x000000, "Member 'BP_HouseBase_C_ChangeColor_Seed::NewSeed' has a wrong offset!");

}

