#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LaunchPart

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LaunchPart.BP_LaunchPart_C.ExecuteUbergraph_BP_LaunchPart
// 0x0048 (0x0048 - 0x0000)
struct BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart) == 0x000008, "Wrong alignment on BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart");
static_assert(sizeof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart) == 0x000048, "Wrong size on BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, EntryPoint) == 0x000000, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_GetAJBGameInstance_bSuccess) == 0x000004, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_IsPlayingReplay_ReturnValue) == 0x000010, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_GetSocketLocation_ReturnValue) == 0x00001C, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_IsValid_ReturnValue1) == 0x000030, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000038, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart, CallFunc_HasLocalSharedController_ReturnValue) == 0x000041, "Member 'BP_LaunchPart_C_ExecuteUbergraph_BP_LaunchPart::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");

// Function BP_LaunchPart.BP_LaunchPart_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LaunchPart_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaunchPart_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LaunchPart_C_ReceiveTick");
static_assert(sizeof(BP_LaunchPart_C_ReceiveTick) == 0x000004, "Wrong size on BP_LaunchPart_C_ReceiveTick");
static_assert(offsetof(BP_LaunchPart_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LaunchPart_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LaunchPart.BP_LaunchPart_C.GetDamageActorTargetLocation
// 0x000C (0x000C - 0x0000)
struct BP_LaunchPart_C_GetDamageActorTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaunchPart_C_GetDamageActorTargetLocation) == 0x000004, "Wrong alignment on BP_LaunchPart_C_GetDamageActorTargetLocation");
static_assert(sizeof(BP_LaunchPart_C_GetDamageActorTargetLocation) == 0x00000C, "Wrong size on BP_LaunchPart_C_GetDamageActorTargetLocation");
static_assert(offsetof(BP_LaunchPart_C_GetDamageActorTargetLocation, Location) == 0x000000, "Member 'BP_LaunchPart_C_GetDamageActorTargetLocation::Location' has a wrong offset!");

}

