#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LaunchPart_PairOfOne

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LaunchPart_PairOfOne.BP_LaunchPart_PairOfOne_C.ExecuteUbergraph_BP_LaunchPart_PairOfOne
// 0x0010 (0x0010 - 0x0000)
struct BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LaunchPart_PairOfOne_C*             K2Node_CustomEvent_Other;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne) == 0x000008, "Wrong alignment on BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne");
static_assert(sizeof(BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne) == 0x000010, "Wrong size on BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne");
static_assert(offsetof(BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne, EntryPoint) == 0x000000, "Member 'BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne, K2Node_CustomEvent_Other) == 0x000008, "Member 'BP_LaunchPart_PairOfOne_C_ExecuteUbergraph_BP_LaunchPart_PairOfOne::K2Node_CustomEvent_Other' has a wrong offset!");

// Function BP_LaunchPart_PairOfOne.BP_LaunchPart_PairOfOne_C.SetPairEachOther
// 0x0008 (0x0008 - 0x0000)
struct BP_LaunchPart_PairOfOne_C_SetPairEachOther final
{
public:
	class ABP_LaunchPart_PairOfOne_C*             Other;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaunchPart_PairOfOne_C_SetPairEachOther) == 0x000008, "Wrong alignment on BP_LaunchPart_PairOfOne_C_SetPairEachOther");
static_assert(sizeof(BP_LaunchPart_PairOfOne_C_SetPairEachOther) == 0x000008, "Wrong size on BP_LaunchPart_PairOfOne_C_SetPairEachOther");
static_assert(offsetof(BP_LaunchPart_PairOfOne_C_SetPairEachOther, Other) == 0x000000, "Member 'BP_LaunchPart_PairOfOne_C_SetPairEachOther::Other' has a wrong offset!");

}

