#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreLoadEmoteHelper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PreLoadEmoteHelper.BP_PreLoadEmoteHelper_C.ExecuteUbergraph_BP_PreLoadEmoteHelper
// 0x0108 (0x0108 - 0x0000)
struct BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Temp_object_Variable;                              // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UAJBAssetManager*                       CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBAssetManager*                       CallFunc_Get_ReturnValue1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEmotePrimaryDataAssetIdByCharaId_bSuccess; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetEmotePrimaryDataAssetIdByCharaId_ReturnValue; // 0x0050(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_CustomEvent_Loaded;                         // 0x0068(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(TArray<class UObject*>& Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item1;                          // 0x0090(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_PrimaryAssetIdToString_ReturnValue;  // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_name_Variable;                                // 0x00E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UAsyncActionLoadPrimaryAssetList*       CallFunc_AsyncLoadPrimaryAssetList_ReturnValue;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper) == 0x000008, "Wrong alignment on BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper");
static_assert(sizeof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper) == 0x000108, "Wrong size on BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, EntryPoint) == 0x000000, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_int_Array_Index_Variable1) == 0x000010, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_object_Variable) == 0x000018, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Get_ReturnValue) == 0x000028, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Get_ReturnValue1) == 0x000030, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Get_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Length_ReturnValue1) == 0x000044, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_GetEmotePrimaryDataAssetIdByCharaId_bSuccess) == 0x000048, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_GetEmotePrimaryDataAssetIdByCharaId_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_GetEmotePrimaryDataAssetIdByCharaId_ReturnValue) == 0x000050, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_GetEmotePrimaryDataAssetIdByCharaId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, K2Node_CustomEvent_Loaded) == 0x000068, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_int_Loop_Counter_Variable1) == 0x000088, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Get_Item1) == 0x000090, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Array_Length_ReturnValue2) == 0x0000A0, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Conv_PrimaryAssetIdToString_ReturnValue) == 0x0000A8, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Conv_PrimaryAssetIdToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000D0, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Less_IntInt_ReturnValue1) == 0x0000E0, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_Add_IntInt_ReturnValue1) == 0x0000E4, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, Temp_name_Variable) == 0x0000E8, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_AsyncLoadPrimaryAssetList_ReturnValue) == 0x0000F8, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_AsyncLoadPrimaryAssetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'BP_PreLoadEmoteHelper_C_ExecuteUbergraph_BP_PreLoadEmoteHelper::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PreLoadEmoteHelper.BP_PreLoadEmoteHelper_C.Completed_107FF52F47F41BC3E625F288BF881739
// 0x0010 (0x0010 - 0x0000)
struct BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739 final
{
public:
	TArray<class UObject*>                        Loaded;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739) == 0x000008, "Wrong alignment on BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739");
static_assert(sizeof(BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739) == 0x000010, "Wrong size on BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739, Loaded) == 0x000000, "Member 'BP_PreLoadEmoteHelper_C_Completed_107FF52F47F41BC3E625F288BF881739::Loaded' has a wrong offset!");

// Function BP_PreLoadEmoteHelper.BP_PreLoadEmoteHelper_C.IsLoadedEmoteAssets
// 0x0001 (0x0001 - 0x0000)
struct BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets final
{
public:
	bool                                          bLoaded;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets) == 0x000001, "Wrong alignment on BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets");
static_assert(sizeof(BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets) == 0x000001, "Wrong size on BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets");
static_assert(offsetof(BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets, bLoaded) == 0x000000, "Member 'BP_PreLoadEmoteHelper_C_IsLoadedEmoteAssets::bLoaded' has a wrong offset!");

}

