#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMoatTest4

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMoatTest4.BP_SplineMoatTest4_C.ExecuteUbergraph_BP_SplineMoatTest4
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location1; // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1; // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0090(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x00A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable1;                             // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue1;                // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4) == 0x000010, "Wrong alignment on BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4");
static_assert(sizeof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4) == 0x0000F0, "Wrong size on BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, EntryPoint) == 0x000000, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_int_Variable) == 0x000004, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Add_IntInt_ReturnValue1) == 0x00000C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue1) == 0x000018, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000020, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x00002C, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Location1) == 0x000038, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Location1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1) == 0x000044, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000050, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_struct_Variable) == 0x000060, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue2) == 0x000090, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_MakeVector2D_ReturnValue3) == 0x0000A0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, Temp_struct_Variable1) == 0x0000B0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4, CallFunc_AddComponent_ReturnValue1) == 0x0000E0, "Member 'BP_SplineMoatTest4_C_ExecuteUbergraph_BP_SplineMoatTest4::CallFunc_AddComponent_ReturnValue1' has a wrong offset!");

}

