#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScoreBoardManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_ScoreBoardPlayerInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.ExecuteUbergraph_BP_ScoreBoardManager
// 0x02E0 (0x02E0 - 0x0000)
struct BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType1;                    // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNotUseCollision;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0048(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchingPlayerInfo>            CallFunc_Map_Values_Values;                        // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTotalDamage_bSuccess;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame; // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out1;            // 0x0120(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue1;    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddKnockDownCount_bSuccess;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame1; // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame2; // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_Array_Get_Item;                           // 0x01E0(0x0088)()
	struct FST_ScoreBoardPlayerInfo               K2Node_MakeStruct_ST_ScoreBoardPlayerInfo;         // 0x0268(0x000C)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision)> K2Node_CreateDelegate_OutputDelegate;              // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item1;                          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1;             // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate2;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_PrevState;                      // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager) == 0x000008, "Wrong alignment on BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager");
static_assert(sizeof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager) == 0x0002E0, "Wrong size on BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, EntryPoint) == 0x000000, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_Damage) == 0x000014, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_DamageType1) == 0x000018, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_DamageType1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_DamageCauser1) == 0x000020, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_bRemainHP) == 0x000028, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_bDamageIsCut) == 0x000029, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_bNotUseCollision) == 0x00002A, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_GetAJBGameInstance_bSuccess) == 0x00002B, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000030, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000038, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000048, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000D0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Map_Values_Values) == 0x0000D8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_AddTotalDamage_bSuccess) == 0x0000EC, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_AddTotalDamage_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000ED, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame) == 0x0000EE, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_DamageType) == 0x0000F0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_DeadActor) == 0x0000F8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_DamageCauser) == 0x000100, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, Temp_int_Loop_Counter_Variable1) == 0x000108, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000110, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_TryGetMatchingPlayerInfo_Out1) == 0x000120, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_TryGetMatchingPlayerInfo_Out1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_TryGetMatchingPlayerInfo_ReturnValue1) == 0x0001A8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_TryGetMatchingPlayerInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Add_IntInt_ReturnValue1) == 0x0001AC, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_AddKnockDownCount_bSuccess) == 0x0001B0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_AddKnockDownCount_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0001B8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_bSuccess2) == 0x0001C0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x0001C8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_DynamicCast_bSuccess3) == 0x0001D0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame1) == 0x0001D1, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame2) == 0x0001D2, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_IsPlayerCharacterAsGame_bPlayerCharacterAsGame2' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, Temp_int_Array_Index_Variable1) == 0x0001D4, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_BooleanAND_ReturnValue) == 0x0001D8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_MakeStruct_ST_ScoreBoardPlayerInfo) == 0x000268, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_MakeStruct_ST_ScoreBoardPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Array_Add_ReturnValue) == 0x000274, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000278, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CreateDelegate_OutputDelegate) == 0x000288, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Array_Get_Item1) == 0x000298, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Array_Length_ReturnValue1) == 0x0002A0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_Less_IntInt_ReturnValue1) == 0x0002A4, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_IsServer_ReturnValue) == 0x0002A5, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CreateDelegate_OutputDelegate1) == 0x0002A8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CreateDelegate_OutputDelegate2) == 0x0002B8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, K2Node_CustomEvent_PrevState) == 0x0002C8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::K2Node_CustomEvent_PrevState' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_FindStateFromPlayerController_ReturnValue) == 0x0002D0, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_FindStateFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager, CallFunc_FindStateFromPlayerController_FindResult) == 0x0002D8, "Member 'BP_ScoreBoardManager_C_ExecuteUbergraph_BP_ScoreBoardManager::CallFunc_FindStateFromPlayerController_FindResult' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.OnBegin_Standby
// 0x0008 (0x0008 - 0x0000)
struct BP_ScoreBoardManager_C_OnBegin_Standby final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScoreBoardManager_C_OnBegin_Standby) == 0x000008, "Wrong alignment on BP_ScoreBoardManager_C_OnBegin_Standby");
static_assert(sizeof(BP_ScoreBoardManager_C_OnBegin_Standby) == 0x000008, "Wrong size on BP_ScoreBoardManager_C_OnBegin_Standby");
static_assert(offsetof(BP_ScoreBoardManager_C_OnBegin_Standby, PrevState) == 0x000000, "Member 'BP_ScoreBoardManager_C_OnBegin_Standby::PrevState' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.OnDeadCharacter
// 0x0018 (0x0018 - 0x0000)
struct BP_ScoreBoardManager_C_OnDeadCharacter final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScoreBoardManager_C_OnDeadCharacter) == 0x000008, "Wrong alignment on BP_ScoreBoardManager_C_OnDeadCharacter");
static_assert(sizeof(BP_ScoreBoardManager_C_OnDeadCharacter) == 0x000018, "Wrong size on BP_ScoreBoardManager_C_OnDeadCharacter");
static_assert(offsetof(BP_ScoreBoardManager_C_OnDeadCharacter, DamageType) == 0x000000, "Member 'BP_ScoreBoardManager_C_OnDeadCharacter::DamageType' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnDeadCharacter, DeadActor) == 0x000008, "Member 'BP_ScoreBoardManager_C_OnDeadCharacter::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnDeadCharacter, DamageCauser) == 0x000010, "Member 'BP_ScoreBoardManager_C_OnDeadCharacter::DamageCauser' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.OnRecieveDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_ScoreBoardManager_C_OnRecieveDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScoreBoardManager_C_OnRecieveDamage) == 0x000008, "Wrong alignment on BP_ScoreBoardManager_C_OnRecieveDamage");
static_assert(sizeof(BP_ScoreBoardManager_C_OnRecieveDamage) == 0x000020, "Wrong size on BP_ScoreBoardManager_C_OnRecieveDamage");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, Damage) == 0x000000, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, DamageType) == 0x000008, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, DamageCauser) == 0x000010, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, bRemainHP) == 0x000018, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, bDamageIsCut) == 0x000019, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_OnRecieveDamage, bNotUseCollision) == 0x00001A, "Member 'BP_ScoreBoardManager_C_OnRecieveDamage::bNotUseCollision' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ScoreBoardManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScoreBoardManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ScoreBoardManager_C_ReceiveTick");
static_assert(sizeof(BP_ScoreBoardManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_ScoreBoardManager_C_ReceiveTick");
static_assert(offsetof(BP_ScoreBoardManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ScoreBoardManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.AddKnockDownCount
// 0x0044 (0x0044 - 0x0000)
struct BP_ScoreBoardManager_C_AddKnockDownCount final
{
public:
	uint8                                         PlayerID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsFound_Local;                                    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ScoreBoardPlayerInfo               CallFunc_Array_Get_Item;                           // 0x0020(0x000C)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ScoreBoardPlayerInfo               K2Node_MakeStruct_ST_ScoreBoardPlayerInfo;         // 0x0034(0x000C)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScoreBoardManager_C_AddKnockDownCount) == 0x000004, "Wrong alignment on BP_ScoreBoardManager_C_AddKnockDownCount");
static_assert(sizeof(BP_ScoreBoardManager_C_AddKnockDownCount) == 0x000044, "Wrong size on BP_ScoreBoardManager_C_AddKnockDownCount");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, PlayerID) == 0x000000, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::PlayerID' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, Value) == 0x000004, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::Value' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, bSuccess) == 0x000008, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, bIsFound_Local) == 0x000009, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::bIsFound_Local' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_Add_IntInt_ReturnValue1) == 0x000030, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, K2Node_MakeStruct_ST_ScoreBoardPlayerInfo) == 0x000034, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::K2Node_MakeStruct_ST_ScoreBoardPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddKnockDownCount, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_ScoreBoardManager_C_AddKnockDownCount::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.AddTotalDamage
// 0x0044 (0x0044 - 0x0000)
struct BP_ScoreBoardManager_C_AddTotalDamage final
{
public:
	uint8                                         PlayerID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Damage;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsFound_Local;                                    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ScoreBoardPlayerInfo               CallFunc_Array_Get_Item;                           // 0x0020(0x000C)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ScoreBoardPlayerInfo               K2Node_MakeStruct_ST_ScoreBoardPlayerInfo;         // 0x0034(0x000C)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ScoreBoardManager_C_AddTotalDamage) == 0x000004, "Wrong alignment on BP_ScoreBoardManager_C_AddTotalDamage");
static_assert(sizeof(BP_ScoreBoardManager_C_AddTotalDamage) == 0x000044, "Wrong size on BP_ScoreBoardManager_C_AddTotalDamage");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, PlayerID) == 0x000000, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::PlayerID' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, Damage) == 0x000004, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, bSuccess) == 0x000008, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, bIsFound_Local) == 0x000009, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::bIsFound_Local' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, Temp_bool_True_if_break_was_hit_Variable) == 0x00000A, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_Add_IntInt_ReturnValue1) == 0x000030, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, K2Node_MakeStruct_ST_ScoreBoardPlayerInfo) == 0x000034, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::K2Node_MakeStruct_ST_ScoreBoardPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_AddTotalDamage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_ScoreBoardManager_C_AddTotalDamage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ScoreBoardManager.BP_ScoreBoardManager_C.ScoreDebugPrint
// 0x0120 (0x0120 - 0x0000)
struct BP_ScoreBoardManager_C_ScoreDebugPrint final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ScoreBoardPlayerInfo               CallFunc_Array_Get_Item;                           // 0x0010(0x000C)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0060(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScoreBoardManager_C_ScoreDebugPrint) == 0x000008, "Wrong alignment on BP_ScoreBoardManager_C_ScoreDebugPrint");
static_assert(sizeof(BP_ScoreBoardManager_C_ScoreDebugPrint) == 0x000120, "Wrong size on BP_ScoreBoardManager_C_ScoreDebugPrint");
static_assert(offsetof(BP_ScoreBoardManager_C_ScoreDebugPrint, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ScoreBoardManager_C_ScoreDebugPrint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ScoreDebugPrint, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ScoreBoardManager_C_ScoreDebugPrint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScoreBoardManager_C_ScoreDebugPrint, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ScoreBoardManager_C_ScoreDebugPrint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
