#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerTrackBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SequencerTrackBase.BP_SequencerTrackBase_C.ExecuteUbergraph_BP_SequencerTrackBase
// 0x0004 (0x0004 - 0x0000)
struct BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase) == 0x000004, "Wrong alignment on BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase");
static_assert(sizeof(BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase) == 0x000004, "Wrong size on BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase");
static_assert(offsetof(BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase, EntryPoint) == 0x000000, "Member 'BP_SequencerTrackBase_C_ExecuteUbergraph_BP_SequencerTrackBase::EntryPoint' has a wrong offset!");

// Function BP_SequencerTrackBase.BP_SequencerTrackBase_C.IsSkippingTrack
// 0x0001 (0x0001 - 0x0000)
struct BP_SequencerTrackBase_C_IsSkippingTrack final
{
public:
	bool                                          bIsSkiping;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerTrackBase_C_IsSkippingTrack) == 0x000001, "Wrong alignment on BP_SequencerTrackBase_C_IsSkippingTrack");
static_assert(sizeof(BP_SequencerTrackBase_C_IsSkippingTrack) == 0x000001, "Wrong size on BP_SequencerTrackBase_C_IsSkippingTrack");
static_assert(offsetof(BP_SequencerTrackBase_C_IsSkippingTrack, bIsSkiping) == 0x000000, "Member 'BP_SequencerTrackBase_C_IsSkippingTrack::bIsSkiping' has a wrong offset!");

}

