#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerPlaySEReceiver

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SequencerPlaySEReceiver.BP_SequencerPlaySEReceiver_C.ExecuteUbergraph_BP_SequencerPlaySEReceiver
// 0x00F8 (0x00F8 - 0x0000)
struct BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent3;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent4;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent5;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent6;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent7;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent8;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent9;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent10;   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent11;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent12;   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent13;   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent14;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent15;   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent16;   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent17;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent18;   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent19;   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent20;   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent21;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent22;   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent23;   // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent24;   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent25;   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent26;   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent27;   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent28;   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent29;   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver) == 0x000008, "Wrong alignment on BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver");
static_assert(sizeof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver) == 0x0000F8, "Wrong size on BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, EntryPoint) == 0x000000, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000008, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000010, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent2) == 0x000018, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent2' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent3) == 0x000020, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent3' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent4) == 0x000028, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent4' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent5) == 0x000030, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent5' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent6) == 0x000038, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent6' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent7) == 0x000040, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent7' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent8) == 0x000048, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent8' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent9) == 0x000050, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent9' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent10) == 0x000058, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent10' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent11) == 0x000060, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent11' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent12) == 0x000068, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent12' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent13) == 0x000070, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent13' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent14) == 0x000078, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent14' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent15) == 0x000080, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent15' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent16) == 0x000088, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent16' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent17) == 0x000090, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent17' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent18) == 0x000098, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent18' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent19) == 0x0000A0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent19' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent20) == 0x0000A8, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent20' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent21) == 0x0000B0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent21' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent22) == 0x0000B8, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent22' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent23) == 0x0000C0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent23' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent24) == 0x0000C8, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent24' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent25) == 0x0000D0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent25' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent26) == 0x0000D8, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent26' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent27) == 0x0000E0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent27' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent28) == 0x0000E8, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent28' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver, CallFunc_RequestWwiseEventOnLocal_AkComponent29) == 0x0000F0, "Member 'BP_SequencerPlaySEReceiver_C_ExecuteUbergraph_BP_SequencerPlaySEReceiver::CallFunc_RequestWwiseEventOnLocal_AkComponent29' has a wrong offset!");

}

