#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShopCompetitionUIFollowerComponent

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ShopCompetitionUIFollowerComponent.BP_ShopCompetitionUIFollowerComponent_C.ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent
// 0x0270 (0x0270 - 0x0000)
struct BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0038(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_UI_FollowPairInfo_C*                CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShopCompetitionWatcherMode_bDisplayWatcherMode; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0xE];                                      // 0x0122(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetWidgetScale_Scale;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0180(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue1;      // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTargetWidgetScale_Scale1;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwnerCharacterDie_bDie;                 // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivate_bCan;                         // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentTickEnabled_ReturnValue;       // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent) == 0x000010, "Wrong alignment on BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent");
static_assert(sizeof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent) == 0x000270, "Wrong size on BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, EntryPoint) == 0x000000, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsValid_ReturnValue1) == 0x000005, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000006, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000008, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetOwner_ReturnValue1) == 0x000030, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000038, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000C0, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetDistanceTo_ReturnValue) == 0x0000C4, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000E4, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x0000E8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x0000F0, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue) == 0x0000F8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x000100, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsShopCompetitionWatcherMode_bDisplayWatcherMode) == 0x000108, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsShopCompetitionWatcherMode_bDisplayWatcherMode' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsValid_ReturnValue2) == 0x000109, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetOwner_ReturnValue2) == 0x000110, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_DynamicCast_AsCharacter) == 0x000118, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_DynamicCast_bSuccess1) == 0x000120, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_Event_EndPlayReason) == 0x000121, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000160, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetTargetWidgetScale_Scale) == 0x000164, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetTargetWidgetScale_Scale' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000168, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_MakeVector_ReturnValue) == 0x00016C, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, K2Node_Event_DeltaSeconds) == 0x000178, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000180, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_K2_GetComponentToWorld_ReturnValue1) == 0x000210, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_K2_GetComponentToWorld_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetTargetWidgetScale_Scale1) == 0x000240, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetTargetWidgetScale_Scale1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetOwner_ReturnValue3) == 0x000248, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000250, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsOwnerCharacterDie_bDie) == 0x000251, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsOwnerCharacterDie_bDie' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_BooleanOR_ReturnValue) == 0x000252, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_GetAttachParent_ReturnValue) == 0x000258, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000260, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_CanActivate_bCan) == 0x000261, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_CanActivate_bCan' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent, CallFunc_IsComponentTickEnabled_ReturnValue) == 0x000262, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ExecuteUbergraph_BP_ShopCompetitionUIFollowerComponent::CallFunc_IsComponentTickEnabled_ReturnValue' has a wrong offset!");

// Function BP_ShopCompetitionUIFollowerComponent.BP_ShopCompetitionUIFollowerComponent_C.IsOwnerCharacterDie
// 0x0020 (0x0020 - 0x0000)
struct BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie final
{
public:
	bool                                          bDie;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie) == 0x000008, "Wrong alignment on BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie");
static_assert(sizeof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie) == 0x000020, "Wrong size on BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie, bDie) == 0x000000, "Member 'BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie::bDie' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000019, "Member 'BP_ShopCompetitionUIFollowerComponent_C_IsOwnerCharacterDie::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");

// Function BP_ShopCompetitionUIFollowerComponent.BP_ShopCompetitionUIFollowerComponent_C.CanActivate
// 0x00E0 (0x00E0 - 0x0000)
struct BP_ShopCompetitionUIFollowerComponent_C_CanActivate final
{
public:
	bool                                          bCan;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0030(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x00C0(0x0008)(ConstParm, NoDestructor)
	class UWB_UI_FollowPairInfo_C*                CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate) == 0x000008, "Wrong alignment on BP_ShopCompetitionUIFollowerComponent_C_CanActivate");
static_assert(sizeof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate) == 0x0000E0, "Wrong size on BP_ShopCompetitionUIFollowerComponent_C_CanActivate");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, bCan) == 0x000000, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::bCan' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000010, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000018, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000030, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000B8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_Not_PreBool_ReturnValue) == 0x0000B9, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000BC, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetShopEventSettings_ReturnValue) == 0x0000C0, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue) == 0x0000C8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_TryGetShopCompetitionFlowWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D1, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x0000D3, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_CanActivate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x0000D8, "Member 'BP_ShopCompetitionUIFollowerComponent_C_CanActivate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");

// Function BP_ShopCompetitionUIFollowerComponent.BP_ShopCompetitionUIFollowerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick");
static_assert(sizeof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShopCompetitionUIFollowerComponent.BP_ShopCompetitionUIFollowerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ShopCompetitionUIFollowerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

