#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_AJBOutGamePlayerController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPF_AJBOutGamePlayerController.BPF_AJBOutGamePlayerController_C.GetAJBOutGamePlayerController_BP
// 0x0038 (0x0038 - 0x0000)
struct BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGamePlayerController_C*       Out_Game_Player_Controller;                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBOutGamePlayerController_C*       K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP) == 0x000008, "Wrong alignment on BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP");
static_assert(sizeof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP) == 0x000038, "Wrong size on BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, PlayerIndex) == 0x000000, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, __WorldContext) == 0x000008, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, bSuccess) == 0x000010, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, Out_Game_Player_Controller) == 0x000018, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::Out_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller) == 0x000028, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGamePlayerController_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPF_AJBOutGamePlayerController.BPF_AJBOutGamePlayerController_C.GetAJBOutGameWwiseManager
// 0x0038 (0x0038 - 0x0000)
struct BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBWwiseManager_C*                  OutGameWwiseManager;                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBOutGamePlayerController_C*       K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager) == 0x000008, "Wrong alignment on BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager");
static_assert(sizeof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager) == 0x000038, "Wrong size on BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, PlayerIndex) == 0x000000, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, __WorldContext) == 0x000008, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, bSuccess) == 0x000010, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, OutGameWwiseManager) == 0x000018, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::OutGameWwiseManager' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller) == 0x000028, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::K2Node_DynamicCast_AsBP_AJBOut_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BPF_AJBOutGamePlayerController_C_GetAJBOutGameWwiseManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

