#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_AJBAIBehaviorFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.BeingDamagedFromUnfocusingEnemy
// 0x00C8 (0x00C8 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 RO_FocusingEnemy;                                  // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Cos_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingDamagedFromPlayer_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualCharacter_ReturnValue;               // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy) == 0x0000C8, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, AI_Controller) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::AI_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, RO_FocusingEnemy) == 0x000008, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::RO_FocusingEnemy' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, __WorldContext) == 0x000030, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, ReturnValue) == 0x000038, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_Cos_ReturnValue) == 0x00003C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetRecognition_ReturnValue) == 0x000040, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000048, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_IsBeingDamagedFromPlayer_ReturnValue) == 0x000050, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_IsBeingDamagedFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetValueAsObject_ReturnValue) == 0x000058, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000060, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000070, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetLocation_ReturnValue) == 0x000078, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetForwardVector_ReturnValue) == 0x000084, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetLocation_ReturnValue1) == 0x000090, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00009C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_Normal_ReturnValue) == 0x0000A8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_GetRecognition_ReturnValue1) == 0x0000B8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000C0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy, CallFunc_EqualCharacter_ReturnValue) == 0x0000C5, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_BeingDamagedFromUnfocusingEnemy::CallFunc_EqualCharacter_ReturnValue' has a wrong offset!");

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.FindAttackingGionToPayAttention
// 0x0108 (0x0108 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 FocusingEnemyKey;                                  // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         AttackGionRadiusThresh;                            // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  Result;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    FocusingEnemy;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackGionRadiusThreshSq;                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBAIGionSource_C*                  CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGionOwnerActor_GionOwnerActor;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention) == 0x000108, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, AI_Controller) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::AI_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, FocusingEnemyKey) == 0x000008, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::FocusingEnemyKey' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, AttackGionRadiusThresh) == 0x000030, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::AttackGionRadiusThresh' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, __WorldContext) == 0x000038, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, ReturnValue) == 0x000040, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, Result) == 0x000048, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::Result' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, FocusingEnemy) == 0x000050, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::FocusingEnemy' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, AttackGionRadiusThreshSq) == 0x000058, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::AttackGionRadiusThreshSq' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, Recognition) == 0x000060, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::Recognition' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_GetRecognition_ReturnValue) == 0x000068, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000070, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Square_ReturnValue) == 0x000078, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_GetValueAsObject_ReturnValue) == 0x000080, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000088, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_GetLocation_ReturnValue) == 0x000098, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_GetGionOwnerActor_GionOwnerActor) == 0x0000D0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_GetGionOwnerActor_GionOwnerActor' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_VSizeSquared_ReturnValue) == 0x000100, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention, CallFunc_Less_FloatFloat_ReturnValue) == 0x000104, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_FindAttackingGionToPayAttention::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.CalcRelativeLocationForFakeAttack
// 0x0158 (0x0158 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 TargetEnemyKey;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0038(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    SelfChara;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    EnemyChara;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DotProductForCheckAngle;                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_AI_RightwardDirectionToDiff_ReturnValue;  // 0x0094(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue1;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AI_IsTargetCharacterRightward_ReturnValue; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue2;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBodyHalfHeight_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_DiffOfCharacters_ReturnValue;          // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x00DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_DirectionOfCharacters_ReturnValue;     // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_DirectionOfCharacters_ReturnValue1;    // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x014C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack) == 0x000158, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, AI_Controller) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::AI_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, TargetEnemyKey) == 0x000008, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::TargetEnemyKey' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, __WorldContext) == 0x000030, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, ReturnValue) == 0x000038, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, SelfChara) == 0x000048, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::SelfChara' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, EnemyChara) == 0x000050, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::EnemyChara' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, DotProductForCheckAngle) == 0x000058, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::DotProductForCheckAngle' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000060, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000078, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_GetValueAsObject_ReturnValue) == 0x000080, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000088, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_AI_RightwardDirectionToDiff_ReturnValue) == 0x000094, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_AI_RightwardDirectionToDiff_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000A0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_MakeLiteralFloat_ReturnValue1) == 0x0000A4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_MakeLiteralFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_AI_IsTargetCharacterRightward_ReturnValue) == 0x0000A8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_AI_IsTargetCharacterRightward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, Temp_bool_Variable) == 0x0000A9, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_MakeLiteralFloat_ReturnValue2) == 0x0000AC, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_MakeLiteralFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_GetBodyHalfHeight_ReturnValue) == 0x0000B0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_GetBodyHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_AI_DiffOfCharacters_ReturnValue) == 0x0000B8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_AI_DiffOfCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_MakeVector_ReturnValue) == 0x0000C4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_VSizeSquared_ReturnValue) == 0x0000D0, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_MakeVector_ReturnValue1) == 0x0000DC, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, Temp_float_Variable) == 0x0000E8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, K2Node_Select_Default) == 0x0000EC, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_AI_DirectionOfCharacters_ReturnValue) == 0x0000F8, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_AI_DirectionOfCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_AI_DirectionOfCharacters_ReturnValue1) == 0x000104, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_AI_DirectionOfCharacters_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Dot_VectorVector_ReturnValue) == 0x000110, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000114, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, Temp_float_Variable1) == 0x000120, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_DegCos_ReturnValue) == 0x000124, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, Temp_bool_Variable1) == 0x000128, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000129, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, K2Node_Select1_Default) == 0x00012C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000130, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000134, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack, CallFunc_Add_VectorVector_ReturnValue1) == 0x00014C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_CalcRelativeLocationForFakeAttack::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.AI_DirectionOfCharacters
// 0x0058 (0x0058 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters final
{
public:
	class ABP_AJBInGameAIImaginaryCharacter_C*    From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters) == 0x000058, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, From) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::From' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, To) == 0x000008, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::To' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, __WorldContext) == 0x000010, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, ReturnValue) == 0x000018, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, CallFunc_GetLocation_ReturnValue) == 0x000024, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, CallFunc_GetLocation_ReturnValue1) == 0x000030, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DirectionOfCharacters::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.AI_DiffOfCharacters
// 0x0048 (0x0048 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters final
{
public:
	class ABP_AJBInGameAIImaginaryCharacter_C*    From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters) == 0x000048, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, From) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::From' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, To) == 0x000008, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::To' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, __WorldContext) == 0x000010, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, ReturnValue) == 0x000018, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, CallFunc_GetLocation_ReturnValue) == 0x000024, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, CallFunc_GetLocation_ReturnValue1) == 0x000030, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_DiffOfCharacters::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BPF_AJBAIBehaviorFunctionLibrary.BPF_AJBAIBehaviorFunctionLibrary_C.AI_IsRightwardVector
// 0x0050 (0x0050 - 0x0000)
struct BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector final
{
public:
	struct FVector                                BaseDirection;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetDirection;                                   // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue1;       // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue1;                    // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CrossProduct2D_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector) == 0x000008, "Wrong alignment on BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector");
static_assert(sizeof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector) == 0x000050, "Wrong size on BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, BaseDirection) == 0x000000, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::BaseDirection' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, TargetDirection) == 0x00000C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::TargetDirection' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, __WorldContext) == 0x000018, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, ReturnValue) == 0x000020, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000024, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector, CallFunc_Conv_VectorToVector2D_ReturnValue1) == 0x00002C, "Member 'BPF_AJBAIBehaviorFunctionLibrary_C_AI_IsRightwardVector::CallFunc_Conv_VectorToVector2D_ReturnValue1' has a wrong offset!");
