#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBCannotApproachToEnemySoon

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_AJBCannotApproachToEnemySoon.BTD_AJBCannotApproachToEnemySoon_C
// 0x0050 (0x00F0 - 0x00A0)
class UBTD_AJBCannotApproachToEnemySoon_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 RO_FocusingEnemy;                                  // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	float                                         AttackRangeSelf;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRangeDiffThreshParam;                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarawayDistanceThreshSqParam;                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarawayDistanceThreshLessHPSqParam;                // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HPThreshParam;                                     // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon(int32 EntryPoint);
	void InitializeParameters(class AAIController* AI_Controller);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_AJBCannotApproachToEnemySoon_C">();
	}
	static class UBTD_AJBCannotApproachToEnemySoon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBCannotApproachToEnemySoon_C>();
	}
};
static_assert(alignof(UBTD_AJBCannotApproachToEnemySoon_C) == 0x000008, "Wrong alignment on UBTD_AJBCannotApproachToEnemySoon_C");
static_assert(sizeof(UBTD_AJBCannotApproachToEnemySoon_C) == 0x0000F0, "Wrong size on UBTD_AJBCannotApproachToEnemySoon_C");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, UberGraphFrame) == 0x0000A0, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, RO_FocusingEnemy) == 0x0000A8, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::RO_FocusingEnemy' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, AttackRangeSelf) == 0x0000D0, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::AttackRangeSelf' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, AttackRangeDiffThreshParam) == 0x0000D4, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::AttackRangeDiffThreshParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, FarawayDistanceThreshSqParam) == 0x0000D8, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::FarawayDistanceThreshSqParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, FarawayDistanceThreshLessHPSqParam) == 0x0000DC, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::FarawayDistanceThreshLessHPSqParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, Recognition) == 0x0000E0, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::Recognition' has a wrong offset!");
static_assert(offsetof(UBTD_AJBCannotApproachToEnemySoon_C, HPThreshParam) == 0x0000E8, "Member 'UBTD_AJBCannotApproachToEnemySoon_C::HPThreshParam' has a wrong offset!");

}

