#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBIfCharacterInSight

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_AJBIfCharacterInSight.BTD_AJBIfCharacterInSight_C.PerformConditionCheckAI
// 0x0040 (0x0040 - 0x0000)
struct BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IfCharacterInSight_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI) == 0x000040, "Wrong size on BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, CallFunc_GetRecognition_ReturnValue) == 0x000018, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000020, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000030, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI, CallFunc_IfCharacterInSight_ReturnValue) == 0x000039, "Member 'BTD_AJBIfCharacterInSight_C_PerformConditionCheckAI::CallFunc_IfCharacterInSight_ReturnValue' has a wrong offset!");

}

