#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBIfExecuteUltimate_Paramed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTD_AJBIfExecuteUltimate_Paramed.BTD_AJBIfExecuteUltimate_Paramed_C.PerformConditionCheckAI
// 0x00B8 (0x00B8 - 0x0000)
struct BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSafeArea_Location;                     // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeArea_Radius;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHPMax_Rep_HP;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHP_Rep_HP;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue2;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLivingPlayerCount_ReturnValue;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue3;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNPC_bIsNPC;                             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue4;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found4;                     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI) == 0x0000B8, "Wrong size on BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetRecognition_ReturnValue) == 0x000018, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, Temp_bool_Variable) == 0x000020, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_ReturnValue) == 0x000024, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_Found) == 0x000028, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetSafeArea_Location) == 0x00002C, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetSafeArea_Location' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetSafeArea_Radius) == 0x000038, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetSafeArea_Radius' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_ReturnValue1) == 0x00003C, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_Found1) == 0x000040, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000041, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetHPMax_Rep_HP) == 0x000044, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetHPMax_Rep_HP' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetHP_Rep_HP) == 0x000048, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetHP_Rep_HP' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000050, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_ReturnValue2) == 0x000054, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_Found2) == 0x000058, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_Found2' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_FTrunc_ReturnValue) == 0x000060, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetLivingPlayerCount_ReturnValue) == 0x000064, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetLivingPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_ReturnValue3) == 0x00006C, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_Found3) == 0x000070, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_Found3' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, Temp_bool_Variable1) == 0x000071, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000072, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue1) == 0x000074, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000078, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetValueAsObject_ReturnValue) == 0x000080, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000088, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_IsNPC_bIsNPC) == 0x000091, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_IsNPC_bIsNPC' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, K2Node_Select_Default) == 0x000098, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_ReturnValue4) == 0x0000A0, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_GetFloatParam_Found4) == 0x0000A4, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_GetFloatParam_Found4' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A8, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, K2Node_Select1_Default) == 0x0000AC, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x0000B0, "Member 'BTD_AJBIfExecuteUltimate_Paramed_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");

}

