#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBCannotApproachToEnemySoon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BTD_AJBCannotApproachToEnemySoon.BTD_AJBCannotApproachToEnemySoon_C.ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon
// 0x0060 (0x0060 - 0x0000)
struct BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AI_Controller;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue2;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found2;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Square_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue3;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found3;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNormalAttackSkill_ReturnValue;         // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttackRangeOfSkill_ReturnValue;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttackRangeOfSkill_Found;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon) == 0x000008, "Wrong alignment on BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon");
static_assert(sizeof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon) == 0x000060, "Wrong size on BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, EntryPoint) == 0x000000, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, K2Node_CustomEvent_AI_Controller) == 0x000008, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::K2Node_CustomEvent_AI_Controller' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetRecognition_ReturnValue) == 0x000010, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_ReturnValue) == 0x000018, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_Found) == 0x00001C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_ReturnValue1) == 0x000020, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_Found1) == 0x000024, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_ReturnValue2) == 0x000028, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_Found2) == 0x00002C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_Found2' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_Square_ReturnValue) == 0x000030, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_ReturnValue3) == 0x000038, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetFloatParam_Found3) == 0x00003C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetFloatParam_Found3' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000040, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_Square_ReturnValue1) == 0x000048, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_Square_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetNormalAttackSkill_ReturnValue) == 0x000050, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetNormalAttackSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetAttackRangeOfSkill_ReturnValue) == 0x000058, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetAttackRangeOfSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon, CallFunc_GetAttackRangeOfSkill_Found) == 0x00005C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon::CallFunc_GetAttackRangeOfSkill_Found' has a wrong offset!");

// Function BTD_AJBCannotApproachToEnemySoon.BTD_AJBCannotApproachToEnemySoon_C.InitializeParameters
// 0x0008 (0x0008 - 0x0000)
struct BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters) == 0x000008, "Wrong alignment on BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters");
static_assert(sizeof(BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters) == 0x000008, "Wrong size on BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters, AI_Controller) == 0x000000, "Member 'BTD_AJBCannotApproachToEnemySoon_C_InitializeParameters::AI_Controller' has a wrong offset!");

// Function BTD_AJBCannotApproachToEnemySoon.BTD_AJBCannotApproachToEnemySoon_C.PerformConditionCheckAI
// 0x0088 (0x0088 - 0x0000)
struct BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocationDiffSq;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHP_Rep_HP;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSafeAreaSmall_ReturnValue;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNormalAttackSkill_ReturnValue;         // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttackRangeOfSkill_ReturnValue;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttackRangeOfSkill_Found;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI) == 0x000088, "Wrong size on BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, LocationDiffSq) == 0x000014, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::LocationDiffSq' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000019, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000020, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetLocation_ReturnValue) == 0x000028, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, Temp_bool_Has_Been_Initd_Variable) == 0x000034, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetHP_Rep_HP) == 0x000038, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetHP_Rep_HP' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_IsSafeAreaSmall_ReturnValue) == 0x00003D, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_IsSafeAreaSmall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, Temp_bool_IsClosed_Variable) == 0x00003E, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000040, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetValueAsObject_ReturnValue) == 0x000048, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000050, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetNormalAttackSkill_ReturnValue) == 0x000060, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetNormalAttackSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetLocation_ReturnValue1) == 0x000068, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetAttackRangeOfSkill_ReturnValue) == 0x000074, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetAttackRangeOfSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_GetAttackRangeOfSkill_Found) == 0x000078, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_GetAttackRangeOfSkill_Found' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x00007C, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI, CallFunc_Less_FloatFloat_ReturnValue) == 0x000084, "Member 'BTD_AJBCannotApproachToEnemySoon_C_PerformConditionCheckAI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

