#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfDamaged_Paramed

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_AJBJumpIfDamaged_Paramed.BTS_AJBJumpIfDamaged_Paramed_C
// 0x0040 (0x00D8 - 0x0098)
class UBTS_AJBJumpIfDamaged_Paramed_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	float                                         ProbabilityParam;                                  // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 InputDestinationKey;                               // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FName                                   Probability;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_AJBJumpIfDamaged_Paramed_C">();
	}
	static class UBTS_AJBJumpIfDamaged_Paramed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBJumpIfDamaged_Paramed_C>();
	}
};
static_assert(alignof(UBTS_AJBJumpIfDamaged_Paramed_C) == 0x000008, "Wrong alignment on UBTS_AJBJumpIfDamaged_Paramed_C");
static_assert(sizeof(UBTS_AJBJumpIfDamaged_Paramed_C) == 0x0000D8, "Wrong size on UBTS_AJBJumpIfDamaged_Paramed_C");
static_assert(offsetof(UBTS_AJBJumpIfDamaged_Paramed_C, UberGraphFrame) == 0x000098, "Member 'UBTS_AJBJumpIfDamaged_Paramed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfDamaged_Paramed_C, ProbabilityParam) == 0x0000A0, "Member 'UBTS_AJBJumpIfDamaged_Paramed_C::ProbabilityParam' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfDamaged_Paramed_C, InputDestinationKey) == 0x0000A8, "Member 'UBTS_AJBJumpIfDamaged_Paramed_C::InputDestinationKey' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfDamaged_Paramed_C, Probability) == 0x0000D0, "Member 'UBTS_AJBJumpIfDamaged_Paramed_C::Probability' has a wrong offset!");

}

