#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfExpectedToCollideSHA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBJumpIfExpectedToCollideSHA.BTS_AJBJumpIfExpectedToCollideSHA_C.ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA
// 0x0108 (0x0108 - 0x0000)
struct BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumping_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_AI_CanSHAReachEnemyIfJumpOver_JumpTypeOrEmpty; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEventTagLocker*                        CallFunc_SpawnEventTagLocker_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA) == 0x000008, "Wrong alignment on BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA");
static_assert(sizeof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA) == 0x000108, "Wrong size on BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, EntryPoint) == 0x000000, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000005, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_Event_OwnerController1) == 0x000008, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_Event_ControlledPawn1) == 0x000010, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, Temp_bool_Has_Been_Initd_Variable1) == 0x00001C, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetInput_ReturnValue) == 0x000020, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetRecognition_ReturnValue) == 0x000028, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000030, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetForwardVector_ReturnValue) == 0x000038, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000044, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_IsValidAILocation_ReturnValue) == 0x00005C, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetLocation_ReturnValue) == 0x000060, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_Add_VectorVector_ReturnValue) == 0x00006C, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_IsJumping_ReturnValue) == 0x000078, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_IsJumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, Temp_bool_IsClosed_Variable) == 0x000079, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000080, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetValueAsObject_ReturnValue) == 0x000088, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000090, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_Event_OwnerController) == 0x0000A0, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_Event_ControlledPawn) == 0x0000A8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, Temp_bool_IsClosed_Variable1) == 0x0000B0, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_AI_CanSHAReachEnemyIfJumpOver_JumpTypeOrEmpty) == 0x0000B8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_AI_CanSHAReachEnemyIfJumpOver_JumpTypeOrEmpty' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000C0, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetBlackboardKeyName_ReturnValue1) == 0x0000C8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetBlackboardKeyName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_SpawnEventTagLocker_ReturnValue) == 0x0000D0, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_SpawnEventTagLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_GetValueAsObject_ReturnValue1) == 0x0000D8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_GetValueAsObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_DynamicCast_AsActor) == 0x0000E0, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, K2Node_DynamicCast_bSuccess1) == 0x0000E8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000EC, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty) == 0x0000F8, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA, GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess) == 0x000100, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ExecuteUbergraph_BTS_AJBJumpIfExpectedToCollideSHA::GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess' has a wrong offset!");

// Function BTS_AJBJumpIfExpectedToCollideSHA.BTS_AJBJumpIfExpectedToCollideSHA_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBJumpIfExpectedToCollideSHA.BTS_AJBJumpIfExpectedToCollideSHA_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBJumpIfExpectedToCollideSHA_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

