#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBReachToLocationByPath

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.ExecuteUbergraph_BTS_AJBReachToLocationByPath
// 0x01F0 (0x01F0 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_OwnerController1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_ControlledPawn1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasObjectValue_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBAIBTExtension_C*                 CallFunc_GetBTExtension_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBTD_AJBExecutionNotifier_C*            CallFunc_GetExecutionNotifier_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        K2Node_DynamicCast_AsNavigation_Path;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0060(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidVectorValue_ReturnValue;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_OwnerController;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_ControlledPawn;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_CustomEvent_NodeResult;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIPathController_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockRequesting_ReturnValue;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_VectorDiffXYSq_ReturnValue;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsArrivedPathEnd_bArrivedPathEnd;         // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Trap;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIEnvironment_C*           CallFunc_GetEnvironment_ReturnValue;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Trap)>           K2Node_CreateDelegate_OutputDelegate1;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_AJBInGameAIEnvironment_C*           CallFunc_GetEnvironment_ReturnValue1;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNavigating_ReturnValue;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IfObstacleMayBeOnThePath_ReturnValue;     // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue1;  // 0x0184(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0198(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue2; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AAIController* OwnerController, class APawn* ControlledPawn)> K2Node_CreateDelegate_OutputDelegate2;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue2;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue1;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEventTagLocker*                        CallFunc_SpawnEventTagLocker_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue2;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath) == 0x000010, "Wrong alignment on BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath) == 0x0001F0, "Wrong size on BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, EntryPoint) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_OwnerController1) == 0x000008, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_ControlledPawn1) == 0x000010, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_Event_OwnerController) == 0x000018, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_HasObjectValue_ReturnValue) == 0x000028, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_HasObjectValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetBTExtension_ReturnValue) == 0x000030, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetBTExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetExecutionNotifier_ReturnValue) == 0x000038, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetExecutionNotifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000040, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000048, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_DynamicCast_AsNavigation_Path) == 0x000050, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_DynamicCast_AsNavigation_Path' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetDebugTags_ReturnValue) == 0x000060, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_HasTag_ReturnValue) == 0x000080, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsValidVectorValue_ReturnValue) == 0x000081, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsValidVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_Event_OwnerController1) == 0x000088, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_Event_ControlledPawn1) == 0x000090, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_OwnerController) == 0x0000A0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_ControlledPawn) == 0x0000A8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_NodeResult) == 0x0000B0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_NodeResult' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetTransform_ReturnValue) == 0x0000C0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000100, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000110, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetLocation_ReturnValue) == 0x000118, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsLockRequesting_ReturnValue) == 0x000124, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsLockRequesting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_AI_VectorDiffXYSq_ReturnValue) == 0x000128, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_AI_VectorDiffXYSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_Less_FloatFloat_ReturnValue) == 0x00012C, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetRecognition_ReturnValue) == 0x000130, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsEventTagLocked_ReturnValue) == 0x000138, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsEventTagLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsArrivedPathEnd_bArrivedPathEnd) == 0x000139, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsArrivedPathEnd_bArrivedPathEnd' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetRecognition_ReturnValue1) == 0x000140, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CustomEvent_Trap) == 0x000158, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CustomEvent_Trap' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetEnvironment_ReturnValue) == 0x000160, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetEnvironment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CreateDelegate_OutputDelegate1) == 0x000168, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetEnvironment_ReturnValue1) == 0x000178, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetEnvironment_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsValid_ReturnValue1) == 0x000180, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsNavigating_ReturnValue) == 0x000181, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsNavigating_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IfObstacleMayBeOnThePath_ReturnValue) == 0x000182, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IfObstacleMayBeOnThePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetBlackboardValueAsVector_ReturnValue1) == 0x000184, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetBlackboardValueAsVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000190, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetLocation_ReturnValue1) == 0x000198, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue2) == 0x0001A8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetRawPawn_ReturnValue) == 0x0001B0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetRawPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, K2Node_CreateDelegate_OutputDelegate2) == 0x0001B8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x0001C8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_GetRecognition_ReturnValue2) == 0x0001D0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_GetRecognition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsEventTagLocked_ReturnValue1) == 0x0001D8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsEventTagLocked_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_SpawnEventTagLocker_ReturnValue) == 0x0001E0, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_SpawnEventTagLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath, CallFunc_IsEventTagLocked_ReturnValue2) == 0x0001E8, "Member 'BTS_AJBReachToLocationByPath_C_ExecuteUbergraph_BTS_AJBReachToLocationByPath::CallFunc_IsEventTagLocked_ReturnValue2' has a wrong offset!");

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.OnTrapAdded
// 0x0008 (0x0008 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_OnTrapAdded final
{
public:
	class AActor*                                 Trap;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_OnTrapAdded) == 0x000008, "Wrong alignment on BTS_AJBReachToLocationByPath_C_OnTrapAdded");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_OnTrapAdded) == 0x000008, "Wrong size on BTS_AJBReachToLocationByPath_C_OnTrapAdded");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnTrapAdded, Trap) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_OnTrapAdded::Trap' has a wrong offset!");

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.OnExecutionFinish
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_OnExecutionFinish final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 NodeResult;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_OnExecutionFinish) == 0x000008, "Wrong alignment on BTS_AJBReachToLocationByPath_C_OnExecutionFinish");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_OnExecutionFinish) == 0x000018, "Wrong size on BTS_AJBReachToLocationByPath_C_OnExecutionFinish");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnExecutionFinish, OwnerController) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_OnExecutionFinish::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnExecutionFinish, ControlledPawn) == 0x000008, "Member 'BTS_AJBReachToLocationByPath_C_OnExecutionFinish::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnExecutionFinish, NodeResult) == 0x000010, "Member 'BTS_AJBReachToLocationByPath_C_OnExecutionFinish::NodeResult' has a wrong offset!");

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.OnExecutionStart
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_OnExecutionStart final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_OnExecutionStart) == 0x000008, "Wrong alignment on BTS_AJBReachToLocationByPath_C_OnExecutionStart");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_OnExecutionStart) == 0x000010, "Wrong size on BTS_AJBReachToLocationByPath_C_OnExecutionStart");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnExecutionStart, OwnerController) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_OnExecutionStart::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_OnExecutionStart, ControlledPawn) == 0x000008, "Member 'BTS_AJBReachToLocationByPath_C_OnExecutionStart::ControlledPawn' has a wrong offset!");

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBReachToLocationByPath_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBReachToLocationByPath_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBReachToLocationByPath_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBReachToLocationByPath.BTS_AJBReachToLocationByPath_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBReachToLocationByPath_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBReachToLocationByPath_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBReachToLocationByPath_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBReachToLocationByPath_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBReachToLocationByPath_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBReachToLocationByPath_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBReachToLocationByPath_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBReachToLocationByPath_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBReachToLocationByPath_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

