#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBKeepDistanceInBattle

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_AJBAICharacterSkillInfo_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBKeepDistanceInBattle.BTS_AJBKeepDistanceInBattle_C.ExecuteUbergraph_BTS_AJBKeepDistanceInBattle
// 0x0550 (0x0550 - 0x0000)
struct BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEventTagLocker*                        CallFunc_SpawnEventTagLocker_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSpeed_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAIBTExtension_C*                 CallFunc_GetBTExtension_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue1;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        K2Node_DynamicCast_AsNavigation_Path;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBodyHalfHeight_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBodyRadius_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBodyRadius_ReturnValue1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_DirectionXYOfCharacters_ReturnValue;   // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable1;                               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue;     // 0x00E8(0x0020)(HasGetValueTypeHash)
	float                                         CallFunc_GetAttackRangeOfSkill_ReturnValue;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttackRangeOfSkill_Found;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_OwnerController1;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_ControlledPawn1;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBTD_AJBExecutionNotifier_C*            CallFunc_GetExecutionNotifier_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue; // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x0138(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_CustomEvent_OwnerController;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_ControlledPawn;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_CustomEvent_NodeResult;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0xF];                                      // 0x0161(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIPathController_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_DirectionXYOfCharacters_ReturnValue1;  // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x01C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNavigating_ReturnValue;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue2;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0200(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHeadTopLocation_ReturnValue;           // 0x021C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue3;                 // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue;                      // 0x0234(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfCharacterInSight_ReturnValue;           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue4;                 // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue5;                 // 0x0258(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Square_ReturnValue;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue;             // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIEnvironment_C*           CallFunc_GetEnvironment_ReturnValue;               // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Trap;                           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Trap)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsNavigating_ReturnValue1;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IfObstacleMayBeOnThePath_ReturnValue;     // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue2; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue6;                 // 0x02B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character2; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue7;                 // 0x02DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsObservableCharacter_ReturnValue;        // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue2;               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found2;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue8;                 // 0x031C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array1;                           // 0x0328(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0338(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CapsuleTraceSingleForObjects_OutHit;      // 0x03C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleForObjects_ReturnValue; // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453[0x1];                                      // 0x0453(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x045C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0468(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0474(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0480(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x04B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBPlacementTrapBase_C*             K2Node_DynamicCast_AsBP_AJBPlacement_Trap_Base;    // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult)> K2Node_CreateDelegate_OutputDelegate2;             // 0x04E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_AI_DiffXYOfCharacters_ReturnValue;        // 0x04F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AAIController* OwnerController, class APawn* ControlledPawn)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0500(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x052C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0538(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingDamaged_ReturnValue;               // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle) == 0x000010, "Wrong alignment on BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle");
static_assert(sizeof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle) == 0x000550, "Wrong size on BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, EntryPoint) == 0x000000, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_SpawnEventTagLocker_ReturnValue) == 0x000008, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_SpawnEventTagLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_HasSpeed_ReturnValue) == 0x000010, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_HasSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000018, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000020, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_Event_OwnerController1) == 0x000030, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_Event_ControlledPawn1) == 0x000038, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_Event_OwnerController) == 0x000048, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_Event_ControlledPawn) == 0x000050, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBTExtension_ReturnValue) == 0x000058, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBTExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue) == 0x000060, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBlackboardValueAsObject_ReturnValue1) == 0x000070, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBlackboardValueAsObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_AsNavigation_Path) == 0x000078, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_AsNavigation_Path' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_bSuccess1) == 0x000080, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBodyHalfHeight_ReturnValue) == 0x000084, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBodyHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBodyRadius_ReturnValue) == 0x000088, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBodyRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, Temp_float_Variable) == 0x00008C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue1) == 0x000090, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBodyRadius_ReturnValue1) == 0x00009C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBodyRadius_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, Temp_float_Variable1) == 0x0000A4, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_AI_DirectionXYOfCharacters_ReturnValue) == 0x0000A8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_AI_DirectionXYOfCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B4, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, Temp_bool_Variable) == 0x0000C0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetRawPawn_ReturnValue) == 0x0000C8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetRawPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, Temp_bool_Variable1) == 0x0000E0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetNormalAttackSkillInfo_ReturnValue) == 0x0000E8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetNormalAttackSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetAttackRangeOfSkill_ReturnValue) == 0x000108, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetAttackRangeOfSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetAttackRangeOfSkill_Found) == 0x00010C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetAttackRangeOfSkill_Found' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_OwnerController1) == 0x000110, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_ControlledPawn1) == 0x000118, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetExecutionNotifier_ReturnValue) == 0x000120, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetExecutionNotifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue) == 0x000128, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue2) == 0x000138, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000148, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_OwnerController) == 0x000150, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_ControlledPawn) == 0x000158, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_NodeResult) == 0x000160, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_NodeResult' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetTransform_ReturnValue) == 0x000170, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001A0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetRecognition_ReturnValue) == 0x0001A8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_AI_DirectionXYOfCharacters_ReturnValue1) == 0x0001B8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_AI_DirectionXYOfCharacters_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0001C4, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IsNavigating_ReturnValue) == 0x0001D0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IsNavigating_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D4, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBlackboardValueAsObject_ReturnValue2) == 0x0001E0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBlackboardValueAsObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1) == 0x0001E8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_bSuccess2) == 0x0001F0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001F1, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001F4, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_ReturnValue) == 0x0001F8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_Found) == 0x0001FC, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_Color) == 0x000200, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000210, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x000218, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetHeadTopLocation_ReturnValue) == 0x00021C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetHeadTopLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue3) == 0x000228, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_AI_AddZ_ReturnValue) == 0x000234, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_AI_AddZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IfCharacterInSight_ReturnValue) == 0x000240, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IfCharacterInSight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue4) == 0x000244, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000250, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue5) == 0x000258, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x000264, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_ReturnValue1) == 0x000268, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_Found1) == 0x00026C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Less_FloatFloat_ReturnValue) == 0x00026D, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Square_ReturnValue) == 0x000270, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IsEventTagLocked_ReturnValue) == 0x000274, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IsEventTagLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_Not_PreBool_ReturnValue) == 0x000275, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetEnvironment_ReturnValue) == 0x000278, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetEnvironment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_BooleanAND_ReturnValue) == 0x000280, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_Trap) == 0x000288, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_Trap' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CreateDelegate_OutputDelegate) == 0x000290, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IsNavigating_ReturnValue1) == 0x0002A0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IsNavigating_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IfObstacleMayBeOnThePath_ReturnValue) == 0x0002A1, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IfObstacleMayBeOnThePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetControllingImaginaryCharacter_ReturnValue2) == 0x0002A8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetControllingImaginaryCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue6) == 0x0002B0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x0002C0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetValueAsObject_ReturnValue) == 0x0002C8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character2) == 0x0002D0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_DynamicCast_bSuccess3) == 0x0002D8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue7) == 0x0002DC, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x0002E8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_DamageType) == 0x0002F0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CustomEvent_DamageCauser) == 0x0002F8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_CreateDelegate_OutputDelegate1) == 0x000300, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_IsObservableCharacter_ReturnValue) == 0x000310, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_IsObservableCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_ReturnValue2) == 0x000314, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetFloatParam_Found2) == 0x000318, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetFloatParam_Found2' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_GetLocation_ReturnValue8) == 0x00031C, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_GetLocation_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, K2Node_MakeArray_Array1) == 0x000328, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000338, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0003C0, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_CapsuleTraceSingleForObjects_OutHit) == 0x0003C8, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_CapsuleTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_CapsuleTraceSingleForObjects_ReturnValue) == 0x000450, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_CapsuleTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_BreakHitResult_bBlockingHit) == 0x000451, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle, CallFunc_BreakHitResult_bInitialOverlap) == 0x000452, "Member 'BTS_AJBKeepDistanceInBattle_C_ExecuteUbergraph_BTS_AJBKeepDistanceInBattle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
