#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfDamaged_Paramed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBJumpIfDamaged_Paramed.BTS_AJBJumpIfDamaged_Paramed_C.ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed
// 0x00B0 (0x00B0 - 0x0000)
struct BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetImaginaryCharacterBody_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingDamagedFromPlayer_ReturnValue;     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumping_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed) == 0x000008, "Wrong alignment on BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed");
static_assert(sizeof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed) == 0x0000B0, "Wrong size on BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, EntryPoint) == 0x000000, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, K2Node_Event_OwnerController1) == 0x000008, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, K2Node_Event_ControlledPawn1) == 0x000010, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetInput_ReturnValue) == 0x000020, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000028, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetImaginaryCharacterBody_ReturnValue) == 0x000030, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetImaginaryCharacterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetRecognition_ReturnValue) == 0x000038, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetForwardVector_ReturnValue) == 0x000040, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_IsBeingDamagedFromPlayer_ReturnValue) == 0x00004C, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_IsBeingDamagedFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetLocation_ReturnValue) == 0x00005C, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_IsJumping_ReturnValue) == 0x000068, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_IsJumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_Add_VectorVector_ReturnValue) == 0x00006C, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_BooleanAND_ReturnValue) == 0x000079, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_BooleanAND_ReturnValue1) == 0x00007A, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x00007C, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_IsValidAILocation_ReturnValue) == 0x000088, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, K2Node_Event_OwnerController) == 0x000090, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, K2Node_Event_ControlledPawn) == 0x000098, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetRecognition_ReturnValue1) == 0x0000A0, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetFloatParam_ReturnValue) == 0x0000A8, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed, CallFunc_GetFloatParam_Found) == 0x0000AC, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ExecuteUbergraph_BTS_AJBJumpIfDamaged_Paramed::CallFunc_GetFloatParam_Found' has a wrong offset!");

// Function BTS_AJBJumpIfDamaged_Paramed.BTS_AJBJumpIfDamaged_Paramed_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBJumpIfDamaged_Paramed.BTS_AJBJumpIfDamaged_Paramed_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBJumpIfDamaged_Paramed_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

