#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpRandomly

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_AJBJumpRandomly.BTS_AJBJumpRandomly_C
// 0x0038 (0x00D0 - 0x0098)
class UBTS_AJBJumpRandomly_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	float                                         Probability;                                       // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 InputDestinationKey;                               // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTS_AJBJumpRandomly(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_AJBJumpRandomly_C">();
	}
	static class UBTS_AJBJumpRandomly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBJumpRandomly_C>();
	}
};
static_assert(alignof(UBTS_AJBJumpRandomly_C) == 0x000008, "Wrong alignment on UBTS_AJBJumpRandomly_C");
static_assert(sizeof(UBTS_AJBJumpRandomly_C) == 0x0000D0, "Wrong size on UBTS_AJBJumpRandomly_C");
static_assert(offsetof(UBTS_AJBJumpRandomly_C, UberGraphFrame) == 0x000098, "Member 'UBTS_AJBJumpRandomly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpRandomly_C, Probability) == 0x0000A0, "Member 'UBTS_AJBJumpRandomly_C::Probability' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpRandomly_C, InputDestinationKey) == 0x0000A8, "Member 'UBTS_AJBJumpRandomly_C::InputDestinationKey' has a wrong offset!");

}

