#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBSearchFollowEnemyAsMovableStand

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBSearchFollowEnemyAsMovableStand.BTS_AJBSearchFollowEnemyAsMovableStand_C.ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand
// 0x0198 (0x0198 - 0x0000)
struct BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindSpotAroundInEnvironmentBlocks_WaySpotLocation; // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FindSpotAroundInEnvironmentBlocks_House;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIHouseInfo_C*                   K2Node_DynamicCast_AsBP_AJBAIHouse_Info;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue1;  // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameWindow*                       CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIGionSource_C*                  K2Node_DynamicCast_AsBP_AJBAIGion_Source;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue1; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue;                      // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue1;                     // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue2;                     // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue2; // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_CustomEvent_AI_Controller;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue1;  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBAIGionSource_C*                  K2Node_DynamicCast_AsBP_AJBAIGion_Source1;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0160(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue3;                     // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue;               // 0x0184(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand) == 0x000008, "Wrong alignment on BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand");
static_assert(sizeof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand) == 0x000198, "Wrong size on BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, EntryPoint) == 0x000000, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000004, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_Event_OwnerController1) == 0x000010, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_Event_ControlledPawn1) == 0x000018, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000028, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000030, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetValueAsObject_ReturnValue) == 0x000038, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetLocation_ReturnValue) == 0x000040, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000050, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_VectorDiffSq_ReturnValue) == 0x00005C, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_VectorDiffSq_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetLocation_ReturnValue1) == 0x000060, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetRecognition_ReturnValue) == 0x000070, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_FindSpotAroundInEnvironmentBlocks_WaySpotLocation) == 0x000078, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_FindSpotAroundInEnvironmentBlocks_WaySpotLocation' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_FindSpotAroundInEnvironmentBlocks_House) == 0x000088, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_FindSpotAroundInEnvironmentBlocks_House' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_AsBP_AJBAIHouse_Info) == 0x000090, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_AsBP_AJBAIHouse_Info' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_bSuccess1) == 0x000098, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetBlackboardValueAsVector_ReturnValue1) == 0x00009C, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetBlackboardValueAsVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_Array_LastIndex_ReturnValue) == 0x0000A8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000AC, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x0000B0, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_AsBP_AJBAIGion_Source) == 0x0000C0, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_AsBP_AJBAIGion_Source' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000D8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue) == 0x0000E4, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue1) == 0x0000E8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_AddZ_ReturnValue) == 0x0000EC, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_AddZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_AddZ_ReturnValue1) == 0x0000F8, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_AddZ_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_RandomFloatInRange_ReturnValue) == 0x000104, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_AddZ_ReturnValue2) == 0x000108, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_AddZ_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, Temp_bool_Has_Been_Initd_Variable) == 0x000114, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_Event_OwnerController) == 0x000118, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_Event_ControlledPawn) == 0x000120, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_Square_ReturnValue) == 0x000128, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue2) == 0x00012C, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetHalfHeightOfLargestCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_CustomEvent_AI_Controller) == 0x000130, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_CustomEvent_AI_Controller' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetBlackboardValueAsObject_ReturnValue1) == 0x000138, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetBlackboardValueAsObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x000140, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_AsBP_AJBAIGion_Source1) == 0x000148, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_AsBP_AJBAIGion_Source1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, K2Node_DynamicCast_bSuccess3) == 0x000150, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000158, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000160, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_GetLocation_ReturnValue2) == 0x00016C, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_AddZ_ReturnValue3) == 0x000178, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_AddZ_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_AI_GetLogColor_ReturnValue) == 0x000184, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_AI_GetLogColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000194, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, Temp_bool_IsClosed_Variable) == 0x000195, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand, CallFunc_Less_FloatFloat_ReturnValue) == 0x000196, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ExecuteUbergraph_BTS_AJBSearchFollowEnemyAsMovableStand::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BTS_AJBSearchFollowEnemyAsMovableStand.BTS_AJBSearchFollowEnemyAsMovableStand_C.DebugDrawDestination
// 0x0008 (0x0008 - 0x0000)
struct BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination) == 0x000008, "Wrong alignment on BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination");
static_assert(sizeof(BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination) == 0x000008, "Wrong size on BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination, AI_Controller) == 0x000000, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_DebugDrawDestination::AI_Controller' has a wrong offset!");

// Function BTS_AJBSearchFollowEnemyAsMovableStand.BTS_AJBSearchFollowEnemyAsMovableStand_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBSearchFollowEnemyAsMovableStand.BTS_AJBSearchFollowEnemyAsMovableStand_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBSearchFollowEnemyAsMovableStand_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
