#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfOnSlopeSHA

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_AJBJumpIfOnSlopeSHA.BTS_AJBJumpIfOnSlopeSHA_C
// 0x0068 (0x0100 - 0x0098)
class UBTS_AJBJumpIfOnSlopeSHA_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	float                                         DegreeSlopeThresh;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 InputDestinationKey;                               // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector                                V1;                                                // 0x00D0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V2;                                                // 0x00DC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V3;                                                // 0x00E8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V4;                                                // 0x00F4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_AJBJumpIfOnSlopeSHA_C">();
	}
	static class UBTS_AJBJumpIfOnSlopeSHA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBJumpIfOnSlopeSHA_C>();
	}
};
static_assert(alignof(UBTS_AJBJumpIfOnSlopeSHA_C) == 0x000008, "Wrong alignment on UBTS_AJBJumpIfOnSlopeSHA_C");
static_assert(sizeof(UBTS_AJBJumpIfOnSlopeSHA_C) == 0x000100, "Wrong size on UBTS_AJBJumpIfOnSlopeSHA_C");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, UberGraphFrame) == 0x000098, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, DegreeSlopeThresh) == 0x0000A0, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::DegreeSlopeThresh' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, InputDestinationKey) == 0x0000A8, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::InputDestinationKey' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, V1) == 0x0000D0, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::V1' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, V2) == 0x0000DC, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::V2' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, V3) == 0x0000E8, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::V3' has a wrong offset!");
static_assert(offsetof(UBTS_AJBJumpIfOnSlopeSHA_C, V4) == 0x0000F4, "Member 'UBTS_AJBJumpIfOnSlopeSHA_C::V4' has a wrong offset!");

}

