#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBRunIntoSaferAreaCenter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBRunIntoSaferAreaCenter.BTT_AJBRunIntoSaferAreaCenter_C.ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter
// 0x00A0 (0x00A0 - 0x0000)
struct BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSpeed_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBAIPathController_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetRandomPathForSaferArea_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPath_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNavigating_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter) == 0x000010, "Wrong alignment on BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter");
static_assert(sizeof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter) == 0x0000A0, "Wrong size on BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, EntryPoint) == 0x000000, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000008, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_HasSpeed_ReturnValue) == 0x000010, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_HasSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, K2Node_Event_OwnerController1) == 0x000018, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, K2Node_Event_ControlledPawn1) == 0x000020, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, K2Node_Event_OwnerController) == 0x000028, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, Temp_bool_Has_Been_Initd_Variable) == 0x000070, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000088, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_GetRandomPathForSaferArea_ReturnValue) == 0x000090, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_GetRandomPathForSaferArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_IsValidPath_ReturnValue) == 0x000098, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_IsValidPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter, CallFunc_IsNavigating_ReturnValue) == 0x000099, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter::CallFunc_IsNavigating_ReturnValue' has a wrong offset!");

// Function BTT_AJBRunIntoSaferAreaCenter.BTT_AJBRunIntoSaferAreaCenter_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI");
static_assert(sizeof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_AJBRunIntoSaferAreaCenter.BTT_AJBRunIntoSaferAreaCenter_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBRunIntoSaferAreaCenter.BTT_AJBRunIntoSaferAreaCenter_C.GetRandomPathForSaferArea
// 0x00F0 (0x00F0 - 0x0000)
struct BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea final
{
public:
	class AAIController*                          AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RatioOfRadius;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirForSaferAreaCenter;                             // 0x0018(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomDeviation;                                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        Result;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 RandomRotations;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_GetSaferArea_Location;                    // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSaferArea_Radius;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSaferArea_Location1;                   // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSaferArea_Radius1;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea) == 0x000008, "Wrong alignment on BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea");
static_assert(sizeof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea) == 0x0000F0, "Wrong size on BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, AIController) == 0x000000, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::AIController' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, RatioOfRadius) == 0x000008, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::RatioOfRadius' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, ReturnValue) == 0x000010, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, DirForSaferAreaCenter) == 0x000018, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::DirForSaferAreaCenter' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, RandomDeviation) == 0x000024, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::RandomDeviation' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, Result) == 0x000028, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::Result' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, RandomRotations) == 0x000030, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::RandomRotations' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000048, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetLocation_ReturnValue) == 0x000054, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetRecognition_ReturnValue) == 0x000060, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, K2Node_MakeArray_Array) == 0x000068, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetSaferArea_Location) == 0x000078, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetSaferArea_Location' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetSaferArea_Radius) == 0x000084, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetSaferArea_Radius' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, Temp_bool_True_if_break_was_hit_Variable) == 0x000094, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Normal_ReturnValue) == 0x000098, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Not_PreBool_ReturnValue) == 0x0000A4, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetRecognition_ReturnValue1) == 0x0000A8, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x0000B0, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetSaferArea_Location1) == 0x0000B8, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetSaferArea_Location1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetSaferArea_Radius1) == 0x0000C4, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetSaferArea_Radius1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_GetLocation_ReturnValue1) == 0x0000C8, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x0000D8, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, Temp_int_Array_Index_Variable) == 0x0000E4, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea, CallFunc_BooleanAND_ReturnValue) == 0x0000ED, "Member 'BTT_AJBRunIntoSaferAreaCenter_C_GetRandomPathForSaferArea::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

