#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindNearestDoor

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBFindNearestDoor.BTT_AJBFindNearestDoor_C.ExecuteUbergraph_BTT_AJBFindNearestDoor
// 0x0098 (0x0098 - 0x0000)
struct BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue;               // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue1;              // 0x0014(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue1;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindNearestDoor_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindNearestDoor_PathToNearestActor1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor) == 0x000008, "Wrong alignment on BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor");
static_assert(sizeof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor) == 0x000098, "Wrong size on BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, EntryPoint) == 0x000000, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_AI_GetLogColor_ReturnValue) == 0x000004, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_AI_GetLogColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_AI_GetLogColor_ReturnValue1) == 0x000014, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_AI_GetLogColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, K2Node_Event_OwnerController) == 0x000028, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x000038, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000040, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_IfDebugDrawOnTask_ReturnValue1) == 0x000048, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_IfDebugDrawOnTask_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_GetLocation_ReturnValue) == 0x00004C, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_GetRecognition_ReturnValue) == 0x000058, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_FindNearestDoor_ReturnValue) == 0x000060, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_FindNearestDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_FindNearestDoor_PathToNearestActor1) == 0x000068, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_FindNearestDoor_PathToNearestActor1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_GetActorBounds_Origin) == 0x000074, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_GetActorBounds_BoxExtent) == 0x000080, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'BTT_AJBFindNearestDoor_C_ExecuteUbergraph_BTT_AJBFindNearestDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BTT_AJBFindNearestDoor.BTT_AJBFindNearestDoor_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBFindNearestDoor_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindNearestDoor_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBFindNearestDoor_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBFindNearestDoor_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBFindNearestDoor_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBFindNearestDoor_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFindNearestDoor_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBFindNearestDoor.BTT_AJBFindNearestDoor_C.FindNearestDoor
// 0x04F0 (0x04F0 - 0x0000)
struct BTT_AJBFindNearestDoor_C_FindNearestDoor final
{
public:
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 DoorObjectToIgnore;                                // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        PathToNearestActor1;                               // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TargetDoors;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	bool                                          bIgnoreZDiff;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        PathToNearestActor;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZDiffThresh;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceSqTemp;                                    // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearestDistanceSq;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NearestActor;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetIndoorHouse_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBAIEnvironmentBlock*                 CallFunc_GetEnvironmentBlockSelf_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBAIHouseInfo_C*                   CallFunc_FindHouseInfoInEnvironmentBlock_AsHouseInfo; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterLocation_ReturnValue;            // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0118(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0170(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	class UBP_AJBInGameAIEnvironment_C*           CallFunc_GetEnvironment_ReturnValue;               // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x01D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0228(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0240(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0280(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x02C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0300(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0310(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0320(0x0018)()
	float                                         CallFunc_BreakVector_X1;                           // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x0348(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData8;             // 0x0388(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData9;             // 0x03C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0408(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x0418(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0428(0x0018)()
	bool                                          CallFunc_IsIndoor_ReturnValue;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0470(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item1;                          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0490(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x04A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x04AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue3;                 // 0x04B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPathValidAndReachable_ReturnValue;      // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x04EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AJBFindNearestDoor_C_FindNearestDoor) == 0x000008, "Wrong alignment on BTT_AJBFindNearestDoor_C_FindNearestDoor");
static_assert(sizeof(BTT_AJBFindNearestDoor_C_FindNearestDoor) == 0x0004F0, "Wrong size on BTT_AJBFindNearestDoor_C_FindNearestDoor");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_FindNearestDoor, Recognition) == 0x000000, "Member 'BTT_AJBFindNearestDoor_C_FindNearestDoor::Recognition' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_FindNearestDoor, DoorObjectToIgnore) == 0x000008, "Member 'BTT_AJBFindNearestDoor_C_FindNearestDoor::DoorObjectToIgnore' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindNearestDoor_C_FindNearestDoor, ReturnValue) == 0x000030, "Member 'BTT_AJBFindNearestDoor_C_FindNearestDoor::ReturnValue' has a wrong offset!");
