#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBCrouchIfNot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_AJBCrouchIfNot.BTT_AJBCrouchIfNot_C.ExecuteUbergraph_BTT_AJBCrouchIfNot
// 0x0030 (0x0030 - 0x0000)
struct BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfCrouching_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot) == 0x000008, "Wrong alignment on BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot");
static_assert(sizeof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot) == 0x000030, "Wrong size on BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, EntryPoint) == 0x000000, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, CallFunc_GetInput_ReturnValue) == 0x000018, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, CallFunc_GetRecognition_ReturnValue) == 0x000020, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot, CallFunc_IfCrouching_ReturnValue) == 0x000028, "Member 'BTT_AJBCrouchIfNot_C_ExecuteUbergraph_BTT_AJBCrouchIfNot::CallFunc_IfCrouching_ReturnValue' has a wrong offset!");

// Function BTT_AJBCrouchIfNot.BTT_AJBCrouchIfNot_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBCrouchIfNot_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBCrouchIfNot_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBCrouchIfNot_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBCrouchIfNot_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBCrouchIfNot_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBCrouchIfNot_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBCrouchIfNot_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBCrouchIfNot_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

