#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindSpotSideways

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AJBFindSpotSideways.BTT_AJBFindSpotSideways_C
// 0x00A0 (0x0140 - 0x00A0)
class UBTT_AJBFindSpotSideways_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FVector                                DirectionToEnemyXY;                                // 0x00A8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 WaySpotKey;                                        // 0x00B8(0x0028)(Edit, BlueprintVisible)
	struct FVector                                WaySpotTemp;                                       // 0x00E0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 PathToWaySpotKey;                                  // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RO_AttackingGionKey;                               // 0x0118(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_AJBFindSpotSideways(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_AJBFindSpotSideways_C">();
	}
	static class UBTT_AJBFindSpotSideways_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBFindSpotSideways_C>();
	}
};
static_assert(alignof(UBTT_AJBFindSpotSideways_C) == 0x000008, "Wrong alignment on UBTT_AJBFindSpotSideways_C");
static_assert(sizeof(UBTT_AJBFindSpotSideways_C) == 0x000140, "Wrong size on UBTT_AJBFindSpotSideways_C");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_AJBFindSpotSideways_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, DirectionToEnemyXY) == 0x0000A8, "Member 'UBTT_AJBFindSpotSideways_C::DirectionToEnemyXY' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, WaySpotKey) == 0x0000B8, "Member 'UBTT_AJBFindSpotSideways_C::WaySpotKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, WaySpotTemp) == 0x0000E0, "Member 'UBTT_AJBFindSpotSideways_C::WaySpotTemp' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, PathToWaySpotKey) == 0x0000F0, "Member 'UBTT_AJBFindSpotSideways_C::PathToWaySpotKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindSpotSideways_C, RO_AttackingGionKey) == 0x000118, "Member 'UBTT_AJBFindSpotSideways_C::RO_AttackingGionKey' has a wrong offset!");

}

