#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindNearestDoor

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AJBFindNearestDoor.BTT_AJBFindNearestDoor_C
// 0x0080 (0x0120 - 0x00A0)
class UBTT_AJBFindNearestDoor_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 DoorActorKey;                                      // 0x00A8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 PathToDoorKey;                                     // 0x00D0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 DestinationKey;                                    // 0x00F8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_AJBFindNearestDoor(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	class AActor* FindNearestDoor(class UBP_AJBInGameAIRecognition_C* Recognition, const struct FBlackboardKeySelector& DoorObjectToIgnore, class UNavigationPath** PathToNearestActor1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_AJBFindNearestDoor_C">();
	}
	static class UBTT_AJBFindNearestDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBFindNearestDoor_C>();
	}
};
static_assert(alignof(UBTT_AJBFindNearestDoor_C) == 0x000008, "Wrong alignment on UBTT_AJBFindNearestDoor_C");
static_assert(sizeof(UBTT_AJBFindNearestDoor_C) == 0x000120, "Wrong size on UBTT_AJBFindNearestDoor_C");
static_assert(offsetof(UBTT_AJBFindNearestDoor_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_AJBFindNearestDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindNearestDoor_C, DoorActorKey) == 0x0000A8, "Member 'UBTT_AJBFindNearestDoor_C::DoorActorKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindNearestDoor_C, PathToDoorKey) == 0x0000D0, "Member 'UBTT_AJBFindNearestDoor_C::PathToDoorKey' has a wrong offset!");
static_assert(offsetof(UBTT_AJBFindNearestDoor_C, DestinationKey) == 0x0000F8, "Member 'UBTT_AJBFindNearestDoor_C::DestinationKey' has a wrong offset!");

}

