#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBClearValue

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AJBClearValue.BTT_AJBClearValue_C
// 0x0080 (0x0120 - 0x00A0)
class UBTT_AJBClearValue_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Key1;                                              // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 Key2;                                              // 0x00D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 Key3;                                              // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTT_AJBClearValue(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_AJBClearValue_C">();
	}
	static class UBTT_AJBClearValue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBClearValue_C>();
	}
};
static_assert(alignof(UBTT_AJBClearValue_C) == 0x000008, "Wrong alignment on UBTT_AJBClearValue_C");
static_assert(sizeof(UBTT_AJBClearValue_C) == 0x000120, "Wrong size on UBTT_AJBClearValue_C");
static_assert(offsetof(UBTT_AJBClearValue_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_AJBClearValue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_AJBClearValue_C, Key1) == 0x0000A8, "Member 'UBTT_AJBClearValue_C::Key1' has a wrong offset!");
static_assert(offsetof(UBTT_AJBClearValue_C, Key2) == 0x0000D0, "Member 'UBTT_AJBClearValue_C::Key2' has a wrong offset!");
static_assert(offsetof(UBTT_AJBClearValue_C, Key3) == 0x0000F8, "Member 'UBTT_AJBClearValue_C::Key3' has a wrong offset!");

}

