#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBTryInteract

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBTryInteract.BTT_AJBTryInteract_C.ExecuteUbergraph_BTT_AJBTryInteract
// 0x05D8 (0x05D8 - 0x0000)
struct BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBGate_C*                          K2Node_DynamicCast_AsBP_AJBGate;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetRawActorFromBlackboardCharacterValue_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  CallFunc_GetComponentsByTag_ReturnValue;           // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UBoxComponent*                          CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController2;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn2;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetImaginaryCharacterBody_ReturnValue;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x011C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue1;  // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInteractActor_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_InteractActor;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* InteractActor)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* InteractActor)>  K2Node_CreateDelegate_OutputDelegate1;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInteracting_ReturnValue;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue;               // 0x0198(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue1;              // 0x01A8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteracting_ReturnValue1;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBreastLocation_ReturnValue;            // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_ReturnValue;              // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue1;                      // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue2;              // 0x01F8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue1;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue3;                 // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0218(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_ReturnValue1;             // 0x0224(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0234(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0240(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHeadTopLocation_ReturnValue;           // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x025C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBreastLocation_ReturnValue1;           // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBreastLocation_ReturnValue2;           // 0x0274(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x0280(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x028C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AI_GetLogColor_ReturnValue3;              // 0x0298(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x02A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfDebugDrawOnTask_ReturnValue2;           // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue4;                 // 0x02B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x02C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBreastLocation_ReturnValue3;           // 0x02D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue;             // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF[0x1];                                      // 0x02DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInteractAction_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue1;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue2;            // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_RemoveZ_ReturnValue;                   // 0x0308(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0314(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue1;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_RemoveZ_ReturnValue1;                  // 0x0340(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x034C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x0358(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetRawBodyActor_ReturnValue;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0370(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue; // 0x0380(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_GetLocation_ReturnValue5;                 // 0x0390(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin1;                   // 0x039C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent1;                // 0x03A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x03B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue5;        // 0x0444(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x0450(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0468(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0474(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0480(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x048C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x04C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetImaginaryCharacterBody_ReturnValue1;   // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue2;               // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetImaginaryCharacterBody_ReturnValue2;   // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue3;               // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue1;                     // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x05A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract) == 0x000008, "Wrong alignment on BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract");
static_assert(sizeof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract) == 0x0005D8, "Wrong size on BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, EntryPoint) == 0x000000, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_DynamicCast_AsBP_AJBGate) == 0x000008, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_DynamicCast_AsBP_AJBGate' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetActorBounds_Origin) == 0x000014, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetActorBounds_BoxExtent) == 0x000020, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue) == 0x00002C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000048, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Normal_ReturnValue) == 0x000050, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetRawActorFromBlackboardCharacterValue_ReturnValue) == 0x000060, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetRawActorFromBlackboardCharacterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetComponentsByTag_ReturnValue) == 0x000068, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Array_Get_Item) == 0x000078, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000080, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_OwnerController1) == 0x000088, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_ControlledPawn1) == 0x000090, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue1) == 0x00009C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_OwnerController2) == 0x0000A8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_OwnerController2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_ControlledPawn2) == 0x0000B0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_ControlledPawn2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetInput_ReturnValue) == 0x0000D0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetRecognition_ReturnValue) == 0x0000D8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetImaginaryCharacterBody_ReturnValue) == 0x0000E0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetImaginaryCharacterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IfDebugDrawOnTask_ReturnValue) == 0x0000E8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IfDebugDrawOnTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x0000F0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetValueAsObject_ReturnValue) == 0x0000F8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue2) == 0x000100, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000110, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x00011C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBlackboardValueAsVector_ReturnValue1) == 0x000128, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBlackboardValueAsVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, Temp_bool_IsClosed_Variable) == 0x000134, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, Temp_bool_Has_Been_Initd_Variable) == 0x000135, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_CustomEvent_TargetActor) == 0x000138, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetInteractActor_ReturnValue) == 0x000140, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetInteractActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000148, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_CustomEvent_InteractActor) == 0x000150, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_CustomEvent_InteractActor' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_OwnerController) == 0x000158, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_Event_ControlledPawn) == 0x000160, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000168, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_CreateDelegate_OutputDelegate1) == 0x000180, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsInteracting_ReturnValue) == 0x000190, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsValid_ReturnValue1) == 0x000191, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000192, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsValid_ReturnValue2) == 0x000193, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsAlive_ReturnValue) == 0x000194, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000195, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_GetLogColor_ReturnValue) == 0x000198, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_GetLogColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_GetLogColor_ReturnValue1) == 0x0001A8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_GetLogColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsInteracting_ReturnValue1) == 0x0001B8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsInteracting_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsValid_ReturnValue3) == 0x0001B9, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBreastLocation_ReturnValue) == 0x0001BC, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBreastLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetFootLocation_ReturnValue) == 0x0001C8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetFootLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x0001D4, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Normal_ReturnValue1) == 0x0001E0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Normal_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0001EC, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_GetLogColor_ReturnValue2) == 0x0001F8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_GetLogColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IfDebugDrawOnTask_ReturnValue1) == 0x000208, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IfDebugDrawOnTask_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue3) == 0x00020C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue1) == 0x000218, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetFootLocation_ReturnValue1) == 0x000224, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetFootLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsValid_ReturnValue4) == 0x000230, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetComponentBounds_Origin) == 0x000234, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetComponentBounds_BoxExtent) == 0x000240, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetComponentBounds_SphereRadius) == 0x00024C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetHeadTopLocation_ReturnValue) == 0x000250, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetHeadTopLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x00025C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBreastLocation_ReturnValue1) == 0x000268, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBreastLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBreastLocation_ReturnValue2) == 0x000274, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBreastLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Subtract_VectorVector_ReturnValue3) == 0x000280, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Subtract_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Normal_ReturnValue2) == 0x00028C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_GetLogColor_ReturnValue3) == 0x000298, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_GetLogColor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0002A8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IfDebugDrawOnTask_ReturnValue2) == 0x0002B4, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IfDebugDrawOnTask_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue4) == 0x0002B8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue2) == 0x0002C4, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetBreastLocation_ReturnValue3) == 0x0002D0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetBreastLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002DC, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsEventTagLocked_ReturnValue) == 0x0002DD, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsEventTagLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BooleanAND_ReturnValue) == 0x0002DE, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetRawPawn_ReturnValue) == 0x0002E0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetRawPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetComponentByClass_ReturnValue) == 0x0002E8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsEventTagLocked_ReturnValue1) == 0x0002F0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsEventTagLocked_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_IsEventTagLocked_ReturnValue2) == 0x0002F1, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_IsEventTagLocked_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetObjectName_ReturnValue) == 0x0002F8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_RemoveZ_ReturnValue) == 0x000308, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_RemoveZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x000314, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue3) == 0x000320, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, Temp_bool_Has_Been_Initd_Variable1) == 0x00032C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetObjectName_ReturnValue1) == 0x000330, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetObjectName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AI_RemoveZ_ReturnValue1) == 0x000340, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AI_RemoveZ_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue4) == 0x00034C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue4) == 0x000358, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000364, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetRawBodyActor_ReturnValue) == 0x000368, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetRawBodyActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, K2Node_MakeArray_Array) == 0x000370, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue) == 0x000380, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetLocation_ReturnValue5) == 0x000390, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetActorBounds_Origin1) == 0x00039C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetActorBounds_Origin1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_GetActorBounds_BoxExtent1) == 0x0003A8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_GetActorBounds_BoxExtent1' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0003B8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000440, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Multiply_VectorFloat_ReturnValue5) == 0x000444, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Multiply_VectorFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_Add_VectorVector_ReturnValue5) == 0x000450, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_bBlockingHit) == 0x00045C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_bInitialOverlap) == 0x00045D, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_Time) == 0x000460, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_Distance) == 0x000464, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_Location) == 0x000468, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_ImpactPoint) == 0x000474, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_Normal) == 0x000480, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_ImpactNormal) == 0x00048C, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_PhysMat) == 0x000498, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_HitActor) == 0x0004A0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_HitComponent) == 0x0004A8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_HitBoneName) == 0x0004B0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_HitItem) == 0x0004B8, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_FaceIndex) == 0x0004BC, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract, CallFunc_BreakHitResult_TraceStart) == 0x0004C0, "Member 'BTT_AJBTryInteract_C_ExecuteUbergraph_BTT_AJBTryInteract::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
