#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindSpotToGetIntoSafeArea

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBFindSpotToGetIntoSafeArea.BTT_AJBFindSpotToGetIntoSafeArea_C.ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea
// 0x0158 (0x0158 - 0x0000)
struct BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSafeArea_Location;                     // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeArea_Radius;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetSafeArea_Location;               // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetSafeArea_Radius;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventTagLocked_ReturnValue1;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spot;                           // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSafeAreaSmall_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSafeArea_Location1;                    // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeArea_Radius1;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetSafeArea_Location1;              // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetSafeArea_Radius1;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation; // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FindNearestSpotInEnvironmentBlocks_House; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound1; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation1; // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindNearestSpotInEnvironmentBlocks_House1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNearestHouseEntrance_ReturnValue;      // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetNearestHouseEntrance_GateActor;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNearestHouseEntrance_Succeeded;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetNearestHouseEntrance_ReturnValue1;     // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNearestHouseEntrance_GateActor1;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNearestHouseEntrance_Succeeded1;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractDirectionForGate_ReturnValue;  // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AI_XYNearer_IfLocation1Nearer;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractDirectionForGate_ReturnValue1; // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AI_XYNearer_IfLocation1Nearer1;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPathValidAndReachable_ReturnValue;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea) == 0x000008, "Wrong alignment on BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea");
static_assert(sizeof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea) == 0x000158, "Wrong size on BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, EntryPoint) == 0x000000, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetRawPawn_ReturnValue) == 0x000008, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetRawPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetSafeArea_Location) == 0x000010, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetSafeArea_Location' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetSafeArea_Radius) == 0x00001C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetSafeArea_Radius' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetLocation_ReturnValue) == 0x000020, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetTargetSafeArea_Location) == 0x00002C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetTargetSafeArea_Location' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetTargetSafeArea_Radius) == 0x000038, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetTargetSafeArea_Radius' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_IsEventTagLocked_ReturnValue) == 0x00003C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_IsEventTagLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, Temp_bool_Has_Been_Initd_Variable) == 0x00003D, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_IsEventTagLocked_ReturnValue1) == 0x00003E, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_IsEventTagLocked_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetLocation_ReturnValue1) == 0x000040, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetLocation_ReturnValue2) == 0x00004C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, K2Node_CustomEvent_Spot) == 0x000058, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::K2Node_CustomEvent_Spot' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x000068, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_RandomFloatInRange_ReturnValue) == 0x000070, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetFloatParam_ReturnValue) == 0x000074, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetFloatParam_Found) == 0x000078, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_Less_FloatFloat_ReturnValue) == 0x000079, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_RandomFloatInRange_ReturnValue1) == 0x00007C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000080, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_IsSafeAreaSmall_ReturnValue) == 0x000081, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_IsSafeAreaSmall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetFloatParam_ReturnValue1) == 0x000084, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetFloatParam_Found1) == 0x000088, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetSafeArea_Location1) == 0x00008C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetSafeArea_Location1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetSafeArea_Radius1) == 0x000098, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetSafeArea_Radius1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetTargetSafeArea_Location1) == 0x00009C, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetTargetSafeArea_Location1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetTargetSafeArea_Radius1) == 0x0000A8, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetTargetSafeArea_Radius1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound) == 0x0000AC, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation) == 0x0000B0, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_House) == 0x0000C0, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_House' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound1) == 0x0000C8, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotFound1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation1) == 0x0000CC, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_WaySpotLocation1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_FindNearestSpotInEnvironmentBlocks_House1) == 0x0000D8, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_FindNearestSpotInEnvironmentBlocks_House1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_ReturnValue) == 0x0000E0, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_GateActor) == 0x0000F0, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_GateActor' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_Succeeded) == 0x0000F8, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_Succeeded' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_ReturnValue1) == 0x0000FC, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_GateActor1) == 0x000108, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_GateActor1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetNearestHouseEntrance_Succeeded1) == 0x000110, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetNearestHouseEntrance_Succeeded1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetInteractDirectionForGate_ReturnValue) == 0x000114, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetInteractDirectionForGate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_AI_XYNearer_IfLocation1Nearer) == 0x000120, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_AI_XYNearer_IfLocation1Nearer' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetInteractDirectionForGate_ReturnValue1) == 0x000124, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetInteractDirectionForGate_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_AI_XYNearer_IfLocation1Nearer1) == 0x000130, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_AI_XYNearer_IfLocation1Nearer1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_IsPathValidAndReachable_ReturnValue) == 0x000131, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_IsPathValidAndReachable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, K2Node_Event_OwnerController) == 0x000138, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, K2Node_Event_ControlledPawn) == 0x000140, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, CallFunc_GetRecognition_ReturnValue) == 0x000148, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea, Temp_bool_IsClosed_Variable) == 0x000150, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ExecuteUbergraph_BTT_AJBFindSpotToGetIntoSafeArea::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BTT_AJBFindSpotToGetIntoSafeArea.BTT_AJBFindSpotToGetIntoSafeArea_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBFindSpotToGetIntoSafeArea.BTT_AJBFindSpotToGetIntoSafeArea_C.SetSpotAndPathThenFinish
// 0x000C (0x000C - 0x0000)
struct BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish final
{
public:
	struct FVector                                Spot;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish) == 0x000004, "Wrong alignment on BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish");
static_assert(sizeof(BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish) == 0x00000C, "Wrong size on BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish");
static_assert(offsetof(BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish, Spot) == 0x000000, "Member 'BTT_AJBFindSpotToGetIntoSafeArea_C_SetSpotAndPathThenFinish::Spot' has a wrong offset!");

}

