#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindSpotSideways

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBFindSpotSideways.BTT_AJBFindSpotSideways_C.ExecuteUbergraph_BTT_AJBFindSpotSideways
// 0x01A0 (0x01A0 - 0x0000)
struct BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Temp_wildcard_Variable;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue3;                 // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue4;                 // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetWaySpotsAround_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_MathExpression_ReturnValue;                 // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToLocationSynchronously_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_MathExpression_ReturnValue1;                // 0x012C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0140(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X2;                           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_MathExpression_ReturnValue2;                // 0x0170(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways) == 0x000008, "Wrong alignment on BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways");
static_assert(sizeof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways) == 0x0001A0, "Wrong size on BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, EntryPoint) == 0x000000, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, Temp_wildcard_Variable) == 0x000008, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, K2Node_Event_OwnerController) == 0x000018, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Array_LastIndex_ReturnValue) == 0x000028, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000030, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000038, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetLocation_ReturnValue) == 0x00003C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Array_Get_Item) == 0x000048, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000058, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetLocation_ReturnValue1) == 0x000060, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetLocation_ReturnValue2) == 0x00006C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetLocation_ReturnValue3) == 0x000078, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetLocation_ReturnValue4) == 0x000084, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetRecognition_ReturnValue) == 0x000090, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000098, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetWaySpotsAround_ReturnValue) == 0x0000A0, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetWaySpotsAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B4, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000BC, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_X) == 0x0000D4, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Z) == 0x0000DC, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, K2Node_MathExpression_ReturnValue) == 0x0000E0, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_DegCos_ReturnValue) == 0x0000EC, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_FindPathToLocationSynchronously_ReturnValue) == 0x0000F0, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_FindPathToLocationSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_IsValid_ReturnValue1) == 0x0000F8, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, Temp_int_Variable) == 0x0000FC, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000100, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_IsValid_ReturnValue2) == 0x000108, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x00010C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_VSizeSquared_ReturnValue) == 0x000118, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_X1) == 0x00011C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Y1) == 0x000120, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Z1) == 0x000124, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Less_FloatFloat_ReturnValue) == 0x000128, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, K2Node_MathExpression_ReturnValue1) == 0x00012C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::K2Node_MathExpression_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Array_Add_ReturnValue) == 0x000138, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Dot_VectorVector_ReturnValue) == 0x00013C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000140, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Abs_ReturnValue) == 0x00014C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x000150, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Less_FloatFloat_ReturnValue1) == 0x00015C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_X2) == 0x000160, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Y2) == 0x000164, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Z2) == 0x000168, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BooleanAND_ReturnValue) == 0x00016C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, K2Node_MathExpression_ReturnValue2) == 0x000170, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::K2Node_MathExpression_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00017C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_X3) == 0x000184, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Y3) == 0x000188, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_BreakVector_Z3) == 0x00018C, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_Add_FloatFloat_ReturnValue) == 0x000190, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways, CallFunc_MakeVector_ReturnValue3) == 0x000194, "Member 'BTT_AJBFindSpotSideways_C_ExecuteUbergraph_BTT_AJBFindSpotSideways::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");

// Function BTT_AJBFindSpotSideways.BTT_AJBFindSpotSideways_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBFindSpotSideways_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBFindSpotSideways_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBFindSpotSideways_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBFindSpotSideways_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBFindSpotSideways_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBFindSpotSideways_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBFindSpotSideways_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBFindSpotSideways_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

