#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBAICharacterSkillInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_AJBAICharacterSkillInfo.ST_AJBAICharacterSkillInfo
// 0x0020 (0x0020 - 0x0000)
struct FST_AJBAICharacterSkillInfo final
{
public:
	struct FGameplayTag                           Character_13_8F630C9E4EEBC61A1856D09408EEDFFA;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillTag_29_E886A487490108C703DACA9730DD9D36;      // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillRole_33_D860601B4BB765CAB444E6B0321FDC4A;     // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EAJBAISkillInputType                          InputType_26_CB23345C40951EE8AA7B4593D6689BFD;     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_AJBAICharacterSkillInfo) == 0x000008, "Wrong alignment on FST_AJBAICharacterSkillInfo");
static_assert(sizeof(FST_AJBAICharacterSkillInfo) == 0x000020, "Wrong size on FST_AJBAICharacterSkillInfo");
static_assert(offsetof(FST_AJBAICharacterSkillInfo, Character_13_8F630C9E4EEBC61A1856D09408EEDFFA) == 0x000000, "Member 'FST_AJBAICharacterSkillInfo::Character_13_8F630C9E4EEBC61A1856D09408EEDFFA' has a wrong offset!");
static_assert(offsetof(FST_AJBAICharacterSkillInfo, SkillTag_29_E886A487490108C703DACA9730DD9D36) == 0x000008, "Member 'FST_AJBAICharacterSkillInfo::SkillTag_29_E886A487490108C703DACA9730DD9D36' has a wrong offset!");
static_assert(offsetof(FST_AJBAICharacterSkillInfo, SkillRole_33_D860601B4BB765CAB444E6B0321FDC4A) == 0x000010, "Member 'FST_AJBAICharacterSkillInfo::SkillRole_33_D860601B4BB765CAB444E6B0321FDC4A' has a wrong offset!");
static_assert(offsetof(FST_AJBAICharacterSkillInfo, InputType_26_CB23345C40951EE8AA7B4593D6689BFD) == 0x000018, "Member 'FST_AJBAICharacterSkillInfo::InputType_26_CB23345C40951EE8AA7B4593D6689BFD' has a wrong offset!");

}

