#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CameraParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_CameraParam.ST_CameraParam
// 0x0018 (0x0018 - 0x0000)
struct FST_CameraParam final
{
public:
	struct FVector                                SpringArmOffset_7_ED99C6C148643D67DF29288F22FCF0BB; // 0x0000(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetArmLength_6_39C24C94420E33E4BBC59D868E7E2A65; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed_10_8A7085FA4A1407FE783B778C0C82C7BA;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FOV_13_F81E908149458F012AF746BD0C0447F3;           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_CameraParam) == 0x000004, "Wrong alignment on FST_CameraParam");
static_assert(sizeof(FST_CameraParam) == 0x000018, "Wrong size on FST_CameraParam");
static_assert(offsetof(FST_CameraParam, SpringArmOffset_7_ED99C6C148643D67DF29288F22FCF0BB) == 0x000000, "Member 'FST_CameraParam::SpringArmOffset_7_ED99C6C148643D67DF29288F22FCF0BB' has a wrong offset!");
static_assert(offsetof(FST_CameraParam, TargetArmLength_6_39C24C94420E33E4BBC59D868E7E2A65) == 0x00000C, "Member 'FST_CameraParam::TargetArmLength_6_39C24C94420E33E4BBC59D868E7E2A65' has a wrong offset!");
static_assert(offsetof(FST_CameraParam, InterpSpeed_10_8A7085FA4A1407FE783B778C0C82C7BA) == 0x000010, "Member 'FST_CameraParam::InterpSpeed_10_8A7085FA4A1407FE783B778C0C82C7BA' has a wrong offset!");
static_assert(offsetof(FST_CameraParam, FOV_13_F81E908149458F012AF746BD0C0447F3) == 0x000014, "Member 'FST_CameraParam::FOV_13_F81E908149458F012AF746BD0C0447F3' has a wrong offset!");

}

