#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CharaIconFrame

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_CharaIconFrame.ST_CharaIconFrame
// 0x0020 (0x0020 - 0x0000)
struct FST_CharaIconFrame final
{
public:
	int32                                         KillCount_10_836693E549F9B856EF4A498622BB723A;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconFrameMaterial_27_40C5645348844555A8A8BCBA5A040D48; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconFrameMaterial_Pressed_28_392994754A2862B582D5399A4B159269; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diamond_1_22_123DA28B46D5FF92DE93F291FAFF3C19;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diamond_2_23_0848470242F0E1FBF29CA5AD69FBE410;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diamond_3_24_816AC2974A6BD7D62FFC76A7BE233D8E;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diamond_4_25_DC50D4DF42F69DB76ED716B801D143CC;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diamond_5_26_D0DA2AF74C52DDBABEB456997ACAC39C;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_CharaIconFrame) == 0x000004, "Wrong alignment on FST_CharaIconFrame");
static_assert(sizeof(FST_CharaIconFrame) == 0x000020, "Wrong size on FST_CharaIconFrame");
static_assert(offsetof(FST_CharaIconFrame, KillCount_10_836693E549F9B856EF4A498622BB723A) == 0x000000, "Member 'FST_CharaIconFrame::KillCount_10_836693E549F9B856EF4A498622BB723A' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, IconFrameMaterial_27_40C5645348844555A8A8BCBA5A040D48) == 0x000004, "Member 'FST_CharaIconFrame::IconFrameMaterial_27_40C5645348844555A8A8BCBA5A040D48' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, IconFrameMaterial_Pressed_28_392994754A2862B582D5399A4B159269) == 0x000008, "Member 'FST_CharaIconFrame::IconFrameMaterial_Pressed_28_392994754A2862B582D5399A4B159269' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, Diamond_1_22_123DA28B46D5FF92DE93F291FAFF3C19) == 0x00000C, "Member 'FST_CharaIconFrame::Diamond_1_22_123DA28B46D5FF92DE93F291FAFF3C19' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, Diamond_2_23_0848470242F0E1FBF29CA5AD69FBE410) == 0x000010, "Member 'FST_CharaIconFrame::Diamond_2_23_0848470242F0E1FBF29CA5AD69FBE410' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, Diamond_3_24_816AC2974A6BD7D62FFC76A7BE233D8E) == 0x000014, "Member 'FST_CharaIconFrame::Diamond_3_24_816AC2974A6BD7D62FFC76A7BE233D8E' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, Diamond_4_25_DC50D4DF42F69DB76ED716B801D143CC) == 0x000018, "Member 'FST_CharaIconFrame::Diamond_4_25_DC50D4DF42F69DB76ED716B801D143CC' has a wrong offset!");
static_assert(offsetof(FST_CharaIconFrame, Diamond_5_26_D0DA2AF74C52DDBABEB456997ACAC39C) == 0x00001C, "Member 'FST_CharaIconFrame::Diamond_5_26_D0DA2AF74C52DDBABEB456997ACAC39C' has a wrong offset!");

}

