#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_FinishVoiceInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_FinishVoiceInfo.ST_FinishVoiceInfo
// 0x0018 (0x0018 - 0x0000)
struct FST_FinishVoiceInfo final
{
public:
	struct FGameplayTag                           CurrentVoiceTag_7_3124A60F4935E1CEFC639286AFF9E5EE; // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BreakVoiceTagIfNeed_4_9340AEEE476E8C23DAFEB5BC640A9569; // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FinishVoiceTag_5_4A23555A4C0834C04B7E8CA0B78653D1; // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_FinishVoiceInfo) == 0x000008, "Wrong alignment on FST_FinishVoiceInfo");
static_assert(sizeof(FST_FinishVoiceInfo) == 0x000018, "Wrong size on FST_FinishVoiceInfo");
static_assert(offsetof(FST_FinishVoiceInfo, CurrentVoiceTag_7_3124A60F4935E1CEFC639286AFF9E5EE) == 0x000000, "Member 'FST_FinishVoiceInfo::CurrentVoiceTag_7_3124A60F4935E1CEFC639286AFF9E5EE' has a wrong offset!");
static_assert(offsetof(FST_FinishVoiceInfo, BreakVoiceTagIfNeed_4_9340AEEE476E8C23DAFEB5BC640A9569) == 0x000008, "Member 'FST_FinishVoiceInfo::BreakVoiceTagIfNeed_4_9340AEEE476E8C23DAFEB5BC640A9569' has a wrong offset!");
static_assert(offsetof(FST_FinishVoiceInfo, FinishVoiceTag_5_4A23555A4C0834C04B7E8CA0B78653D1) == 0x000010, "Member 'FST_FinishVoiceInfo::FinishVoiceTag_5_4A23555A4C0834C04B7E8CA0B78653D1' has a wrong offset!");

}

