#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Test1_BTT_LookAt_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass test1_BTT_LookAt_1.test1_BTT_LookAt_1_C
// 0x0018 (0x00B8 - 0x00A0)
class UTest1_BTT_LookAt_1_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	bool                                          bShouldLootAtEnemy;                                // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_TargetLocation;                               // 0x00AC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_test1_BTT_LookAt_1(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"test1_BTT_LookAt_1_C">();
	}
	static class UTest1_BTT_LookAt_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTest1_BTT_LookAt_1_C>();
	}
};
static_assert(alignof(UTest1_BTT_LookAt_1_C) == 0x000008, "Wrong alignment on UTest1_BTT_LookAt_1_C");
static_assert(sizeof(UTest1_BTT_LookAt_1_C) == 0x0000B8, "Wrong size on UTest1_BTT_LookAt_1_C");
static_assert(offsetof(UTest1_BTT_LookAt_1_C, UberGraphFrame) == 0x0000A0, "Member 'UTest1_BTT_LookAt_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTest1_BTT_LookAt_1_C, bShouldLootAtEnemy) == 0x0000A8, "Member 'UTest1_BTT_LookAt_1_C::bShouldLootAtEnemy' has a wrong offset!");
static_assert(offsetof(UTest1_BTT_LookAt_1_C, Temp_TargetLocation) == 0x0000AC, "Member 'UTest1_BTT_LookAt_1_C::Temp_TargetLocation' has a wrong offset!");

}

