#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ActionLogColumn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ActionLogColumn.WB_ActionLogColumn_C
// 0x0038 (0x0280 - 0x0248)
class UWB_ActionLogColumn_C final : public UAJBUserWidget
{
public:
	class UWidgetAnimation*                       Anim_ChatIcon;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_194;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_ChatIcon;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_ActionLog;                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DisplayTimer;                                      // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnFinishedVisibleTime;                             // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFinishedVisibleTime__DelegateSignature(class UWB_ActionLogColumn_C* SelfLogColumn);
	void UpdateText(class FText& MessageBase, int32& Type, int32& Value1, int32& Value2);
	void InvisibleText();
	void IsUsedText(bool* bUsed);
	void SetVisibleTimer(float Time);
	float GetVisibleTimerElapsedTime_();
	void IsRadioChatLog(int32& Type, bool* bRadioChat);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ActionLogColumn_C">();
	}
	static class UWB_ActionLogColumn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ActionLogColumn_C>();
	}
};
static_assert(alignof(UWB_ActionLogColumn_C) == 0x000008, "Wrong alignment on UWB_ActionLogColumn_C");
static_assert(sizeof(UWB_ActionLogColumn_C) == 0x000280, "Wrong size on UWB_ActionLogColumn_C");
static_assert(offsetof(UWB_ActionLogColumn_C, Anim_ChatIcon) == 0x000248, "Member 'UWB_ActionLogColumn_C::Anim_ChatIcon' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogColumn_C, AJBImage_194) == 0x000250, "Member 'UWB_ActionLogColumn_C::AJBImage_194' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogColumn_C, Img_ChatIcon) == 0x000258, "Member 'UWB_ActionLogColumn_C::Img_ChatIcon' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogColumn_C, RichTextBlock_ActionLog) == 0x000260, "Member 'UWB_ActionLogColumn_C::RichTextBlock_ActionLog' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogColumn_C, DisplayTimer) == 0x000268, "Member 'UWB_ActionLogColumn_C::DisplayTimer' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogColumn_C, OnFinishedVisibleTime) == 0x000270, "Member 'UWB_ActionLogColumn_C::OnFinishedVisibleTime' has a wrong offset!");

}

