#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBInGameGionScreen

#include "Basic.hpp"

#include "ST_GionInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"
#include "ST_GionLocallyControlScreenInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.OnDisplayGion__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature final
{
public:
	struct FGameplayTag                           GionType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOnScreen;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsOwnerGion;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature) == 0x000008, "Wrong alignment on WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature");
static_assert(sizeof(WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature) == 0x000010, "Wrong size on WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature");
static_assert(offsetof(WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature, GionType) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature::GionType' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature, bIsOnScreen) == 0x000008, "Member 'WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature::bIsOnScreen' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature, bIsOwnerGion) == 0x000009, "Member 'WB_AJBInGameGionScreen_C_OnDisplayGion__DelegateSignature::bIsOwnerGion' has a wrong offset!");

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.ExecuteUbergraph_WB_AJBInGameGionScreen
// 0x0110 (0x0110 - 0x0000)
struct WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_AJBInGameGionEffect_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOwner;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Owner;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsFriend;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInOwnersEnv;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv;     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameGion_C*                    K2Node_CustomEvent_GionActor;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_SetupEffect_GionType;                     // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetupEffect_bIsOnScreen;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x00D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00D8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x00E0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBInGameGionEffect_C*              CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedUpdatePosition_Result;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_UpdateEffectPosition_GionType;            // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateEffectPosition_bIsOnScreen;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateEffectPosition_bIsOwnerGion;        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetViewTargetHearingAbilityRate_HearingAbilityRate; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen) == 0x000008, "Wrong alignment on WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen");
static_assert(sizeof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen) == 0x000110, "Wrong size on WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, EntryPoint) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_IsClosed_Variable) == 0x00000D, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00000E, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_int_Variable) == 0x000010, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_Has_Been_Initd_Variable1) == 0x000018, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x000028, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_AddChildToCanvas_ReturnValue) == 0x000030, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_bIsOwner) == 0x000038, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_bIsOwner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_Owner) == 0x000040, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_bIsFriend) == 0x000048, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_bIsFriend' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_SpanwedSpaceInOwnersEnv) == 0x000049, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_SpanwedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv) == 0x00004A, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_SpanwedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_CustomEvent_GionActor) == 0x000050, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_CustomEvent_GionActor' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_Event_MyGeometry) == 0x000058, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, K2Node_Event_InDeltaTime) == 0x000090, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_SetupEffect_GionType) == 0x000098, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_SetupEffect_GionType' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_SetupEffect_bIsOnScreen) == 0x0000A0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_SetupEffect_bIsOnScreen' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_GetViewportSize_SizeX) == 0x0000B4, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_GetViewportSize_SizeX' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_GetViewportSize_SizeY) == 0x0000B8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_GetViewportSize_SizeY' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000BC, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x0000C0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_GetViewportScale_ReturnValue) == 0x0000C4, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_MakeVector2D_ReturnValue) == 0x0000C8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_MakeVector2D_ReturnValue1) == 0x0000D0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0000D8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x0000E0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_bool_IsClosed_Variable1) == 0x0000E8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, Temp_int_Array_Index_Variable) == 0x0000EC, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_IsNeedUpdatePosition_Result) == 0x0000F8, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_IsNeedUpdatePosition_Result' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_UpdateEffectPosition_GionType) == 0x000100, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_UpdateEffectPosition_GionType' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_UpdateEffectPosition_bIsOnScreen) == 0x000108, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_UpdateEffectPosition_bIsOnScreen' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_UpdateEffectPosition_bIsOwnerGion) == 0x000109, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_UpdateEffectPosition_bIsOwnerGion' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen, CallFunc_GetViewTargetHearingAbilityRate_HearingAbilityRate) == 0x00010C, "Member 'WB_AJBInGameGionScreen_C_ExecuteUbergraph_WB_AJBInGameGionScreen::CallFunc_GetViewTargetHearingAbilityRate_HearingAbilityRate' has a wrong offset!");

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_AJBInGameGionScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_Tick) == 0x000004, "Wrong alignment on WB_AJBInGameGionScreen_C_Tick");
static_assert(sizeof(WB_AJBInGameGionScreen_C_Tick) == 0x00003C, "Wrong size on WB_AJBInGameGionScreen_C_Tick");
static_assert(offsetof(WB_AJBInGameGionScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_AJBInGameGionScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.RequestEffect
// 0x0020 (0x0020 - 0x0000)
struct WB_AJBInGameGionScreen_C_RequestEffect final
{
public:
	bool                                          bIsOwner;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFriend;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_GionSpawnedSpace                            SpanwedSpaceInOwnersEnv;                           // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpanwedSpaceInNotOwnersEnv;                        // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameGion_C*                    GionActor;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_RequestEffect) == 0x000008, "Wrong alignment on WB_AJBInGameGionScreen_C_RequestEffect");
static_assert(sizeof(WB_AJBInGameGionScreen_C_RequestEffect) == 0x000020, "Wrong size on WB_AJBInGameGionScreen_C_RequestEffect");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, bIsOwner) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::bIsOwner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, Owner) == 0x000008, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::Owner' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, bIsFriend) == 0x000010, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::bIsFriend' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, SpanwedSpaceInOwnersEnv) == 0x000011, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::SpanwedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, SpanwedSpaceInNotOwnersEnv) == 0x000012, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::SpanwedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_RequestEffect, GionActor) == 0x000018, "Member 'WB_AJBInGameGionScreen_C_RequestEffect::GionActor' has a wrong offset!");

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.FindUseEffect
// 0x0020 (0x0020 - 0x0000)
struct WB_AJBInGameGionScreen_C_FindUseEffect final
{
public:
	class UWB_AJBInGameGionEffect_C*              Output_Get;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBInGameGionEffect_C*              UseEffect;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBInGameGionEffect_C*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_FindUseEffect) == 0x000008, "Wrong alignment on WB_AJBInGameGionScreen_C_FindUseEffect");
static_assert(sizeof(WB_AJBInGameGionScreen_C_FindUseEffect) == 0x000020, "Wrong size on WB_AJBInGameGionScreen_C_FindUseEffect");
static_assert(offsetof(WB_AJBInGameGionScreen_C_FindUseEffect, Output_Get) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_FindUseEffect::Output_Get' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_FindUseEffect, UseEffect) == 0x000008, "Member 'WB_AJBInGameGionScreen_C_FindUseEffect::UseEffect' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_FindUseEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_AJBInGameGionScreen_C_FindUseEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_FindUseEffect, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WB_AJBInGameGionScreen_C_FindUseEffect::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_FindUseEffect, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_AJBInGameGionScreen_C_FindUseEffect::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C.UpdateEffectPosition
// 0x0278 (0x0278 - 0x0000)
struct WB_AJBInGameGionScreen_C_UpdateEffectPosition final
{
public:
	class UWB_AJBInGameGionEffect_C*              UpdateWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GionType;                                          // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOnScreen;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsOwnerGion;                                      // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_GionType;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_GionIsOnScreen;                              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleBase;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseSize;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetSize;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              WidgetMaxSize;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetVector;                                      // 0x0038(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraVector;                                      // 0x0044(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x0050(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectScale;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              WidgetLoation;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x00D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GionLocallyControlScreenInfo       CallFunc_Array_Get_Item;                           // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FBox2D                                 CallFunc_Array_Get_Item1;                          // 0x00F8(0x0014)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x010C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0114(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue1;   // 0x011C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x013C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0144(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0154(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0174(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X4;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y4;                         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue1;                      // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue1;   // 0x01B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X5;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y5;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x01D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x01DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x020C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0238(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0248(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x0258(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0260(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x026C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBInGameGionScreen_C_UpdateEffectPosition) == 0x000008, "Wrong alignment on WB_AJBInGameGionScreen_C_UpdateEffectPosition");
static_assert(sizeof(WB_AJBInGameGionScreen_C_UpdateEffectPosition) == 0x000278, "Wrong size on WB_AJBInGameGionScreen_C_UpdateEffectPosition");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, UpdateWidget) == 0x000000, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::UpdateWidget' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, GionType) == 0x000008, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::GionType' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, bIsOnScreen) == 0x000010, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::bIsOnScreen' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, bIsOwnerGion) == 0x000011, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::bIsOwnerGion' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, Temp_GionType) == 0x000018, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::Temp_GionType' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, Local_GionIsOnScreen) == 0x000020, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::Local_GionIsOnScreen' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, ScaleBase) == 0x000024, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::ScaleBase' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, BaseSize) == 0x000028, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::BaseSize' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, WidgetSize) == 0x00002C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::WidgetSize' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, WidgetMaxSize) == 0x000030, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::WidgetMaxSize' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, TargetVector) == 0x000038, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::TargetVector' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CameraVector) == 0x000044, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CameraVector' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CameraLocation) == 0x000050, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CameraLocation' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, EffectScale) == 0x00005C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::EffectScale' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, WidgetLoation) == 0x000060, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::WidgetLoation' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_BreakVector_X) == 0x00006C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_BreakVector_Y) == 0x000070, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_BreakVector_Z) == 0x000074, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000078, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_MakeVector_ReturnValue) == 0x00007C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Normal_ReturnValue) == 0x000088, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, K2Node_SwitchEnum1_CmpSuccess) == 0x000094, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000095, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000098, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000A4, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A8, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x0000B8, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000BC, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Conv_ByteToInt_ReturnValue1) == 0x0000C0, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Conv_ByteToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Percent_IntInt_ReturnValue) == 0x0000CC, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, Temp_struct_Variable) == 0x0000D0, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, Temp_bool_Variable) == 0x0000D8, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_Array_Get_Item1) == 0x0000F8, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_AJBInGameGionScreen_C_UpdateEffectPosition, CallFunc_MakeVector2D_ReturnValue) == 0x00010C, "Member 'WB_AJBInGameGionScreen_C_UpdateEffectPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
