#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ArrowButton_L

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.ExecuteUbergraph_WB_ArrowButton_L
// 0x00D8 (0x00D8 - 0x0000)
struct WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_ReturnValue;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0058(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L) == 0x000008, "Wrong alignment on WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L");
static_assert(sizeof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L) == 0x0000D8, "Wrong size on WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, EntryPoint) == 0x000000, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_FInterpTo_ReturnValue) == 0x000048, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, K2Node_Event_IsDesignTime) == 0x00004C, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_GetDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_GetDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, K2Node_MakeStruct_SlateFontInfo) == 0x000058, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, K2Node_CustomEvent_IsActive) == 0x0000A8, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_GetEffectMaterial_ReturnValue) == 0x0000B0, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x0000B8, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x0000C0, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_MakeVector2D_ReturnValue) == 0x0000C8, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L, CallFunc_FInterpTo_ReturnValue1) == 0x0000D0, "Member 'WB_ArrowButton_L_C_ExecuteUbergraph_WB_ArrowButton_L::CallFunc_FInterpTo_ReturnValue1' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.SetButtonActive
// 0x0001 (0x0001 - 0x0000)
struct WB_ArrowButton_L_C_SetButtonActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_L_C_SetButtonActive) == 0x000001, "Wrong alignment on WB_ArrowButton_L_C_SetButtonActive");
static_assert(sizeof(WB_ArrowButton_L_C_SetButtonActive) == 0x000001, "Wrong size on WB_ArrowButton_L_C_SetButtonActive");
static_assert(offsetof(WB_ArrowButton_L_C_SetButtonActive, IsActive) == 0x000000, "Member 'WB_ArrowButton_L_C_SetButtonActive::IsActive' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ArrowButton_L_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_L_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ArrowButton_L_C_PreConstruct");
static_assert(sizeof(WB_ArrowButton_L_C_PreConstruct) == 0x000001, "Wrong size on WB_ArrowButton_L_C_PreConstruct");
static_assert(offsetof(WB_ArrowButton_L_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ArrowButton_L_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ArrowButton_L_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_L_C_Tick) == 0x000004, "Wrong alignment on WB_ArrowButton_L_C_Tick");
static_assert(sizeof(WB_ArrowButton_L_C_Tick) == 0x00003C, "Wrong size on WB_ArrowButton_L_C_Tick");
static_assert(offsetof(WB_ArrowButton_L_C_Tick, MyGeometry) == 0x000000, "Member 'WB_ArrowButton_L_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_ArrowButton_L_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.GetTextBlock
// 0x0008 (0x0008 - 0x0000)
struct WB_ArrowButton_L_C_GetTextBlock final
{
public:
	class UAJBTextBlock*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_L_C_GetTextBlock) == 0x000008, "Wrong alignment on WB_ArrowButton_L_C_GetTextBlock");
static_assert(sizeof(WB_ArrowButton_L_C_GetTextBlock) == 0x000008, "Wrong size on WB_ArrowButton_L_C_GetTextBlock");
static_assert(offsetof(WB_ArrowButton_L_C_GetTextBlock, ReturnValue) == 0x000000, "Member 'WB_ArrowButton_L_C_GetTextBlock::ReturnValue' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ArrowButton_L_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ArrowButton_L_C_GetButton) == 0x000008, "Wrong alignment on WB_ArrowButton_L_C_GetButton");
static_assert(sizeof(WB_ArrowButton_L_C_GetButton) == 0x000008, "Wrong size on WB_ArrowButton_L_C_GetButton");
static_assert(offsetof(WB_ArrowButton_L_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ArrowButton_L_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ArrowButton_L.WB_ArrowButton_L_C.IsPlayingAnimationButton
// 0x0003 (0x0003 - 0x0000)
struct WB_ArrowButton_L_C_IsPlayingAnimationButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ArrowButton_L_C_IsPlayingAnimationButton) == 0x000001, "Wrong alignment on WB_ArrowButton_L_C_IsPlayingAnimationButton");
static_assert(sizeof(WB_ArrowButton_L_C_IsPlayingAnimationButton) == 0x000003, "Wrong size on WB_ArrowButton_L_C_IsPlayingAnimationButton");
static_assert(offsetof(WB_ArrowButton_L_C_IsPlayingAnimationButton, ReturnValue) == 0x000000, "Member 'WB_ArrowButton_L_C_IsPlayingAnimationButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_IsPlayingAnimationButton, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'WB_ArrowButton_L_C_IsPlayingAnimationButton::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ArrowButton_L_C_IsPlayingAnimationButton, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_ArrowButton_L_C_IsPlayingAnimationButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

