#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ActionLogWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ActionLogWindow.WB_ActionLogWindow_C
// 0x0028 (0x0230 - 0x0208)
class UWB_ActionLogWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           LogRoot;                                           // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ActionLogColumn_C*>          LogColumns;                                        // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DisplayTime;                                       // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LogNum;                                            // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ActionLogWindow(int32 EntryPoint);
	void OnFinishedVisibleTime(class UWB_ActionLogColumn_C* SelfLogColumn);
	void Construct();
	void RequestShowLog(class FText& MessageBase, int32& Type, int32& Value1, int32& Value2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ActionLogWindow_C">();
	}
	static class UWB_ActionLogWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ActionLogWindow_C>();
	}
};
static_assert(alignof(UWB_ActionLogWindow_C) == 0x000008, "Wrong alignment on UWB_ActionLogWindow_C");
static_assert(sizeof(UWB_ActionLogWindow_C) == 0x000230, "Wrong size on UWB_ActionLogWindow_C");
static_assert(offsetof(UWB_ActionLogWindow_C, UberGraphFrame) == 0x000208, "Member 'UWB_ActionLogWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogWindow_C, LogRoot) == 0x000210, "Member 'UWB_ActionLogWindow_C::LogRoot' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogWindow_C, LogColumns) == 0x000218, "Member 'UWB_ActionLogWindow_C::LogColumns' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogWindow_C, DisplayTime) == 0x000228, "Member 'UWB_ActionLogWindow_C::DisplayTime' has a wrong offset!");
static_assert(offsetof(UWB_ActionLogWindow_C, LogNum) == 0x00022C, "Member 'UWB_ActionLogWindow_C::LogNum' has a wrong offset!");

}

