#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharacterSelect_PairInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C
// 0x0128 (0x0370 - 0x0248)
class UWB_CharacterSelect_PairInfo_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_CharaIcon;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_CharacterName;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_PairPlayerName;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_TitleName;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FAJBCharacterInfo                      CurrentPairCharacterInfo;                          // 0x0278(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bLoadedPlayerIcon;                                 // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckLoadedIconTimer;                              // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bOpened;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_CharacterSelect_PairInfo(int32 EntryPoint);
	void OnCheckLoadedIcon();
	void Close();
	void Open();
	void SetPairCharacter(const struct FAJBCharacterInfo& AJBCharacterInfo);
	void SetPairInfo(const class FText& TitleName, const class FText& PairPlayerName);
	void OnLoaded_C683495D4A6FFF6328BC899C33F27267(class UObject* Loaded);
	void IsShowingUI(bool* bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CharacterSelect_PairInfo_C">();
	}
	static class UWB_CharacterSelect_PairInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CharacterSelect_PairInfo_C>();
	}
};
static_assert(alignof(UWB_CharacterSelect_PairInfo_C) == 0x000008, "Wrong alignment on UWB_CharacterSelect_PairInfo_C");
static_assert(sizeof(UWB_CharacterSelect_PairInfo_C) == 0x000370, "Wrong size on UWB_CharacterSelect_PairInfo_C");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, UberGraphFrame) == 0x000248, "Member 'UWB_CharacterSelect_PairInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, Appear) == 0x000250, "Member 'UWB_CharacterSelect_PairInfo_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, Img_CharaIcon) == 0x000258, "Member 'UWB_CharacterSelect_PairInfo_C::Img_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, Txt_CharacterName) == 0x000260, "Member 'UWB_CharacterSelect_PairInfo_C::Txt_CharacterName' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, Txt_PairPlayerName) == 0x000268, "Member 'UWB_CharacterSelect_PairInfo_C::Txt_PairPlayerName' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, Txt_TitleName) == 0x000270, "Member 'UWB_CharacterSelect_PairInfo_C::Txt_TitleName' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, CurrentPairCharacterInfo) == 0x000278, "Member 'UWB_CharacterSelect_PairInfo_C::CurrentPairCharacterInfo' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, bLoadedPlayerIcon) == 0x000358, "Member 'UWB_CharacterSelect_PairInfo_C::bLoadedPlayerIcon' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, CheckLoadedIconTimer) == 0x000360, "Member 'UWB_CharacterSelect_PairInfo_C::CheckLoadedIconTimer' has a wrong offset!");
static_assert(offsetof(UWB_CharacterSelect_PairInfo_C, bOpened) == 0x000368, "Member 'UWB_CharacterSelect_PairInfo_C::bOpened' has a wrong offset!");

}

