#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressFooter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C
// 0x0090 (0x02D8 - 0x0248)
class UWB_ChallengeEventProgressFooter_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Exp_Appear;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_0;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TextEventPeriod;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TextNextClassUpExp;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FChallengeEventProgressContext         ProgressContext;                                   // 0x0270(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnFinished;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFinished__DelegateSignature();
	void ExecuteUbergraph_WB_ChallengeEventProgressFooter(int32 EntryPoint);
	void Setup(const struct FChallengeEventProgressContext& ProgressContext_0);
	void Start(int32 RestExpToNextClass);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ChallengeEventProgressFooter_C">();
	}
	static class UWB_ChallengeEventProgressFooter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ChallengeEventProgressFooter_C>();
	}
};
static_assert(alignof(UWB_ChallengeEventProgressFooter_C) == 0x000008, "Wrong alignment on UWB_ChallengeEventProgressFooter_C");
static_assert(sizeof(UWB_ChallengeEventProgressFooter_C) == 0x0002D8, "Wrong size on UWB_ChallengeEventProgressFooter_C");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, UberGraphFrame) == 0x000248, "Member 'UWB_ChallengeEventProgressFooter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, Exp_Appear) == 0x000250, "Member 'UWB_ChallengeEventProgressFooter_C::Exp_Appear' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, AJBImage_0) == 0x000258, "Member 'UWB_ChallengeEventProgressFooter_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, TextEventPeriod) == 0x000260, "Member 'UWB_ChallengeEventProgressFooter_C::TextEventPeriod' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, TextNextClassUpExp) == 0x000268, "Member 'UWB_ChallengeEventProgressFooter_C::TextNextClassUpExp' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, ProgressContext) == 0x000270, "Member 'UWB_ChallengeEventProgressFooter_C::ProgressContext' has a wrong offset!");
static_assert(offsetof(UWB_ChallengeEventProgressFooter_C, OnFinished) == 0x0002C8, "Member 'UWB_ChallengeEventProgressFooter_C::OnFinished' has a wrong offset!");

}

