#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Connecting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPopupWindowSEType_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Connecting.WB_Connecting_C
// 0x0030 (0x02F0 - 0x02C0)
class UWB_Connecting_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             BlockingTouch;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextOnlyRoot;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_TxtOnly;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPopupWindowSEType                            PopupWindowSEType;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsPlayOpenSE;                                     // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WB_Connecting(int32 EntryPoint);
	void OnFinishedOpenCurveAnim();
	void Construct();
	void OnOpeningWindow();
	void OnClosingWindow();
	bool OnInputReleasedUp();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedTouch();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool IsModeless();
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL2();
	bool OnInputPressedL1();
	bool OnInputReleasedL3();
	bool OnInputPressedL3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Connecting_C">();
	}
	static class UWB_Connecting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Connecting_C>();
	}
};
static_assert(alignof(UWB_Connecting_C) == 0x000008, "Wrong alignment on UWB_Connecting_C");
static_assert(sizeof(UWB_Connecting_C) == 0x0002F0, "Wrong size on UWB_Connecting_C");
static_assert(offsetof(UWB_Connecting_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_Connecting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, Loop) == 0x0002C8, "Member 'UWB_Connecting_C::Loop' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, BlockingTouch) == 0x0002D0, "Member 'UWB_Connecting_C::BlockingTouch' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, TextOnlyRoot) == 0x0002D8, "Member 'UWB_Connecting_C::TextOnlyRoot' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, Txt_TxtOnly) == 0x0002E0, "Member 'UWB_Connecting_C::Txt_TxtOnly' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, PopupWindowSEType) == 0x0002E8, "Member 'UWB_Connecting_C::PopupWindowSEType' has a wrong offset!");
static_assert(offsetof(UWB_Connecting_C, bIsPlayOpenSE) == 0x0002E9, "Member 'UWB_Connecting_C::bIsPlayOpenSE' has a wrong offset!");

}

