#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaSelectListName

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_CharaSelectListName.WB_CharaSelectListName_C.ExecuteUbergraph_WB_CharaSelectListName
// 0x0040 (0x0040 - 0x0000)
struct WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_WidthOverride;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBBattleTypeString_Out;               // 0x0010(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName) == 0x000008, "Wrong alignment on WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName");
static_assert(sizeof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName) == 0x000040, "Wrong size on WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, EntryPoint) == 0x000000, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, K2Node_CustomEvent_WidthOverride) == 0x000008, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::K2Node_CustomEvent_WidthOverride' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, CallFunc_GetAJBBattleTypeString_Out) == 0x000010, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::CallFunc_GetAJBBattleTypeString_Out' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName, CallFunc_AddChildToOverlay_ReturnValue) == 0x000038, "Member 'WB_CharaSelectListName_C_ExecuteUbergraph_WB_CharaSelectListName::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

// Function WB_CharaSelectListName.WB_CharaSelectListName_C.SetupWidgetSize
// 0x0004 (0x0004 - 0x0000)
struct WB_CharaSelectListName_C_SetupWidgetSize final
{
public:
	float                                         WidthOverride;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectListName_C_SetupWidgetSize) == 0x000004, "Wrong alignment on WB_CharaSelectListName_C_SetupWidgetSize");
static_assert(sizeof(WB_CharaSelectListName_C_SetupWidgetSize) == 0x000004, "Wrong size on WB_CharaSelectListName_C_SetupWidgetSize");
static_assert(offsetof(WB_CharaSelectListName_C_SetupWidgetSize, WidthOverride) == 0x000000, "Member 'WB_CharaSelectListName_C_SetupWidgetSize::WidthOverride' has a wrong offset!");

// Function WB_CharaSelectListName.WB_CharaSelectListName_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaSelectListName_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaSelectListName_C_PreConstruct) == 0x000001, "Wrong alignment on WB_CharaSelectListName_C_PreConstruct");
static_assert(sizeof(WB_CharaSelectListName_C_PreConstruct) == 0x000001, "Wrong size on WB_CharaSelectListName_C_PreConstruct");
static_assert(offsetof(WB_CharaSelectListName_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_CharaSelectListName_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

