#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaAchieve_Progress

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.ExecuteUbergraph_WB_CharaAchieve_Progress
// 0x0028 (0x0028 - 0x0000)
struct WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetLoopPillerMoveAnimation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeOutAnimation_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEffectsAlsoBeDisplayed;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress) == 0x000008, "Wrong alignment on WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress");
static_assert(sizeof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress) == 0x000028, "Wrong size on WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress");
static_assert(offsetof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress, EntryPoint) == 0x000000, "Member 'WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress, CallFunc_GetLoopPillerMoveAnimation_ReturnValue) == 0x000008, "Member 'WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress::CallFunc_GetLoopPillerMoveAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress, CallFunc_GetFadeInAnimation_ReturnValue) == 0x000010, "Member 'WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress::CallFunc_GetFadeInAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress, CallFunc_GetFadeOutAnimation_ReturnValue) == 0x000018, "Member 'WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress::CallFunc_GetFadeOutAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress, K2Node_CustomEvent_bEffectsAlsoBeDisplayed) == 0x000020, "Member 'WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress::K2Node_CustomEvent_bEffectsAlsoBeDisplayed' has a wrong offset!");

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.SetActiveDisplay
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaAchieve_Progress_C_SetActiveDisplay final
{
public:
	bool                                          bEffectsAlsoBeDisplayed;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaAchieve_Progress_C_SetActiveDisplay) == 0x000001, "Wrong alignment on WB_CharaAchieve_Progress_C_SetActiveDisplay");
static_assert(sizeof(WB_CharaAchieve_Progress_C_SetActiveDisplay) == 0x000001, "Wrong size on WB_CharaAchieve_Progress_C_SetActiveDisplay");
static_assert(offsetof(WB_CharaAchieve_Progress_C_SetActiveDisplay, bEffectsAlsoBeDisplayed) == 0x000000, "Member 'WB_CharaAchieve_Progress_C_SetActiveDisplay::bEffectsAlsoBeDisplayed' has a wrong offset!");

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaAchieve_Progress_C_GetFadeInAnimation) == 0x000008, "Wrong alignment on WB_CharaAchieve_Progress_C_GetFadeInAnimation");
static_assert(sizeof(WB_CharaAchieve_Progress_C_GetFadeInAnimation) == 0x000008, "Wrong size on WB_CharaAchieve_Progress_C_GetFadeInAnimation");
static_assert(offsetof(WB_CharaAchieve_Progress_C_GetFadeInAnimation, ReturnValue) == 0x000000, "Member 'WB_CharaAchieve_Progress_C_GetFadeInAnimation::ReturnValue' has a wrong offset!");

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetFadeOutAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetFadeOutAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaAchieve_Progress_C_GetFadeOutAnimation) == 0x000008, "Wrong alignment on WB_CharaAchieve_Progress_C_GetFadeOutAnimation");
static_assert(sizeof(WB_CharaAchieve_Progress_C_GetFadeOutAnimation) == 0x000008, "Wrong size on WB_CharaAchieve_Progress_C_GetFadeOutAnimation");
static_assert(offsetof(WB_CharaAchieve_Progress_C_GetFadeOutAnimation, ReturnValue) == 0x000000, "Member 'WB_CharaAchieve_Progress_C_GetFadeOutAnimation::ReturnValue' has a wrong offset!");

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetLoopPillerMoveAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation) == 0x000008, "Wrong alignment on WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation");
static_assert(sizeof(WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation) == 0x000008, "Wrong size on WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation");
static_assert(offsetof(WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation, ReturnValue) == 0x000000, "Member 'WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation::ReturnValue' has a wrong offset!");

}

