#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaSelectButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "ST_CharaIconFrame_structs.hpp"
#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ECharacterSelectInscrollInnerState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.ExecuteUbergraph_WB_CharaSelectButton
// 0x01C8 (0x01C8 - 0x0000)
struct WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_PlaySE;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectableInTutorial_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectableInTutorial_ReturnValue1;      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_ReturnValue;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterSelectInscrollInnerState            K2Node_CustomEvent_NewState;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0140(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton");
static_assert(sizeof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton) == 0x0001C8, "Wrong size on WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, EntryPoint) == 0x000000, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, Temp_bool_Variable) == 0x000004, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_CustomEvent_PlaySE) == 0x000018, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_CustomEvent_PlaySE' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_Event_MyGeometry) == 0x00001C, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_Event_InDeltaTime) == 0x000054, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_FInterpTo_ReturnValue) == 0x000058, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000060, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_SlotAsCanvasSlot_ReturnValue1) == 0x000068, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_SlotAsCanvasSlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x000070, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_IsSelectableInTutorial_ReturnValue) == 0x000078, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_IsSelectableInTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000079, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_IsSelectableInTutorial_ReturnValue1) == 0x00007A, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_IsSelectableInTutorial_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Not_PreBool_ReturnValue) == 0x00007B, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000080, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_GetEffectMaterial_ReturnValue) == 0x000088, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_CreateDelegate_OutputDelegate1) == 0x000098, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x0000A8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_GetDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_GetDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_CustomEvent_Loaded) == 0x0000B8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_CustomEvent_NewState) == 0x0000C0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_GetRenderOpacity_ReturnValue) == 0x0000C4, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_FInterpTo_ReturnValue1) == 0x0000CC, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_FInterpTo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_GetAJBGameInstance_bSuccess) == 0x0000D0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0000D8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x000120, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, Temp_object_Variable) == 0x000128, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_DynamicCast_AsTexture_2D) == 0x000130, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_MakeStruct_FormatArgumentData1) == 0x000140, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_MakeArray_Array) == 0x000180, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Format_ReturnValue) == 0x000190, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001A8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x0001AC, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Percent_IntInt_ReturnValue) == 0x0001B0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B4, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B8, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001BC, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton, K2Node_Select_Default) == 0x0001C0, "Member 'WB_CharaSelectButton_C_ExecuteUbergraph_WB_CharaSelectButton::K2Node_Select_Default' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.SetInscrollInnerState
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaSelectButton_C_SetInscrollInnerState final
{
public:
	ECharacterSelectInscrollInnerState            NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectButton_C_SetInscrollInnerState) == 0x000001, "Wrong alignment on WB_CharaSelectButton_C_SetInscrollInnerState");
static_assert(sizeof(WB_CharaSelectButton_C_SetInscrollInnerState) == 0x000001, "Wrong size on WB_CharaSelectButton_C_SetInscrollInnerState");
static_assert(offsetof(WB_CharaSelectButton_C_SetInscrollInnerState, NewState) == 0x000000, "Member 'WB_CharaSelectButton_C_SetInscrollInnerState::NewState' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_CharaSelectButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectButton_C_Tick) == 0x000004, "Wrong alignment on WB_CharaSelectButton_C_Tick");
static_assert(sizeof(WB_CharaSelectButton_C_Tick) == 0x00003C, "Wrong size on WB_CharaSelectButton_C_Tick");
static_assert(offsetof(WB_CharaSelectButton_C_Tick, MyGeometry) == 0x000000, "Member 'WB_CharaSelectButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_CharaSelectButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.OnSelectedButton
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaSelectButton_C_OnSelectedButton final
{
public:
	bool                                          PlaySE;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaSelectButton_C_OnSelectedButton) == 0x000001, "Wrong alignment on WB_CharaSelectButton_C_OnSelectedButton");
static_assert(sizeof(WB_CharaSelectButton_C_OnSelectedButton) == 0x000001, "Wrong size on WB_CharaSelectButton_C_OnSelectedButton");
static_assert(offsetof(WB_CharaSelectButton_C_OnSelectedButton, PlaySE) == 0x000000, "Member 'WB_CharaSelectButton_C_OnSelectedButton::PlaySE' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.OnLoaded_F29C97A74F29593B313480BDAF17DBC3
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3");
static_assert(sizeof(WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3) == 0x000008, "Wrong size on WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3");
static_assert(offsetof(WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3, Loaded) == 0x000000, "Member 'WB_CharaSelectButton_C_OnLoaded_F29C97A74F29593B313480BDAF17DBC3::Loaded' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaSelectButton_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharaSelectButton_C_GetButton) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_GetButton");
static_assert(sizeof(WB_CharaSelectButton_C_GetButton) == 0x000008, "Wrong size on WB_CharaSelectButton_C_GetButton");
static_assert(offsetof(WB_CharaSelectButton_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_CharaSelectButton_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.IsMatchCharaInfo
// 0x00E8 (0x00E8 - 0x0000)
struct WB_CharaSelectButton_C_IsMatchCharaInfo final
{
public:
	struct FAJBCharacterInfo                      AJBCharacterInfo;                                  // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bMatch;                                            // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaSelectButton_C_IsMatchCharaInfo) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_IsMatchCharaInfo");
static_assert(sizeof(WB_CharaSelectButton_C_IsMatchCharaInfo) == 0x0000E8, "Wrong size on WB_CharaSelectButton_C_IsMatchCharaInfo");
static_assert(offsetof(WB_CharaSelectButton_C_IsMatchCharaInfo, AJBCharacterInfo) == 0x000000, "Member 'WB_CharaSelectButton_C_IsMatchCharaInfo::AJBCharacterInfo' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_IsMatchCharaInfo, bMatch) == 0x0000E0, "Member 'WB_CharaSelectButton_C_IsMatchCharaInfo::bMatch' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_IsMatchCharaInfo, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000E1, "Member 'WB_CharaSelectButton_C_IsMatchCharaInfo::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WB_CharaSelectButton_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WB_CharaSelectButton_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_OnMouseButtonDown");
static_assert(sizeof(WB_CharaSelectButton_C_OnMouseButtonDown) == 0x000218, "Wrong size on WB_CharaSelectButton_C_OnMouseButtonDown");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WB_CharaSelectButton_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WB_CharaSelectButton_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WB_CharaSelectButton_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WB_CharaSelectButton_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct WB_CharaSelectButton_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WB_CharaSelectButton_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_OnMouseButtonUp");
static_assert(sizeof(WB_CharaSelectButton_C_OnMouseButtonUp) == 0x000218, "Wrong size on WB_CharaSelectButton_C_OnMouseButtonUp");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WB_CharaSelectButton_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WB_CharaSelectButton_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'WB_CharaSelectButton_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WB_CharaSelectButton_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.SetupIconFrame
// 0x00D0 (0x00D0 - 0x0000)
struct WB_CharaSelectButton_C_SetupIconFrame final
{
public:
	int32                                         KillCount;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              Diamond_Materials;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CurrentIndex;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LColorIndex;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_CharaIconFrame                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item2;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item3;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item4;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item5;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item6;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WB_CharaSelectButton_C_SetupIconFrame) == 0x000008, "Wrong alignment on WB_CharaSelectButton_C_SetupIconFrame");
static_assert(sizeof(WB_CharaSelectButton_C_SetupIconFrame) == 0x0000D0, "Wrong size on WB_CharaSelectButton_C_SetupIconFrame");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, KillCount) == 0x000000, "Member 'WB_CharaSelectButton_C_SetupIconFrame::KillCount' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, Diamond_Materials) == 0x000008, "Member 'WB_CharaSelectButton_C_SetupIconFrame::Diamond_Materials' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CurrentIndex) == 0x000018, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CurrentIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, LColorIndex) == 0x00001C, "Member 'WB_CharaSelectButton_C_SetupIconFrame::LColorIndex' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000068, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item) == 0x000080, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item1) == 0x000088, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item2) == 0x000090, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item3) == 0x000098, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item4) == 0x0000A0, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item5) == 0x0000A8, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_Array_Get_Item6) == 0x0000B0, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'WB_CharaSelectButton_C_SetupIconFrame::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_SetupIconFrame, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WB_CharaSelectButton_C_SetupIconFrame::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_CharaSelectButton.WB_CharaSelectButton_C.IsSelectableInTutorial
// 0x0005 (0x0005 - 0x0000)
struct WB_CharaSelectButton_C_IsSelectableInTutorial final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharaSelectButton_C_IsSelectableInTutorial) == 0x000001, "Wrong alignment on WB_CharaSelectButton_C_IsSelectableInTutorial");
static_assert(sizeof(WB_CharaSelectButton_C_IsSelectableInTutorial) == 0x000005, "Wrong size on WB_CharaSelectButton_C_IsSelectableInTutorial");
static_assert(offsetof(WB_CharaSelectButton_C_IsSelectableInTutorial, ReturnValue) == 0x000000, "Member 'WB_CharaSelectButton_C_IsSelectableInTutorial::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectButton_C_IsSelectableInTutorial, CallFunc_PlayModeEquals_bResult) == 0x000001, "Member 'WB_CharaSelectButton_C_IsSelectableInTutorial::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
