#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharacterSelect_PairInfo

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C.ExecuteUbergraph_WB_CharacterSelect_PairInfo
// 0x0168 (0x0168 - 0x0000)
struct WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	class FText                                   K2Node_CustomEvent_TitleName;                      // 0x0040(0x0018)()
	class FText                                   K2Node_CustomEvent_PairPlayerName;                 // 0x0058(0x0018)()
	struct FAJBCharacterInfo                      K2Node_CustomEvent_AJBCharacterInfo;               // 0x0070(0x00E0)(ConstParm)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate1;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo");
static_assert(sizeof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo) == 0x000168, "Wrong size on WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, EntryPoint) == 0x000000, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, Temp_object_Variable) == 0x000008, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000030, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CustomEvent_TitleName) == 0x000040, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CustomEvent_TitleName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CustomEvent_PairPlayerName) == 0x000058, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CustomEvent_PairPlayerName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CustomEvent_AJBCharacterInfo) == 0x000070, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CustomEvent_AJBCharacterInfo' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CustomEvent_Loaded) == 0x000150, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo, K2Node_CreateDelegate_OutputDelegate1) == 0x000158, "Member 'WB_CharacterSelect_PairInfo_C_ExecuteUbergraph_WB_CharacterSelect_PairInfo::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C.SetPairCharacter
// 0x00E0 (0x00E0 - 0x0000)
struct WB_CharacterSelect_PairInfo_C_SetPairCharacter final
{
public:
	struct FAJBCharacterInfo                      AJBCharacterInfo;                                  // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_CharacterSelect_PairInfo_C_SetPairCharacter) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairInfo_C_SetPairCharacter");
static_assert(sizeof(WB_CharacterSelect_PairInfo_C_SetPairCharacter) == 0x0000E0, "Wrong size on WB_CharacterSelect_PairInfo_C_SetPairCharacter");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_SetPairCharacter, AJBCharacterInfo) == 0x000000, "Member 'WB_CharacterSelect_PairInfo_C_SetPairCharacter::AJBCharacterInfo' has a wrong offset!");

// Function WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C.SetPairInfo
// 0x0030 (0x0030 - 0x0000)
struct WB_CharacterSelect_PairInfo_C_SetPairInfo final
{
public:
	class FText                                   TitleName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PairPlayerName;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_CharacterSelect_PairInfo_C_SetPairInfo) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairInfo_C_SetPairInfo");
static_assert(sizeof(WB_CharacterSelect_PairInfo_C_SetPairInfo) == 0x000030, "Wrong size on WB_CharacterSelect_PairInfo_C_SetPairInfo");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_SetPairInfo, TitleName) == 0x000000, "Member 'WB_CharacterSelect_PairInfo_C_SetPairInfo::TitleName' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_SetPairInfo, PairPlayerName) == 0x000018, "Member 'WB_CharacterSelect_PairInfo_C_SetPairInfo::PairPlayerName' has a wrong offset!");

// Function WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C.OnLoaded_C683495D4A6FFF6328BC899C33F27267
// 0x0008 (0x0008 - 0x0000)
struct WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267) == 0x000008, "Wrong alignment on WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267");
static_assert(sizeof(WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267) == 0x000008, "Wrong size on WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267, Loaded) == 0x000000, "Member 'WB_CharacterSelect_PairInfo_C_OnLoaded_C683495D4A6FFF6328BC899C33F27267::Loaded' has a wrong offset!");

// Function WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C.IsShowingUI
// 0x0003 (0x0003 - 0x0000)
struct WB_CharacterSelect_PairInfo_C_IsShowingUI final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_CharacterSelect_PairInfo_C_IsShowingUI) == 0x000001, "Wrong alignment on WB_CharacterSelect_PairInfo_C_IsShowingUI");
static_assert(sizeof(WB_CharacterSelect_PairInfo_C_IsShowingUI) == 0x000003, "Wrong size on WB_CharacterSelect_PairInfo_C_IsShowingUI");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_IsShowingUI, bShow) == 0x000000, "Member 'WB_CharacterSelect_PairInfo_C_IsShowingUI::bShow' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_IsShowingUI, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_CharacterSelect_PairInfo_C_IsShowingUI::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_CharacterSelect_PairInfo_C_IsShowingUI, CallFunc_IsVisible_ReturnValue) == 0x000002, "Member 'WB_CharacterSelect_PairInfo_C_IsShowingUI::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

}

