#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaSelectDecisionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CharaSelectDecisionButton.WB_CharaSelectDecisionButton_C
// 0x0038 (0x02D8 - 0x02A0)
class UWB_CharaSelectDecisionButton_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pressed;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_0;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              ButtonBG_Pattern;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Text;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonCancelledEvent__DelegateSignature();
	void ExecuteUbergraph_WB_CharaSelectDecisionButton(int32 EntryPoint);
	class UAJBButton* GetButton();
	class UAJBTextBlock* GetTextBlock();
	void OnButtonPressedAnimation();
	void OnButtonReleasedAnimation();
	void PlayButtonAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CharaSelectDecisionButton_C">();
	}
	static class UWB_CharaSelectDecisionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CharaSelectDecisionButton_C>();
	}
};
static_assert(alignof(UWB_CharaSelectDecisionButton_C) == 0x000008, "Wrong alignment on UWB_CharaSelectDecisionButton_C");
static_assert(sizeof(UWB_CharaSelectDecisionButton_C) == 0x0002D8, "Wrong size on UWB_CharaSelectDecisionButton_C");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, UberGraphFrame) == 0x0002A0, "Member 'UWB_CharaSelectDecisionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, Anim_Pressed) == 0x0002A8, "Member 'UWB_CharaSelectDecisionButton_C::Anim_Pressed' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, AJBTextBlock_0) == 0x0002B0, "Member 'UWB_CharaSelectDecisionButton_C::AJBTextBlock_0' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, Button) == 0x0002B8, "Member 'UWB_CharaSelectDecisionButton_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, ButtonBG_Pattern) == 0x0002C0, "Member 'UWB_CharaSelectDecisionButton_C::ButtonBG_Pattern' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, RetainerBox_1) == 0x0002C8, "Member 'UWB_CharaSelectDecisionButton_C::RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UWB_CharaSelectDecisionButton_C, Text) == 0x0002D0, "Member 'UWB_CharaSelectDecisionButton_C::Text' has a wrong offset!");

}

