#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DamageAreaMessage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_DamageAreaMessage.WB_DamageAreaMessage_C.ExecuteUbergraph_WB_DamageAreaMessage
// 0x0078 (0x0078 - 0x0000)
struct WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)()
	float                                         K2Node_CustomEvent_DisplayTime;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0028(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage) == 0x000008, "Wrong alignment on WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage");
static_assert(sizeof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage) == 0x000078, "Wrong size on WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage");
static_assert(offsetof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage, EntryPoint) == 0x000000, "Member 'WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage, K2Node_CustomEvent_Text) == 0x000008, "Member 'WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage, K2Node_CustomEvent_DisplayTime) == 0x000020, "Member 'WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage::K2Node_CustomEvent_DisplayTime' has a wrong offset!");
static_assert(offsetof(WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage, K2Node_MakeStruct_SlateFontInfo) == 0x000028, "Member 'WB_DamageAreaMessage_C_ExecuteUbergraph_WB_DamageAreaMessage::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function WB_DamageAreaMessage.WB_DamageAreaMessage_C.ShowMessageText
// 0x0020 (0x0020 - 0x0000)
struct WB_DamageAreaMessage_C_ShowMessageText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         DisplayTime;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DamageAreaMessage_C_ShowMessageText) == 0x000008, "Wrong alignment on WB_DamageAreaMessage_C_ShowMessageText");
static_assert(sizeof(WB_DamageAreaMessage_C_ShowMessageText) == 0x000020, "Wrong size on WB_DamageAreaMessage_C_ShowMessageText");
static_assert(offsetof(WB_DamageAreaMessage_C_ShowMessageText, Text) == 0x000000, "Member 'WB_DamageAreaMessage_C_ShowMessageText::Text' has a wrong offset!");
static_assert(offsetof(WB_DamageAreaMessage_C_ShowMessageText, DisplayTime) == 0x000018, "Member 'WB_DamageAreaMessage_C_ShowMessageText::DisplayTime' has a wrong offset!");

}

