#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DBISequencerSkipper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DBISequencerSkipper.WB_DBISequencerSkipper_C
// 0x0038 (0x0240 - 0x0208)
class UWB_DBISequencerSkipper_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             AJBButton_0;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClickedSkip;                                     // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bAutoRemove;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnClickedSkip__DelegateSignature();
	void ExecuteUbergraph_WB_DBISequencerSkipper(int32 EntryPoint);
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Anim_FadeOut_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void Close();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DBISequencerSkipper_C">();
	}
	static class UWB_DBISequencerSkipper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DBISequencerSkipper_C>();
	}
};
static_assert(alignof(UWB_DBISequencerSkipper_C) == 0x000008, "Wrong alignment on UWB_DBISequencerSkipper_C");
static_assert(sizeof(UWB_DBISequencerSkipper_C) == 0x000240, "Wrong size on UWB_DBISequencerSkipper_C");
static_assert(offsetof(UWB_DBISequencerSkipper_C, UberGraphFrame) == 0x000208, "Member 'UWB_DBISequencerSkipper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DBISequencerSkipper_C, Anim_FadeOut) == 0x000210, "Member 'UWB_DBISequencerSkipper_C::Anim_FadeOut' has a wrong offset!");
static_assert(offsetof(UWB_DBISequencerSkipper_C, AJBButton_0) == 0x000218, "Member 'UWB_DBISequencerSkipper_C::AJBButton_0' has a wrong offset!");
static_assert(offsetof(UWB_DBISequencerSkipper_C, Overlay_0) == 0x000220, "Member 'UWB_DBISequencerSkipper_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWB_DBISequencerSkipper_C, OnClickedSkip) == 0x000228, "Member 'UWB_DBISequencerSkipper_C::OnClickedSkip' has a wrong offset!");
static_assert(offsetof(UWB_DBISequencerSkipper_C, bAutoRemove) == 0x000238, "Member 'UWB_DBISequencerSkipper_C::bAutoRemove' has a wrong offset!");

}

