#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DamageAreaMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DamageAreaMessage.WB_DamageAreaMessage_C
// 0x0028 (0x0230 - 0x0208)
class UWB_DamageAreaMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       TextDisappear;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextAppear;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MessageBelt;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Message;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_DamageAreaMessage(int32 EntryPoint);
	void ShowMessageText(const class FText& Text, float DisplayTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DamageAreaMessage_C">();
	}
	static class UWB_DamageAreaMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DamageAreaMessage_C>();
	}
};
static_assert(alignof(UWB_DamageAreaMessage_C) == 0x000008, "Wrong alignment on UWB_DamageAreaMessage_C");
static_assert(sizeof(UWB_DamageAreaMessage_C) == 0x000230, "Wrong size on UWB_DamageAreaMessage_C");
static_assert(offsetof(UWB_DamageAreaMessage_C, UberGraphFrame) == 0x000208, "Member 'UWB_DamageAreaMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DamageAreaMessage_C, TextDisappear) == 0x000210, "Member 'UWB_DamageAreaMessage_C::TextDisappear' has a wrong offset!");
static_assert(offsetof(UWB_DamageAreaMessage_C, TextAppear) == 0x000218, "Member 'UWB_DamageAreaMessage_C::TextAppear' has a wrong offset!");
static_assert(offsetof(UWB_DamageAreaMessage_C, Image_MessageBelt) == 0x000220, "Member 'UWB_DamageAreaMessage_C::Image_MessageBelt' has a wrong offset!");
static_assert(offsetof(UWB_DamageAreaMessage_C, Text_Message) == 0x000228, "Member 'UWB_DamageAreaMessage_C::Text_Message' has a wrong offset!");

}

