#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmoneyButton_OK

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_EmoneyButton_OK.WB_EmoneyButton_OK_C.ExecuteUbergraph_WB_EmoneyButton_OK
// 0x0004 (0x0004 - 0x0000)
struct WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK) == 0x000004, "Wrong alignment on WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK");
static_assert(sizeof(WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK) == 0x000004, "Wrong size on WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK");
static_assert(offsetof(WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK, EntryPoint) == 0x000000, "Member 'WB_EmoneyButton_OK_C_ExecuteUbergraph_WB_EmoneyButton_OK::EntryPoint' has a wrong offset!");

// Function WB_EmoneyButton_OK.WB_EmoneyButton_OK_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoneyButton_OK_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_EmoneyButton_OK_C_GetButton) == 0x000008, "Wrong alignment on WB_EmoneyButton_OK_C_GetButton");
static_assert(sizeof(WB_EmoneyButton_OK_C_GetButton) == 0x000008, "Wrong size on WB_EmoneyButton_OK_C_GetButton");
static_assert(offsetof(WB_EmoneyButton_OK_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_EmoneyButton_OK_C_GetButton::ReturnValue' has a wrong offset!");

}

