#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FullMap

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_FullMap.WB_FullMap_C.ExecuteUbergraph_WB_FullMap
// 0x0038 (0x0038 - 0x0000)
struct WB_FullMap_C_ExecuteUbergraph_WB_FullMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bLocationDown;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap) == 0x000008, "Wrong alignment on WB_FullMap_C_ExecuteUbergraph_WB_FullMap");
static_assert(sizeof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap) == 0x000038, "Wrong size on WB_FullMap_C_ExecuteUbergraph_WB_FullMap");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, EntryPoint) == 0x000000, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, Temp_bool_Variable) == 0x000004, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, Temp_byte_Variable) == 0x000005, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, Temp_byte_Variable1) == 0x000006, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_PlayModeEquals_bResult) == 0x000007, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, K2Node_CustomEvent_bLocationDown) == 0x000008, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::K2Node_CustomEvent_bLocationDown' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, K2Node_Select_Default) == 0x000009, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_ExecuteUbergraph_WB_FullMap, CallFunc_MakeVector2D_ReturnValue1) == 0x000030, "Member 'WB_FullMap_C_ExecuteUbergraph_WB_FullMap::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.ChangeFullMapGuideLocation
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_ChangeFullMapGuideLocation final
{
public:
	bool                                          bLocationDown;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_ChangeFullMapGuideLocation) == 0x000001, "Wrong alignment on WB_FullMap_C_ChangeFullMapGuideLocation");
static_assert(sizeof(WB_FullMap_C_ChangeFullMapGuideLocation) == 0x000001, "Wrong size on WB_FullMap_C_ChangeFullMapGuideLocation");
static_assert(offsetof(WB_FullMap_C_ChangeFullMapGuideLocation, bLocationDown) == 0x000000, "Member 'WB_FullMap_C_ChangeFullMapGuideLocation::bLocationDown' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedUp) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedUp");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedUp) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedUp");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedUp, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedUp::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedRight) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedRight");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedRight) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedRight");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedRight, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedRight::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedLeft) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedLeft");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedLeft) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedLeft");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedLeft, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedLeft::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedDown) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedDown");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedDown) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedDown");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedDown, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedDown::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedDecide) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedDecide");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedDecide) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedDecide");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedDecide, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedDecide::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedCancel) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedCancel");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedCancel) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedCancel");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedCancel, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedCancel::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedUp) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedUp");
static_assert(sizeof(WB_FullMap_C_OnInputPressedUp) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedUp");
static_assert(offsetof(WB_FullMap_C_OnInputPressedUp, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedUp::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedRight) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedRight");
static_assert(sizeof(WB_FullMap_C_OnInputPressedRight) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedRight");
static_assert(offsetof(WB_FullMap_C_OnInputPressedRight, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedRight::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedLeft) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedLeft");
static_assert(sizeof(WB_FullMap_C_OnInputPressedLeft) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedLeft");
static_assert(offsetof(WB_FullMap_C_OnInputPressedLeft, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedLeft::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedDown) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedDown");
static_assert(sizeof(WB_FullMap_C_OnInputPressedDown) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedDown");
static_assert(offsetof(WB_FullMap_C_OnInputPressedDown, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedDown::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedDecide) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedDecide");
static_assert(sizeof(WB_FullMap_C_OnInputPressedDecide) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedDecide");
static_assert(offsetof(WB_FullMap_C_OnInputPressedDecide, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedDecide::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedCancel) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedCancel");
static_assert(sizeof(WB_FullMap_C_OnInputPressedCancel) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedCancel");
static_assert(offsetof(WB_FullMap_C_OnInputPressedCancel, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedCancel::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_IsModeless) == 0x000001, "Wrong alignment on WB_FullMap_C_IsModeless");
static_assert(sizeof(WB_FullMap_C_IsModeless) == 0x000001, "Wrong size on WB_FullMap_C_IsModeless");
static_assert(offsetof(WB_FullMap_C_IsModeless, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_IsModeless::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_FullMap_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputTurnRate) == 0x000004, "Wrong alignment on WB_FullMap_C_OnInputTurnRate");
static_assert(sizeof(WB_FullMap_C_OnInputTurnRate) == 0x000008, "Wrong size on WB_FullMap_C_OnInputTurnRate");
static_assert(offsetof(WB_FullMap_C_OnInputTurnRate, Value) == 0x000000, "Member 'WB_FullMap_C_OnInputTurnRate::Value' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputTurnRate, ReturnValue) == 0x000004, "Member 'WB_FullMap_C_OnInputTurnRate::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_FullMap_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputMoveRight) == 0x000004, "Wrong alignment on WB_FullMap_C_OnInputMoveRight");
static_assert(sizeof(WB_FullMap_C_OnInputMoveRight) == 0x000008, "Wrong size on WB_FullMap_C_OnInputMoveRight");
static_assert(offsetof(WB_FullMap_C_OnInputMoveRight, Value) == 0x000000, "Member 'WB_FullMap_C_OnInputMoveRight::Value' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputMoveRight, ReturnValue) == 0x000004, "Member 'WB_FullMap_C_OnInputMoveRight::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_FullMap_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputMoveForward) == 0x000004, "Wrong alignment on WB_FullMap_C_OnInputMoveForward");
static_assert(sizeof(WB_FullMap_C_OnInputMoveForward) == 0x000008, "Wrong size on WB_FullMap_C_OnInputMoveForward");
static_assert(offsetof(WB_FullMap_C_OnInputMoveForward, Value) == 0x000000, "Member 'WB_FullMap_C_OnInputMoveForward::Value' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputMoveForward, ReturnValue) == 0x000004, "Member 'WB_FullMap_C_OnInputMoveForward::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_FullMap_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputLookupRate) == 0x000004, "Wrong alignment on WB_FullMap_C_OnInputLookupRate");
static_assert(sizeof(WB_FullMap_C_OnInputLookupRate) == 0x000008, "Wrong size on WB_FullMap_C_OnInputLookupRate");
static_assert(offsetof(WB_FullMap_C_OnInputLookupRate, Value) == 0x000000, "Member 'WB_FullMap_C_OnInputLookupRate::Value' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputLookupRate, ReturnValue) == 0x000004, "Member 'WB_FullMap_C_OnInputLookupRate::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedTouch) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedTouch");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedTouch) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedTouch");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedTouch, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedTouch::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_FullMap_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedTouch) == 0x000004, "Wrong alignment on WB_FullMap_C_OnInputPressedTouch");
static_assert(sizeof(WB_FullMap_C_OnInputPressedTouch) == 0x00000C, "Wrong size on WB_FullMap_C_OnInputPressedTouch");
static_assert(offsetof(WB_FullMap_C_OnInputPressedTouch, LocationX) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedTouch::LocationX' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputPressedTouch, LocationY) == 0x000004, "Member 'WB_FullMap_C_OnInputPressedTouch::LocationY' has a wrong offset!");
static_assert(offsetof(WB_FullMap_C_OnInputPressedTouch, ReturnValue) == 0x000008, "Member 'WB_FullMap_C_OnInputPressedTouch::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedR2) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedR2");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedR2) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedR2");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedR2, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedR2::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedR1) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedR1");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedR1) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedR1");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedR1, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedR1::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedL2) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedL2");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedL2) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedL2");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedL2, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedL2::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedL1) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedL1");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedL1) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedL1");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedL1, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedL1::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedR2) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedR2");
static_assert(sizeof(WB_FullMap_C_OnInputPressedR2) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedR2");
static_assert(offsetof(WB_FullMap_C_OnInputPressedR2, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedR2::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedR1) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedR1");
static_assert(sizeof(WB_FullMap_C_OnInputPressedR1) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedR1");
static_assert(offsetof(WB_FullMap_C_OnInputPressedR1, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedR1::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedL2) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedL2");
static_assert(sizeof(WB_FullMap_C_OnInputPressedL2) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedL2");
static_assert(offsetof(WB_FullMap_C_OnInputPressedL2, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedL2::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedL1) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedL1");
static_assert(sizeof(WB_FullMap_C_OnInputPressedL1) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedL1");
static_assert(offsetof(WB_FullMap_C_OnInputPressedL1, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedL1::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputReleasedL3) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputReleasedL3");
static_assert(sizeof(WB_FullMap_C_OnInputReleasedL3) == 0x000001, "Wrong size on WB_FullMap_C_OnInputReleasedL3");
static_assert(offsetof(WB_FullMap_C_OnInputReleasedL3, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputReleasedL3::ReturnValue' has a wrong offset!");

// Function WB_FullMap.WB_FullMap_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMap_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMap_C_OnInputPressedL3) == 0x000001, "Wrong alignment on WB_FullMap_C_OnInputPressedL3");
static_assert(sizeof(WB_FullMap_C_OnInputPressedL3) == 0x000001, "Wrong size on WB_FullMap_C_OnInputPressedL3");
static_assert(offsetof(WB_FullMap_C_OnInputPressedL3, ReturnValue) == 0x000000, "Member 'WB_FullMap_C_OnInputPressedL3::ReturnValue' has a wrong offset!");

}

