#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FullMapGuide

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_FullMapGuide.WB_FullMapGuide_C.ExecuteUbergraph_WB_FullMapGuide
// 0x0018 (0x0018 - 0x0000)
struct WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide) == 0x000008, "Wrong alignment on WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide");
static_assert(sizeof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide) == 0x000018, "Wrong size on WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide");
static_assert(offsetof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide, EntryPoint) == 0x000000, "Member 'WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide, CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture) == 0x000008, "Member 'WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide::CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture' has a wrong offset!");
static_assert(offsetof(WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide, CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture1) == 0x000010, "Member 'WB_FullMapGuide_C_ExecuteUbergraph_WB_FullMapGuide::CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture1' has a wrong offset!");

// Function WB_FullMapGuide.WB_FullMapGuide_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_FullMapGuide_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_FullMapGuide_C_PreConstruct) == 0x000001, "Wrong alignment on WB_FullMapGuide_C_PreConstruct");
static_assert(sizeof(WB_FullMapGuide_C_PreConstruct) == 0x000001, "Wrong size on WB_FullMapGuide_C_PreConstruct");
static_assert(offsetof(WB_FullMapGuide_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_FullMapGuide_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

