#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameResultTicket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_GameResultTicket.WB_GameResultTicket_C
// 0x0220 (0x04E0 - 0x02C0)
class UWB_GameResultTicket_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UOverlay*                               Over_TicketDetail;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameResultTicket_Detail_C*          ResultTicket_Detail_1;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameResultTicket_Detail_C*          ResultTicket_Detail_2;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameResultTicket_Detail_C*          ResultTicket_Detail_3;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameResultTicket_Detail_C*          ResultTicket_Detail_4;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameResultTicket_Detail_C*          ResultTicket_Detail_5;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TicketNum;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TotalTicketNum;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BG_Animation_C*                     WB_BG_Animation;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_YES;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RewardEffect_C*                     WB_RewardEffect;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsUpdateTimeCountdown;                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CountDownElapsedTime;                              // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBHUDBase*                            CachedAJBHUD;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownTimeMax;                                  // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGameResult                         ReceiveGameResult;                                 // 0x0338(0x0190)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	int32                                         PreGameTicket;                                     // 0x04C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NowGameTicket;                                     // 0x04CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UWB_GameResultTicket_Detail_C*>  DetailWidgets;                                     // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_GameResultTicket(int32 EntryPoint);
	void StopTimeCountDown();
	void StartTimeCountDown();
	void UpdateDisplay();
	void BndEvt__WB_CommonButton_Yes_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void Construct();
	void OnFinishedOpenCurveAnim();
	void OnClosingWindow();
	void OnOpeningWindow();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GetRewardAchieveTicket(int32* TicketCount);
	class UWB_GameResultTicket_Detail_C* TryGetDetailWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_GameResultTicket_C">();
	}
	static class UWB_GameResultTicket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GameResultTicket_C>();
	}
};
static_assert(alignof(UWB_GameResultTicket_C) == 0x000008, "Wrong alignment on UWB_GameResultTicket_C");
static_assert(sizeof(UWB_GameResultTicket_C) == 0x0004E0, "Wrong size on UWB_GameResultTicket_C");
static_assert(offsetof(UWB_GameResultTicket_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_GameResultTicket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, Over_TicketDetail) == 0x0002C8, "Member 'UWB_GameResultTicket_C::Over_TicketDetail' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ResultTicket_Detail_1) == 0x0002D0, "Member 'UWB_GameResultTicket_C::ResultTicket_Detail_1' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ResultTicket_Detail_2) == 0x0002D8, "Member 'UWB_GameResultTicket_C::ResultTicket_Detail_2' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ResultTicket_Detail_3) == 0x0002E0, "Member 'UWB_GameResultTicket_C::ResultTicket_Detail_3' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ResultTicket_Detail_4) == 0x0002E8, "Member 'UWB_GameResultTicket_C::ResultTicket_Detail_4' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ResultTicket_Detail_5) == 0x0002F0, "Member 'UWB_GameResultTicket_C::ResultTicket_Detail_5' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, TicketNum) == 0x0002F8, "Member 'UWB_GameResultTicket_C::TicketNum' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, TotalTicketNum) == 0x000300, "Member 'UWB_GameResultTicket_C::TotalTicketNum' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, WB_BG_Animation) == 0x000308, "Member 'UWB_GameResultTicket_C::WB_BG_Animation' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, WB_CommonButton_YES) == 0x000310, "Member 'UWB_GameResultTicket_C::WB_CommonButton_YES' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, WB_RewardEffect) == 0x000318, "Member 'UWB_GameResultTicket_C::WB_RewardEffect' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, bIsUpdateTimeCountdown) == 0x000320, "Member 'UWB_GameResultTicket_C::bIsUpdateTimeCountdown' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, CountDownElapsedTime) == 0x000324, "Member 'UWB_GameResultTicket_C::CountDownElapsedTime' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, CachedAJBHUD) == 0x000328, "Member 'UWB_GameResultTicket_C::CachedAJBHUD' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, CountDownTimeMax) == 0x000330, "Member 'UWB_GameResultTicket_C::CountDownTimeMax' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, ReceiveGameResult) == 0x000338, "Member 'UWB_GameResultTicket_C::ReceiveGameResult' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, PreGameTicket) == 0x0004C8, "Member 'UWB_GameResultTicket_C::PreGameTicket' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, NowGameTicket) == 0x0004CC, "Member 'UWB_GameResultTicket_C::NowGameTicket' has a wrong offset!");
static_assert(offsetof(UWB_GameResultTicket_C, DetailWidgets) == 0x0004D0, "Member 'UWB_GameResultTicket_C::DetailWidgets' has a wrong offset!");

}

