#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameModeView

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_GameModeView.WB_GameModeView_C.ExecuteUbergraph_WB_GameModeView
// 0x00A0 (0x00A0 - 0x0000)
struct WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsOfflineMode_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x002C(0x0008)(ConstParm, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PpBuy_C*                            K2Node_DynamicCast_AsWB_Pp_Buy;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PpBuy_C*                            K2Node_DynamicCast_AsWB_Pp_Buy1;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBHUDBase*                            K2Node_DynamicCast_AsAJBHUDBase;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView) == 0x000008, "Wrong alignment on WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView");
static_assert(sizeof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView) == 0x0000A0, "Wrong size on WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, EntryPoint) == 0x000000, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, Temp_bool_Variable) == 0x000004, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, Temp_byte_Variable) == 0x000005, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, Temp_byte_Variable1) == 0x000006, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_IsOfflineMode_ReturnValue) == 0x000028, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_IsOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_GetShopEventSettings_ReturnValue) == 0x00002C, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_Select_Default) == 0x000034, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000035, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_CustomEvent_TargetWidget1) == 0x000050, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_CustomEvent_TargetWidget1' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_AsWB_Pp_Buy) == 0x000058, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_AsWB_Pp_Buy' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_CustomEvent_TargetWidget) == 0x000068, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_AsWB_Pp_Buy1) == 0x000070, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_AsWB_Pp_Buy1' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, CallFunc_GetHUD_ReturnValue) == 0x000088, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_AsAJBHUDBase) == 0x000090, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_AsAJBHUDBase' has a wrong offset!");
static_assert(offsetof(WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView, K2Node_DynamicCast_bSuccess2) == 0x000098, "Member 'WB_GameModeView_C_ExecuteUbergraph_WB_GameModeView::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function WB_GameModeView.WB_GameModeView_C.OnClosed
// 0x0008 (0x0008 - 0x0000)
struct WB_GameModeView_C_OnClosed final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GameModeView_C_OnClosed) == 0x000008, "Wrong alignment on WB_GameModeView_C_OnClosed");
static_assert(sizeof(WB_GameModeView_C_OnClosed) == 0x000008, "Wrong size on WB_GameModeView_C_OnClosed");
static_assert(offsetof(WB_GameModeView_C_OnClosed, TargetWidget) == 0x000000, "Member 'WB_GameModeView_C_OnClosed::TargetWidget' has a wrong offset!");

// Function WB_GameModeView.WB_GameModeView_C.OnOpen
// 0x0008 (0x0008 - 0x0000)
struct WB_GameModeView_C_OnOpen final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GameModeView_C_OnOpen) == 0x000008, "Wrong alignment on WB_GameModeView_C_OnOpen");
static_assert(sizeof(WB_GameModeView_C_OnOpen) == 0x000008, "Wrong size on WB_GameModeView_C_OnOpen");
static_assert(offsetof(WB_GameModeView_C_OnOpen, TargetWidget) == 0x000000, "Member 'WB_GameModeView_C_OnOpen::TargetWidget' has a wrong offset!");

}

