#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Highlight_SaveSelectWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_Highlight_SaveSelectWindow.WB_Highlight_SaveSelectWindow_C.ExecuteUbergraph_WB_Highlight_SaveSelectWindow
// 0x0568 (0x0568 - 0x0000)
struct WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_PpBuyWindow_C*                      CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue1;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Credit_C*                           CallFunc_Create_ReturnValue2;                      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Credit_C*                           CallFunc_FindAJBWidgetOfClass_OutWidget;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue3;                      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget2;                  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBPlayerControllerBase*               K2Node_DynamicCast_AsAJBPlayer_Controller_Base1;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAJBVideoRecorder*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	class AAJBVideoRecorder*                      CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetProgress_ReturnValue;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinalizeAviWriter_ReturnValue;            // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBHighlightManager_bIsValid;          // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBHighlightManager*                   CallFunc_GetAJBHighlightManager_ReturnValue;       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishedCreateMovie_ReturnValue;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RequestEncodeMovie_ErrorMessage;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestEncodeMovie_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue1;        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate4;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class UNetHttp*                               CallFunc_Create_ReturnValue4;                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FColor>                         CallFunc_GetThumbnailData_Color;                   // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetThumbnailData_Width;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetThumbnailData_Height;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetThumbnailData_Result;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBHighlightManager*                   CallFunc_GetHighlightManager_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetMoviePath_ReturnValue;                 // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAJBNetAPI_UploadHighlight*             CallFunc_Request_UploadHighlight_ReturnValue;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUploadHighlight_ReturnValue;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcProgress_Progress;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable5;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue2;        // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue5;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable;                                // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetThumbnailTexture_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinalizeAviWriter_ReturnValue1;           // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentSection;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalSection;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result2;                        // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentSection1;                // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalSection1;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAJBNetAPIResult Result, int32 CurrentSection, int32 TotalSection)> K2Node_CreateDelegate_OutputDelegate8;             // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAJBNetAPIResult Result, int32 CurrentSection, int32 TotalSection)> K2Node_CreateDelegate_OutputDelegate9;             // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result3;                        // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentSection2;                // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalSection2;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result, int32 CurrentSection, int32 TotalSection)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0310(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor1;                    // 0x0320(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue6;             // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable2; // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333[0x5];                                      // 0x0333(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBHighlightPlayerController_C*     K2Node_DynamicCast_AsBP_AJBHighlight_Player_Controller; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHighlightVersion_ReturnValue;          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeOutActionProxy*                    CallFunc_FadeOut_ReturnValue;                      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxHighlightUploadNum_ReturnValue;     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0390(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03D0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03E0(0x0018)()
	bool                                          CallFunc_GetAJBGameInstance_bSuccess4;             // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance4;    // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHighlightUploadRemainingNum_ReturnValue; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxHighlightUploadNum_ReturnValue1;    // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0410(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0450(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0490(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x04A0(0x0018)()
	bool                                          CallFunc_IsTimeCountdowning_ReturnValue;           // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x04C0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue7;             // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x04E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTimeCountdowning_ReturnValue1;          // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimeCountdowning_ReturnValue2;          // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue5;                      // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectedBuy_bSelected;                  // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue6;                      // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBConfirmResult                             K2Node_CustomEvent_Result;                         // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable5;                // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B[0x5];                                      // 0x052B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAJBVideoRecorder*>              CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0538(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBVideoRecorder*                      CallFunc_Array_Get_Item1;                          // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow) == 0x000008, "Wrong alignment on WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow");
static_assert(sizeof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow) == 0x000568, "Wrong size on WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, EntryPoint) == 0x000000, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_IsClosed_Variable1) == 0x000006, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_IsClosed_Variable2) == 0x000007, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Has_Been_Initd_Variable1) == 0x000018, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000019, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_IsClosed_Variable3) == 0x00001A, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Has_Been_Initd_Variable2) == 0x00001B, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CreateDelegate_OutputDelegate1) == 0x000020, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000030, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000031, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_MakeLiteralByte_ReturnValue2) == 0x000032, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue) == 0x000033, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_MakeLiteralByte_ReturnValue3) == 0x000034, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_MakeLiteralByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CreateDelegate_OutputDelegate3) == 0x000050, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Create_ReturnValue1) == 0x000060, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_Event_MyGeometry) == 0x000068, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Has_Been_Initd_Variable3) == 0x0000A4, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue1) == 0x0000A5, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x0000A8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue2) == 0x0000B0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x0000B8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_ComponentBoundEvent_TargetButton1) == 0x0000C0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_ComponentBoundEvent_OwnerWidget) == 0x0000C8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_ComponentBoundEvent_TargetButton) == 0x0000D0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Create_ReturnValue2) == 0x0000E0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_FindAJBWidgetOfClass_OutWidget) == 0x0000E8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_FindAJBWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue3) == 0x0000F0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_IsClosed_Variable4) == 0x0000F1, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_IsClosed_Variable4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Create_ReturnValue3) == 0x0000F8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CustomEvent_TargetWidget2) == 0x000100, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CustomEvent_TargetWidget2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetAJBGameInstance_bSuccess) == 0x000108, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000110, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetPlayerController_ReturnValue1) == 0x000118, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetPlayerController_ReturnValue2) == 0x000120, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base) == 0x000128, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_DynamicCast_AsAJBPlayer_Controller_Base1) == 0x000138, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_DynamicCast_AsAJBPlayer_Controller_Base1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_DynamicCast_bSuccess1) == 0x000140, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue4) == 0x000141, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetAllActorsOfClass_OutActors) == 0x000148, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Array_Get_Item) == 0x000158, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Conv_FloatToString_ReturnValue) == 0x000160, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Greater_IntInt_ReturnValue) == 0x000184, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000188, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_IsValid_ReturnValue5) == 0x000190, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetProgress_ReturnValue) == 0x000194, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000198, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_FinalizeAviWriter_ReturnValue) == 0x00019C, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_FinalizeAviWriter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_MakeLiteralByte_ReturnValue4) == 0x00019D, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_MakeLiteralByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetAJBHighlightManager_bIsValid) == 0x00019E, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetAJBHighlightManager_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetAJBHighlightManager_ReturnValue) == 0x0001A0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetAJBHighlightManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_FinishedCreateMovie_ReturnValue) == 0x0001A8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_FinishedCreateMovie_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_RequestEncodeMovie_ErrorMessage) == 0x0001B0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_RequestEncodeMovie_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_RequestEncodeMovie_ReturnValue) == 0x0001C0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_RequestEncodeMovie_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001C4, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001C8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001CC, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_FClamp_ReturnValue) == 0x0001D0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetWorldDeltaSeconds_ReturnValue1) == 0x0001D4, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetWorldDeltaSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0001D8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0001DC, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_FClamp_ReturnValue1) == 0x0001E0, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_FClamp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, Temp_bool_Has_Been_Initd_Variable4) == 0x0001E4, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, K2Node_CreateDelegate_OutputDelegate4) == 0x0001E8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_Create_ReturnValue4) == 0x0001F8, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_Create_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetThumbnailData_Color) == 0x000200, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetThumbnailData_Color' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetThumbnailData_Width) == 0x000210, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetThumbnailData_Width' has a wrong offset!");
static_assert(offsetof(WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow, CallFunc_GetThumbnailData_Height) == 0x000214, "Member 'WB_Highlight_SaveSelectWindow_C_ExecuteUbergraph_WB_Highlight_SaveSelectWindow::CallFunc_GetThumbnailData_Height' has a wrong offset!");
