#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Highlight_LoadingWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_Highlight_LoadingWindow.WB_Highlight_LoadingWindow_C.ExecuteUbergraph_WB_Highlight_LoadingWindow
// 0x0020 (0x0020 - 0x0000)
struct WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow) == 0x000008, "Wrong alignment on WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow");
static_assert(sizeof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow) == 0x000020, "Wrong size on WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow");
static_assert(offsetof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow, EntryPoint) == 0x000000, "Member 'WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow, K2Node_CustomEvent_Value) == 0x000004, "Member 'WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000008, "Member 'WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WB_Highlight_LoadingWindow.WB_Highlight_LoadingWindow_C.UpdateProgressBar
// 0x0004 (0x0004 - 0x0000)
struct WB_Highlight_LoadingWindow_C_UpdateProgressBar final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Highlight_LoadingWindow_C_UpdateProgressBar) == 0x000004, "Wrong alignment on WB_Highlight_LoadingWindow_C_UpdateProgressBar");
static_assert(sizeof(WB_Highlight_LoadingWindow_C_UpdateProgressBar) == 0x000004, "Wrong size on WB_Highlight_LoadingWindow_C_UpdateProgressBar");
static_assert(offsetof(WB_Highlight_LoadingWindow_C_UpdateProgressBar, Value) == 0x000000, "Member 'WB_Highlight_LoadingWindow_C_UpdateProgressBar::Value' has a wrong offset!");

}

