#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HighlightProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_HighlightProgressBar.WB_HighlightProgressBar_C
// 0x0020 (0x02E0 - 0x02C0)
class UWB_HighlightProgressBar_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ProgressBar;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          ProgressNum;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_HighlightProgressBar(int32 EntryPoint);
	void UpdateProgressBar(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_HighlightProgressBar_C">();
	}
	static class UWB_HighlightProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_HighlightProgressBar_C>();
	}
};
static_assert(alignof(UWB_HighlightProgressBar_C) == 0x000008, "Wrong alignment on UWB_HighlightProgressBar_C");
static_assert(sizeof(UWB_HighlightProgressBar_C) == 0x0002E0, "Wrong size on UWB_HighlightProgressBar_C");
static_assert(offsetof(UWB_HighlightProgressBar_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_HighlightProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_HighlightProgressBar_C, ProgressBar) == 0x0002C8, "Member 'UWB_HighlightProgressBar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWB_HighlightProgressBar_C, ProgressNum) == 0x0002D0, "Member 'UWB_HighlightProgressBar_C::ProgressNum' has a wrong offset!");
static_assert(offsetof(UWB_HighlightProgressBar_C, NewVar_0) == 0x0002D8, "Member 'UWB_HighlightProgressBar_C::NewVar_0' has a wrong offset!");

}

