#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HighlightFader

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_HighlightFader.WB_HighlightFader_C.ExecuteUbergraph_WB_HighlightFader
// 0x0050 (0x0050 - 0x0000)
struct WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBHighlightManager_bIsValid;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBHighlightManager*                   CallFunc_GetAJBHighlightManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader) == 0x000008, "Wrong alignment on WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader");
static_assert(sizeof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader) == 0x000050, "Wrong size on WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, EntryPoint) == 0x000000, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000010, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000030, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000038, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, CallFunc_GetAJBHighlightManager_bIsValid) == 0x000040, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::CallFunc_GetAJBHighlightManager_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader, CallFunc_GetAJBHighlightManager_ReturnValue) == 0x000048, "Member 'WB_HighlightFader_C_ExecuteUbergraph_WB_HighlightFader::CallFunc_GetAJBHighlightManager_ReturnValue' has a wrong offset!");

}

