#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameLoadingOld

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_InGameLoadingOld.WB_InGameLoadingOld_C.ExecuteUbergraph_WB_InGameLoadingOld
// 0x0030 (0x0030 - 0x0000)
struct WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableDebugDisplay_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld) == 0x000008, "Wrong alignment on WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld");
static_assert(sizeof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld) == 0x000030, "Wrong size on WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, EntryPoint) == 0x000000, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable) == 0x000004, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable) == 0x000005, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Variable1) == 0x000006, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable1) == 0x000007, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable2) == 0x000008, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00000A, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_Has_Been_Initd_Variable) == 0x00000B, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000010, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_IsEnableDebugDisplay_ReturnValue) == 0x000019, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_IsEnableDebugDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult) == 0x00001A, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult1) == 0x00001B, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult1' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_PlayModeEquals_bResult2) == 0x00001C, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_PlayModeEquals_bResult2' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, Temp_byte_Variable3) == 0x00001E, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select_Default) == 0x00001F, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, K2Node_Select1_Default) == 0x000020, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000028, "Member 'WB_InGameLoadingOld_C_ExecuteUbergraph_WB_InGameLoadingOld::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");

}

