#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameLoadingOld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_InGameLoadingOld.WB_InGameLoadingOld_C
// 0x0070 (0x0330 - 0x02C0)
class UWB_InGameLoadingOld_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_3;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_4;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_5;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_DangerArea;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Line1;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Line2;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_SafeArea;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_SignalPin_ExplanationWindow;              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_SignalPin_ExplanationWindow;           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameModeView_C*                     WB_GameModeView;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TipsOld_C*                          WB_Tips;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                LastPlayWaitingSE;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_InGameLoadingOld(int32 EntryPoint);
	void CallStatLevels();
	void OnClosingWindow();
	void OnOpeningWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_InGameLoadingOld_C">();
	}
	static class UWB_InGameLoadingOld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_InGameLoadingOld_C>();
	}
};
static_assert(alignof(UWB_InGameLoadingOld_C) == 0x000008, "Wrong alignment on UWB_InGameLoadingOld_C");
static_assert(sizeof(UWB_InGameLoadingOld_C) == 0x000330, "Wrong size on UWB_InGameLoadingOld_C");
static_assert(offsetof(UWB_InGameLoadingOld_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_InGameLoadingOld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, Loop) == 0x0002C8, "Member 'UWB_InGameLoadingOld_C::Loop' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_3) == 0x0002D0, "Member 'UWB_InGameLoadingOld_C::AJBImage_3' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_4) == 0x0002D8, "Member 'UWB_InGameLoadingOld_C::AJBImage_4' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_5) == 0x0002E0, "Member 'UWB_InGameLoadingOld_C::AJBImage_5' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_DangerArea) == 0x0002E8, "Member 'UWB_InGameLoadingOld_C::AJBImage_DangerArea' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_Line1) == 0x0002F0, "Member 'UWB_InGameLoadingOld_C::AJBImage_Line1' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_Line2) == 0x0002F8, "Member 'UWB_InGameLoadingOld_C::AJBImage_Line2' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_SafeArea) == 0x000300, "Member 'UWB_InGameLoadingOld_C::AJBImage_SafeArea' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, AJBImage_SignalPin_ExplanationWindow) == 0x000308, "Member 'UWB_InGameLoadingOld_C::AJBImage_SignalPin_ExplanationWindow' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, CanvasPanel_SignalPin_ExplanationWindow) == 0x000310, "Member 'UWB_InGameLoadingOld_C::CanvasPanel_SignalPin_ExplanationWindow' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, WB_GameModeView) == 0x000318, "Member 'UWB_InGameLoadingOld_C::WB_GameModeView' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, WB_Tips) == 0x000320, "Member 'UWB_InGameLoadingOld_C::WB_Tips' has a wrong offset!");
static_assert(offsetof(UWB_InGameLoadingOld_C, LastPlayWaitingSE) == 0x000328, "Member 'UWB_InGameLoadingOld_C::LastPlayWaitingSE' has a wrong offset!");

}

