#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameMain

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_InGameMain.WB_InGameMain_C.ExecuteUbergraph_WB_InGameMain
// 0x02F8 (0x02F8 - 0x0000)
struct WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Operator;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Target;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CauserType;                           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLivingPlayerCount_Count;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacter;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0050(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	TArray<class UWB_SkillPartsTimer_C*>          K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x011C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Tag1;                                 // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatValue;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_Tag2;                                 // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x01B0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue1;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F0(0x0008)(NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableDebugInput_ReturnValue;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid1;                // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue1;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableDebugInput_ReturnValue1;          // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_UI_FollowPairInfo_C*>        CallFunc_Map_Values_Values;                        // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_UI_FollowPairInfo_C*                CallFunc_Array_Get_Item;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0280(0x0018)()
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBUIMapManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x02B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBUIMapManager_C*                  CallFunc_Array_Get_Item1;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid2;                // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue2;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDevMouseCursorController_C*      CallFunc_GetComponentByClass_ReturnValue2;         // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain) == 0x000008, "Wrong alignment on WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain");
static_assert(sizeof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain) == 0x0002F8, "Wrong size on WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, EntryPoint) == 0x000000, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag) == 0x000008, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Operator) == 0x000010, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Target) == 0x000018, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_CauserType) == 0x000020, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_CauserType' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_SerialNumber) == 0x000028, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000038, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetLivingPlayerCount_Count) == 0x000044, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetLivingPlayerCount_Count' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CustomEvent_TargetCharacter) == 0x000048, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000050, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_MakeArray_Array) == 0x000108, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000118, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_MyGeometry) == 0x00011C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_InDeltaTime) == 0x000154, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x000158, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag1) == 0x000160, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_FloatValue) == 0x000168, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_FloatValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000170, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_ComponentBoundEvent_TargetButton) == 0x000178, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, Temp_int_Array_Index_Variable) == 0x000180, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000188, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_PlayCameraShake_ReturnValue) == 0x000190, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_Event_Tag2) == 0x000198, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_Event_Tag2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001A8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_MakeColor_ReturnValue) == 0x0001B0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate1) == 0x0001C0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetDynamicMaterial_ReturnValue1) == 0x0001D0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetDynamicMaterial_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x0001D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, K2Node_CreateDelegate_OutputDelegate2) == 0x0001E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBGameInstance_bSuccess) == 0x0001F8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000200, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsPlayingReplay_ReturnValue) == 0x000208, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue) == 0x000209, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, Temp_int_Loop_Counter_Variable) == 0x00020C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid) == 0x000210, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue) == 0x000218, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue) == 0x000220, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Add_IntInt_ReturnValue) == 0x00022C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEnableDebugInput_ReturnValue) == 0x000230, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEnableDebugInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid1) == 0x000231, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue1) == 0x000238, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue1) == 0x000240, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue1) == 0x000248, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEnableDebugInput_ReturnValue1) == 0x000249, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEnableDebugInput_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Length_ReturnValue) == 0x00024C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue2) == 0x000250, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsVisible_ReturnValue) == 0x000251, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000254, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000258, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Map_Values_Values) == 0x000260, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Get_Item) == 0x000270, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Length_ReturnValue1) == 0x000278, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Less_IntInt_ReturnValue) == 0x00027C, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_MakeLiteralText_ReturnValue) == 0x000280, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000298, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x0002A0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetCurrentFlowState_FlowState) == 0x0002A8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAllActorsOfClass_OutActors) == 0x0002B0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0002C0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Array_Get_Item1) == 0x0002C8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue1) == 0x0002D0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue3) == 0x0002D1, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsEditor_ReturnValue) == 0x0002D2, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_bIsValid2) == 0x0002D3, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_bIsValid2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetAJBInGameHUD_ReturnValue2) == 0x0002D8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetAJBInGameHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue2) == 0x0002E0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_GetComponentByClass_ReturnValue2) == 0x0002E8, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsValid_ReturnValue4) == 0x0002F0, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_IsDistribution_ReturnValue) == 0x0002F1, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_Not_PreBool_ReturnValue3) == 0x0002F2, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain, CallFunc_BooleanAND_ReturnValue) == 0x0002F3, "Member 'WB_InGameMain_C_ExecuteUbergraph_WB_InGameMain::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_InGameMain_C_BndEvt__WB_EndTrainingButton_0_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.AddGameplayTag
// 0x0028 (0x0028 - 0x0000)
struct WB_InGameMain_C_AddGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Operator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CauserType;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_AddGameplayTag) == 0x000008, "Wrong alignment on WB_InGameMain_C_AddGameplayTag");
static_assert(sizeof(WB_InGameMain_C_AddGameplayTag) == 0x000028, "Wrong size on WB_InGameMain_C_AddGameplayTag");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTag, Tag) == 0x000000, "Member 'WB_InGameMain_C_AddGameplayTag::Tag' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTag, Operator) == 0x000008, "Member 'WB_InGameMain_C_AddGameplayTag::Operator' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTag, Target) == 0x000010, "Member 'WB_InGameMain_C_AddGameplayTag::Target' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTag, CauserType) == 0x000018, "Member 'WB_InGameMain_C_AddGameplayTag::CauserType' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTag, SerialNumber) == 0x000020, "Member 'WB_InGameMain_C_AddGameplayTag::SerialNumber' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.InitializeInGameMainUI
// 0x0008 (0x0008 - 0x0000)
struct WB_InGameMain_C_InitializeInGameMainUI final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_InitializeInGameMainUI) == 0x000008, "Wrong alignment on WB_InGameMain_C_InitializeInGameMainUI");
static_assert(sizeof(WB_InGameMain_C_InitializeInGameMainUI) == 0x000008, "Wrong size on WB_InGameMain_C_InitializeInGameMainUI");
static_assert(offsetof(WB_InGameMain_C_InitializeInGameMainUI, TargetCharacter) == 0x000000, "Member 'WB_InGameMain_C_InitializeInGameMainUI::TargetCharacter' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_InGameMain_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_Tick) == 0x000004, "Wrong alignment on WB_InGameMain_C_Tick");
static_assert(sizeof(WB_InGameMain_C_Tick) == 0x00003C, "Wrong size on WB_InGameMain_C_Tick");
static_assert(offsetof(WB_InGameMain_C_Tick, MyGeometry) == 0x000000, "Member 'WB_InGameMain_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_InGameMain_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.AddGameplayTagWithFloat
// 0x0010 (0x0010 - 0x0000)
struct WB_InGameMain_C_AddGameplayTagWithFloat final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         FloatValue;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_AddGameplayTagWithFloat) == 0x000008, "Wrong alignment on WB_InGameMain_C_AddGameplayTagWithFloat");
static_assert(sizeof(WB_InGameMain_C_AddGameplayTagWithFloat) == 0x000010, "Wrong size on WB_InGameMain_C_AddGameplayTagWithFloat");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTagWithFloat, Tag) == 0x000000, "Member 'WB_InGameMain_C_AddGameplayTagWithFloat::Tag' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_AddGameplayTagWithFloat, FloatValue) == 0x000008, "Member 'WB_InGameMain_C_AddGameplayTagWithFloat::FloatValue' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.RemoveGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct WB_InGameMain_C_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_RemoveGameplayTag) == 0x000008, "Wrong alignment on WB_InGameMain_C_RemoveGameplayTag");
static_assert(sizeof(WB_InGameMain_C_RemoveGameplayTag) == 0x000008, "Wrong size on WB_InGameMain_C_RemoveGameplayTag");
static_assert(offsetof(WB_InGameMain_C_RemoveGameplayTag, Tag) == 0x000000, "Member 'WB_InGameMain_C_RemoveGameplayTag::Tag' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.UpdateMP
// 0x0058 (0x0058 - 0x0000)
struct WB_InGameMain_C_UpdateMP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLInvisibleSkill;                                  // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LValue;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameMain_C_UpdateMP) == 0x000008, "Wrong alignment on WB_InGameMain_C_UpdateMP");
static_assert(sizeof(WB_InGameMain_C_UpdateMP) == 0x000058, "Wrong size on WB_InGameMain_C_UpdateMP");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, DeltaTime) == 0x000000, "Member 'WB_InGameMain_C_UpdateMP::DeltaTime' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, bLInvisibleSkill) == 0x000004, "Member 'WB_InGameMain_C_UpdateMP::bLInvisibleSkill' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, LValue) == 0x000008, "Member 'WB_InGameMain_C_UpdateMP::LValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_InGameMain_C_UpdateMP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'WB_InGameMain_C_UpdateMP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_FInterpTo_ReturnValue) == 0x00001C, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_InGameMain_C_UpdateMP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00002C, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000030, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_IsSkillActive_ReturnValue) == 0x000041, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_IsSkillActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000050, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameMain_C_UpdateMP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000054, "Member 'WB_InGameMain_C_UpdateMP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_InGameMain.WB_InGameMain_C.UpdateHPAndAPAndCP
// 0x00A8 (0x00A8 - 0x0000)
struct WB_InGameMain_C_UpdateHPAndAPAndCP final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AdditionalAP_C>    K2Node_DynamicCast_AsBI_Additional_AP1;            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueMax_AAPValueMax;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_AAPValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue5;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
