#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkCautionPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_LandmarkBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LandmarkCautionPlayer.WB_LandmarkCautionPlayer_C
// 0x0038 (0x02A8 - 0x0270)
class UWB_LandmarkCautionPlayer_C final : public UWB_LandmarkBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_LandmarkCautionPlayer_C;         // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_Pin;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Pin;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_SubPixeler;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Scaler;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Resizer;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PrevScale;                                         // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LandmarkCautionPlayer(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetInnerScale(float InnerScale_0);

	void IsTouchMarker(const struct FVector2D& TouchPosition, float Scale, bool* IsTouch) const;
	void GetContentWidget(class UWidget** ContentWidget) const;
	class URetainerBox* GetRetainerBoxWidget() const;
	void GetResizerWidget(class USizeBox** SizeBox) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LandmarkCautionPlayer_C">();
	}
	static class UWB_LandmarkCautionPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LandmarkCautionPlayer_C>();
	}
};
static_assert(alignof(UWB_LandmarkCautionPlayer_C) == 0x000008, "Wrong alignment on UWB_LandmarkCautionPlayer_C");
static_assert(sizeof(UWB_LandmarkCautionPlayer_C) == 0x0002A8, "Wrong size on UWB_LandmarkCautionPlayer_C");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, UberGraphFrame_WB_LandmarkCautionPlayer_C) == 0x000270, "Member 'UWB_LandmarkCautionPlayer_C::UberGraphFrame_WB_LandmarkCautionPlayer_C' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, AJBImage_Pin) == 0x000278, "Member 'UWB_LandmarkCautionPlayer_C::AJBImage_Pin' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, Overlay_Pin) == 0x000280, "Member 'UWB_LandmarkCautionPlayer_C::Overlay_Pin' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, RetainerBox_SubPixeler) == 0x000288, "Member 'UWB_LandmarkCautionPlayer_C::RetainerBox_SubPixeler' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, ScaleBox_Scaler) == 0x000290, "Member 'UWB_LandmarkCautionPlayer_C::ScaleBox_Scaler' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, SizeBox_Resizer) == 0x000298, "Member 'UWB_LandmarkCautionPlayer_C::SizeBox_Resizer' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkCautionPlayer_C, PrevScale) == 0x0002A0, "Member 'UWB_LandmarkCautionPlayer_C::PrevScale' has a wrong offset!");

}

