#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_Card

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lottery_Card.WB_Lottery_Card_C
// 0x0078 (0x0318 - 0x02A0)
class UWB_Lottery_Card_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Release;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_FadeFlash;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_2;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_3;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             CardButton;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              MT_Flash;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Aura_Card_C*                        WB_Aura;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Aura_Yellow_C*                      WB_Aura_Yellow;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClickedCardDispatcher;                           // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         AuraOffset;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnClickedCardDispatcher__DelegateSignature(class UWB_Lottery_Card_C* ClickCardWidget);
	void ExecuteUbergraph_WB_Lottery_Card(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void PlayAnim_Release();
	void PlayAnim_Appear();
	void OnButtonReleasedAnimation();
	void OnButtonPressedAnimation();
	void SetupPremiumCard(bool bPremium);
	void BndEvt__CardButton_K2Node_ComponentBoundEvent_2_OnButtonCancelledEvent__DelegateSignature();
	void EnableInput(bool bInIsEnabled);
	class UAJBButton* GetButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lottery_Card_C">();
	}
	static class UWB_Lottery_Card_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lottery_Card_C>();
	}
};
static_assert(alignof(UWB_Lottery_Card_C) == 0x000008, "Wrong alignment on UWB_Lottery_Card_C");
static_assert(sizeof(UWB_Lottery_Card_C) == 0x000318, "Wrong size on UWB_Lottery_Card_C");
static_assert(offsetof(UWB_Lottery_Card_C, UberGraphFrame) == 0x0002A0, "Member 'UWB_Lottery_Card_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, Release) == 0x0002A8, "Member 'UWB_Lottery_Card_C::Release' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, Press) == 0x0002B0, "Member 'UWB_Lottery_Card_C::Press' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, Appear) == 0x0002B8, "Member 'UWB_Lottery_Card_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, AJBImage_FadeFlash) == 0x0002C0, "Member 'UWB_Lottery_Card_C::AJBImage_FadeFlash' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, AJBRetainerBox_2) == 0x0002C8, "Member 'UWB_Lottery_Card_C::AJBRetainerBox_2' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, AJBRetainerBox_3) == 0x0002D0, "Member 'UWB_Lottery_Card_C::AJBRetainerBox_3' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, CardButton) == 0x0002D8, "Member 'UWB_Lottery_Card_C::CardButton' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, MT_Flash) == 0x0002E0, "Member 'UWB_Lottery_Card_C::MT_Flash' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, WB_Aura) == 0x0002E8, "Member 'UWB_Lottery_Card_C::WB_Aura' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, WB_Aura_Yellow) == 0x0002F0, "Member 'UWB_Lottery_Card_C::WB_Aura_Yellow' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, WidgetSwitcher_0) == 0x0002F8, "Member 'UWB_Lottery_Card_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, OnClickedCardDispatcher) == 0x000300, "Member 'UWB_Lottery_Card_C::OnClickedCardDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_Lottery_Card_C, AuraOffset) == 0x000310, "Member 'UWB_Lottery_Card_C::AuraOffset' has a wrong offset!");

}

