#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkPairMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_LandmarkBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LandmarkPairMarker.WB_LandmarkPairMarker_C
// 0x0030 (0x02A0 - 0x0270)
class UWB_LandmarkPairMarker_C final : public UWB_LandmarkBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_LandmarkPairMarker_C;            // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UOverlay*                               Overlay_Pin;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_SubPixeler;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Scaler;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Resizer;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PrevScale;                                         // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LandmarkPairMarker(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetInnerScale(float InnerScale_0);

	void GetContentWidget(class UWidget** ContentWidget) const;
	void GetResizerWidget(class USizeBox** SizeBox) const;
	class URetainerBox* GetRetainerBoxWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LandmarkPairMarker_C">();
	}
	static class UWB_LandmarkPairMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LandmarkPairMarker_C>();
	}
};
static_assert(alignof(UWB_LandmarkPairMarker_C) == 0x000008, "Wrong alignment on UWB_LandmarkPairMarker_C");
static_assert(sizeof(UWB_LandmarkPairMarker_C) == 0x0002A0, "Wrong size on UWB_LandmarkPairMarker_C");
static_assert(offsetof(UWB_LandmarkPairMarker_C, UberGraphFrame_WB_LandmarkPairMarker_C) == 0x000270, "Member 'UWB_LandmarkPairMarker_C::UberGraphFrame_WB_LandmarkPairMarker_C' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkPairMarker_C, Overlay_Pin) == 0x000278, "Member 'UWB_LandmarkPairMarker_C::Overlay_Pin' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkPairMarker_C, RetainerBox_SubPixeler) == 0x000280, "Member 'UWB_LandmarkPairMarker_C::RetainerBox_SubPixeler' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkPairMarker_C, ScaleBox_Scaler) == 0x000288, "Member 'UWB_LandmarkPairMarker_C::ScaleBox_Scaler' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkPairMarker_C, SizeBox_Resizer) == 0x000290, "Member 'UWB_LandmarkPairMarker_C::SizeBox_Resizer' has a wrong offset!");
static_assert(offsetof(UWB_LandmarkPairMarker_C, PrevScale) == 0x000298, "Member 'UWB_LandmarkPairMarker_C::PrevScale' has a wrong offset!");

}

