#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_Card

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_Lottery_Card.WB_Lottery_Card_C.OnClickedCardDispatcher__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature final
{
public:
	class UWB_Lottery_Card_C*                     ClickCardWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature) == 0x000008, "Wrong alignment on WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature");
static_assert(sizeof(WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature) == 0x000008, "Wrong size on WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature");
static_assert(offsetof(WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature, ClickCardWidget) == 0x000000, "Member 'WB_Lottery_Card_C_OnClickedCardDispatcher__DelegateSignature::ClickCardWidget' has a wrong offset!");

// Function WB_Lottery_Card.WB_Lottery_Card_C.ExecuteUbergraph_WB_Lottery_Card
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsEnabled;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPremium;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card) == 0x000004, "Wrong alignment on WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card");
static_assert(sizeof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card) == 0x000010, "Wrong size on WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card");
static_assert(offsetof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card, EntryPoint) == 0x000000, "Member 'WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card, K2Node_CustomEvent_bInIsEnabled) == 0x000004, "Member 'WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card::K2Node_CustomEvent_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card, K2Node_CustomEvent_bPremium) == 0x000005, "Member 'WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card::K2Node_CustomEvent_bPremium' has a wrong offset!");
static_assert(offsetof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000008, "Member 'WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_Lottery_Card.WB_Lottery_Card_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Lottery_Card_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Lottery_Card_C_PreConstruct");
static_assert(sizeof(WB_Lottery_Card_C_PreConstruct) == 0x000001, "Wrong size on WB_Lottery_Card_C_PreConstruct");
static_assert(offsetof(WB_Lottery_Card_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Lottery_Card_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Lottery_Card.WB_Lottery_Card_C.SetupPremiumCard
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_SetupPremiumCard final
{
public:
	bool                                          bPremium;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Lottery_Card_C_SetupPremiumCard) == 0x000001, "Wrong alignment on WB_Lottery_Card_C_SetupPremiumCard");
static_assert(sizeof(WB_Lottery_Card_C_SetupPremiumCard) == 0x000001, "Wrong size on WB_Lottery_Card_C_SetupPremiumCard");
static_assert(offsetof(WB_Lottery_Card_C_SetupPremiumCard, bPremium) == 0x000000, "Member 'WB_Lottery_Card_C_SetupPremiumCard::bPremium' has a wrong offset!");

// Function WB_Lottery_Card.WB_Lottery_Card_C.EnableInput
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_EnableInput final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Lottery_Card_C_EnableInput) == 0x000001, "Wrong alignment on WB_Lottery_Card_C_EnableInput");
static_assert(sizeof(WB_Lottery_Card_C_EnableInput) == 0x000001, "Wrong size on WB_Lottery_Card_C_EnableInput");
static_assert(offsetof(WB_Lottery_Card_C_EnableInput, bInIsEnabled) == 0x000000, "Member 'WB_Lottery_Card_C_EnableInput::bInIsEnabled' has a wrong offset!");

// Function WB_Lottery_Card.WB_Lottery_Card_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_Card_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lottery_Card_C_GetButton) == 0x000008, "Wrong alignment on WB_Lottery_Card_C_GetButton");
static_assert(sizeof(WB_Lottery_Card_C_GetButton) == 0x000008, "Wrong size on WB_Lottery_Card_C_GetButton");
static_assert(offsetof(WB_Lottery_Card_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_Lottery_Card_C_GetButton::ReturnValue' has a wrong offset!");

}

