#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkableMap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_LandmarkableMap.WB_LandmarkableMap_C.ExecuteUbergraph_WB_LandmarkableMap
// 0x04E0 (0x04E0 - 0x0000)
struct WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_ElapsedTime_Variable;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_CustomEvent_MyGeometry1;                    // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_CustomEvent_MouseEvent1;                    // 0x0060(0x0070)(ConstParm)
	struct FGeometry                              K2Node_CustomEvent_MyGeometry;                     // 0x00D0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_CustomEvent_MouseEvent;                     // 0x0108(0x0070)(ConstParm)
	struct FVector2D                              CallFunc_CalcStickPosition_StickPosition;          // 0x0178(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcStickPosition_NormalizedStickPosition; // 0x0180(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcStickPosition_bIsValid;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_CalcStickPosition_StickPosition1;         // 0x018C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcStickPosition_NormalizedStickPosition1; // 0x0194(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcStickPosition_bIsValid1;              // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryRemoveLandmark_Removed;                // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01A0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue1;        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue2;        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_InPosition;                     // 0x01E4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InScale;                        // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampPosition_ReturnValue;                // 0x01F0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampScale_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2DInterpTo_ReturnValue;             // 0x01FC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_TargetPosition;                 // 0x0208(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ScrollScaleTarget;              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampPosition_ReturnValue1;               // 0x0214(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampScale_ReturnValue1;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcMapScale_ReturnValue;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0224(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0238(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition3;            // 0x0240(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_IconAngle1;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkableMap_C*                  K2Node_CustomEvent_MapWidget3;                     // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x025C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Vector2d_ReturnValue;         // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition2;            // 0x0280(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_IconAngle;                      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkableMap_C*                  K2Node_CustomEvent_MapWidget2;                     // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisibleIcon;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PairHP;                         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue1;   // 0x02A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition1;            // 0x02AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkableMap_C*                  K2Node_CustomEvent_MapWidget1;                     // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SignalPinType1;                 // 0x02C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FromMap;                        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DFloat_ReturnValue;       // 0x02CC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_NormalizedPosition;             // 0x02D4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkableMap_C*                  K2Node_CustomEvent_MapWidget;                      // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SignalPinType;                  // 0x02E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue2;   // 0x02F0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DFloat_ReturnValue1;      // 0x02FC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue3;   // 0x0304(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBUIMapManager_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue;    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue1;   // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnableBlink;                   // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353[0x1];                                      // 0x0353(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0354(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue1;      // 0x035C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x036F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_LandmarkBase_C*                     K2Node_Select_Default;                             // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkBase_C*                     K2Node_Select1_Default;                            // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0394(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue1;     // 0x03B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x03BC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcMapScale_ReturnValue1;                // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid;                 // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue;              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBInGameHUD_C>    K2Node_DynamicCast_AsBI_AJBIn_Game_HUD;            // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBUIMapManager_C*                  CallFunc_GetUIMapManager_Manager;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& NormalizedPosition, class UWB_LandmarkableMap_C* MapWidget, const struct FGameplayTag& SignalTypeTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0400(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector2D& NormalizedPosition, class UWB_LandmarkableMap_C* MapWidget, const struct FGameplayTag& SignalTypeTag, bool FromMap)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0438(0x0008)(NoDestructor)
	TDelegate<void(const struct FVector2D& NormalizedPosition, float IconAngle, class UWB_LandmarkableMap_C* MapWidget, bool bVisibleIcon, int32 PairHP)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0440(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FVector2D& NormalizedPosition, float IconAngle, class UWB_LandmarkableMap_C* MapWidget)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0450(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_LandmarkBase_C*                     CallFunc_Array_Get_Item;                           // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBUIMapManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0478(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBUIMapManager_C*                  CallFunc_Array_Get_Item1;                          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_LandmarkBase_C*                     CallFunc_Array_Get_Item2;                          // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B6[0x2];                                      // 0x04B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_LandmarkBase_C*                     K2Node_DynamicCast_AsWB_Landmark_Base;             // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA[0x2];                                      // 0x04DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap) == 0x000010, "Wrong alignment on WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap");
static_assert(sizeof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap) == 0x0004E0, "Wrong size on WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, EntryPoint) == 0x000000, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Variable) == 0x000004, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_float_ElapsedTime_Variable) == 0x00000C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_float_ElapsedTime_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000019, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_int_Variable) == 0x00001C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MyGeometry1) == 0x000024, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MyGeometry1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MouseEvent1) == 0x000060, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MouseEvent1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MyGeometry) == 0x0000D0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MouseEvent) == 0x000108, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MouseEvent' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_StickPosition) == 0x000178, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_StickPosition' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_NormalizedStickPosition) == 0x000180, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_NormalizedStickPosition' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_bIsValid) == 0x000188, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_StickPosition1) == 0x00018C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_StickPosition1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_NormalizedStickPosition1) == 0x000194, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_NormalizedStickPosition1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcStickPosition_bIsValid1) == 0x00019C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcStickPosition_bIsValid1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_TryRemoveLandmark_Removed) == 0x00019D, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_TryRemoveLandmark_Removed' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Event_MyGeometry) == 0x0001A0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Event_InDeltaTime) == 0x0001D8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetWorldDeltaSeconds_ReturnValue1) == 0x0001DC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetWorldDeltaSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetWorldDeltaSeconds_ReturnValue2) == 0x0001E0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetWorldDeltaSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_InPosition) == 0x0001E4, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_InPosition' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_InScale) == 0x0001EC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_InScale' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_ClampPosition_ReturnValue) == 0x0001F0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_ClampPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_ClampScale_ReturnValue) == 0x0001F8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_ClampScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Vector2DInterpTo_ReturnValue) == 0x0001FC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Vector2DInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_FInterpTo_ReturnValue) == 0x000204, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_TargetPosition) == 0x000208, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_TargetPosition' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_ScrollScaleTarget) == 0x000210, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_ScrollScaleTarget' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_ClampPosition_ReturnValue1) == 0x000214, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_ClampPosition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_ClampScale_ReturnValue1) == 0x00021C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_ClampScale_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcMapScale_ReturnValue) == 0x000220, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcMapScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetDesiredSize_ReturnValue) == 0x000224, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Event_IsDesignTime) == 0x00022C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000234, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000238, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_NormalizedPosition3) == 0x000240, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_NormalizedPosition3' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_IconAngle1) == 0x000248, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_IconAngle1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MapWidget3) == 0x000250, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MapWidget3' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000258, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x00025C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_int_Variable1) == 0x000264, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Add_IntInt_ReturnValue1) == 0x000268, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BuildString_Vector2d_ReturnValue) == 0x000270, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BuildString_Vector2d_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_NormalizedPosition2) == 0x000280, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_NormalizedPosition2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_IconAngle) == 0x000288, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_IconAngle' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MapWidget2) == 0x000290, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MapWidget2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_bVisibleIcon) == 0x000298, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_bVisibleIcon' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_PairHP) == 0x00029C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_PairHP' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DVector2D_ReturnValue1) == 0x0002A0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0002A8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_NormalizedPosition1) == 0x0002AC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_NormalizedPosition1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MapWidget1) == 0x0002B8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MapWidget1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_SignalPinType1) == 0x0002C0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_SignalPinType1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_FromMap) == 0x0002C8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_FromMap' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0002C9, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Subtract_Vector2DFloat_ReturnValue) == 0x0002CC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Subtract_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_NormalizedPosition) == 0x0002D4, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_NormalizedPosition' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_MapWidget) == 0x0002E0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_MapWidget' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_SignalPinType) == 0x0002E8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_SignalPinType' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DVector2D_ReturnValue2) == 0x0002F0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x0002F8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Subtract_Vector2DFloat_ReturnValue1) == 0x0002FC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Subtract_Vector2DFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DVector2D_ReturnValue3) == 0x000304, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_MakeTransform_ReturnValue) == 0x000310, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000340, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_FinishSpawningActor_ReturnValue) == 0x000348, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_NotEqual_Vector2DVector2D_ReturnValue) == 0x000350, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_NotEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_NotEqual_Vector2DVector2D_ReturnValue1) == 0x000351, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_NotEqual_Vector2DVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_bEnableBlink) == 0x000352, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_bEnableBlink' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000354, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Multiply_Vector2DFloat_ReturnValue1) == 0x00035C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Multiply_Vector2DFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakVector2D_X) == 0x000364, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakVector2D_Y) == 0x000368, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_IsValid_ReturnValue) == 0x00036C, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CustomEvent_bIsVisible) == 0x00036D, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CustomEvent_bIsVisible' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Variable1) == 0x00036E, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Has_Been_Initd_Variable1) == 0x00036F, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Variable2) == 0x000370, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_bool_Variable3) == 0x000371, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000374, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Select_Default) == 0x000378, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000380, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Select1_Default) == 0x000388, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000390, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000394, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakColor_R) == 0x0003A4, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakColor_G) == 0x0003A8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakColor_B) == 0x0003AC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakColor_A) == 0x0003B0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Divide_Vector2DVector2D_ReturnValue1) == 0x0003B4, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Divide_Vector2DVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_MakeVector2D_ReturnValue) == 0x0003BC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakVector2D_X1) == 0x0003C4, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_BreakVector2D_Y1) == 0x0003C8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_CalcMapScale_ReturnValue1) == 0x0003CC, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_CalcMapScale_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetAJBInGameHUD_bIsValid) == 0x0003D0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetAJBInGameHUD_bIsValid' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetAJBInGameHUD_ReturnValue) == 0x0003D8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetAJBInGameHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_DynamicCast_AsBI_AJBIn_Game_HUD) == 0x0003E0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_DynamicCast_AsBI_AJBIn_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_DynamicCast_bSuccess) == 0x0003F0, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetUIMapManager_Manager) == 0x0003F8, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetUIMapManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CreateDelegate_OutputDelegate) == 0x000400, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_IsValid_ReturnValue1) == 0x000410, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CreateDelegate_OutputDelegate1) == 0x000418, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CreateDelegate_OutputDelegate2) == 0x000428, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000438, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CreateDelegate_OutputDelegate3) == 0x000440, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_CreateDelegate_OutputDelegate4) == 0x000450, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_int_Variable2) == 0x000460, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Add_IntInt_ReturnValue2) == 0x000464, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Array_Get_Item) == 0x000468, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Less_IntInt_ReturnValue) == 0x000470, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, Temp_float_Variable) == 0x000474, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_GetAllActorsOfClass_OutActors) == 0x000478, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, CallFunc_Array_Get_Item1) == 0x000488, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap, K2Node_Select2_Default) == 0x000490, "Member 'WB_LandmarkableMap_C_ExecuteUbergraph_WB_LandmarkableMap::K2Node_Select2_Default' has a wrong offset!");
