#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LivingPlayerCount

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_LivingPlayerCount.WB_LivingPlayerCount_C.ExecuteUbergraph_WB_LivingPlayerCount
// 0x0058 (0x0058 - 0x0000)
struct WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue1;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue2;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0044(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount) == 0x000008, "Wrong alignment on WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount");
static_assert(sizeof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount) == 0x000058, "Wrong size on WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, EntryPoint) == 0x000000, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, Temp_bool_Variable) == 0x000004, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, Temp_byte_Variable) == 0x000005, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, Temp_byte_Variable1) == 0x000006, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_GetBrushResourceAsMaterial_ReturnValue) == 0x000008, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_GetBrushResourceAsMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_GetBrushResourceAsMaterial_ReturnValue1) == 0x000018, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_GetBrushResourceAsMaterial_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000020, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_GetBrushResourceAsMaterial_ReturnValue2) == 0x000030, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_GetBrushResourceAsMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000038, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, K2Node_Select_Default) == 0x000040, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount, CallFunc_MakeColor_ReturnValue) == 0x000044, "Member 'WB_LivingPlayerCount_C_ExecuteUbergraph_WB_LivingPlayerCount::CallFunc_MakeColor_ReturnValue' has a wrong offset!");

// Function WB_LivingPlayerCount.WB_LivingPlayerCount_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_LivingPlayerCount_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_LivingPlayerCount_C_PreConstruct) == 0x000001, "Wrong alignment on WB_LivingPlayerCount_C_PreConstruct");
static_assert(sizeof(WB_LivingPlayerCount_C_PreConstruct) == 0x000001, "Wrong size on WB_LivingPlayerCount_C_PreConstruct");
static_assert(offsetof(WB_LivingPlayerCount_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_LivingPlayerCount_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_LivingPlayerCount.WB_LivingPlayerCount_C.UpdateLivingPlayerNum
// 0x0060 (0x0060 - 0x0000)
struct WB_LivingPlayerCount_C_UpdateLivingPlayerNum final
{
public:
	int32                                         NewNum;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LNum;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0024(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChangeColorLivingPlayerCount_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum) == 0x000008, "Wrong alignment on WB_LivingPlayerCount_C_UpdateLivingPlayerNum");
static_assert(sizeof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum) == 0x000060, "Wrong size on WB_LivingPlayerCount_C_UpdateLivingPlayerNum");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, NewNum) == 0x000000, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::NewNum' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, LNum) == 0x000004, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::LNum' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, Temp_byte_Variable) == 0x000008, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_BuildString_Int_ReturnValue) == 0x000010, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_MakeColor_ReturnValue) == 0x000024, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, Temp_byte_Variable1) == 0x000034, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000035, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x000036, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_Divide_IntInt_ReturnValue) == 0x000038, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00003C, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, Temp_bool_Variable) == 0x000040, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, K2Node_Select_Default) == 0x000041, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000044, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_Percent_IntInt_ReturnValue) == 0x000048, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x00004C, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000050, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_GetChangeColorLivingPlayerCount_ReturnValue) == 0x000054, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_GetChangeColorLivingPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x000058, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_LivingPlayerCount_C_UpdateLivingPlayerNum, CallFunc_SelectFloat_ReturnValue) == 0x00005C, "Member 'WB_LivingPlayerCount_C_UpdateLivingPlayerNum::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

}

