#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MenuTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MenuTitle.WB_MenuTitle_C
// 0x0060 (0x0268 - 0x0208)
class UWB_MenuTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_0;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           ModeSelect_TxtRoot;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubTitle;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Title;                                             // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MenuTitle;                                         // 0x0230(0x0018)(Edit, BlueprintVisible)
	class FText                                   MenuSubTitle;                                      // 0x0248(0x0018)(Edit, BlueprintVisible)
	class UClass*                                 ModeSelect_TxtBaseClass;                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_MenuTitle(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MenuTitle_C">();
	}
	static class UWB_MenuTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MenuTitle_C>();
	}
};
static_assert(alignof(UWB_MenuTitle_C) == 0x000008, "Wrong alignment on UWB_MenuTitle_C");
static_assert(sizeof(UWB_MenuTitle_C) == 0x000268, "Wrong size on UWB_MenuTitle_C");
static_assert(offsetof(UWB_MenuTitle_C, UberGraphFrame) == 0x000208, "Member 'UWB_MenuTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, AJBImage_0) == 0x000210, "Member 'UWB_MenuTitle_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, ModeSelect_TxtRoot) == 0x000218, "Member 'UWB_MenuTitle_C::ModeSelect_TxtRoot' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, SubTitle) == 0x000220, "Member 'UWB_MenuTitle_C::SubTitle' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, Title) == 0x000228, "Member 'UWB_MenuTitle_C::Title' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, MenuTitle) == 0x000230, "Member 'UWB_MenuTitle_C::MenuTitle' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, MenuSubTitle) == 0x000248, "Member 'UWB_MenuTitle_C::MenuSubTitle' has a wrong offset!");
static_assert(offsetof(UWB_MenuTitle_C, ModeSelect_TxtBaseClass) == 0x000260, "Member 'UWB_MenuTitle_C::ModeSelect_TxtBaseClass' has a wrong offset!");

}

