#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_PAIR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.ExecuteUbergraph_WB_ModeSelect_Button_PAIR
// 0x00E0 (0x00E0 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelectable;                          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_NeedPP;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBMatchSchedule                      CallFunc_GetNationalMatchSchedule_OutMatchSchedule; // 0x0048(0x0018)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime; // 0x0060(0x0020)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime; // 0x0080(0x0020)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetNextMatchableDateText_bSuccess;     // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetNextMatchableDateText_Result;       // 0x00A8(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x00C4(0x0008)(ConstParm, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSoloMode;                      // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR) == 0x0000E0, "Wrong size on WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, EntryPoint) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_bool_Variable) == 0x000004, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_int_Variable) == 0x000008, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_int_Variable1) == 0x00000C, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_byte_Variable) == 0x000010, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000011, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_bool_Has_Been_Initd_Variable) == 0x000012, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_Event_bSelectable) == 0x000013, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_Event_bSelectable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_Event_NeedPP) == 0x000014, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_Event_NeedPP' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_bool_Variable1) == 0x000031, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_Event_IsDesignTime) == 0x000032, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_IsPressableVisibility_ReturnValue) == 0x000033, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_IsPressableVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetAJBGameInstance_bSuccess) == 0x000034, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000038, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode) == 0x000040, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode) == 0x000041, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetNationalMatchSchedule_OutMatchSchedule) == 0x000048, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetNationalMatchSchedule_OutMatchSchedule' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime) == 0x000060, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime) == 0x000080, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Not_PreBool_ReturnValue1) == 0x0000A1, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_TryGetNextMatchableDateText_bSuccess) == 0x0000A2, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_TryGetNextMatchableDateText_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_TryGetNextMatchableDateText_Result) == 0x0000A8, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_TryGetNextMatchableDateText_Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x0000C1, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Not_PreBool_ReturnValue2) == 0x0000C2, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, Temp_byte_Variable1) == 0x0000C3, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_GetShopEventSettings_ReturnValue) == 0x0000C4, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_Select_Default) == 0x0000CC, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_CustomEvent_bSoloMode) == 0x0000CD, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_CustomEvent_bSoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, K2Node_Select1_Default) == 0x0000D0, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000D4, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x0000D5, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_BooleanOR_ReturnValue) == 0x0000D6, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_BooleanOR_ReturnValue1) == 0x0000D7, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Not_PreBool_ReturnValue3) == 0x0000D8, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_BooleanOR_ReturnValue2) == 0x0000D9, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR, CallFunc_Not_PreBool_ReturnValue4) == 0x0000DA, "Member 'WB_ModeSelect_Button_PAIR_C_ExecuteUbergraph_WB_ModeSelect_Button_PAIR::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.SwitchDisplayMode
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode final
{
public:
	bool                                          bSoloMode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode) == 0x000001, "Wrong size on WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode, bSoloMode) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_SwitchDisplayMode::bSoloMode' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_GetButton) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_GetButton");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_GetButton) == 0x000008, "Wrong size on WB_ModeSelect_Button_PAIR_C_GetButton");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_PreConstruct");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_PreConstruct) == 0x000001, "Wrong size on WB_ModeSelect_Button_PAIR_C_PreConstruct");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.SetNeedPP
// 0x0004 (0x0004 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_SetNeedPP final
{
public:
	int32                                         NeedPP_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_SetNeedPP) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_SetNeedPP");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_SetNeedPP) == 0x000004, "Wrong size on WB_ModeSelect_Button_PAIR_C_SetNeedPP");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_SetNeedPP, NeedPP_0) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_SetNeedPP::NeedPP_0' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.SetEnableSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_SetEnableSelect final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_SetEnableSelect) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_SetEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_SetEnableSelect) == 0x000001, "Wrong size on WB_ModeSelect_Button_PAIR_C_SetEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_SetEnableSelect, bSelectable) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_SetEnableSelect::bSelectable' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.IsEnableSelect
// 0x0088 (0x0088 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_IsEnableSelect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAJBArcadeGamePlay_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x0004(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBMatchSchedule                      CallFunc_GetNationalMatchSchedule_OutMatchSchedule; // 0x0020(0x0018)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime; // 0x0038(0x0020)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime; // 0x0058(0x0020)(NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAJBArcadeGamePlay_ReturnValue1;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable1;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue1;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_IsEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect) == 0x000088, "Wrong size on WB_ModeSelect_Button_PAIR_C_IsEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, bEnable) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_CanAJBArcadeGamePlay_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_CanAJBArcadeGamePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_IsEnableSelect_bEnable) == 0x000002, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_IsEnableSelect_bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetShopEventSettings_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetAJBGameInstance_bSuccess) == 0x00000D, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000010, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode) == 0x000018, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode) == 0x000019, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutMatchSchedule) == 0x000020, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutMatchSchedule' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime) == 0x000038, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime) == 0x000058, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x000078, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_CanAJBArcadeGamePlay_ReturnValue1) == 0x000079, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_CanAJBArcadeGamePlay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_IsEnableSelect_bEnable1) == 0x00007B, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_IsEnableSelect_bEnable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_IsAJBOfflineMode_ReturnValue1) == 0x00007C, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_IsAJBOfflineMode_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue1) == 0x00007D, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue1) == 0x00007E, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue2) == 0x00007F, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue3) == 0x000080, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue4) == 0x000081, "Member 'WB_ModeSelect_Button_PAIR_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.IsButtonDecisioning
// 0x0002 (0x0002 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning) == 0x000002, "Wrong size on WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning, IsDecisioning) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning::IsDecisioning' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_PAIR_C_IsButtonDecisioning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_GetAuraImage) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_GetAuraImage");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_GetAuraImage) == 0x000008, "Wrong size on WB_ModeSelect_Button_PAIR_C_GetAuraImage");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetAuraImage, AuraImage) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_GetAuraImage::AuraImage' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial) == 0x000010, "Wrong size on WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial, EffectMaterial) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial::EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_PAIR_C_GetRetainerEffectMaterial::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_PAIR.WB_ModeSelect_Button_PAIR_C.GetButtonCenterPosition
// 0x008C (0x008C - 0x0000)
struct WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition final
{
public:
	struct FVector2D                              ScreenPosition;                                    // 0x0000(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0010(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x004C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue1;        // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x006C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x007C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0084(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition");
static_assert(sizeof(WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition) == 0x00008C, "Wrong size on WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition, ScreenPosition) == 0x000000, "Member 'WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition::ScreenPosition' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_PAIR_C_GetButtonCenterPosition::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
