#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelectButtonBase

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.ExecuteUbergraph_WB_ModeSelectButtonBase
// 0x00E8 (0x00E8 - 0x0000)
struct WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_FocusLine_C*                        CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetAuraImage_AuraImage;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSelectable;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NeedPP;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_CustomEvent_OwnerWidget;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_CustomEvent_TargetButton;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetRetainerEffectMaterial_EffectMaterial; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButton*                             CallFunc_GetButton_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x00C8(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetButtonCenterPosition_ScreenPosition;   // 0x00DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase) == 0x000008, "Wrong alignment on WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase");
static_assert(sizeof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase) == 0x0000E8, "Wrong size on WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, EntryPoint) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Conv_BoolToFloat_ReturnValue1) == 0x000010, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Conv_BoolToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_FInterpTo_ReturnValue) == 0x000014, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_int_Variable) == 0x000028, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetAuraImage_AuraImage) == 0x000030, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetAuraImage_AuraImage' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CustomEvent_bSelectable) == 0x000041, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CustomEvent_bSelectable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_Event_IsDesignTime) == 0x000042, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CustomEvent_NeedPP) == 0x000044, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CustomEvent_NeedPP' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_bool_Has_Been_Initd_Variable) == 0x000048, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CustomEvent_OwnerWidget) == 0x000060, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CustomEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CustomEvent_TargetButton) == 0x000068, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CustomEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetRetainerEffectMaterial_EffectMaterial) == 0x000078, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetRetainerEffectMaterial_EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_IsValid_ReturnValue1) == 0x000080, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Conv_BoolToFloat_ReturnValue2) == 0x000084, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Conv_BoolToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000088, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000090, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_Not_PreBool_ReturnValue1) == 0x000098, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_RequestWwiseEventOnLocal_AkComponent2) == 0x0000A0, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_RequestWwiseEventOnLocal_AkComponent2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_IsPressableVisibility_ReturnValue) == 0x0000A9, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_IsPressableVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetButton_ReturnValue) == 0x0000B0, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_CreateDelegate_OutputDelegate1) == 0x0000B8, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetShopEventSettings_ReturnValue) == 0x0000C8, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_BooleanAND_ReturnValue1) == 0x0000D0, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_IsEnableSelect_bEnable) == 0x0000D1, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_IsEnableSelect_bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_bool_Variable) == 0x0000D2, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_bool_IsClosed_Variable) == 0x0000D3, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_Select_Default) == 0x0000D4, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_IsValid_ReturnValue2) == 0x0000D8, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, CallFunc_GetButtonCenterPosition_ScreenPosition) == 0x0000DC, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::CallFunc_GetButtonCenterPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, Temp_bool_Variable1) == 0x0000E4, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase, K2Node_Select1_Default) == 0x0000E5, "Member 'WB_ModeSelectButtonBase_C_ExecuteUbergraph_WB_ModeSelectButtonBase::K2Node_Select1_Default' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.OnDecidedButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelectButtonBase_C_OnDecidedButtonEvent final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_OnDecidedButtonEvent) == 0x000008, "Wrong alignment on WB_ModeSelectButtonBase_C_OnDecidedButtonEvent");
static_assert(sizeof(WB_ModeSelectButtonBase_C_OnDecidedButtonEvent) == 0x000010, "Wrong size on WB_ModeSelectButtonBase_C_OnDecidedButtonEvent");
static_assert(offsetof(WB_ModeSelectButtonBase_C_OnDecidedButtonEvent, OwnerWidget) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_OnDecidedButtonEvent::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_OnDecidedButtonEvent, TargetButton) == 0x000008, "Member 'WB_ModeSelectButtonBase_C_OnDecidedButtonEvent::TargetButton' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.SetNeedPP
// 0x0004 (0x0004 - 0x0000)
struct WB_ModeSelectButtonBase_C_SetNeedPP final
{
public:
	int32                                         NeedPP_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_SetNeedPP) == 0x000004, "Wrong alignment on WB_ModeSelectButtonBase_C_SetNeedPP");
static_assert(sizeof(WB_ModeSelectButtonBase_C_SetNeedPP) == 0x000004, "Wrong size on WB_ModeSelectButtonBase_C_SetNeedPP");
static_assert(offsetof(WB_ModeSelectButtonBase_C_SetNeedPP, NeedPP_0) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_SetNeedPP::NeedPP_0' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelectButtonBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ModeSelectButtonBase_C_PreConstruct");
static_assert(sizeof(WB_ModeSelectButtonBase_C_PreConstruct) == 0x000001, "Wrong size on WB_ModeSelectButtonBase_C_PreConstruct");
static_assert(offsetof(WB_ModeSelectButtonBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.SetEnableSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelectButtonBase_C_SetEnableSelect final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_SetEnableSelect) == 0x000001, "Wrong alignment on WB_ModeSelectButtonBase_C_SetEnableSelect");
static_assert(sizeof(WB_ModeSelectButtonBase_C_SetEnableSelect) == 0x000001, "Wrong size on WB_ModeSelectButtonBase_C_SetEnableSelect");
static_assert(offsetof(WB_ModeSelectButtonBase_C_SetEnableSelect, bSelectable) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_SetEnableSelect::bSelectable' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.LeftPadCh
// 0x0080 (0x0080 - 0x0000)
struct WB_ModeSelectButtonBase_C_LeftPadCh final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ChCount;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PadCh;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	TArray<class FString>                         PadChrs;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue1;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_LeftPadCh) == 0x000008, "Wrong alignment on WB_ModeSelectButtonBase_C_LeftPadCh");
static_assert(sizeof(WB_ModeSelectButtonBase_C_LeftPadCh) == 0x000080, "Wrong size on WB_ModeSelectButtonBase_C_LeftPadCh");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, SourceString) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::SourceString' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, ChCount) == 0x000010, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::ChCount' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, PadCh) == 0x000018, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::PadCh' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, ReturnValue) == 0x000028, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, PadChrs) == 0x000038, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::PadChrs' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Len_ReturnValue) == 0x000048, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_JoinStringArray_ReturnValue) == 0x000050, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Array_Add_ReturnValue1) == 0x000064, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, Temp_int_Variable) == 0x000068, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Len_ReturnValue1) == 0x00006C, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Len_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000078, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_LeftPadCh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00007C, "Member 'WB_ModeSelectButtonBase_C_LeftPadCh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ModeSelectButtonBase.WB_ModeSelectButtonBase_C.TryGetNextMatchableDateText
// 0x0660 (0x0660 - 0x0000)
struct WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText final
{
public:
	struct FDateTime                              Date;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              EndDate;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FMatchScheduleTimeInfo                 StartTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FMatchScheduleTimeInfo                 EndTime;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          bSuccess;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0028(0x0018)(Parm, OutParm)
	class FText                                   LResult;                                           // 0x0040(0x0018)(Edit, BlueprintVisible)
	struct FDateTime                              LInvaliddate;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   LTitle2;                                           // 0x0060(0x0018)(Edit, BlueprintVisible)
	class FText                                   LTitle;                                            // 0x0078(0x0018)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue;                    // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue1;                   // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0108(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0120(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0160(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x01A0(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue2;                   // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue3;                   // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum2;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum3;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0240(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x0258(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0270(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x02B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x02F0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year1;                      // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month1;                     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day1;                       // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour1;                      // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute1;                    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second1;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond1;               // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue4;            // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue5;            // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue4;                   // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue5;                   // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum4;              // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum5;              // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue4;           // 0x03C8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue5;           // 0x03E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x03F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x0438(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData8;             // 0x0478(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue6;            // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue7;            // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue6;                   // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftPadCh_ReturnValue7;                   // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum6;              // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ASCNumChr2JISNumChr_JISNum7;              // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue6;           // 0x0518(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue7;           // 0x0530(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData9;             // 0x0548(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData10;            // 0x0588(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x05C8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData11;            // 0x05D8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0618(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0630(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0640(0x0018)()
	bool                                          CallFunc_NotEqual_DateTimeDateTime_ReturnValue;    // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue1; // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x065B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText) == 0x000008, "Wrong alignment on WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText");
static_assert(sizeof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText) == 0x000660, "Wrong size on WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, Date) == 0x000000, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::Date' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, EndDate) == 0x000008, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::EndDate' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, StartTime) == 0x000010, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::StartTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, EndTime) == 0x000018, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::EndTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, bSuccess) == 0x000020, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, Result) == 0x000028, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, LResult) == 0x000040, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::LResult' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, LInvaliddate) == 0x000058, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::LInvaliddate' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, LTitle2) == 0x000060, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::LTitle2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, LTitle) == 0x000078, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::LTitle' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue) == 0x000090, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue1) == 0x0000A0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue) == 0x0000B0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue1) == 0x0000C0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum) == 0x0000D0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum1) == 0x0000E0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue1) == 0x000108, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData) == 0x000120, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData1) == 0x000160, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData2) == 0x0001A0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue2) == 0x0001E0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue3) == 0x0001F0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue2) == 0x000200, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue3) == 0x000210, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum2) == 0x000220, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum3) == 0x000230, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue2) == 0x000240, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue3) == 0x000258, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData3) == 0x000270, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData4) == 0x0002B0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData5) == 0x0002F0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Year) == 0x000330, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Month) == 0x000334, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Day) == 0x000338, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Hour) == 0x00033C, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Minute) == 0x000340, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Second) == 0x000344, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Millisecond) == 0x000348, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Year1) == 0x00034C, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Year1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Month1) == 0x000350, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Month1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Day1) == 0x000354, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Day1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Hour1) == 0x000358, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Hour1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Minute1) == 0x00035C, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Minute1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Second1) == 0x000360, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Second1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_BreakDateTime_Millisecond1) == 0x000364, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_BreakDateTime_Millisecond1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue4) == 0x000368, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue5) == 0x000378, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue4) == 0x000388, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue5) == 0x000398, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum4) == 0x0003A8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum5) == 0x0003B8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue4) == 0x0003C8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_StringToText_ReturnValue5) == 0x0003E0, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_StringToText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData6) == 0x0003F8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData6' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData7) == 0x000438, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData7' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, K2Node_MakeStruct_FormatArgumentData8) == 0x000478, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::K2Node_MakeStruct_FormatArgumentData8' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue6) == 0x0004B8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_Conv_IntToString_ReturnValue7) == 0x0004C8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_Conv_IntToString_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue6) == 0x0004D8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_LeftPadCh_ReturnValue7) == 0x0004E8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_LeftPadCh_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText, CallFunc_ASCNumChr2JISNumChr_JISNum6) == 0x0004F8, "Member 'WB_ModeSelectButtonBase_C_TryGetNextMatchableDateText::CallFunc_ASCNumChr2JISNumChr_JISNum6' has a wrong offset!");
