#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_RewardPercent

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelectable;                          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBonusUpPeriod_bBonusUp;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent) == 0x000010, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, EntryPoint) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_bool_Variable) == 0x000004, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000005, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_bool_IsClosed_Variable) == 0x000007, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, K2Node_Event_IsDesignTime) == 0x000009, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_byte_Variable) == 0x00000A, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, CallFunc_IsPressableVisibility_ReturnValue) == 0x00000B, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::CallFunc_IsPressableVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, Temp_byte_Variable1) == 0x00000C, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, K2Node_Event_bSelectable) == 0x00000D, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::K2Node_Event_bSelectable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, CallFunc_IsBonusUpPeriod_bBonusUp) == 0x00000E, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::CallFunc_IsBonusUpPeriod_bBonusUp' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent, K2Node_Select_Default) == 0x00000F, "Member 'WB_ModeSelect_Button_RewardPercent_C_ExecuteUbergraph_WB_ModeSelect_Button_RewardPercent::K2Node_Select_Default' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_GetButton) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_GetButton");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_GetButton) == 0x000008, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_GetButton");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.SetEnableSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect) == 0x000001, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect, bSelectable) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_SetEnableSelect::bSelectable' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_PreConstruct");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_PreConstruct) == 0x000001, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_PreConstruct");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.IsButtonDecisioning
// 0x0005 (0x0005 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning) == 0x000005, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning, IsDecisioning) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning::IsDecisioning' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000002, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsButtonDecisioning::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.IsEnableSelect
// 0x0014 (0x0014 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x0004(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect) == 0x000014, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, bEnable) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_GetShopEventSettings_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x00000C, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue1) == 0x00000E, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_IsEnableSelect_bEnable) == 0x00000F, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_IsEnableSelect_bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue1) == 0x000011, "Member 'WB_ModeSelect_Button_RewardPercent_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_GetAuraImage) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_GetAuraImage");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_GetAuraImage) == 0x000008, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_GetAuraImage");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_GetAuraImage, AuraImage) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_GetAuraImage::AuraImage' has a wrong offset!");

// Function WB_ModeSelect_Button_RewardPercent.WB_ModeSelect_Button_RewardPercent_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial");
static_assert(sizeof(WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial) == 0x000010, "Wrong size on WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial, EffectMaterial) == 0x000000, "Member 'WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial::EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_RewardPercent_C_GetRetainerEffectMaterial::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

}

