#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_SOLO

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.ExecuteUbergraph_WB_ModeSelect_Button_SOLO
// 0x0118 (0x0118 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelectable;                          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NeedPP;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSoloMode;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBMatchSchedule                      CallFunc_GetNationalMatchSchedule_OutMatchSchedule; // 0x0050(0x0018)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime; // 0x0068(0x0020)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime; // 0x0088(0x0020)(NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNextMatchableDateText_bSuccess;     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetNextMatchableDateText_Result;       // 0x00B0(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00CC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO) == 0x000118, "Wrong size on WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, EntryPoint) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_bool_Variable) == 0x000004, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_int_Variable) == 0x000008, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_int_Variable1) == 0x00000C, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_byte_Variable) == 0x000010, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000011, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_bool_Has_Been_Initd_Variable) == 0x000012, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Event_bSelectable) == 0x000013, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Event_bSelectable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Event_NeedPP) == 0x000018, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Event_NeedPP' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_bool_Variable1) == 0x000039, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_IsPressableVisibility_ReturnValue) == 0x00003A, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_IsPressableVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_CustomEvent_bSoloMode) == 0x00003B, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_CustomEvent_bSoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetAJBGameInstance_bSuccess) == 0x00003C, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000040, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode) == 0x000048, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode) == 0x000049, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetNationalMatchSchedule_OutMatchSchedule) == 0x000050, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetNationalMatchSchedule_OutMatchSchedule' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime) == 0x000068, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime) == 0x000088, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Select_Default) == 0x0000A8, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_TryGetNextMatchableDateText_bSuccess) == 0x0000AC, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_TryGetNextMatchableDateText_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_TryGetNextMatchableDateText_Result) == 0x0000B0, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_TryGetNextMatchableDateText_Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Not_PreBool_ReturnValue1) == 0x0000C9, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_BooleanAND_ReturnValue) == 0x0000CA, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Event_MyGeometry) == 0x0000CC, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Event_InDeltaTime) == 0x000104, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x000108, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Not_PreBool_ReturnValue2) == 0x000109, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, Temp_byte_Variable1) == 0x00010A, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, K2Node_Select1_Default) == 0x00010B, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00010C, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x00010D, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_BooleanOR_ReturnValue) == 0x00010E, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_BooleanOR_ReturnValue1) == 0x00010F, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Not_PreBool_ReturnValue3) == 0x000110, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_BooleanOR_ReturnValue2) == 0x000111, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO, CallFunc_Not_PreBool_ReturnValue4) == 0x000112, "Member 'WB_ModeSelect_Button_SOLO_C_ExecuteUbergraph_WB_ModeSelect_Button_SOLO::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_Tick) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_Tick");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_Tick) == 0x00003C, "Wrong size on WB_ModeSelect_Button_SOLO_C_Tick");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_Tick, MyGeometry) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_ModeSelect_Button_SOLO_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.SwitchDisplayMode
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode final
{
public:
	bool                                          bSoloMode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode) == 0x000001, "Wrong size on WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode, bSoloMode) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_SwitchDisplayMode::bSoloMode' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_GetButton) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_GetButton");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_GetButton) == 0x000008, "Wrong size on WB_ModeSelect_Button_SOLO_C_GetButton");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.SetNeedPP
// 0x0004 (0x0004 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_SetNeedPP final
{
public:
	int32                                         NeedPP_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_SetNeedPP) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_SetNeedPP");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_SetNeedPP) == 0x000004, "Wrong size on WB_ModeSelect_Button_SOLO_C_SetNeedPP");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_SetNeedPP, NeedPP_0) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_SetNeedPP::NeedPP_0' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_PreConstruct");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_PreConstruct) == 0x000001, "Wrong size on WB_ModeSelect_Button_SOLO_C_PreConstruct");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.SetEnableSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_SetEnableSelect final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_SetEnableSelect) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_SetEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_SetEnableSelect) == 0x000001, "Wrong size on WB_ModeSelect_Button_SOLO_C_SetEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_SetEnableSelect, bSelectable) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_SetEnableSelect::bSelectable' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.IsEnableSelect
// 0x0088 (0x0088 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_IsEnableSelect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAJBArcadeGamePlay_ReturnValue;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x0008(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue1;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBMatchSchedule                      CallFunc_GetNationalMatchSchedule_OutMatchSchedule; // 0x0028(0x0018)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime; // 0x0040(0x0020)(NoDestructor)
	struct FAJBMatchScheduleDateTime              CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime; // 0x0060(0x0020)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAJBArcadeGamePlay_ReturnValue1;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable1;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_IsEnableSelect");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect) == 0x000088, "Wrong size on WB_ModeSelect_Button_SOLO_C_IsEnableSelect");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, bEnable) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_CanAJBArcadeGamePlay_ReturnValue) == 0x000002, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_CanAJBArcadeGamePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_IsEnableSelect_bEnable) == 0x000004, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_IsEnableSelect_bEnable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetShopEventSettings_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetShopEventSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue1) == 0x000011, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetAJBGameInstance_bSuccess) == 0x000012, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000018, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_IsAJBOfflineMode_ReturnValue1) == 0x000020, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_IsAJBOfflineMode_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode) == 0x000021, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutCanPlaySoloMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode) == 0x000022, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutCanPlayPairMode' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutMatchSchedule) == 0x000028, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutMatchSchedule' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime) == 0x000040, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutSoloScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime) == 0x000060, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_GetNationalMatchSchedule_OutPairScheduleDateTime' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_Not_PreBool_ReturnValue1) == 0x000080, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_CanAJBArcadeGamePlay_ReturnValue1) == 0x000081, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_CanAJBArcadeGamePlay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_IsEnableSelect_bEnable1) == 0x000082, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_IsEnableSelect_bEnable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue2) == 0x000083, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue3) == 0x000084, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsEnableSelect, CallFunc_BooleanAND_ReturnValue4) == 0x000085, "Member 'WB_ModeSelect_Button_SOLO_C_IsEnableSelect::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.IsButtonDecisioning
// 0x0002 (0x0002 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning) == 0x000001, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning) == 0x000002, "Wrong size on WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning, IsDecisioning) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning::IsDecisioning' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WB_ModeSelect_Button_SOLO_C_IsButtonDecisioning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_GetAuraImage) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_GetAuraImage");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_GetAuraImage) == 0x000008, "Wrong size on WB_ModeSelect_Button_SOLO_C_GetAuraImage");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetAuraImage, AuraImage) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_GetAuraImage::AuraImage' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial) == 0x000008, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial) == 0x000010, "Wrong size on WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial, EffectMaterial) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial::EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_SOLO_C_GetRetainerEffectMaterial::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_Button_SOLO.WB_ModeSelect_Button_SOLO_C.GetButtonCenterPosition
// 0x008C (0x008C - 0x0000)
struct WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition final
{
public:
	struct FVector2D                              ScreenPosition;                                    // 0x0000(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x001C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue1;        // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x006C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x007C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0084(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition) == 0x000004, "Wrong alignment on WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition");
static_assert(sizeof(WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition) == 0x00008C, "Wrong size on WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition, ScreenPosition) == 0x000000, "Member 'WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition::ScreenPosition' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_Button_SOLO_C_GetButtonCenterPosition::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
