#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_OfflineModeLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_OfflineModeLabel.WB_OfflineModeLabel_C
// 0x0028 (0x0230 - 0x0208)
class UWB_OfflineModeLabel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          AJBTextBlock_Row1;                                 // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_Row2;                                 // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              BG;                                                // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPPBuy;                                           // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_OfflineModeLabel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ChangeDisplayType(bool PPBuyMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_OfflineModeLabel_C">();
	}
	static class UWB_OfflineModeLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_OfflineModeLabel_C>();
	}
};
static_assert(alignof(UWB_OfflineModeLabel_C) == 0x000008, "Wrong alignment on UWB_OfflineModeLabel_C");
static_assert(sizeof(UWB_OfflineModeLabel_C) == 0x000230, "Wrong size on UWB_OfflineModeLabel_C");
static_assert(offsetof(UWB_OfflineModeLabel_C, UberGraphFrame) == 0x000208, "Member 'UWB_OfflineModeLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_OfflineModeLabel_C, AJBTextBlock_Row1) == 0x000210, "Member 'UWB_OfflineModeLabel_C::AJBTextBlock_Row1' has a wrong offset!");
static_assert(offsetof(UWB_OfflineModeLabel_C, AJBTextBlock_Row2) == 0x000218, "Member 'UWB_OfflineModeLabel_C::AJBTextBlock_Row2' has a wrong offset!");
static_assert(offsetof(UWB_OfflineModeLabel_C, BG) == 0x000220, "Member 'UWB_OfflineModeLabel_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_OfflineModeLabel_C, IsPPBuy) == 0x000228, "Member 'UWB_OfflineModeLabel_C::IsPPBuy' has a wrong offset!");

}

