#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PPBuyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_PPBuyButton.WB_PPBuyButton_C.ExecuteUbergraph_WB_PPBuyButton
// 0x0078 (0x0078 - 0x0000)
struct WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBuyAddPP_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBuyAddPP_ReturnValue1;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue1;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton) == 0x000008, "Wrong alignment on WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton");
static_assert(sizeof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton) == 0x000078, "Wrong size on WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, EntryPoint) == 0x000000, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue) == 0x000004, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000020, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, Temp_bool_IsClosed_Variable) == 0x000022, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000040, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBGameInstance_bSuccess) == 0x000048, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000050, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000058, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000060, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_CanBuyAddPP_ReturnValue) == 0x000068, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_CanBuyAddPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_CanBuyAddPP_ReturnValue1) == 0x000069, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_CanBuyAddPP_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue1) == 0x00006C, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_GetAJBArcadeLimitAdditionalCredit_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_NotEqual_IntInt_ReturnValue1) == 0x000070, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_NotEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton, CallFunc_BooleanAND_ReturnValue1) == 0x000071, "Member 'WB_PPBuyButton_C_ExecuteUbergraph_WB_PPBuyButton::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function WB_PPBuyButton.WB_PPBuyButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_PPBuyButton_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PPBuyButton_C_GetButton) == 0x000008, "Wrong alignment on WB_PPBuyButton_C_GetButton");
static_assert(sizeof(WB_PPBuyButton_C_GetButton) == 0x000008, "Wrong size on WB_PPBuyButton_C_GetButton");
static_assert(offsetof(WB_PPBuyButton_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_PPBuyButton_C_GetButton::ReturnValue' has a wrong offset!");

}

