#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PlayerDownGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_PlayerDownGauge.WB_PlayerDownGauge_C
// 0x0020 (0x0228 - 0x0208)
class UWB_PlayerDownGauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 PBFrame_MP_Bar;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_Time;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Bar;                                           // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_PlayerDownGauge(int32 EntryPoint);
	void UpdateDisplay(float BarValue, float Time);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_PlayerDownGauge_C">();
	}
	static class UWB_PlayerDownGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PlayerDownGauge_C>();
	}
};
static_assert(alignof(UWB_PlayerDownGauge_C) == 0x000008, "Wrong alignment on UWB_PlayerDownGauge_C");
static_assert(sizeof(UWB_PlayerDownGauge_C) == 0x000228, "Wrong size on UWB_PlayerDownGauge_C");
static_assert(offsetof(UWB_PlayerDownGauge_C, UberGraphFrame) == 0x000208, "Member 'UWB_PlayerDownGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_PlayerDownGauge_C, PBFrame_MP_Bar) == 0x000210, "Member 'UWB_PlayerDownGauge_C::PBFrame_MP_Bar' has a wrong offset!");
static_assert(offsetof(UWB_PlayerDownGauge_C, Txt_Time) == 0x000218, "Member 'UWB_PlayerDownGauge_C::Txt_Time' has a wrong offset!");
static_assert(offsetof(UWB_PlayerDownGauge_C, DMI_Bar) == 0x000220, "Member 'UWB_PlayerDownGauge_C::DMI_Bar' has a wrong offset!");

}

