#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PlayerWatching

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_PlayerWatching.WB_PlayerWatching_C
// 0x00A8 (0x0368 - 0x02C0)
class UWB_PlayerWatching_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Watching;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_0;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_1;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_1;                                    // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AutoFlowResultRoot;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerName;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WatchingEndButton;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableAutoFlow;                                   // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   WatchingEndConfirm;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AutoFlowCountDownTimer;                            // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayOpenSE;                                     // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   PPCheckConfirm;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPCheckProcessStep;                                // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_PairAlertConfirm_C*                 PairAlertConfirm;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NameTimer;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         PPConfirmTimer;                                    // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FreePPTimer;                                       // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceInvalidEndButton;                            // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnStartConsumePPDispatcher;                        // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnStopConsumePPDispatcher;                         // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnStartConsumePPDispatcher__DelegateSignature();
	void OnStopConsumePPDispatcher__DelegateSignature();
	void ExecuteUbergraph_WB_PlayerWatching(int32 EntryPoint);
	void OnClosedPPCheckConfim(class UAJBWindowWidget* TargetWidget);
	void ForceCloseConfirmWindowAndBlockEndButton();
	void OnFinishedConfirmPair(EAJBConfirmResult Result);
	void OnResetAutoFlowUI();
	void OnUpdatePlayerName();
	void OnFinish();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void EnableAutoFlow();
	void Construct();
	void OnFinishedConfirm(EAJBConfirmResult Result);
	void ShowConfirmWatchingEnd();
	void OnFinishedAnim();
	void BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnClosingWindow();
	void OnOpeningWindow();
	void UpdateTimer(float DeltaTime, float MaxTime, bool* bTimeZero);
	void IsFreePP(bool* bFree);
	class FText GetText_Title();
	void IsMyPairCharacterActive(bool* bActive);
	void ChangeGameEndButtonDisplay();
	bool OnInputReleasedUp();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool IsModeless();
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedTouch();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL2();
	bool OnInputPressedL1();
	bool OnInputReleasedL3();
	bool OnInputPressedL3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_PlayerWatching_C">();
	}
	static class UWB_PlayerWatching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PlayerWatching_C>();
	}
};
static_assert(alignof(UWB_PlayerWatching_C) == 0x000008, "Wrong alignment on UWB_PlayerWatching_C");
static_assert(sizeof(UWB_PlayerWatching_C) == 0x000368, "Wrong size on UWB_PlayerWatching_C");
static_assert(offsetof(UWB_PlayerWatching_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_PlayerWatching_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, Anim_Watching) == 0x0002C8, "Member 'UWB_PlayerWatching_C::Anim_Watching' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, AJBImage_0) == 0x0002D0, "Member 'UWB_PlayerWatching_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, AJBImage_1) == 0x0002D8, "Member 'UWB_PlayerWatching_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, AJBTextBlock_1) == 0x0002E0, "Member 'UWB_PlayerWatching_C::AJBTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, AutoFlowResultRoot) == 0x0002E8, "Member 'UWB_PlayerWatching_C::AutoFlowResultRoot' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, PlayerName) == 0x0002F0, "Member 'UWB_PlayerWatching_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, WatchingEndButton) == 0x0002F8, "Member 'UWB_PlayerWatching_C::WatchingEndButton' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, CurrentTime) == 0x000300, "Member 'UWB_PlayerWatching_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, bEnableAutoFlow) == 0x000304, "Member 'UWB_PlayerWatching_C::bEnableAutoFlow' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, WatchingEndConfirm) == 0x000308, "Member 'UWB_PlayerWatching_C::WatchingEndConfirm' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, AutoFlowCountDownTimer) == 0x000310, "Member 'UWB_PlayerWatching_C::AutoFlowCountDownTimer' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, bIsPlayOpenSE) == 0x000314, "Member 'UWB_PlayerWatching_C::bIsPlayOpenSE' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, PPCheckConfirm) == 0x000318, "Member 'UWB_PlayerWatching_C::PPCheckConfirm' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, PPCheckProcessStep) == 0x000320, "Member 'UWB_PlayerWatching_C::PPCheckProcessStep' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, PairAlertConfirm) == 0x000328, "Member 'UWB_PlayerWatching_C::PairAlertConfirm' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, NameTimer) == 0x000330, "Member 'UWB_PlayerWatching_C::NameTimer' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, PPConfirmTimer) == 0x000338, "Member 'UWB_PlayerWatching_C::PPConfirmTimer' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, FreePPTimer) == 0x00033C, "Member 'UWB_PlayerWatching_C::FreePPTimer' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, bForceInvalidEndButton) == 0x000340, "Member 'UWB_PlayerWatching_C::bForceInvalidEndButton' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, OnStartConsumePPDispatcher) == 0x000348, "Member 'UWB_PlayerWatching_C::OnStartConsumePPDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_PlayerWatching_C, OnStopConsumePPDispatcher) == 0x000358, "Member 'UWB_PlayerWatching_C::OnStopConsumePPDispatcher' has a wrong offset!");

}

