#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RadioChat.WB_RadioChat_C
// 0x0060 (0x0268 - 0x0208)
class UWB_RadioChat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_1;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_2;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             ChatToggleButton;                                  // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Over_Button_Close;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Over_Button_Open;                                  // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_RadioChatButtonList_C*              WB_RadioChatButtonList;                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         TargetButtonScaleValue;                            // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonScaleValue;                                  // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpendChatList;                                    // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             RadioChatTable;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnClicked__DelegateSignature(const struct FST_RadioChatInfo& ChatInfo);
	void ExecuteUbergraph_WB_RadioChat(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ResetButton();
	void CloseList();
	void BndEvt__ChatToggleButton_K2Node_ComponentBoundEvent_3_OnButtonCancelledEvent__DelegateSignature();
	void BndEvt__ChatToggleButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__ChatToggleButton_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void Reset();
	void OnClickedButton(const struct FST_RadioChatInfo& ChatInfo);
	void Construct();
	void BndEvt__ChatToggleButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ChangeChatButtonDisplay(bool bCloseButton);
	void UpdateDisplayButtons(class AAJBInGameCharacter* InGameCharacter);
	bool IsClearCondition(const struct FST_RadioChatInfo& RadioChatInfo, class AAJBInGameCharacter* TargetCharacter);
	void IsOpend(bool* bIsOpened);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RadioChat_C">();
	}
	static class UWB_RadioChat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RadioChat_C>();
	}
};
static_assert(alignof(UWB_RadioChat_C) == 0x000008, "Wrong alignment on UWB_RadioChat_C");
static_assert(sizeof(UWB_RadioChat_C) == 0x000268, "Wrong size on UWB_RadioChat_C");
static_assert(offsetof(UWB_RadioChat_C, UberGraphFrame) == 0x000208, "Member 'UWB_RadioChat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, AJBImage_1) == 0x000210, "Member 'UWB_RadioChat_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, AJBImage_2) == 0x000218, "Member 'UWB_RadioChat_C::AJBImage_2' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, ChatToggleButton) == 0x000220, "Member 'UWB_RadioChat_C::ChatToggleButton' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, Over_Button_Close) == 0x000228, "Member 'UWB_RadioChat_C::Over_Button_Close' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, Over_Button_Open) == 0x000230, "Member 'UWB_RadioChat_C::Over_Button_Open' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, WB_RadioChatButtonList) == 0x000238, "Member 'UWB_RadioChat_C::WB_RadioChatButtonList' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, OnClicked) == 0x000240, "Member 'UWB_RadioChat_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, TargetButtonScaleValue) == 0x000250, "Member 'UWB_RadioChat_C::TargetButtonScaleValue' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, ButtonScaleValue) == 0x000254, "Member 'UWB_RadioChat_C::ButtonScaleValue' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, bOpendChatList) == 0x000258, "Member 'UWB_RadioChat_C::bOpendChatList' has a wrong offset!");
static_assert(offsetof(UWB_RadioChat_C, RadioChatTable) == 0x000260, "Member 'UWB_RadioChat_C::RadioChatTable' has a wrong offset!");

}

