#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChatButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_RadioChatInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RadioChatButton.WB_RadioChatButton_C
// 0x0078 (0x0280 - 0x0208)
class UWB_RadioChatButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBButton*                             AJBButton_0;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Root;                                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_2line_1;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_2line_2;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_ButtonTitle;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vertical_Text2;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         TargetButtonScaleValue;                            // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonScaleValue;                                  // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_RadioChatInfo                      ChatInfo;                                          // 0x0258(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnClicked__DelegateSignature(const struct FST_RadioChatInfo& ChatInfo_0);
	void ExecuteUbergraph_WB_RadioChatButton(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_3_OnButtonCancelledEvent__DelegateSignature();
	void ResetButtonAnim();
	void SetupChatInfo(const struct FST_RadioChatInfo& ChatInfo_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RadioChatButton_C">();
	}
	static class UWB_RadioChatButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RadioChatButton_C>();
	}
};
static_assert(alignof(UWB_RadioChatButton_C) == 0x000008, "Wrong alignment on UWB_RadioChatButton_C");
static_assert(sizeof(UWB_RadioChatButton_C) == 0x000280, "Wrong size on UWB_RadioChatButton_C");
static_assert(offsetof(UWB_RadioChatButton_C, UberGraphFrame) == 0x000208, "Member 'UWB_RadioChatButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, AJBButton_0) == 0x000210, "Member 'UWB_RadioChatButton_C::AJBButton_0' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, Root) == 0x000218, "Member 'UWB_RadioChatButton_C::Root' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, Txt_2line_1) == 0x000220, "Member 'UWB_RadioChatButton_C::Txt_2line_1' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, Txt_2line_2) == 0x000228, "Member 'UWB_RadioChatButton_C::Txt_2line_2' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, Txt_ButtonTitle) == 0x000230, "Member 'UWB_RadioChatButton_C::Txt_ButtonTitle' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, Vertical_Text2) == 0x000238, "Member 'UWB_RadioChatButton_C::Vertical_Text2' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, OnClicked) == 0x000240, "Member 'UWB_RadioChatButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, TargetButtonScaleValue) == 0x000250, "Member 'UWB_RadioChatButton_C::TargetButtonScaleValue' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, ButtonScaleValue) == 0x000254, "Member 'UWB_RadioChatButton_C::ButtonScaleValue' has a wrong offset!");
static_assert(offsetof(UWB_RadioChatButton_C, ChatInfo) == 0x000258, "Member 'UWB_RadioChatButton_C::ChatInfo' has a wrong offset!");

}

