#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_Button_Random

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RoomSelect_Button_Random.WB_RoomSelect_Button_Random_C
// 0x0058 (0x02F8 - 0x02A0)
class UWB_RoomSelect_Button_Random_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Press;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Release;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_0;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_Specular;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Color;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Flame;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              PlayerIcon;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Aura_C*                             WB_Aura;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         AuraOffset;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_RoomSelect_Button_Random(int32 EntryPoint);
	void BndEvt__Anim_Press_K2Node_ComponentBoundEvent_2_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonCancelledEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	class UAJBButton* GetButton();
	void OnButtonPressedAnimation();
	void OnButtonReleasedAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RoomSelect_Button_Random_C">();
	}
	static class UWB_RoomSelect_Button_Random_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RoomSelect_Button_Random_C>();
	}
};
static_assert(alignof(UWB_RoomSelect_Button_Random_C) == 0x000008, "Wrong alignment on UWB_RoomSelect_Button_Random_C");
static_assert(sizeof(UWB_RoomSelect_Button_Random_C) == 0x0002F8, "Wrong size on UWB_RoomSelect_Button_Random_C");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, UberGraphFrame) == 0x0002A0, "Member 'UWB_RoomSelect_Button_Random_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, Anim_Press) == 0x0002A8, "Member 'UWB_RoomSelect_Button_Random_C::Anim_Press' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, Anim_Release) == 0x0002B0, "Member 'UWB_RoomSelect_Button_Random_C::Anim_Release' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, AJBRetainerBox_0) == 0x0002B8, "Member 'UWB_RoomSelect_Button_Random_C::AJBRetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, AJBRetainerBox_Specular) == 0x0002C0, "Member 'UWB_RoomSelect_Button_Random_C::AJBRetainerBox_Specular' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, Button) == 0x0002C8, "Member 'UWB_RoomSelect_Button_Random_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, Img_Color) == 0x0002D0, "Member 'UWB_RoomSelect_Button_Random_C::Img_Color' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, Img_Flame) == 0x0002D8, "Member 'UWB_RoomSelect_Button_Random_C::Img_Flame' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, PlayerIcon) == 0x0002E0, "Member 'UWB_RoomSelect_Button_Random_C::PlayerIcon' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, WB_Aura) == 0x0002E8, "Member 'UWB_RoomSelect_Button_Random_C::WB_Aura' has a wrong offset!");
static_assert(offsetof(UWB_RoomSelect_Button_Random_C, AuraOffset) == 0x0002F0, "Member 'UWB_RoomSelect_Button_Random_C::AuraOffset' has a wrong offset!");

}

