#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Retire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Retire.WB_Retire_C
// 0x0028 (0x02E8 - 0x02C0)
class UWB_Retire_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Retire;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_126;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBG;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerName;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Retire(int32 EntryPoint);
	void OnAnimationFinished_Retire();
	void OnClosingWindow();
	void OnOpeningWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Retire_C">();
	}
	static class UWB_Retire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Retire_C>();
	}
};
static_assert(alignof(UWB_Retire_C) == 0x000008, "Wrong alignment on UWB_Retire_C");
static_assert(sizeof(UWB_Retire_C) == 0x0002E8, "Wrong size on UWB_Retire_C");
static_assert(offsetof(UWB_Retire_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_Retire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Retire_C, Retire) == 0x0002C8, "Member 'UWB_Retire_C::Retire' has a wrong offset!");
static_assert(offsetof(UWB_Retire_C, AJBImage_126) == 0x0002D0, "Member 'UWB_Retire_C::AJBImage_126' has a wrong offset!");
static_assert(offsetof(UWB_Retire_C, BlackBG) == 0x0002D8, "Member 'UWB_Retire_C::BlackBG' has a wrong offset!");
static_assert(offsetof(UWB_Retire_C, PlayerName) == 0x0002E0, "Member 'UWB_Retire_C::PlayerName' has a wrong offset!");

}

