#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChat

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ST_RadioChatInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_RadioChat.WB_RadioChat_C.OnClicked__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct WB_RadioChat_C_OnClicked__DelegateSignature final
{
public:
	struct FST_RadioChatInfo                      ChatInfo;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChat_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WB_RadioChat_C_OnClicked__DelegateSignature");
static_assert(sizeof(WB_RadioChat_C_OnClicked__DelegateSignature) == 0x000028, "Wrong size on WB_RadioChat_C_OnClicked__DelegateSignature");
static_assert(offsetof(WB_RadioChat_C_OnClicked__DelegateSignature, ChatInfo) == 0x000000, "Member 'WB_RadioChat_C_OnClicked__DelegateSignature::ChatInfo' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.ExecuteUbergraph_WB_RadioChat
// 0x00D8 (0x00D8 - 0x0000)
struct WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FST_RadioChatInfo& ChatInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_RadioChatButton_C*>          CallFunc_GetButtons_ReturnValues;                  // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_RadioChatButton_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RadioChatInfo                      K2Node_CustomEvent_ChatInfo;                       // 0x0040(0x0028)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressableButton_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat) == 0x000008, "Wrong alignment on WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat");
static_assert(sizeof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat) == 0x0000D8, "Wrong size on WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, EntryPoint) == 0x000000, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_GetButtons_ReturnValues) == 0x000020, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_GetButtons_ReturnValues' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_Array_Get_Item) == 0x000030, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, K2Node_CustomEvent_ChatInfo) == 0x000040, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::K2Node_CustomEvent_ChatInfo' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000070, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000080, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_IsPressableButton_ReturnValue) == 0x000088, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_IsPressableButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, K2Node_Event_MyGeometry) == 0x00008C, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_MakeVector2D_ReturnValue) == 0x0000C8, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat, CallFunc_FInterpTo_Constant_ReturnValue) == 0x0000D0, "Member 'WB_RadioChat_C_ExecuteUbergraph_WB_RadioChat::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_RadioChat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChat_C_Tick) == 0x000004, "Wrong alignment on WB_RadioChat_C_Tick");
static_assert(sizeof(WB_RadioChat_C_Tick) == 0x00003C, "Wrong size on WB_RadioChat_C_Tick");
static_assert(offsetof(WB_RadioChat_C_Tick, MyGeometry) == 0x000000, "Member 'WB_RadioChat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_RadioChat_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.OnClickedButton
// 0x0028 (0x0028 - 0x0000)
struct WB_RadioChat_C_OnClickedButton final
{
public:
	struct FST_RadioChatInfo                      ChatInfo;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChat_C_OnClickedButton) == 0x000008, "Wrong alignment on WB_RadioChat_C_OnClickedButton");
static_assert(sizeof(WB_RadioChat_C_OnClickedButton) == 0x000028, "Wrong size on WB_RadioChat_C_OnClickedButton");
static_assert(offsetof(WB_RadioChat_C_OnClickedButton, ChatInfo) == 0x000000, "Member 'WB_RadioChat_C_OnClickedButton::ChatInfo' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.ChangeChatButtonDisplay
// 0x0009 (0x0009 - 0x0000)
struct WB_RadioChat_C_ChangeChatButtonDisplay final
{
public:
	bool                                          bCloseButton;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChat_C_ChangeChatButtonDisplay) == 0x000001, "Wrong alignment on WB_RadioChat_C_ChangeChatButtonDisplay");
static_assert(sizeof(WB_RadioChat_C_ChangeChatButtonDisplay) == 0x000009, "Wrong size on WB_RadioChat_C_ChangeChatButtonDisplay");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, bCloseButton) == 0x000000, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::bCloseButton' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_bool_Variable) == 0x000001, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_byte_Variable) == 0x000002, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_byte_Variable1) == 0x000003, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_bool_Variable1) == 0x000004, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, K2Node_Select_Default) == 0x000005, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_byte_Variable2) == 0x000006, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, Temp_byte_Variable3) == 0x000007, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_ChangeChatButtonDisplay, K2Node_Select1_Default) == 0x000008, "Member 'WB_RadioChat_C_ChangeChatButtonDisplay::K2Node_Select1_Default' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.UpdateDisplayButtons
// 0x00A8 (0x00A8 - 0x0000)
struct WB_RadioChat_C_UpdateDisplayButtons final
{
public:
	class AAJBInGameCharacter*                    InGameCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LButtonArrayIndex;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_RadioChatButton_C*>          LButtons;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RadioChatInfo                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearCondition_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_RadioChatButton_C*                  CallFunc_Array_Get_Item1;                          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_RadioChatButton_C*>          CallFunc_GetButtons_ReturnValues;                  // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WB_RadioChat_C_UpdateDisplayButtons) == 0x000008, "Wrong alignment on WB_RadioChat_C_UpdateDisplayButtons");
static_assert(sizeof(WB_RadioChat_C_UpdateDisplayButtons) == 0x0000A8, "Wrong size on WB_RadioChat_C_UpdateDisplayButtons");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, InGameCharacter) == 0x000000, "Member 'WB_RadioChat_C_UpdateDisplayButtons::InGameCharacter' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, LButtonArrayIndex) == 0x000008, "Member 'WB_RadioChat_C_UpdateDisplayButtons::LButtonArrayIndex' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, LButtons) == 0x000010, "Member 'WB_RadioChat_C_UpdateDisplayButtons::LButtons' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WB_RadioChat_C_UpdateDisplayButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_RadioChat_C_UpdateDisplayButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Array_Get_Item) == 0x000040, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Add_IntInt_ReturnValue1) == 0x000048, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_IsClearCondition_ReturnValue) == 0x000081, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_IsClearCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, Temp_int_Variable) == 0x000084, "Member 'WB_RadioChat_C_UpdateDisplayButtons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Array_Get_Item1) == 0x000088, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000090, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_UpdateDisplayButtons, CallFunc_GetButtons_ReturnValues) == 0x000098, "Member 'WB_RadioChat_C_UpdateDisplayButtons::CallFunc_GetButtons_ReturnValues' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.IsClearCondition
// 0x00A0 (0x00A0 - 0x0000)
struct WB_RadioChat_C_IsClearCondition final
{
public:
	struct FST_RadioChatInfo                      RadioChatInfo;                                     // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    TargetCharacter;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          bUseUltimateSkill;                                 // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0038(0x0020)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetSkillComponentByType_bSuccess;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     CallFunc_TryGetSkillComponentByType_SkillComponet; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_CanUseSkill_TagContainer;                 // 0x0078(0x0020)()
	bool                                          CallFunc_CanUseSkill_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_RadioChat_C_IsClearCondition) == 0x000008, "Wrong alignment on WB_RadioChat_C_IsClearCondition");
static_assert(sizeof(WB_RadioChat_C_IsClearCondition) == 0x0000A0, "Wrong size on WB_RadioChat_C_IsClearCondition");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, RadioChatInfo) == 0x000000, "Member 'WB_RadioChat_C_IsClearCondition::RadioChatInfo' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, TargetCharacter) == 0x000028, "Member 'WB_RadioChat_C_IsClearCondition::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, ReturnValue) == 0x000030, "Member 'WB_RadioChat_C_IsClearCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, bUseUltimateSkill) == 0x000031, "Member 'WB_RadioChat_C_IsClearCondition::bUseUltimateSkill' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000038, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'WB_RadioChat_C_IsClearCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_IsValid_ReturnValue) == 0x00005A, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, K2Node_SwitchEnum1_CmpSuccess) == 0x00005B, "Member 'WB_RadioChat_C_IsClearCondition::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000060, "Member 'WB_RadioChat_C_IsClearCondition::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WB_RadioChat_C_IsClearCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_TryGetSkillComponentByType_bSuccess) == 0x000069, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_TryGetSkillComponentByType_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_TryGetSkillComponentByType_SkillComponet) == 0x000070, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_TryGetSkillComponentByType_SkillComponet' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_CanUseSkill_TagContainer) == 0x000078, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_CanUseSkill_TagContainer' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_CanUseSkill_ReturnValue) == 0x000098, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_CanUseSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, K2Node_SwitchEnum2_CmpSuccess) == 0x000099, "Member 'WB_RadioChat_C_IsClearCondition::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_HasAnyTags_ReturnValue) == 0x00009A, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChat_C_IsClearCondition, CallFunc_Not_PreBool_ReturnValue1) == 0x00009B, "Member 'WB_RadioChat_C_IsClearCondition::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");

// Function WB_RadioChat.WB_RadioChat_C.IsOpend
// 0x0001 (0x0001 - 0x0000)
struct WB_RadioChat_C_IsOpend final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_RadioChat_C_IsOpend) == 0x000001, "Wrong alignment on WB_RadioChat_C_IsOpend");
static_assert(sizeof(WB_RadioChat_C_IsOpend) == 0x000001, "Wrong size on WB_RadioChat_C_IsOpend");
static_assert(offsetof(WB_RadioChat_C_IsOpend, bIsOpened) == 0x000000, "Member 'WB_RadioChat_C_IsOpend::bIsOpened' has a wrong offset!");

}

