#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_IDMatchStandby

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_RoomSelect_IDMatchStandby.WB_RoomSelect_IDMatchStandby_C.ExecuteUbergraph_WB_RoomSelect_IDMatchStandby
// 0x00A8 (0x00A8 - 0x0000)
struct WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAJBTextBlock*>                  K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class UAJBTextBlock*                          CallFunc_Array_Get_Item1;                          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby) == 0x000008, "Wrong alignment on WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby");
static_assert(sizeof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby) == 0x0000A8, "Wrong size on WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, EntryPoint) == 0x000000, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000020, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, K2Node_ComponentBoundEvent_TargetButton) == 0x000028, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, K2Node_CustomEvent_Text) == 0x000030, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000040, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Len_ReturnValue) == 0x000050, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Array_Get_Item) == 0x000058, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, K2Node_MakeArray_Array) == 0x000090, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby, CallFunc_Array_Get_Item1) == 0x0000A0, "Member 'WB_RoomSelect_IDMatchStandby_C_ExecuteUbergraph_WB_RoomSelect_IDMatchStandby::CallFunc_Array_Get_Item1' has a wrong offset!");

// Function WB_RoomSelect_IDMatchStandby.WB_RoomSelect_IDMatchStandby_C.BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_RoomSelect_IDMatchStandby_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_RoomSelect_IDMatchStandby.WB_RoomSelect_IDMatchStandby_C.SetMatchingIDText
// 0x0010 (0x0010 - 0x0000)
struct WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText) == 0x000008, "Wrong alignment on WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText");
static_assert(sizeof(WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText) == 0x000010, "Wrong size on WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText");
static_assert(offsetof(WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText, Text) == 0x000000, "Member 'WB_RoomSelect_IDMatchStandby_C_SetMatchingIDText::Text' has a wrong offset!");

}

