#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChatButtonList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_RadioChatButtonList.WB_RadioChatButtonList_C.ExecuteUbergraph_WB_RadioChatButtonList
// 0x0060 (0x0060 - 0x0000)
struct WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWB_RadioChatButton_C*>          CallFunc_GetButtons_ReturnValues;                  // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_RadioChatButton_C*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_RadioChatButton_C*>          K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList) == 0x000008, "Wrong alignment on WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList");
static_assert(sizeof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList) == 0x000060, "Wrong size on WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, EntryPoint) == 0x000000, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, Temp_int_Variable) == 0x000004, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, K2Node_CreateDelegate_OutputDelegate1) == 0x000020, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, CallFunc_GetButtons_ReturnValues) == 0x000030, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::CallFunc_GetButtons_ReturnValues' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, CallFunc_Array_Get_Item) == 0x000040, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, K2Node_MakeArray_Array) == 0x000048, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_RadioChatButtonList.WB_RadioChatButtonList_C.GetButtons
// 0x0010 (0x0010 - 0x0000)
struct WB_RadioChatButtonList_C_GetButtons final
{
public:
	TArray<class UWB_RadioChatButton_C*>          ReturnValues;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
};
static_assert(alignof(WB_RadioChatButtonList_C_GetButtons) == 0x000008, "Wrong alignment on WB_RadioChatButtonList_C_GetButtons");
static_assert(sizeof(WB_RadioChatButtonList_C_GetButtons) == 0x000010, "Wrong size on WB_RadioChatButtonList_C_GetButtons");
static_assert(offsetof(WB_RadioChatButtonList_C_GetButtons, ReturnValues) == 0x000000, "Member 'WB_RadioChatButtonList_C_GetButtons::ReturnValues' has a wrong offset!");

}

