#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillPartsTimer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SkillPartsTimer.WB_SkillPartsTimer_C
// 0x00B8 (0x02C0 - 0x0208)
class UWB_SkillPartsTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              BG;                                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TimeText;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            DefaultTextColor;                                  // 0x0220(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultBGTint;                                     // 0x0248(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RedTextColor;                                      // 0x0270(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            RedBGTint;                                         // 0x0298(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_SkillPartsTimer(int32 EntryPoint);
	void Construct();
	void ResetColor();
	void ChangeColorType(bool bColorTypeRed);
	void UpdateTimer(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SkillPartsTimer_C">();
	}
	static class UWB_SkillPartsTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillPartsTimer_C>();
	}
};
static_assert(alignof(UWB_SkillPartsTimer_C) == 0x000008, "Wrong alignment on UWB_SkillPartsTimer_C");
static_assert(sizeof(UWB_SkillPartsTimer_C) == 0x0002C0, "Wrong size on UWB_SkillPartsTimer_C");
static_assert(offsetof(UWB_SkillPartsTimer_C, UberGraphFrame) == 0x000208, "Member 'UWB_SkillPartsTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, BG) == 0x000210, "Member 'UWB_SkillPartsTimer_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, TimeText) == 0x000218, "Member 'UWB_SkillPartsTimer_C::TimeText' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, DefaultTextColor) == 0x000220, "Member 'UWB_SkillPartsTimer_C::DefaultTextColor' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, DefaultBGTint) == 0x000248, "Member 'UWB_SkillPartsTimer_C::DefaultBGTint' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, RedTextColor) == 0x000270, "Member 'UWB_SkillPartsTimer_C::RedTextColor' has a wrong offset!");
static_assert(offsetof(UWB_SkillPartsTimer_C, RedBGTint) == 0x000298, "Member 'UWB_SkillPartsTimer_C::RedBGTint' has a wrong offset!");

}

