#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillGuideText

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_SkillGuideText.WB_SkillGuideText_C.ExecuteUbergraph_WB_SkillGuideText
// 0x0008 (0x0008 - 0x0000)
struct WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText) == 0x000004, "Wrong alignment on WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText");
static_assert(sizeof(WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText) == 0x000008, "Wrong size on WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText");
static_assert(offsetof(WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText, EntryPoint) == 0x000000, "Member 'WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_SkillGuideText_C_ExecuteUbergraph_WB_SkillGuideText::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_SkillGuideText.WB_SkillGuideText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_SkillGuideText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SkillGuideText_C_PreConstruct) == 0x000001, "Wrong alignment on WB_SkillGuideText_C_PreConstruct");
static_assert(sizeof(WB_SkillGuideText_C_PreConstruct) == 0x000001, "Wrong size on WB_SkillGuideText_C_PreConstruct");
static_assert(offsetof(WB_SkillGuideText_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_SkillGuideText_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_SkillGuideText.WB_SkillGuideText_C.SetParamater
// 0x0028 (0x0028 - 0x0000)
struct WB_SkillGuideText_C_SetParamater final
{
public:
	EAJBPadIconType                               PadType_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SkillGuideText_C_SetParamater) == 0x000008, "Wrong alignment on WB_SkillGuideText_C_SetParamater");
static_assert(sizeof(WB_SkillGuideText_C_SetParamater) == 0x000028, "Wrong size on WB_SkillGuideText_C_SetParamater");
static_assert(offsetof(WB_SkillGuideText_C_SetParamater, PadType_0) == 0x000000, "Member 'WB_SkillGuideText_C_SetParamater::PadType_0' has a wrong offset!");
static_assert(offsetof(WB_SkillGuideText_C_SetParamater, InText) == 0x000008, "Member 'WB_SkillGuideText_C_SetParamater::InText' has a wrong offset!");
static_assert(offsetof(WB_SkillGuideText_C_SetParamater, CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture) == 0x000020, "Member 'WB_SkillGuideText_C_SetParamater::CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture' has a wrong offset!");

}

