#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_OverGrow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_Skill_OverGrow.WB_Skill_OverGrow_C.ExecuteUbergraph_WB_Skill_OverGrow
// 0x0090 (0x0090 - 0x0000)
struct WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter1;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow) == 0x000008, "Wrong alignment on WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow");
static_assert(sizeof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow) == 0x000090, "Wrong size on WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, EntryPoint) == 0x000000, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000004, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000008, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000010, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000018, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x000020, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x000028, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsHighlightPlayBegin_ReturnValue) == 0x000030, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsHighlightPlayBegin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsHighlightPlayBegin_ReturnValue1) == 0x000031, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsHighlightPlayBegin_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x000038, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_Get_UI_TargetCharacter_TargetCharacter1) == 0x000040, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_Get_UI_TargetCharacter_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBGameInstance_bSuccess) == 0x000048, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000050, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsPlayingReplay_ReturnValue) == 0x000058, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000059, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000060, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000069, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_Not_PreBool_ReturnValue1) == 0x00006A, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x00006B, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x000070, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000078, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000080, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_IsValid_ReturnValue1) == 0x000089, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00008A, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x00008B, "Member 'WB_Skill_OverGrow_C_ExecuteUbergraph_WB_Skill_OverGrow::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");

}

