#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StarIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_StarIcon.WB_StarIcon_C.ExecuteUbergraph_WB_StarIcon
// 0x00B8 (0x00B8 - 0x0000)
struct WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDifficultyMaxNum_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBImage*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0030(0x0088)()
};
static_assert(alignof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon) == 0x000008, "Wrong alignment on WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon");
static_assert(sizeof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon) == 0x0000B8, "Wrong size on WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, EntryPoint) == 0x000000, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, Temp_int_Variable) == 0x000008, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_GetDifficultyMaxNum_ReturnValue) == 0x000010, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_GetDifficultyMaxNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000030, "Member 'WB_StarIcon_C_ExecuteUbergraph_WB_StarIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WB_StarIcon.WB_StarIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_StarIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_StarIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WB_StarIcon_C_PreConstruct");
static_assert(sizeof(WB_StarIcon_C_PreConstruct) == 0x000001, "Wrong size on WB_StarIcon_C_PreConstruct");
static_assert(offsetof(WB_StarIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_StarIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_StarIcon.WB_StarIcon_C.UpdateStar
// 0x0030 (0x0030 - 0x0000)
struct WB_StarIcon_C_UpdateStar final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LCount;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StarIcon_C_UpdateStar) == 0x000008, "Wrong alignment on WB_StarIcon_C_UpdateStar");
static_assert(sizeof(WB_StarIcon_C_UpdateStar) == 0x000030, "Wrong size on WB_StarIcon_C_UpdateStar");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, Num) == 0x000000, "Member 'WB_StarIcon_C_UpdateStar::Num' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, LCount) == 0x000004, "Member 'WB_StarIcon_C_UpdateStar::LCount' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, Temp_byte_Variable) == 0x000008, "Member 'WB_StarIcon_C_UpdateStar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, Temp_byte_Variable1) == 0x000009, "Member 'WB_StarIcon_C_UpdateStar::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, Temp_bool_Variable) == 0x000010, "Member 'WB_StarIcon_C_UpdateStar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, Temp_int_Variable) == 0x000014, "Member 'WB_StarIcon_C_UpdateStar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000019, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, K2Node_Select_Default) == 0x00001A, "Member 'WB_StarIcon_C_UpdateStar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StarIcon_C_UpdateStar, CallFunc_GetChildrenCount_ReturnValue) == 0x00002C, "Member 'WB_StarIcon_C_UpdateStar::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

}

