#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_StickyDive

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Skill_StickyDive.WB_Skill_StickyDive_C.ExecuteUbergraph_WB_Skill_StickyDive
// 0x01D8 (0x01D8 - 0x0000)
struct WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue2;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter2;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue3;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess4;             // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance4;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue4;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue3;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter3;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBStickyDiveSkill_C*               K2Node_DynamicCast_AsBP_AJBSticky_Dive_Skill;      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess1;   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget1;  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SkillPartsTimer_C*                  CallFunc_RegisterSkillTimer_ReturValue;            // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess2;   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget2;  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess4;             // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess5;             // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue4;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter4;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess6;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive) == 0x000008, "Wrong alignment on WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive");
static_assert(sizeof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive) == 0x0001D8, "Wrong size on WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, EntryPoint) == 0x000000, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000011, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000018, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsHighlightPlayBegin_ReturnValue) == 0x000020, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsHighlightPlayBegin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x000028, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_bSuccess) == 0x000030, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000038, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000040, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000048, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsPlayingReplay_ReturnValue) == 0x000050, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000051, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Not_PreBool_ReturnValue1) == 0x000053, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000054, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000058, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue1) == 0x000060, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsHighlightPlayBegin_ReturnValue1) == 0x000061, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsHighlightPlayBegin_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter1) == 0x000068, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x000071, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x000078, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsHighlightPlayBegin_ReturnValue2) == 0x000080, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsHighlightPlayBegin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter2) == 0x000088, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000090, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000098, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsPlayingReplay_ReturnValue2) == 0x0000A0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_bSuccess3) == 0x0000A1, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance3) == 0x0000A8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Not_PreBool_ReturnValue2) == 0x0000B0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsPlayingReplay_ReturnValue3) == 0x0000B1, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsPlayingReplay_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Not_PreBool_ReturnValue3) == 0x0000B2, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_bSuccess4) == 0x0000B3, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance4) == 0x0000B8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsPlayingReplay_ReturnValue4) == 0x0000C0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsPlayingReplay_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Not_PreBool_ReturnValue4) == 0x0000C1, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x0000C2, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x0000C8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsHighlightPlayBegin_ReturnValue3) == 0x0000D0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsHighlightPlayBegin_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter3) == 0x0000D8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, K2Node_Event_MyGeometry) == 0x0000E0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, K2Node_Event_InDeltaTime) == 0x000118, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, K2Node_DynamicCast_AsBP_AJBSticky_Dive_Skill) == 0x000120, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::K2Node_DynamicCast_AsBP_AJBSticky_Dive_Skill' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00012C, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetValidValue_ReturnValue) == 0x000130, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, K2Node_SwitchEnum_CmpSuccess) == 0x000131, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x000132, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x000138, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess1) == 0x000140, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget1) == 0x000148, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_RegisterSkillTimer_ReturValue) == 0x000150, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_RegisterSkillTimer_ReturValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess2) == 0x000158, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget2) == 0x000160, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000168, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue2) == 0x000170, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000178, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue3) == 0x000180, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000181, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess4) == 0x000182, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4) == 0x000188, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000190, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue4) == 0x000198, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000199, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess5) == 0x00019A, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess5' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5) == 0x0001A0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsHighlightPlayBegin_ReturnValue4) == 0x0001A8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsHighlightPlayBegin_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter4) == 0x0001B0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x0001B8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_bSuccess6) == 0x0001B9, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_bSuccess6' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6) == 0x0001C0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0001C8, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x0001D0, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive, CallFunc_IsValid_ReturnValue5) == 0x0001D1, "Member 'WB_Skill_StickyDive_C_ExecuteUbergraph_WB_Skill_StickyDive::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function WB_Skill_StickyDive.WB_Skill_StickyDive_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Skill_StickyDive_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_StickyDive_C_Tick) == 0x000004, "Wrong alignment on WB_Skill_StickyDive_C_Tick");
static_assert(sizeof(WB_Skill_StickyDive_C_Tick) == 0x00003C, "Wrong size on WB_Skill_StickyDive_C_Tick");
static_assert(offsetof(WB_Skill_StickyDive_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Skill_StickyDive_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Skill_StickyDive_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Skill_StickyDive.WB_Skill_StickyDive_C.GetSXPCharacter
// 0x0028 (0x0028 - 0x0000)
struct WB_Skill_StickyDive_C_GetSXPCharacter final
{
public:
	class ABP_AJBInGameMovableStand_SXP_C*        SXP;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameMovableStand*                 CallFunc_GetOwnerMovableStand_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameMovableStand_SXP_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand_SXP; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_StickyDive_C_GetSXPCharacter) == 0x000008, "Wrong alignment on WB_Skill_StickyDive_C_GetSXPCharacter");
static_assert(sizeof(WB_Skill_StickyDive_C_GetSXPCharacter) == 0x000028, "Wrong size on WB_Skill_StickyDive_C_GetSXPCharacter");
static_assert(offsetof(WB_Skill_StickyDive_C_GetSXPCharacter, SXP) == 0x000000, "Member 'WB_Skill_StickyDive_C_GetSXPCharacter::SXP' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_GetSXPCharacter, bSuccess) == 0x000008, "Member 'WB_Skill_StickyDive_C_GetSXPCharacter::bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_StickyDive_C_GetSXPCharacter, CallFunc_GetOwnerMovableStand_ReturnValue) == 0x000010, "Member 'WB_Skill_StickyDive_C_GetSXPCharacter::CallFunc_GetOwnerMovableStand_ReturnValue' has a wrong offset!");
