#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_RodeoShotPistols

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Skill_RodeoShotPistols.WB_Skill_RodeoShotPistols_C
// 0x0030 (0x02B0 - 0x0280)
class UWB_Skill_RodeoShotPistols_C : public UAJBInGameSkillWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_ErrorSeparate_Belt;                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_ErrorSeparate;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SkillPartsTimer_C*                  TimerWidget;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillTag;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Skill_RodeoShotPistols(int32 EntryPoint);
	void OnRegisterSkill();
	void OnInactiveSkillWidget();
	void OnActiveSkillWidget();
	void OnUnregisterSkill();
	void FinalizeUI();
	void OnUnregisterSkillComponent();
	void OnRegisterSkillComponent();
	void OnStateChanged(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GetSXPCharacter(bool* bSuccess, class ABP_AJBInGameMovableStand_SXP_C** SXP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Skill_RodeoShotPistols_C">();
	}
	static class UWB_Skill_RodeoShotPistols_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Skill_RodeoShotPistols_C>();
	}
};
static_assert(alignof(UWB_Skill_RodeoShotPistols_C) == 0x000008, "Wrong alignment on UWB_Skill_RodeoShotPistols_C");
static_assert(sizeof(UWB_Skill_RodeoShotPistols_C) == 0x0002B0, "Wrong size on UWB_Skill_RodeoShotPistols_C");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, UberGraphFrame) == 0x000280, "Member 'UWB_Skill_RodeoShotPistols_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, AJBImage_ErrorSeparate_Belt) == 0x000288, "Member 'UWB_Skill_RodeoShotPistols_C::AJBImage_ErrorSeparate_Belt' has a wrong offset!");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, CanvasPanel_0) == 0x000290, "Member 'UWB_Skill_RodeoShotPistols_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, Txt_ErrorSeparate) == 0x000298, "Member 'UWB_Skill_RodeoShotPistols_C::Txt_ErrorSeparate' has a wrong offset!");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, TimerWidget) == 0x0002A0, "Member 'UWB_Skill_RodeoShotPistols_C::TimerWidget' has a wrong offset!");
static_assert(offsetof(UWB_Skill_RodeoShotPistols_C, SkillTag) == 0x0002A8, "Member 'UWB_Skill_RodeoShotPistols_C::SkillTag' has a wrong offset!");

}

