#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ScoreBoardRow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.ExecuteUbergraph_WB_ScoreBoardRow
// 0x0078 (0x0078 - 0x0000)
struct WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_KnockOut;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalDamage;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0028(0x0018)()
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0040(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
};
static_assert(alignof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow) == 0x000008, "Wrong alignment on WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow");
static_assert(sizeof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow) == 0x000078, "Wrong size on WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, EntryPoint) == 0x000000, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, K2Node_CustomEvent_KnockOut) == 0x000004, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::K2Node_CustomEvent_KnockOut' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, K2Node_CustomEvent_TotalDamage) == 0x000008, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::K2Node_CustomEvent_TotalDamage' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, CallFunc_Conv_IntToText_ReturnValue1) == 0x000028, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, K2Node_CustomEvent_Color) == 0x000040, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.SetNameColor
// 0x0010 (0x0010 - 0x0000)
struct WB_ScoreBoardRow_C_SetNameColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScoreBoardRow_C_SetNameColor) == 0x000004, "Wrong alignment on WB_ScoreBoardRow_C_SetNameColor");
static_assert(sizeof(WB_ScoreBoardRow_C_SetNameColor) == 0x000010, "Wrong size on WB_ScoreBoardRow_C_SetNameColor");
static_assert(offsetof(WB_ScoreBoardRow_C_SetNameColor, Color) == 0x000000, "Member 'WB_ScoreBoardRow_C_SetNameColor::Color' has a wrong offset!");

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.SetNewValues
// 0x0008 (0x0008 - 0x0000)
struct WB_ScoreBoardRow_C_SetNewValues final
{
public:
	int32                                         KnockOut;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalDamage_0;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScoreBoardRow_C_SetNewValues) == 0x000004, "Wrong alignment on WB_ScoreBoardRow_C_SetNewValues");
static_assert(sizeof(WB_ScoreBoardRow_C_SetNewValues) == 0x000008, "Wrong size on WB_ScoreBoardRow_C_SetNewValues");
static_assert(offsetof(WB_ScoreBoardRow_C_SetNewValues, KnockOut) == 0x000000, "Member 'WB_ScoreBoardRow_C_SetNewValues::KnockOut' has a wrong offset!");
static_assert(offsetof(WB_ScoreBoardRow_C_SetNewValues, TotalDamage_0) == 0x000004, "Member 'WB_ScoreBoardRow_C_SetNewValues::TotalDamage_0' has a wrong offset!");

}

