#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SkillGuide.WB_SkillGuide_C
// 0x0058 (0x0260 - 0x0208)
class UWB_SkillGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GuideRoot;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GuideBG_C*                          WB_GuideBG;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_SkillGuideText_C*>           UnusedGuideText;                                   // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnAppearDispatcher;                                // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnDisappearDispatcher;                             // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnAppearDispatcher__DelegateSignature();
	void OnDisappearDispatcher__DelegateSignature();
	void ExecuteUbergraph_WB_SkillGuide(int32 EntryPoint);
	void Construct();
	void OnCloseTickGate();
	void OnOpenTickGate();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ResetGuide();
	void UnbindDisappearAnimation();
	void OnFinishedDisappear();
	void PlayDisappearAnimation();
	void PlayAppearAnimation(const struct FAJBSkillGuideInfo& GuideInfo);
	void PopUnusedGuideText(class UWB_SkillGuideText_C** Output, bool* bCreate);
	void PushUnusedGuideText(const class UWidget*& NewItem);
	void RemoveChildren();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SkillGuide_C">();
	}
	static class UWB_SkillGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillGuide_C>();
	}
};
static_assert(alignof(UWB_SkillGuide_C) == 0x000008, "Wrong alignment on UWB_SkillGuide_C");
static_assert(sizeof(UWB_SkillGuide_C) == 0x000260, "Wrong size on UWB_SkillGuide_C");
static_assert(offsetof(UWB_SkillGuide_C, UberGraphFrame) == 0x000208, "Member 'UWB_SkillGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, Appear) == 0x000210, "Member 'UWB_SkillGuide_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, GuideRoot) == 0x000218, "Member 'UWB_SkillGuide_C::GuideRoot' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, WB_GuideBG) == 0x000220, "Member 'UWB_SkillGuide_C::WB_GuideBG' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, Timer) == 0x000228, "Member 'UWB_SkillGuide_C::Timer' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, UnusedGuideText) == 0x000230, "Member 'UWB_SkillGuide_C::UnusedGuideText' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, OnAppearDispatcher) == 0x000240, "Member 'UWB_SkillGuide_C::OnAppearDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_SkillGuide_C, OnDisappearDispatcher) == 0x000250, "Member 'UWB_SkillGuide_C::OnDisappearDispatcher' has a wrong offset!");

}

