#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItemOpenPage

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_TestModeMenuItemOpenPage.WB_TestModeMenuItemOpenPage_C.ExecuteUbergraph_WB_TestModeMenuItemOpenPage
// 0x0020 (0x0020 - 0x0000)
struct WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_TestModeMenuBase_C*>         CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_TestModeMenuBase_C*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage) == 0x000008, "Wrong alignment on WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage");
static_assert(sizeof(WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage) == 0x000020, "Wrong size on WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage");
static_assert(offsetof(WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage, EntryPoint) == 0x000000, "Member 'WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_TestModeMenuItemOpenPage_C_ExecuteUbergraph_WB_TestModeMenuItemOpenPage::CallFunc_Array_Get_Item' has a wrong offset!");

}

