#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TutorialInGameInputGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TutorialInGameInputGuide.WB_TutorialInGameInputGuide_C
// 0x0028 (0x0230 - 0x0208)
class UWB_TutorialInGameInputGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              BG;                                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GuideBG_C*                          WB_GuideBG;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SkillGuide_C*                       SkillGuideWidget;                                  // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_TutorialInGameInputGuide(int32 EntryPoint);
	void OnAppearSkillGuide();
	void OnDisappearSkillGuide();
	void SetSkillGuide(class UWB_SkillGuide_C* SkillGuideWidget_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TutorialInGameInputGuide_C">();
	}
	static class UWB_TutorialInGameInputGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TutorialInGameInputGuide_C>();
	}
};
static_assert(alignof(UWB_TutorialInGameInputGuide_C) == 0x000008, "Wrong alignment on UWB_TutorialInGameInputGuide_C");
static_assert(sizeof(UWB_TutorialInGameInputGuide_C) == 0x000230, "Wrong size on UWB_TutorialInGameInputGuide_C");
static_assert(offsetof(UWB_TutorialInGameInputGuide_C, UberGraphFrame) == 0x000208, "Member 'UWB_TutorialInGameInputGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TutorialInGameInputGuide_C, Disappear) == 0x000210, "Member 'UWB_TutorialInGameInputGuide_C::Disappear' has a wrong offset!");
static_assert(offsetof(UWB_TutorialInGameInputGuide_C, BG) == 0x000218, "Member 'UWB_TutorialInGameInputGuide_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_TutorialInGameInputGuide_C, WB_GuideBG) == 0x000220, "Member 'UWB_TutorialInGameInputGuide_C::WB_GuideBG' has a wrong offset!");
static_assert(offsetof(UWB_TutorialInGameInputGuide_C, SkillGuideWidget) == 0x000228, "Member 'UWB_TutorialInGameInputGuide_C::SkillGuideWidget' has a wrong offset!");

}

