#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TournamentMode_UltimateLogColumn

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TournamentMode_UltimateLogColumn.WB_TournamentMode_UltimateLogColumn_C
// 0x00A0 (0x02E8 - 0x0248)
class UWB_TournamentMode_UltimateLogColumn_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       End;                                               // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start;                                             // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ActiveButtonRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_CharaIcon;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_UltimateMessageBelt;                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InactiveButtonRoot;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerName;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          SkillActionText;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentMode_UltimateLogButton_C* WB_TournamentMode_UltimateLogButton;               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentMode_UltimateLogButton_Dead_C* WB_TournamentMode_UltimateLogButton_Dead;          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherButton;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DisplayTimer;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnFinishedVisibleTime;                             // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               DMI_CharaIcon;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerID;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDecided;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ECharacterBehavior                            CharacterBehavior;                                 // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnFinishedVisibleTime__DelegateSignature(class UWB_TournamentMode_UltimateLogColumn_C* SelfLogColumn);
	void OnDecided__DelegateSignature(int32 PlayerID_0);
	void ExecuteUbergraph_WB_TournamentMode_UltimateLogColumn(int32 EntryPoint);
	void ChangeDisplayEnable(bool bEnable);
	void ChangeDisplayActive();
	void ChangeDisplayInactive();
	void UpdateCharaParam(ECharacterBehavior CharacterBehavior_0);
	void BndEvt__WB_TournamentMode_UltimateLogButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void Construct();
	void Setup(int32 PlayerID_0, const struct FGameplayTag& SkillTag, float DisplayTime);
	void Finish();
	void OnLoaded_257D691F42A19B883E92EF93EF3C7CAF(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TournamentMode_UltimateLogColumn_C">();
	}
	static class UWB_TournamentMode_UltimateLogColumn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TournamentMode_UltimateLogColumn_C>();
	}
};
static_assert(alignof(UWB_TournamentMode_UltimateLogColumn_C) == 0x000008, "Wrong alignment on UWB_TournamentMode_UltimateLogColumn_C");
static_assert(sizeof(UWB_TournamentMode_UltimateLogColumn_C) == 0x0002E8, "Wrong size on UWB_TournamentMode_UltimateLogColumn_C");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, UberGraphFrame) == 0x000248, "Member 'UWB_TournamentMode_UltimateLogColumn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, End) == 0x000250, "Member 'UWB_TournamentMode_UltimateLogColumn_C::End' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, Start) == 0x000258, "Member 'UWB_TournamentMode_UltimateLogColumn_C::Start' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, ActiveButtonRoot) == 0x000260, "Member 'UWB_TournamentMode_UltimateLogColumn_C::ActiveButtonRoot' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, AJBImage_CharaIcon) == 0x000268, "Member 'UWB_TournamentMode_UltimateLogColumn_C::AJBImage_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, AJBImage_UltimateMessageBelt) == 0x000270, "Member 'UWB_TournamentMode_UltimateLogColumn_C::AJBImage_UltimateMessageBelt' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, InactiveButtonRoot) == 0x000278, "Member 'UWB_TournamentMode_UltimateLogColumn_C::InactiveButtonRoot' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, PlayerName) == 0x000280, "Member 'UWB_TournamentMode_UltimateLogColumn_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, SkillActionText) == 0x000288, "Member 'UWB_TournamentMode_UltimateLogColumn_C::SkillActionText' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, WB_TournamentMode_UltimateLogButton) == 0x000290, "Member 'UWB_TournamentMode_UltimateLogColumn_C::WB_TournamentMode_UltimateLogButton' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, WB_TournamentMode_UltimateLogButton_Dead) == 0x000298, "Member 'UWB_TournamentMode_UltimateLogColumn_C::WB_TournamentMode_UltimateLogButton_Dead' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, WidgetSwitcherButton) == 0x0002A0, "Member 'UWB_TournamentMode_UltimateLogColumn_C::WidgetSwitcherButton' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, DisplayTimer) == 0x0002A8, "Member 'UWB_TournamentMode_UltimateLogColumn_C::DisplayTimer' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, OnFinishedVisibleTime) == 0x0002B0, "Member 'UWB_TournamentMode_UltimateLogColumn_C::OnFinishedVisibleTime' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, DMI_CharaIcon) == 0x0002C0, "Member 'UWB_TournamentMode_UltimateLogColumn_C::DMI_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, PlayerID) == 0x0002C8, "Member 'UWB_TournamentMode_UltimateLogColumn_C::PlayerID' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, OnDecided) == 0x0002D0, "Member 'UWB_TournamentMode_UltimateLogColumn_C::OnDecided' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, CharacterBehavior) == 0x0002E0, "Member 'UWB_TournamentMode_UltimateLogColumn_C::CharacterBehavior' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogColumn_C, bActive) == 0x0002E1, "Member 'UWB_TournamentMode_UltimateLogColumn_C::bActive' has a wrong offset!");

}

