#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Tutorial_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Tutorial_Arrow.WB_Tutorial_Arrow_C
// 0x0030 (0x0238 - 0x0208)
class UWB_Tutorial_Arrow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIn;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_PointToObjcect;                               // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Arrow;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Belt;                                     // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Tutorial_Arrow(int32 EntryPoint);
	void Hide();
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Tutorial_Arrow_C">();
	}
	static class UWB_Tutorial_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Tutorial_Arrow_C>();
	}
};
static_assert(alignof(UWB_Tutorial_Arrow_C) == 0x000008, "Wrong alignment on UWB_Tutorial_Arrow_C");
static_assert(sizeof(UWB_Tutorial_Arrow_C) == 0x000238, "Wrong size on UWB_Tutorial_Arrow_C");
static_assert(offsetof(UWB_Tutorial_Arrow_C, UberGraphFrame) == 0x000208, "Member 'UWB_Tutorial_Arrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Tutorial_Arrow_C, Anim_FadeOut) == 0x000210, "Member 'UWB_Tutorial_Arrow_C::Anim_FadeOut' has a wrong offset!");
static_assert(offsetof(UWB_Tutorial_Arrow_C, Anim_FadeIn) == 0x000218, "Member 'UWB_Tutorial_Arrow_C::Anim_FadeIn' has a wrong offset!");
static_assert(offsetof(UWB_Tutorial_Arrow_C, Anim_PointToObjcect) == 0x000220, "Member 'UWB_Tutorial_Arrow_C::Anim_PointToObjcect' has a wrong offset!");
static_assert(offsetof(UWB_Tutorial_Arrow_C, AJBImage_Arrow) == 0x000228, "Member 'UWB_Tutorial_Arrow_C::AJBImage_Arrow' has a wrong offset!");
static_assert(offsetof(UWB_Tutorial_Arrow_C, AJBImage_Belt) == 0x000230, "Member 'UWB_Tutorial_Arrow_C::AJBImage_Belt' has a wrong offset!");

}

