#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TipsOld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TipsOld.WB_TipsOld_C
// 0x0068 (0x0270 - 0x0208)
class UWB_TipsOld_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disappear;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_0;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_1;                                  // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TipsText;                                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   CurrentRowName;                                    // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SwitchingTipsTimer;                                // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class FName>                           TipsRowNames;                                      // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         TipsSwitchingTime;                                 // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayText;                                       // 0x0258(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_TipsOld(int32 EntryPoint);
	void Construct();
	void OnFinishedAnim();
	void OnSwitchingTips();
	void OnUpdateTips();
	void StartTips();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TipsOld_C">();
	}
	static class UWB_TipsOld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TipsOld_C>();
	}
};
static_assert(alignof(UWB_TipsOld_C) == 0x000008, "Wrong alignment on UWB_TipsOld_C");
static_assert(sizeof(UWB_TipsOld_C) == 0x000270, "Wrong size on UWB_TipsOld_C");
static_assert(offsetof(UWB_TipsOld_C, UberGraphFrame) == 0x000208, "Member 'UWB_TipsOld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, Anim_Disappear) == 0x000210, "Member 'UWB_TipsOld_C::Anim_Disappear' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, AJBImage_0) == 0x000218, "Member 'UWB_TipsOld_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, AJBRetainerBox_1) == 0x000220, "Member 'UWB_TipsOld_C::AJBRetainerBox_1' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, TipsText) == 0x000228, "Member 'UWB_TipsOld_C::TipsText' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, CurrentRowName) == 0x000230, "Member 'UWB_TipsOld_C::CurrentRowName' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, SwitchingTipsTimer) == 0x000238, "Member 'UWB_TipsOld_C::SwitchingTipsTimer' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, TipsRowNames) == 0x000240, "Member 'UWB_TipsOld_C::TipsRowNames' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, TipsSwitchingTime) == 0x000250, "Member 'UWB_TipsOld_C::TipsSwitchingTime' has a wrong offset!");
static_assert(offsetof(UWB_TipsOld_C, DisplayText) == 0x000258, "Member 'UWB_TipsOld_C::DisplayText' has a wrong offset!");

}

