#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TournamentMode_UltimateLogWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TournamentMode_UltimateLogWindow.WB_TournamentMode_UltimateLogWindow_C
// 0x0048 (0x0290 - 0x0248)
class UWB_TournamentMode_UltimateLogWindow_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           LogRoot;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxLogNum;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_TournamentMode_UltimateLogColumn_C*> LogColumns;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWB_TournamentMode_UltimateLogColumn_C* Temp_Column;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayTime;                                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDecidedUltimateWindowButton;                     // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnDecidedUltimateWindowButton__DelegateSignature(int32 PlayerID);
	void ExecuteUbergraph_WB_TournamentMode_UltimateLogWindow(int32 EntryPoint);
	void Construct();
	void OnDecided(int32 PlayerID);
	void RequestUltimateLog(int32 PlayerID, const struct FGameplayTag& SkillTag);
	void UpdateCharaParam(const struct FST_ShopCompetitionUICharaParam& CharaParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TournamentMode_UltimateLogWindow_C">();
	}
	static class UWB_TournamentMode_UltimateLogWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TournamentMode_UltimateLogWindow_C>();
	}
};
static_assert(alignof(UWB_TournamentMode_UltimateLogWindow_C) == 0x000008, "Wrong alignment on UWB_TournamentMode_UltimateLogWindow_C");
static_assert(sizeof(UWB_TournamentMode_UltimateLogWindow_C) == 0x000290, "Wrong size on UWB_TournamentMode_UltimateLogWindow_C");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, UberGraphFrame) == 0x000248, "Member 'UWB_TournamentMode_UltimateLogWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, LogRoot) == 0x000250, "Member 'UWB_TournamentMode_UltimateLogWindow_C::LogRoot' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, MaxLogNum) == 0x000258, "Member 'UWB_TournamentMode_UltimateLogWindow_C::MaxLogNum' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, LogColumns) == 0x000260, "Member 'UWB_TournamentMode_UltimateLogWindow_C::LogColumns' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, Temp_Column) == 0x000270, "Member 'UWB_TournamentMode_UltimateLogWindow_C::Temp_Column' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, DisplayTime) == 0x000278, "Member 'UWB_TournamentMode_UltimateLogWindow_C::DisplayTime' has a wrong offset!");
static_assert(offsetof(UWB_TournamentMode_UltimateLogWindow_C, OnDecidedUltimateWindowButton) == 0x000280, "Member 'UWB_TournamentMode_UltimateLogWindow_C::OnDecidedUltimateWindowButton' has a wrong offset!");

}

