#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModePage

#include "Basic.hpp"

#include "ST_TestModeText_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_TestModePage.WB_TestModePage_C.ExecuteUbergraph_WB_TestModePage
// 0x0128 (0x0128 - 0x0000)
struct WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_TestModeMenuBase_C*>         CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_TestModeMenuBase_C*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item1;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_OnDecide_self_CastInput;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item2;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_IsLock_self_CastInput;                    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLock_result;                            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item3;                          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_OnCancel_self_CastInput;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_TestModeText>               K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_AJBTestModeText_C*                  CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TestModeText                       K2Node_MakeStruct_ST_TestModeText;                 // 0x0098(0x0028)(HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_SelectItemMenu;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TestModeText                       K2Node_MakeStruct_ST_TestModeText1;                // 0x00D0(0x0028)(HasGetValueTypeHash)
	TArray<struct FST_TestModeText>               K2Node_MakeArray_Array1;                           // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_AJBTestModeText_C*                  CallFunc_Create_ReturnValue1;                      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue1;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage) == 0x000008, "Wrong alignment on WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage");
static_assert(sizeof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage) == 0x000128, "Wrong size on WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, EntryPoint) == 0x000000, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Get_Item1) == 0x000020, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_OnDecide_self_CastInput) == 0x000028, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_OnDecide_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Get_Item2) == 0x000040, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_IsLock_self_CastInput) == 0x000048, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_IsLock_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_IsLock_result) == 0x000058, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_IsLock_result' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Get_Item3) == 0x000060, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_OnCancel_self_CastInput) == 0x000068, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_OnCancel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_TextIsEmpty_ReturnValue) == 0x000078, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_TextIsEmpty_ReturnValue1) == 0x00007A, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_TextIsEmpty_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Not_PreBool_ReturnValue1) == 0x00007B, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_TextIsEmpty_ReturnValue2) == 0x00007C, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Not_PreBool_ReturnValue2) == 0x00007D, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_MakeArray_Array) == 0x000080, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Create_ReturnValue) == 0x000090, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_MakeStruct_ST_TestModeText) == 0x000098, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_MakeStruct_ST_TestModeText' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C0, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_Event_SelectItemMenu) == 0x0000C8, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_Event_SelectItemMenu' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_MakeStruct_ST_TestModeText1) == 0x0000D0, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_MakeStruct_ST_TestModeText1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_MakeArray_Array1) == 0x0000F8, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Create_ReturnValue1) == 0x000108, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Array_Length_ReturnValue1) == 0x000110, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_AddChildToVerticalBox_ReturnValue1) == 0x000118, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_AddChildToVerticalBox_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, CallFunc_Greater_IntInt_ReturnValue1) == 0x000120, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage, K2Node_Event_IsDesignTime) == 0x000121, "Member 'WB_TestModePage_C_ExecuteUbergraph_WB_TestModePage::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_TestModePage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModePage_C_PreConstruct) == 0x000001, "Wrong alignment on WB_TestModePage_C_PreConstruct");
static_assert(sizeof(WB_TestModePage_C_PreConstruct) == 0x000001, "Wrong size on WB_TestModePage_C_PreConstruct");
static_assert(offsetof(WB_TestModePage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_TestModePage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.SetFocusMenuItem
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WB_TestModePage_C_SetFocusMenuItem final
{
public:
	class FName                                   SelectItemMenu;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_SetFocusMenuItem) == 0x000008, "Wrong alignment on WB_TestModePage_C_SetFocusMenuItem");
static_assert(sizeof(WB_TestModePage_C_SetFocusMenuItem) == 0x000008, "Wrong size on WB_TestModePage_C_SetFocusMenuItem");
static_assert(offsetof(WB_TestModePage_C_SetFocusMenuItem, SelectItemMenu) == 0x000000, "Member 'WB_TestModePage_C_SetFocusMenuItem::SelectItemMenu' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateMenuItemInteger
// 0x0048 (0x0048 - 0x0000)
struct WB_TestModePage_C_CreateMenuItemInteger final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultValue;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueMin;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueMax;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InValueOffsetX;                                    // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemInteger_C*          MenuItem;                                          // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemInteger_C*          CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_CreateMenuItemInteger) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateMenuItemInteger");
static_assert(sizeof(WB_TestModePage_C_CreateMenuItemInteger) == 0x000048, "Wrong size on WB_TestModePage_C_CreateMenuItemInteger");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, Label) == 0x000000, "Member 'WB_TestModePage_C_CreateMenuItemInteger::Label' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, Value) == 0x000018, "Member 'WB_TestModePage_C_CreateMenuItemInteger::Value' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, DefaultValue) == 0x00001C, "Member 'WB_TestModePage_C_CreateMenuItemInteger::DefaultValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, ValueMin) == 0x000020, "Member 'WB_TestModePage_C_CreateMenuItemInteger::ValueMin' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, ValueMax) == 0x000024, "Member 'WB_TestModePage_C_CreateMenuItemInteger::ValueMax' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, IsLoop) == 0x000028, "Member 'WB_TestModePage_C_CreateMenuItemInteger::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, InValueOffsetX) == 0x00002C, "Member 'WB_TestModePage_C_CreateMenuItemInteger::InValueOffsetX' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, MenuItem) == 0x000030, "Member 'WB_TestModePage_C_CreateMenuItemInteger::MenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WB_TestModePage_C_CreateMenuItemInteger::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'WB_TestModePage_C_CreateMenuItemInteger::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, Temp_bool_Variable) == 0x000041, "Member 'WB_TestModePage_C_CreateMenuItemInteger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemInteger, K2Node_Select_Default) == 0x000044, "Member 'WB_TestModePage_C_CreateMenuItemInteger::K2Node_Select_Default' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateMenuItemSelectText
// 0x0050 (0x0050 - 0x0000)
struct WB_TestModePage_C_CreateMenuItemSelectText final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FText>                           SelectText;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         SelectIndex_0;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultIndex;                                      // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAlignRight;                                       // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ValueOffsetX_0;                                    // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemSelectText_C*       MenuItem;                                          // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemSelectText_C*       CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_CreateMenuItemSelectText) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateMenuItemSelectText");
static_assert(sizeof(WB_TestModePage_C_CreateMenuItemSelectText) == 0x000050, "Wrong size on WB_TestModePage_C_CreateMenuItemSelectText");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, Label) == 0x000000, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::Label' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, SelectText) == 0x000018, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::SelectText' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, SelectIndex_0) == 0x000028, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::SelectIndex_0' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, DefaultIndex) == 0x00002C, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::DefaultIndex' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, IsLoop) == 0x000030, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, bAlignRight) == 0x000031, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::bAlignRight' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, ValueOffsetX_0) == 0x000034, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::ValueOffsetX_0' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, MenuItem) == 0x000038, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::MenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, Temp_bool_Variable) == 0x000049, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemSelectText, K2Node_Select_Default) == 0x00004C, "Member 'WB_TestModePage_C_CreateMenuItemSelectText::K2Node_Select_Default' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateMenuItemOpenPage
// 0x0030 (0x0030 - 0x0000)
struct WB_TestModePage_C_CreateMenuItemOpenPage final
{
public:
	class FName                                   OpenPage;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWB_TestModeMenuItemOpenPage_C*         MenuItem;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemOpenPage_C*         CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_CreateMenuItemOpenPage) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateMenuItemOpenPage");
static_assert(sizeof(WB_TestModePage_C_CreateMenuItemOpenPage) == 0x000030, "Wrong size on WB_TestModePage_C_CreateMenuItemOpenPage");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemOpenPage, OpenPage) == 0x000000, "Member 'WB_TestModePage_C_CreateMenuItemOpenPage::OpenPage' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemOpenPage, Label) == 0x000008, "Member 'WB_TestModePage_C_CreateMenuItemOpenPage::Label' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemOpenPage, MenuItem) == 0x000020, "Member 'WB_TestModePage_C_CreateMenuItemOpenPage::MenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemOpenPage, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WB_TestModePage_C_CreateMenuItemOpenPage::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.FindFocus
// 0x0058 (0x0058 - 0x0000)
struct WB_TestModePage_C_FindFocus final
{
public:
	class FName                                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstCanSelectItem;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFindedFocus;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item1;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemOpenPage_C*         K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Open_Page; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModePage_C_FindFocus) == 0x000008, "Wrong alignment on WB_TestModePage_C_FindFocus");
static_assert(sizeof(WB_TestModePage_C_FindFocus) == 0x000058, "Wrong size on WB_TestModePage_C_FindFocus");
static_assert(offsetof(WB_TestModePage_C_FindFocus, InputPin) == 0x000000, "Member 'WB_TestModePage_C_FindFocus::InputPin' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, FirstCanSelectItem) == 0x000008, "Member 'WB_TestModePage_C_FindFocus::FirstCanSelectItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, bFindedFocus) == 0x00000C, "Member 'WB_TestModePage_C_FindFocus::bFindedFocus' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_TestModePage_C_FindFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'WB_TestModePage_C_FindFocus::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, Temp_bool_True_if_break_was_hit_Variable) == 0x000015, "Member 'WB_TestModePage_C_FindFocus::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Not_PreBool_ReturnValue) == 0x000016, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, Temp_bool_Has_Been_Initd_Variable) == 0x000017, "Member 'WB_TestModePage_C_FindFocus::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WB_TestModePage_C_FindFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Not_PreBool_ReturnValue1) == 0x000020, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Array_Get_Item1) == 0x000038, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WB_TestModePage_C_FindFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'WB_TestModePage_C_FindFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Open_Page) == 0x000048, "Member 'WB_TestModePage_C_FindFocus::K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Open_Page' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WB_TestModePage_C_FindFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000051, "Member 'WB_TestModePage_C_FindFocus::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_FindFocus, CallFunc_BooleanAND_ReturnValue1) == 0x000052, "Member 'WB_TestModePage_C_FindFocus::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.MoveFocus
// 0x0098 (0x0098 - 0x0000)
struct WB_TestModePage_C_MoveFocus final
{
public:
	bool                                          bIsNext;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item1;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_OnNext_self_CastInput;                    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_OnPrev_self_CastInput;                    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_TestModeInterface_C> CallFunc_IsLock_self_CastInput;                    // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLock_result;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item3;                          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item4;                          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_MoveFocus) == 0x000008, "Wrong alignment on WB_TestModePage_C_MoveFocus");
static_assert(sizeof(WB_TestModePage_C_MoveFocus) == 0x000098, "Wrong size on WB_TestModePage_C_MoveFocus");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, bIsNext) == 0x000000, "Member 'WB_TestModePage_C_MoveFocus::bIsNext' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, NewIndex) == 0x000004, "Member 'WB_TestModePage_C_MoveFocus::NewIndex' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, Temp_int_Variable) == 0x000008, "Member 'WB_TestModePage_C_MoveFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, Temp_int_Variable1) == 0x000018, "Member 'WB_TestModePage_C_MoveFocus::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, Temp_bool_Variable) == 0x00001C, "Member 'WB_TestModePage_C_MoveFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Get_Item1) == 0x000020, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, K2Node_Select_Default) == 0x000028, "Member 'WB_TestModePage_C_MoveFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_OnNext_self_CastInput) == 0x000030, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_OnNext_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_OnPrev_self_CastInput) == 0x000048, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_OnPrev_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Get_Item2) == 0x000058, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_IsLock_self_CastInput) == 0x000060, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_IsLock_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_IsLock_result) == 0x000070, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_IsLock_result' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000071, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000072, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Get_Item3) == 0x000078, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Get_Item4) == 0x000080, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Add_IntInt_ReturnValue1) == 0x00008C, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_MoveFocus, CallFunc_Percent_IntInt_ReturnValue) == 0x000090, "Member 'WB_TestModePage_C_MoveFocus::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateMenuItemButton
// 0x0028 (0x0028 - 0x0000)
struct WB_TestModePage_C_CreateMenuItemButton final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWB_TestModeMenuItemBase_C*             MenuItem;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemBase_C*             CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_CreateMenuItemButton) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateMenuItemButton");
static_assert(sizeof(WB_TestModePage_C_CreateMenuItemButton) == 0x000028, "Wrong size on WB_TestModePage_C_CreateMenuItemButton");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemButton, Label) == 0x000000, "Member 'WB_TestModePage_C_CreateMenuItemButton::Label' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemButton, MenuItem) == 0x000018, "Member 'WB_TestModePage_C_CreateMenuItemButton::MenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemButton, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WB_TestModePage_C_CreateMenuItemButton::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.AddMenuItemWidget
// 0x0038 (0x0038 - 0x0000)
struct WB_TestModePage_C_AddMenuItemWidget final
{
public:
	class UUserWidget*                            AddWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemBase_C*             K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Base;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_AddMenuItemWidget) == 0x000008, "Wrong alignment on WB_TestModePage_C_AddMenuItemWidget");
static_assert(sizeof(WB_TestModePage_C_AddMenuItemWidget) == 0x000038, "Wrong size on WB_TestModePage_C_AddMenuItemWidget");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, AddWidget) == 0x000000, "Member 'WB_TestModePage_C_AddMenuItemWidget::AddWidget' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Base) == 0x000008, "Member 'WB_TestModePage_C_AddMenuItemWidget::K2Node_DynamicCast_AsWB_Test_Mode_Menu_Item_Base' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WB_TestModePage_C_AddMenuItemWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WB_TestModePage_C_AddMenuItemWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WB_TestModePage_C_AddMenuItemWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WB_TestModePage_C_AddMenuItemWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WB_TestModePage_C_AddMenuItemWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_AddMenuItemWidget, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'WB_TestModePage_C_AddMenuItemWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateMenuItemExit
// 0x0030 (0x0030 - 0x0000)
struct WB_TestModePage_C_CreateMenuItemExit final
{
public:
	class UWB_TestModeMenuItemOpenPage_C*         MenuItem;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ExitName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_TestModeMenuItemOpenPage_C*         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)(ConstParm)
};
static_assert(alignof(WB_TestModePage_C_CreateMenuItemExit) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateMenuItemExit");
static_assert(sizeof(WB_TestModePage_C_CreateMenuItemExit) == 0x000030, "Wrong size on WB_TestModePage_C_CreateMenuItemExit");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemExit, MenuItem) == 0x000000, "Member 'WB_TestModePage_C_CreateMenuItemExit::MenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemExit, ExitName) == 0x000008, "Member 'WB_TestModePage_C_CreateMenuItemExit::ExitName' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemExit, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WB_TestModePage_C_CreateMenuItemExit::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateMenuItemExit, Temp_text_Variable) == 0x000018, "Member 'WB_TestModePage_C_CreateMenuItemExit::Temp_text_Variable' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.SetOtherMenuItemsCanSelect
// 0x0030 (0x0030 - 0x0000)
struct WB_TestModePage_C_SetOtherMenuItemsCanSelect final
{
public:
	class UObject*                                BaseMenuItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanSelect;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_TestModeMenuItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModePage_C_SetOtherMenuItemsCanSelect) == 0x000008, "Wrong alignment on WB_TestModePage_C_SetOtherMenuItemsCanSelect");
static_assert(sizeof(WB_TestModePage_C_SetOtherMenuItemsCanSelect) == 0x000030, "Wrong size on WB_TestModePage_C_SetOtherMenuItemsCanSelect");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, BaseMenuItem) == 0x000000, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::BaseMenuItem' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, bCanSelect) == 0x000008, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::bCanSelect' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_SetOtherMenuItemsCanSelect, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000029, "Member 'WB_TestModePage_C_SetOtherMenuItemsCanSelect::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WB_TestModePage.WB_TestModePage_C.CreateReadOnlyLabel
// 0x0040 (0x0040 - 0x0000)
struct WB_TestModePage_C_CreateReadOnlyLabel final
{
public:
	struct FST_TestModeText                       LabelData;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         ValueOffset;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IndentOffset;                                      // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBTestModeReadOnlyValue_C*         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBTestModeReadOnlyValue_C*         CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModePage_C_CreateReadOnlyLabel) == 0x000008, "Wrong alignment on WB_TestModePage_C_CreateReadOnlyLabel");
static_assert(sizeof(WB_TestModePage_C_CreateReadOnlyLabel) == 0x000040, "Wrong size on WB_TestModePage_C_CreateReadOnlyLabel");
static_assert(offsetof(WB_TestModePage_C_CreateReadOnlyLabel, LabelData) == 0x000000, "Member 'WB_TestModePage_C_CreateReadOnlyLabel::LabelData' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateReadOnlyLabel, ValueOffset) == 0x000028, "Member 'WB_TestModePage_C_CreateReadOnlyLabel::ValueOffset' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateReadOnlyLabel, IndentOffset) == 0x00002C, "Member 'WB_TestModePage_C_CreateReadOnlyLabel::IndentOffset' has a wrong offset!");
static_assert(offsetof(WB_TestModePage_C_CreateReadOnlyLabel, ReturnValue) == 0x000030, "Member 'WB_TestModePage_C_CreateReadOnlyLabel::ReturnValue' has a wrong offset!");
