#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TimeLimitCountDown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TimeLimitCountDown.WB_TimeLimitCountDown_C
// 0x0040 (0x0248 - 0x0208)
class UWB_TimeLimitCountDown_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              Img_BG;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_MaterialGauge;                                 // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TimeNumber;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnFinishedLocalTime;                               // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               DMI_Gauge;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TimerNum;                                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousTimerNum;                                  // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFinishedLocalTime__DelegateSignature();
	void ExecuteUbergraph_WB_TimeLimitCountDown(int32 EntryPoint);
	void Construct();
	void SetTextNum(float Value, float MaxValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TimeLimitCountDown_C">();
	}
	static class UWB_TimeLimitCountDown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TimeLimitCountDown_C>();
	}
};
static_assert(alignof(UWB_TimeLimitCountDown_C) == 0x000008, "Wrong alignment on UWB_TimeLimitCountDown_C");
static_assert(sizeof(UWB_TimeLimitCountDown_C) == 0x000248, "Wrong size on UWB_TimeLimitCountDown_C");
static_assert(offsetof(UWB_TimeLimitCountDown_C, UberGraphFrame) == 0x000208, "Member 'UWB_TimeLimitCountDown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, Img_BG) == 0x000210, "Member 'UWB_TimeLimitCountDown_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, Img_MaterialGauge) == 0x000218, "Member 'UWB_TimeLimitCountDown_C::Img_MaterialGauge' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, TimeNumber) == 0x000220, "Member 'UWB_TimeLimitCountDown_C::TimeNumber' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, OnFinishedLocalTime) == 0x000228, "Member 'UWB_TimeLimitCountDown_C::OnFinishedLocalTime' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, DMI_Gauge) == 0x000238, "Member 'UWB_TimeLimitCountDown_C::DMI_Gauge' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, TimerNum) == 0x000240, "Member 'UWB_TimeLimitCountDown_C::TimerNum' has a wrong offset!");
static_assert(offsetof(UWB_TimeLimitCountDown_C, PreviousTimerNum) == 0x000244, "Member 'UWB_TimeLimitCountDown_C::PreviousTimerNum' has a wrong offset!");

}

