#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItem_StatusLockButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WB_TestModeMenuItemBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C
// 0x0068 (0x0360 - 0x02F8)
class UWB_TestModeMenuItem_StatusLockButton_C final : public UWB_TestModeMenuItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_TestModeMenuItem_StatusLockButton_C; // 0x02F8(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             StatusText;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLock;                                           // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckStatusTimer;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnCheckStatusTick;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         StatusOffsetX;                                     // 0x0328(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           StatusTextColor;                                   // 0x032C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlinkStatusTimer;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bStatusBlink;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StatusDarkColor;                                   // 0x034C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnCheckStatusTick__DelegateSignature();
	void ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton(int32 EntryPoint);
	void StatusBlinkAnim();
	void CheckStatusTick();
	void Construct();
	void OnDecide();
	void Unlock();
	void SetStatusText(const class FText& Text);
	void SetStatusColor(const struct FLinearColor& BaseColor, const struct FLinearColor& DarkColor);
	void StartStatusBlink();
	void StopStatusBlink();
	void PreConstruct(bool IsDesignTime);
	void ModifyLabelColor();
	void IsLock(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TestModeMenuItem_StatusLockButton_C">();
	}
	static class UWB_TestModeMenuItem_StatusLockButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TestModeMenuItem_StatusLockButton_C>();
	}
};
static_assert(alignof(UWB_TestModeMenuItem_StatusLockButton_C) == 0x000008, "Wrong alignment on UWB_TestModeMenuItem_StatusLockButton_C");
static_assert(sizeof(UWB_TestModeMenuItem_StatusLockButton_C) == 0x000360, "Wrong size on UWB_TestModeMenuItem_StatusLockButton_C");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, UberGraphFrame_WB_TestModeMenuItem_StatusLockButton_C) == 0x0002F8, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::UberGraphFrame_WB_TestModeMenuItem_StatusLockButton_C' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, StatusText) == 0x000300, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::StatusText' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, bIsLock) == 0x000308, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::bIsLock' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, CheckStatusTimer) == 0x000310, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::CheckStatusTimer' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, OnCheckStatusTick) == 0x000318, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::OnCheckStatusTick' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, StatusOffsetX) == 0x000328, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::StatusOffsetX' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, StatusTextColor) == 0x00032C, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::StatusTextColor' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, BlinkStatusTimer) == 0x000340, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::BlinkStatusTimer' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, bStatusBlink) == 0x000348, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::bStatusBlink' has a wrong offset!");
static_assert(offsetof(UWB_TestModeMenuItem_StatusLockButton_C, StatusDarkColor) == 0x00034C, "Member 'UWB_TestModeMenuItem_StatusLockButton_C::StatusDarkColor' has a wrong offset!");

}

