#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItemInteger

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ExecuteUbergraph_WB_TestModeMenuItemInteger
// 0x0008 (0x0008 - 0x0000)
struct WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger) == 0x000004, "Wrong alignment on WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger) == 0x000008, "Wrong size on WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger, EntryPoint) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger, K2Node_Event_Value) == 0x000004, "Member 'WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger::K2Node_Event_Value' has a wrong offset!");

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.SetSelectValue
// 0x0004 (0x0004 - 0x0000)
struct WB_TestModeMenuItemInteger_C_SetSelectValue final
{
public:
	int32                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_SetSelectValue) == 0x000004, "Wrong alignment on WB_TestModeMenuItemInteger_C_SetSelectValue");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_SetSelectValue) == 0x000004, "Wrong size on WB_TestModeMenuItemInteger_C_SetSelectValue");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_SetSelectValue, Value_0) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_SetSelectValue::Value_0' has a wrong offset!");

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ValueDown
// 0x000C (0x000C - 0x0000)
struct WB_TestModeMenuItemInteger_C_ValueDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValueDown_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_ValueDown) == 0x000004, "Wrong alignment on WB_TestModeMenuItemInteger_C_ValueDown");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_ValueDown) == 0x00000C, "Wrong size on WB_TestModeMenuItemInteger_C_ValueDown");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueDown, ReturnValue) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_ValueDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueDown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_TestModeMenuItemInteger_C_ValueDown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueDown, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WB_TestModeMenuItemInteger_C_ValueDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueDown, CallFunc_ValueDown_ReturnValue) == 0x000009, "Member 'WB_TestModeMenuItemInteger_C_ValueDown::CallFunc_ValueDown_ReturnValue' has a wrong offset!");

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ValueUp
// 0x000C (0x000C - 0x0000)
struct WB_TestModeMenuItemInteger_C_ValueUp final
{
public:
	bool                                          IsMax;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValueUp_IsMax;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_ValueUp) == 0x000004, "Wrong alignment on WB_TestModeMenuItemInteger_C_ValueUp");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_ValueUp) == 0x00000C, "Wrong size on WB_TestModeMenuItemInteger_C_ValueUp");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueUp, IsMax) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_ValueUp::IsMax' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueUp, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'WB_TestModeMenuItemInteger_C_ValueUp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueUp, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_TestModeMenuItemInteger_C_ValueUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_ValueUp, CallFunc_ValueUp_IsMax) == 0x000008, "Member 'WB_TestModeMenuItemInteger_C_ValueUp::CallFunc_ValueUp_IsMax' has a wrong offset!");

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.IsDefaultValue
// 0x0002 (0x0002 - 0x0000)
struct WB_TestModeMenuItemInteger_C_IsDefaultValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_IsDefaultValue) == 0x000001, "Wrong alignment on WB_TestModeMenuItemInteger_C_IsDefaultValue");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_IsDefaultValue) == 0x000002, "Wrong size on WB_TestModeMenuItemInteger_C_IsDefaultValue");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_IsDefaultValue, ReturnValue) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_IsDefaultValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_IsDefaultValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'WB_TestModeMenuItemInteger_C_IsDefaultValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.GetValueText
// 0x0030 (0x0030 - 0x0000)
struct WB_TestModeMenuItemInteger_C_GetValueText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(WB_TestModeMenuItemInteger_C_GetValueText) == 0x000008, "Wrong alignment on WB_TestModeMenuItemInteger_C_GetValueText");
static_assert(sizeof(WB_TestModeMenuItemInteger_C_GetValueText) == 0x000030, "Wrong size on WB_TestModeMenuItemInteger_C_GetValueText");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_GetValueText, OutText) == 0x000000, "Member 'WB_TestModeMenuItemInteger_C_GetValueText::OutText' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItemInteger_C_GetValueText, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WB_TestModeMenuItemInteger_C_GetValueText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

