#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TournamentMode_PlayerSelectButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_TournamentMode_PlayerSelectButton.WB_TournamentMode_PlayerSelectButton_C.ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton
// 0x0010 (0x0010 - 0x0000)
struct WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton) == 0x000008, "Wrong alignment on WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton");
static_assert(sizeof(WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton) == 0x000010, "Wrong size on WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton");
static_assert(offsetof(WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton, EntryPoint) == 0x000000, "Member 'WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000008, "Member 'WB_TournamentMode_PlayerSelectButton_C_ExecuteUbergraph_WB_TournamentMode_PlayerSelectButton::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");

// Function WB_TournamentMode_PlayerSelectButton.WB_TournamentMode_PlayerSelectButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_TournamentMode_PlayerSelectButton_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TournamentMode_PlayerSelectButton_C_GetButton) == 0x000008, "Wrong alignment on WB_TournamentMode_PlayerSelectButton_C_GetButton");
static_assert(sizeof(WB_TournamentMode_PlayerSelectButton_C_GetButton) == 0x000008, "Wrong size on WB_TournamentMode_PlayerSelectButton_C_GetButton");
static_assert(offsetof(WB_TournamentMode_PlayerSelectButton_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_TournamentMode_PlayerSelectButton_C_GetButton::ReturnValue' has a wrong offset!");

}

