#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_UI_FollowPairInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_WidgetSafeZone_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_UI_FollowPairInfo.WB_UI_FollowPairInfo_C
// 0x0120 (0x0368 - 0x0248)
class UWB_UI_FollowPairInfo_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_BottomOutViewArrow;                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_LeftOutViewArrow;                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_RightOutViewArrow;                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_TopOutViewArrow;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                BarAdjustingSpacer;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DownHelpText;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              DyingBar;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Horiz_CountDownText;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              PadIcon;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PairInfo_CameraOnly;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              PBFrame_HP;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_BottomSpacer;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_BottomSpacer2;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_Lv;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_PlayerLevel;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_PlayerName;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_Time;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_PairDownEffect_C*                WB_UI_PairDownEffect;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TargetScreenPosition;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentScreenPosition;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHPPercent;                                  // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentApPercent;                                  // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentCPPercent;                                  // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameBarSizeX;                                     // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CurrentPairName;                                   // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bViewportMode;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_DyingBar;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CacheOrthant;                                      // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FollowPlayerID;                                    // 0x032C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEnableOutViewUI;                                  // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentRootWidgetOpacity;                          // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutViewWidgetOpacity;                              // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceWidgetOpacity;                             // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_WidgetSafeZone                     SafeZoneSize;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	EAJBPadIconType                               PadType;                                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScreenPosHeaderHeightLimit;                        // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHideArrow;                                        // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_HPandAPandCPbar;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_UI_FollowPairInfo(int32 EntryPoint);
	void Update(const struct FTransform& FollowTargetTransform);
	void Open();
	void Close();
	void ShowPlayerNameOnly();
	void Construct();
	void SetPairHPAndAPAndCPAndSP(float HpValue, float ApValue, float CPValue, float MaxCPValue, int32 SpValue);
	void SetupShopCompetitionPairInfo();
	void SetEnabledInvisibleDistance(bool bInvisible);
	void SetPairName(const class FText& InText);
	void UpdateWidgetScale(float NewScale, float MaxMinScale, float OffsetLocation);
	void UpdateDyingBar(float BarValue, float Time);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateArrowVisibility(bool bIsOutViewPosition, const struct FVector2D& ScreenPosition);
	void GetHalfViewportSize();
	void UpdatePairComponentPosition(const struct FVector& PairWorldPosition);
	void ClampScreenPosition(struct FVector2D& Position, struct FVector2D* NewPosition);
	void SetScreenPosHeaderHeightLimit(float Height);

	void GetOrthant(const struct FVector2D& ScreenPosition, int32* Orthant) const;
	struct FVector2D GetDPIScaledDesiredSize() const;
	bool IsInViewPositionFun(const struct FVector2D& ScreenPosition) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_UI_FollowPairInfo_C">();
	}
	static class UWB_UI_FollowPairInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_UI_FollowPairInfo_C>();
	}
};
static_assert(alignof(UWB_UI_FollowPairInfo_C) == 0x000008, "Wrong alignment on UWB_UI_FollowPairInfo_C");
static_assert(sizeof(UWB_UI_FollowPairInfo_C) == 0x000368, "Wrong size on UWB_UI_FollowPairInfo_C");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, UberGraphFrame) == 0x000248, "Member 'UWB_UI_FollowPairInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, AJBImage_BottomOutViewArrow) == 0x000250, "Member 'UWB_UI_FollowPairInfo_C::AJBImage_BottomOutViewArrow' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, AJBImage_LeftOutViewArrow) == 0x000258, "Member 'UWB_UI_FollowPairInfo_C::AJBImage_LeftOutViewArrow' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, AJBImage_RightOutViewArrow) == 0x000260, "Member 'UWB_UI_FollowPairInfo_C::AJBImage_RightOutViewArrow' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, AJBImage_TopOutViewArrow) == 0x000268, "Member 'UWB_UI_FollowPairInfo_C::AJBImage_TopOutViewArrow' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, BarAdjustingSpacer) == 0x000270, "Member 'UWB_UI_FollowPairInfo_C::BarAdjustingSpacer' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Border_DownHelpText) == 0x000278, "Member 'UWB_UI_FollowPairInfo_C::Border_DownHelpText' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, DyingBar) == 0x000280, "Member 'UWB_UI_FollowPairInfo_C::DyingBar' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Horiz_CountDownText) == 0x000288, "Member 'UWB_UI_FollowPairInfo_C::Horiz_CountDownText' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, PadIcon) == 0x000290, "Member 'UWB_UI_FollowPairInfo_C::PadIcon' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, PairInfo_CameraOnly) == 0x000298, "Member 'UWB_UI_FollowPairInfo_C::PairInfo_CameraOnly' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, PBFrame_HP) == 0x0002A0, "Member 'UWB_UI_FollowPairInfo_C::PBFrame_HP' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Spacer_BottomSpacer) == 0x0002A8, "Member 'UWB_UI_FollowPairInfo_C::Spacer_BottomSpacer' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Spacer_BottomSpacer2) == 0x0002B0, "Member 'UWB_UI_FollowPairInfo_C::Spacer_BottomSpacer2' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Txt_Lv) == 0x0002B8, "Member 'UWB_UI_FollowPairInfo_C::Txt_Lv' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Txt_PlayerLevel) == 0x0002C0, "Member 'UWB_UI_FollowPairInfo_C::Txt_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Txt_PlayerName) == 0x0002C8, "Member 'UWB_UI_FollowPairInfo_C::Txt_PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, Txt_Time) == 0x0002D0, "Member 'UWB_UI_FollowPairInfo_C::Txt_Time' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, WB_UI_PairDownEffect) == 0x0002D8, "Member 'UWB_UI_FollowPairInfo_C::WB_UI_PairDownEffect' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, TargetScreenPosition) == 0x0002E0, "Member 'UWB_UI_FollowPairInfo_C::TargetScreenPosition' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentScreenPosition) == 0x0002E8, "Member 'UWB_UI_FollowPairInfo_C::CurrentScreenPosition' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentHPPercent) == 0x0002F0, "Member 'UWB_UI_FollowPairInfo_C::CurrentHPPercent' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentApPercent) == 0x0002F4, "Member 'UWB_UI_FollowPairInfo_C::CurrentApPercent' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentCPPercent) == 0x0002F8, "Member 'UWB_UI_FollowPairInfo_C::CurrentCPPercent' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, FrameBarSizeX) == 0x0002FC, "Member 'UWB_UI_FollowPairInfo_C::FrameBarSizeX' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentPairName) == 0x000300, "Member 'UWB_UI_FollowPairInfo_C::CurrentPairName' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, bViewportMode) == 0x000318, "Member 'UWB_UI_FollowPairInfo_C::bViewportMode' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, DMI_DyingBar) == 0x000320, "Member 'UWB_UI_FollowPairInfo_C::DMI_DyingBar' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CacheOrthant) == 0x000328, "Member 'UWB_UI_FollowPairInfo_C::CacheOrthant' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, FollowPlayerID) == 0x00032C, "Member 'UWB_UI_FollowPairInfo_C::FollowPlayerID' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, bEnableOutViewUI) == 0x000330, "Member 'UWB_UI_FollowPairInfo_C::bEnableOutViewUI' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, CurrentRootWidgetOpacity) == 0x000334, "Member 'UWB_UI_FollowPairInfo_C::CurrentRootWidgetOpacity' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, OutViewWidgetOpacity) == 0x000338, "Member 'UWB_UI_FollowPairInfo_C::OutViewWidgetOpacity' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, DistanceWidgetOpacity) == 0x00033C, "Member 'UWB_UI_FollowPairInfo_C::DistanceWidgetOpacity' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, SafeZoneSize) == 0x000340, "Member 'UWB_UI_FollowPairInfo_C::SafeZoneSize' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, PadType) == 0x000350, "Member 'UWB_UI_FollowPairInfo_C::PadType' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, ScreenPosHeaderHeightLimit) == 0x000354, "Member 'UWB_UI_FollowPairInfo_C::ScreenPosHeaderHeightLimit' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, bHideArrow) == 0x000358, "Member 'UWB_UI_FollowPairInfo_C::bHideArrow' has a wrong offset!");
static_assert(offsetof(UWB_UI_FollowPairInfo_C, DMI_HPandAPandCPbar) == 0x000360, "Member 'UWB_UI_FollowPairInfo_C::DMI_HPandAPandCPbar' has a wrong offset!");

}

