#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenu

#include "../SDK/Basic.hpp"

#include "../SDK/Engine_structs.hpp"
#include "../SDK/InputCore_structs.hpp"
#include "../SDK/UMG_structs.hpp"
#include "../SDK/UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenu.WBP_OptionsMenu_C
// 0x00D0 (0x02D8 - 0x0208)
class UWBP_OptionsMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWBP_BLOnlineStatus_C*                  OnlineStatus;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TLVersionInfo_C*                   VersionInfo;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MultiplayerMenu_C*                 WBP_MultiplayerMenu;                               // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Options_C*                         WBP_Options;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsMenu_C*                    WBP_SettingsMenu;                                  // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         InternalTickRate;                                  // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InternalTimeBetweenTicks;                          // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnInputKeyPressed;                                 // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FKey                                   InputKey;                                          // 0x0258(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TSet<struct FKey>                             InputKeys;                                         // 0x0270(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          bIsOptionsMenuVisible;                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasShowingMouse;                                  // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnToggleMenu;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SwitchToTabIndex(int32 Index_0);
	void SwitchToTab(class UUserWidget* OwnedWidget);
	void CreateGenericErrorPopup(const class FString& InHeader, const class FString& InDescriptor);
	void RemoveInputKey(struct FKey& InKey, bool* bItemFoundAndRemoved);
	void AddInputKey(struct FKey& InKey);
	void InternalTick();
	void ToggleMenu();
	void EventOnToggleMenu(bool bIsOptionsMenuVisible_0);
	void EventOnClickedResume();
	void EventOnClickedSettings();
	void EventOnInputKeyPressed(const struct FKey& PressedKey);
	void Construct();
	void EventOnClickedMultiplayer();
	void EventOnClosedGenericMenu();
	void ExecuteUbergraph_WBP_OptionsMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenu_C">();
	}
	static class UWBP_OptionsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenu_C>();
	}
};
}

