#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CallbackTimer

#include "../SDK/Basic.hpp"


namespace SDK::Params
{

// Function BP_CallbackTimer.BP_CallbackTimer_C.OnBroadcastCallback
// 0x0058 (0x0058 - 0x0000)
struct BP_CallbackTimer_C_OnBroadcastCallback final
{
public:
	uint32                                         pCallbackUpper;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint32                                         pCallbackLower;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};

// Function BP_CallbackTimer.BP_CallbackTimer_C.SetCallbackTimer
// 0x000C (0x000C - 0x0000)
struct BP_CallbackTimer_C_SetCallbackTimer final
{
public:
	float                                         WaitFor;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint32                                         pCallbackUpper;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint32                                         pCallbackLower;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CallbackTimer.BP_CallbackTimer_C.ExecuteUbergraph_BP_CallbackTimer
// 0x0004 (0x0004 - 0x0000)
struct BP_CallbackTimer_C_ExecuteUbergraph_BP_CallbackTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

