#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalPatcher

#include "../SDK/Basic.hpp"


namespace SDK::Params
{

// Function BP_GlobalPatcher.BP_GlobalPatcher_C.SetWidgetText
// 0x0030 (0x0030 - 0x0000)
struct BP_GlobalPatcher_C_SetWidgetText final
{
public:
	class UTextBlock*                             TextToEdit;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewText;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(BP_GlobalPatcher_C_SetWidgetText) == 0x000008, "Wrong alignment on BP_GlobalPatcher_C_SetWidgetText");
static_assert(sizeof(BP_GlobalPatcher_C_SetWidgetText) == 0x000030, "Wrong size on BP_GlobalPatcher_C_SetWidgetText");
static_assert(offsetof(BP_GlobalPatcher_C_SetWidgetText, TextToEdit) == 0x000000, "Member 'BP_GlobalPatcher_C_SetWidgetText::TextToEdit' has a wrong offset!");
static_assert(offsetof(BP_GlobalPatcher_C_SetWidgetText, NewText) == 0x000008, "Member 'BP_GlobalPatcher_C_SetWidgetText::newText' has a wrong offset!");
static_assert(offsetof(BP_GlobalPatcher_C_SetWidgetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_GlobalPatcher_C_SetWidgetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

