#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_AJBTitleScreen

#include "../SDK/Basic.hpp"


namespace SDK::Params
{

// Function GM_AJBTitleScreen.GM_AJBTitleScreen_C.ExecuteUbergraph_GM_AJBTitleScreen
// 0x0020 (0x0020 - 0x0000)
struct GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingKismet*                  CallFunc_LoadLevelInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_AJBTitleScreen_C*                  CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen) == 0x000008, "Wrong alignment on GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen");
static_assert(sizeof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen) == 0x000020, "Wrong size on GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen");
static_assert(offsetof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen, EntryPoint) == 0x000000, "Member 'GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen, CallFunc_LoadLevelInstance_bOutSuccess) == 0x000004, "Member 'GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen, CallFunc_LoadLevelInstance_ReturnValue) == 0x000008, "Member 'GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GM_AJBTitleScreen_C_ExecuteUbergraph_GM_AJBTitleScreen::CallFunc_Create_ReturnValue' has a wrong offset!");

}

