#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenu

#include "../SDK/Basic.hpp"

#include "../SDK/Engine_structs.hpp"
#include "../SDK/InputCore_structs.hpp"
#include "../SDK/UMG_structs.hpp"
#include "../SDK/UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenu.WBP_OptionsMenu_C
// 0x0078 (0x0280 - 0x0208)
class UWBP_OptionsMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Burple_Packround;                                  // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OSS_Offline;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OSS_Online;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                QuitGameButton;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResumeButton;                                      // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ReturnToMainMenuButton;                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SettingsButton;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Start_OR_StopHostingButton;                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPauseMenuIsVisible;                               // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   InputKey;                                          // 0x0258(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         InternalTickRate;                                  // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InternalTickCount;                                 // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeBetweenTicks;                                  // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetOnlineStatus(bool bIsOnline);
	void ToggleVisibility();
	void bVisibilityToESlate(ESlateVisibility* Visibility_0);
	void GetDominatingTickRate(float* NewParam);
	void GetInputKey(struct FKey* InputKey_0);
	void IsMenuVisible(bool* Bool);
	void SetInputKey(const struct FKey& NewKey);
	void InternalTick();
	void BndEvt__SettingsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ResumeButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ReturnToMainMenuButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Start_OR_StopHostingButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_OptionsMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenu_C">();
	}
	static class UWBP_OptionsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenu_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenu_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenu_C");
static_assert(sizeof(UWBP_OptionsMenu_C) == 0x000280, "Wrong size on UWBP_OptionsMenu_C");
static_assert(offsetof(UWBP_OptionsMenu_C, UberGraphFrame) == 0x000208, "Member 'UWBP_OptionsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Burple_Packround) == 0x000210, "Member 'UWBP_OptionsMenu_C::Burple_Packround' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, OSS_Offline) == 0x000218, "Member 'UWBP_OptionsMenu_C::OSS_Offline' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, OSS_Online) == 0x000220, "Member 'UWBP_OptionsMenu_C::OSS_Online' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, QuitGameButton) == 0x000228, "Member 'UWBP_OptionsMenu_C::QuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, ResumeButton) == 0x000230, "Member 'UWBP_OptionsMenu_C::ResumeButton' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, ReturnToMainMenuButton) == 0x000238, "Member 'UWBP_OptionsMenu_C::ReturnToMainMenuButton' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, SettingsButton) == 0x000240, "Member 'UWBP_OptionsMenu_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Start_OR_StopHostingButton) == 0x000248, "Member 'UWBP_OptionsMenu_C::Start_OR_StopHostingButton' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, bPauseMenuIsVisible) == 0x000250, "Member 'UWBP_OptionsMenu_C::bPauseMenuIsVisible' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, InputKey) == 0x000258, "Member 'UWBP_OptionsMenu_C::InputKey' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, InternalTickRate) == 0x000270, "Member 'UWBP_OptionsMenu_C::InternalTickRate' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, InternalTickCount) == 0x000274, "Member 'UWBP_OptionsMenu_C::InternalTickCount' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, TimeBetweenTicks) == 0x000278, "Member 'UWBP_OptionsMenu_C::TimeBetweenTicks' has a wrong offset!");

}

