#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AJBTitleScreen

#include "../SDK/Basic.hpp"

#include "../SDK/Engine_structs.hpp"
#include "../SDK/UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AJBTitleScreen.WBP_AJBTitleScreen_C
// 0x0098 (0x02A0 - 0x0208)
class UWBP_AJBTitleScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 CreditsBG;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DiscordBT;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DiscordIco;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DLLCommitVersion;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GitHubBT;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GitHubIco;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageJJLS_TITLE_P;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageJJLS_TITLEUnused;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InvisibleButtonPressToStart;                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewsBG;                                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlaceholderImage;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SettingsBT;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SettingsIco;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DevelopedBy;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PressToStart;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ScamWarning;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                YouTubeBT;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YouTubeIco;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDLLCommitVersion(class FString& NewVersion);
	void ExecuteUbergraph_WBP_AJBTitleScreen(int32 EntryPoint);
	void BndEvt__YouTubeBT_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__InvisibleButtonPressToStart_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__GitHubBT_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DiscordBT_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AJBTitleScreen_C">();
	}
	static class UWBP_AJBTitleScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AJBTitleScreen_C>();
	}
};
static_assert(alignof(UWBP_AJBTitleScreen_C) == 0x000008, "Wrong alignment on UWBP_AJBTitleScreen_C");
static_assert(sizeof(UWBP_AJBTitleScreen_C) == 0x0002A0, "Wrong size on UWBP_AJBTitleScreen_C");
static_assert(offsetof(UWBP_AJBTitleScreen_C, UberGraphFrame) == 0x000208, "Member 'UWBP_AJBTitleScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, CreditsBG) == 0x000210, "Member 'UWBP_AJBTitleScreen_C::CreditsBG' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, DiscordBT) == 0x000218, "Member 'UWBP_AJBTitleScreen_C::DiscordBT' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, DiscordIco) == 0x000220, "Member 'UWBP_AJBTitleScreen_C::DiscordIco' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, DLLCommitVersion) == 0x000228, "Member 'UWBP_AJBTitleScreen_C::DLLCommitVersion' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, GitHubBT) == 0x000230, "Member 'UWBP_AJBTitleScreen_C::GitHubBT' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, GitHubIco) == 0x000238, "Member 'UWBP_AJBTitleScreen_C::GitHubIco' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, ImageJJLS_TITLE_P) == 0x000240, "Member 'UWBP_AJBTitleScreen_C::ImageJJLS_TITLE_P' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, ImageJJLS_TITLEUnused) == 0x000248, "Member 'UWBP_AJBTitleScreen_C::ImageJJLS_TITLEUnused' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, InvisibleButtonPressToStart) == 0x000250, "Member 'UWBP_AJBTitleScreen_C::InvisibleButtonPressToStart' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, NewsBG) == 0x000258, "Member 'UWBP_AJBTitleScreen_C::NewsBG' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, PlaceholderImage) == 0x000260, "Member 'UWBP_AJBTitleScreen_C::PlaceholderImage' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, SettingsBT) == 0x000268, "Member 'UWBP_AJBTitleScreen_C::SettingsBT' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, SettingsIco) == 0x000270, "Member 'UWBP_AJBTitleScreen_C::SettingsIco' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, TEXT_DevelopedBy) == 0x000278, "Member 'UWBP_AJBTitleScreen_C::TEXT_DevelopedBy' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, TEXT_PressToStart) == 0x000280, "Member 'UWBP_AJBTitleScreen_C::TEXT_PressToStart' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, TEXT_ScamWarning) == 0x000288, "Member 'UWBP_AJBTitleScreen_C::TEXT_ScamWarning' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, YouTubeBT) == 0x000290, "Member 'UWBP_AJBTitleScreen_C::YouTubeBT' has a wrong offset!");
static_assert(offsetof(UWBP_AJBTitleScreen_C, YouTubeIco) == 0x000298, "Member 'UWBP_AJBTitleScreen_C::YouTubeIco' has a wrong offset!");

}

