#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AJB

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "AmwPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "AJB_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function AJB.ActorCluster.CalcCenterLocationOfActors
// 0x000C (0x000C - 0x0000)
struct ActorCluster_CalcCenterLocationOfActors final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorCluster_CalcCenterLocationOfActors) == 0x000004, "Wrong alignment on ActorCluster_CalcCenterLocationOfActors");
static_assert(sizeof(ActorCluster_CalcCenterLocationOfActors) == 0x00000C, "Wrong size on ActorCluster_CalcCenterLocationOfActors");
static_assert(offsetof(ActorCluster_CalcCenterLocationOfActors, ReturnValue) == 0x000000, "Member 'ActorCluster_CalcCenterLocationOfActors::ReturnValue' has a wrong offset!");

// Function AJB.AJBInGameAIController.GetContextActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIController_GetContextActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIController_GetContextActor) == 0x000008, "Wrong alignment on AJBInGameAIController_GetContextActor");
static_assert(sizeof(AJBInGameAIController_GetContextActor) == 0x000008, "Wrong size on AJBInGameAIController_GetContextActor");
static_assert(offsetof(AJBInGameAIController_GetContextActor, ReturnValue) == 0x000000, "Member 'AJBInGameAIController_GetContextActor::ReturnValue' has a wrong offset!");

// Function AJB.ActorClusterHost.ClusterKMeansPPByLocation
// 0x0020 (0x0020 - 0x0000)
struct ActorClusterHost_ClusterKMeansPPByLocation final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         CountOfCluster;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountOfClusteringMax;                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocationXYOnlyArg;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ActorClusterHost_ClusterKMeansPPByLocation) == 0x000008, "Wrong alignment on ActorClusterHost_ClusterKMeansPPByLocation");
static_assert(sizeof(ActorClusterHost_ClusterKMeansPPByLocation) == 0x000020, "Wrong size on ActorClusterHost_ClusterKMeansPPByLocation");
static_assert(offsetof(ActorClusterHost_ClusterKMeansPPByLocation, Actors) == 0x000000, "Member 'ActorClusterHost_ClusterKMeansPPByLocation::Actors' has a wrong offset!");
static_assert(offsetof(ActorClusterHost_ClusterKMeansPPByLocation, CountOfCluster) == 0x000010, "Member 'ActorClusterHost_ClusterKMeansPPByLocation::CountOfCluster' has a wrong offset!");
static_assert(offsetof(ActorClusterHost_ClusterKMeansPPByLocation, CountOfClusteringMax) == 0x000014, "Member 'ActorClusterHost_ClusterKMeansPPByLocation::CountOfClusteringMax' has a wrong offset!");
static_assert(offsetof(ActorClusterHost_ClusterKMeansPPByLocation, bLocationXYOnlyArg) == 0x000018, "Member 'ActorClusterHost_ClusterKMeansPPByLocation::bLocationXYOnlyArg' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestAddNPCFromDebugActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor) == 0x000008, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor, Actor) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor::Actor' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestAddNPCFromDebugArgs
// 0x0040 (0x0040 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AddInfoTags;                                       // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         AILevel;                                           // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs) == 0x000040, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs, Location) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs::Location' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs, Rotation) == 0x00000C, "Member 'AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs::Rotation' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs, AddInfoTags) == 0x000018, "Member 'AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs::AddInfoTags' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs, AILevel) == 0x000038, "Member 'AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs::AILevel' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestByGameplayTags
// 0x0038 (0x0038 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestByGameplayTags final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                VectorIn;                                          // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestByGameplayTags) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestByGameplayTags");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestByGameplayTags) == 0x000038, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestByGameplayTags");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestByGameplayTags, PlayerController) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestByGameplayTags::PlayerController' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestByGameplayTags, Tags) == 0x000008, "Member 'AJBInGameAIDirectorComponent_DebugRequestByGameplayTags::Tags' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestByGameplayTags, VectorIn) == 0x000028, "Member 'AJBInGameAIDirectorComponent_DebugRequestByGameplayTags::VectorIn' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestHideDebugInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo) == 0x000008, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo, PlayerController) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo::PlayerController' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestNPCAllLog
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestNPCAllLog final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NPCId;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestNPCAllLog) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestNPCAllLog");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestNPCAllLog) == 0x000010, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestNPCAllLog");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestNPCAllLog, PlayerController) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestNPCAllLog::PlayerController' has a wrong offset!");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestNPCAllLog, NPCId) == 0x000008, "Member 'AJBInGameAIDirectorComponent_DebugRequestNPCAllLog::NPCId' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestRestartBehavior
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestRestartBehavior final
{
public:
	int32                                         DebugMenuIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestRestartBehavior) == 0x000004, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestRestartBehavior");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestRestartBehavior) == 0x000004, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestRestartBehavior");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestRestartBehavior, DebugMenuIndex) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestRestartBehavior::DebugMenuIndex' has a wrong offset!");

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestShowDebugInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo) == 0x000008, "Wrong alignment on AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo");
static_assert(sizeof(AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo) == 0x000008, "Wrong size on AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo");
static_assert(offsetof(AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo, PlayerController) == 0x000000, "Member 'AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo::PlayerController' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddBurningActor) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddBurningActor");
static_assert(sizeof(AJBAIEnvironmentBlock_AddBurningActor) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddBurningActor");
static_assert(offsetof(AJBAIEnvironmentBlock_AddBurningActor, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddBurningActor::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddDoor
// 0x0010 (0x0010 - 0x0000)
struct AJBAIEnvironmentBlock_AddDoor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNotInHouse;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIEnvironmentBlock_AddDoor) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddDoor");
static_assert(sizeof(AJBAIEnvironmentBlock_AddDoor) == 0x000010, "Wrong size on AJBAIEnvironmentBlock_AddDoor");
static_assert(offsetof(AJBAIEnvironmentBlock_AddDoor, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddDoor::Actor' has a wrong offset!");
static_assert(offsetof(AJBAIEnvironmentBlock_AddDoor, bIsNotInHouse) == 0x000008, "Member 'AJBAIEnvironmentBlock_AddDoor::bIsNotInHouse' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddGate
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddGate final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddGate) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddGate");
static_assert(sizeof(AJBAIEnvironmentBlock_AddGate) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddGate");
static_assert(offsetof(AJBAIEnvironmentBlock_AddGate, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddGate::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddHouseInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddHouseInfo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddHouseInfo) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddHouseInfo");
static_assert(sizeof(AJBAIEnvironmentBlock_AddHouseInfo) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddHouseInfo");
static_assert(offsetof(AJBAIEnvironmentBlock_AddHouseInfo, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddHouseInfo::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddStartPoint
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_AddStartPoint final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddStartPoint) == 0x000004, "Wrong alignment on AJBAIEnvironmentBlock_AddStartPoint");
static_assert(sizeof(AJBAIEnvironmentBlock_AddStartPoint) == 0x00000C, "Wrong size on AJBAIEnvironmentBlock_AddStartPoint");
static_assert(offsetof(AJBAIEnvironmentBlock_AddStartPoint, Location) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddStartPoint::Location' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddTrap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddTrap) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddTrap");
static_assert(sizeof(AJBAIEnvironmentBlock_AddTrap) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddTrap");
static_assert(offsetof(AJBAIEnvironmentBlock_AddTrap, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddTrap::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddWaySpotByActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddWaySpotByActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddWaySpotByActor) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddWaySpotByActor");
static_assert(sizeof(AJBAIEnvironmentBlock_AddWaySpotByActor) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddWaySpotByActor");
static_assert(offsetof(AJBAIEnvironmentBlock_AddWaySpotByActor, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddWaySpotByActor::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddWaySpotByLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_AddWaySpotByLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddWaySpotByLocation) == 0x000004, "Wrong alignment on AJBAIEnvironmentBlock_AddWaySpotByLocation");
static_assert(sizeof(AJBAIEnvironmentBlock_AddWaySpotByLocation) == 0x00000C, "Wrong size on AJBAIEnvironmentBlock_AddWaySpotByLocation");
static_assert(offsetof(AJBAIEnvironmentBlock_AddWaySpotByLocation, Location) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddWaySpotByLocation::Location' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.AddWindow
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddWindow final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_AddWindow) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_AddWindow");
static_assert(sizeof(AJBAIEnvironmentBlock_AddWindow) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_AddWindow");
static_assert(offsetof(AJBAIEnvironmentBlock_AddWindow, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_AddWindow::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.RemoveBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_RemoveBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_RemoveBurningActor) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_RemoveBurningActor");
static_assert(sizeof(AJBAIEnvironmentBlock_RemoveBurningActor) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_RemoveBurningActor");
static_assert(offsetof(AJBAIEnvironmentBlock_RemoveBurningActor, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_RemoveBurningActor::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.RemoveTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_RemoveTrap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_RemoveTrap) == 0x000008, "Wrong alignment on AJBAIEnvironmentBlock_RemoveTrap");
static_assert(sizeof(AJBAIEnvironmentBlock_RemoveTrap) == 0x000008, "Wrong size on AJBAIEnvironmentBlock_RemoveTrap");
static_assert(offsetof(AJBAIEnvironmentBlock_RemoveTrap, Actor) == 0x000000, "Member 'AJBAIEnvironmentBlock_RemoveTrap::Actor' has a wrong offset!");

// Function AJB.AJBAIEnvironmentBlock.GetCenterLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_GetCenterLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIEnvironmentBlock_GetCenterLocation) == 0x000004, "Wrong alignment on AJBAIEnvironmentBlock_GetCenterLocation");
static_assert(sizeof(AJBAIEnvironmentBlock_GetCenterLocation) == 0x00000C, "Wrong size on AJBAIEnvironmentBlock_GetCenterLocation");
static_assert(offsetof(AJBAIEnvironmentBlock_GetCenterLocation, ReturnValue) == 0x000000, "Member 'AJBAIEnvironmentBlock_GetCenterLocation::ReturnValue' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_RequestAddBurningActor) == 0x000008, "Wrong alignment on AJBInGameAIEnvironmentComponent_RequestAddBurningActor");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_RequestAddBurningActor) == 0x000008, "Wrong size on AJBInGameAIEnvironmentComponent_RequestAddBurningActor");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAddBurningActor, Actor) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_RequestAddBurningActor::Actor' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddSpawnedItem
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem final
{
public:
	class AActor*                                 Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem) == 0x000008, "Wrong alignment on AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem) == 0x000008, "Wrong size on AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem, Item) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem::Item' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddTrap final
{
public:
	class AActor*                                 Trap;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_RequestAddTrap) == 0x000008, "Wrong alignment on AJBInGameAIEnvironmentComponent_RequestAddTrap");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_RequestAddTrap) == 0x000008, "Wrong size on AJBInGameAIEnvironmentComponent_RequestAddTrap");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAddTrap, Trap) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_RequestAddTrap::Trap' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAIGion
// 0x0020 (0x0020 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAIGion final
{
public:
	struct FGameplayTag                           GionEffectType;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 GionOwner;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_RequestAIGion) == 0x000008, "Wrong alignment on AJBInGameAIEnvironmentComponent_RequestAIGion");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_RequestAIGion) == 0x000020, "Wrong size on AJBInGameAIEnvironmentComponent_RequestAIGion");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAIGion, GionEffectType) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_RequestAIGion::GionEffectType' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAIGion, GionOwner) == 0x000008, "Member 'AJBInGameAIEnvironmentComponent_RequestAIGion::GionOwner' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_RequestAIGion, Location) == 0x000010, "Member 'AJBInGameAIEnvironmentComponent_RequestAIGion::Location' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.SetupEnvironmentBlocks
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks final
{
public:
	class AActor*                                 NavMeshVolume;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockUnitSizeIn;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks) == 0x000008, "Wrong alignment on AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks) == 0x000010, "Wrong size on AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks, NavMeshVolume) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks::NavMeshVolume' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks, BlockUnitSizeIn) == 0x000008, "Member 'AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks::BlockUnitSizeIn' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.GetBlockIndex
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_GetBlockIndex final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_GetBlockIndex) == 0x000004, "Wrong alignment on AJBInGameAIEnvironmentComponent_GetBlockIndex");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_GetBlockIndex) == 0x000010, "Wrong size on AJBInGameAIEnvironmentComponent_GetBlockIndex");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndex, Location) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndex::Location' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndex, ReturnValue) == 0x00000C, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndex::ReturnValue' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.GetBlockIndexAround
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_GetBlockIndexAround final
{
public:
	int32                                         BlockIndexCenter;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetCountX;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetCountY;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround) == 0x000004, "Wrong alignment on AJBInGameAIEnvironmentComponent_GetBlockIndexAround");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround) == 0x000010, "Wrong size on AJBInGameAIEnvironmentComponent_GetBlockIndexAround");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround, BlockIndexCenter) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndexAround::BlockIndexCenter' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround, OffsetCountX) == 0x000004, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndexAround::OffsetCountX' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround, OffsetCountY) == 0x000008, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndexAround::OffsetCountY' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_GetBlockIndexAround, ReturnValue) == 0x00000C, "Member 'AJBInGameAIEnvironmentComponent_GetBlockIndexAround::ReturnValue' has a wrong offset!");

// Function AJB.AJBInGameAIEnvironmentComponent.IsInNavMeshVolume
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_IsInNavMeshVolume final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBInGameAIEnvironmentComponent_IsInNavMeshVolume) == 0x000004, "Wrong alignment on AJBInGameAIEnvironmentComponent_IsInNavMeshVolume");
static_assert(sizeof(AJBInGameAIEnvironmentComponent_IsInNavMeshVolume) == 0x000010, "Wrong size on AJBInGameAIEnvironmentComponent_IsInNavMeshVolume");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_IsInNavMeshVolume, Location) == 0x000000, "Member 'AJBInGameAIEnvironmentComponent_IsInNavMeshVolume::Location' has a wrong offset!");
static_assert(offsetof(AJBInGameAIEnvironmentComponent_IsInNavMeshVolume, ReturnValue) == 0x00000C, "Member 'AJBInGameAIEnvironmentComponent_IsInNavMeshVolume::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.AabbContainsAabb
// 0x003C (0x003C - 0x0000)
struct AJBAIFunctionLibrary_AabbContainsAabb final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox                                   Other;                                             // 0x001C(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_AabbContainsAabb) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_AabbContainsAabb");
static_assert(sizeof(AJBAIFunctionLibrary_AabbContainsAabb) == 0x00003C, "Wrong size on AJBAIFunctionLibrary_AabbContainsAabb");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsAabb, Box) == 0x000000, "Member 'AJBAIFunctionLibrary_AabbContainsAabb::Box' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsAabb, Other) == 0x00001C, "Member 'AJBAIFunctionLibrary_AabbContainsAabb::Other' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsAabb, ReturnValue) == 0x000038, "Member 'AJBAIFunctionLibrary_AabbContainsAabb::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.AabbContainsPoint
// 0x002C (0x002C - 0x0000)
struct AJBAIFunctionLibrary_AabbContainsPoint final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_AabbContainsPoint) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_AabbContainsPoint");
static_assert(sizeof(AJBAIFunctionLibrary_AabbContainsPoint) == 0x00002C, "Wrong size on AJBAIFunctionLibrary_AabbContainsPoint");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsPoint, Box) == 0x000000, "Member 'AJBAIFunctionLibrary_AabbContainsPoint::Box' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsPoint, Point) == 0x00001C, "Member 'AJBAIFunctionLibrary_AabbContainsPoint::Point' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_AabbContainsPoint, ReturnValue) == 0x000028, "Member 'AJBAIFunctionLibrary_AabbContainsPoint::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.DeprojectScreenPositionToWorldForAI
// 0x0048 (0x0048 - 0x0000)
struct AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI final
{
public:
	float                                         ScreenX;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenY;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewSize;                                          // 0x0024(0x0008)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocation;                                     // 0x002C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldDirection;                                    // 0x0038(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI");
static_assert(sizeof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI) == 0x000048, "Wrong size on AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, ScreenX) == 0x000000, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::ScreenX' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, ScreenY) == 0x000004, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::ScreenY' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, Location) == 0x000008, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::Location' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, Rotation) == 0x000014, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::Rotation' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, FOV) == 0x000020, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::FOV' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, ViewSize) == 0x000024, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::ViewSize' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, WorldLocation) == 0x00002C, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::WorldLocation' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, WorldDirection) == 0x000038, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::WorldDirection' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI, ReturnValue) == 0x000044, "Member 'AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.GetBlackboardKeyName
// 0x0030 (0x0030 - 0x0000)
struct AJBAIFunctionLibrary_GetBlackboardKeyName final
{
public:
	struct FBlackboardKeySelector                 Key;                                               // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIFunctionLibrary_GetBlackboardKeyName) == 0x000008, "Wrong alignment on AJBAIFunctionLibrary_GetBlackboardKeyName");
static_assert(sizeof(AJBAIFunctionLibrary_GetBlackboardKeyName) == 0x000030, "Wrong size on AJBAIFunctionLibrary_GetBlackboardKeyName");
static_assert(offsetof(AJBAIFunctionLibrary_GetBlackboardKeyName, Key) == 0x000000, "Member 'AJBAIFunctionLibrary_GetBlackboardKeyName::Key' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_GetBlackboardKeyName, ReturnValue) == 0x000028, "Member 'AJBAIFunctionLibrary_GetBlackboardKeyName::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.GetClosestPointOnAabb
// 0x0034 (0x0034 - 0x0000)
struct AJBAIFunctionLibrary_GetClosestPointOnAabb final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIFunctionLibrary_GetClosestPointOnAabb) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_GetClosestPointOnAabb");
static_assert(sizeof(AJBAIFunctionLibrary_GetClosestPointOnAabb) == 0x000034, "Wrong size on AJBAIFunctionLibrary_GetClosestPointOnAabb");
static_assert(offsetof(AJBAIFunctionLibrary_GetClosestPointOnAabb, Box) == 0x000000, "Member 'AJBAIFunctionLibrary_GetClosestPointOnAabb::Box' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_GetClosestPointOnAabb, Point) == 0x00001C, "Member 'AJBAIFunctionLibrary_GetClosestPointOnAabb::Point' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_GetClosestPointOnAabb, ReturnValue) == 0x000028, "Member 'AJBAIFunctionLibrary_GetClosestPointOnAabb::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.InvalidLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIFunctionLibrary_InvalidLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAIFunctionLibrary_InvalidLocation) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_InvalidLocation");
static_assert(sizeof(AJBAIFunctionLibrary_InvalidLocation) == 0x00000C, "Wrong size on AJBAIFunctionLibrary_InvalidLocation");
static_assert(offsetof(AJBAIFunctionLibrary_InvalidLocation, ReturnValue) == 0x000000, "Member 'AJBAIFunctionLibrary_InvalidLocation::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.IsFinite
// 0x0008 (0x0008 - 0x0000)
struct AJBAIFunctionLibrary_IsFinite final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_IsFinite) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_IsFinite");
static_assert(sizeof(AJBAIFunctionLibrary_IsFinite) == 0x000008, "Wrong size on AJBAIFunctionLibrary_IsFinite");
static_assert(offsetof(AJBAIFunctionLibrary_IsFinite, Value) == 0x000000, "Member 'AJBAIFunctionLibrary_IsFinite::Value' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_IsFinite, ReturnValue) == 0x000004, "Member 'AJBAIFunctionLibrary_IsFinite::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.IsNaN
// 0x0008 (0x0008 - 0x0000)
struct AJBAIFunctionLibrary_IsNaN final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_IsNaN) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_IsNaN");
static_assert(sizeof(AJBAIFunctionLibrary_IsNaN) == 0x000008, "Wrong size on AJBAIFunctionLibrary_IsNaN");
static_assert(offsetof(AJBAIFunctionLibrary_IsNaN, Value) == 0x000000, "Member 'AJBAIFunctionLibrary_IsNaN::Value' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_IsNaN, ReturnValue) == 0x000004, "Member 'AJBAIFunctionLibrary_IsNaN::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.IsSameParentBTNode
// 0x0018 (0x0018 - 0x0000)
struct AJBAIFunctionLibrary_IsSameParentBTNode final
{
public:
	class UBTDecorator_BlueprintBase*             Decorator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTService_BlueprintBase*               Service;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_IsSameParentBTNode) == 0x000008, "Wrong alignment on AJBAIFunctionLibrary_IsSameParentBTNode");
static_assert(sizeof(AJBAIFunctionLibrary_IsSameParentBTNode) == 0x000018, "Wrong size on AJBAIFunctionLibrary_IsSameParentBTNode");
static_assert(offsetof(AJBAIFunctionLibrary_IsSameParentBTNode, Decorator) == 0x000000, "Member 'AJBAIFunctionLibrary_IsSameParentBTNode::Decorator' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_IsSameParentBTNode, Service) == 0x000008, "Member 'AJBAIFunctionLibrary_IsSameParentBTNode::Service' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_IsSameParentBTNode, ReturnValue) == 0x000010, "Member 'AJBAIFunctionLibrary_IsSameParentBTNode::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.LineAabbIntersection
// 0x0038 (0x0038 - 0x0000)
struct AJBAIFunctionLibrary_LineAabbIntersection final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Start;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_LineAabbIntersection) == 0x000004, "Wrong alignment on AJBAIFunctionLibrary_LineAabbIntersection");
static_assert(sizeof(AJBAIFunctionLibrary_LineAabbIntersection) == 0x000038, "Wrong size on AJBAIFunctionLibrary_LineAabbIntersection");
static_assert(offsetof(AJBAIFunctionLibrary_LineAabbIntersection, Box) == 0x000000, "Member 'AJBAIFunctionLibrary_LineAabbIntersection::Box' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_LineAabbIntersection, Start) == 0x00001C, "Member 'AJBAIFunctionLibrary_LineAabbIntersection::Start' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_LineAabbIntersection, End) == 0x000028, "Member 'AJBAIFunctionLibrary_LineAabbIntersection::End' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_LineAabbIntersection, ReturnValue) == 0x000034, "Member 'AJBAIFunctionLibrary_LineAabbIntersection::ReturnValue' has a wrong offset!");

// Function AJB.AJBAIFunctionLibrary.MakeBoundingBoxFromLocations
// 0x0030 (0x0030 - 0x0000)
struct AJBAIFunctionLibrary_MakeBoundingBoxFromLocations final
{
public:
	TArray<struct FVector>                        Locations;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBox                                   OutBox;                                            // 0x0010(0x001C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AJBAIFunctionLibrary_MakeBoundingBoxFromLocations) == 0x000008, "Wrong alignment on AJBAIFunctionLibrary_MakeBoundingBoxFromLocations");
static_assert(sizeof(AJBAIFunctionLibrary_MakeBoundingBoxFromLocations) == 0x000030, "Wrong size on AJBAIFunctionLibrary_MakeBoundingBoxFromLocations");
static_assert(offsetof(AJBAIFunctionLibrary_MakeBoundingBoxFromLocations, Locations) == 0x000000, "Member 'AJBAIFunctionLibrary_MakeBoundingBoxFromLocations::Locations' has a wrong offset!");
static_assert(offsetof(AJBAIFunctionLibrary_MakeBoundingBoxFromLocations, OutBox) == 0x000010, "Member 'AJBAIFunctionLibrary_MakeBoundingBoxFromLocations::OutBox' has a wrong offset!");

// Function AJB.AJBInGameAIInputProxyComponent.DebugResetOwnerController
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIInputProxyComponent_DebugResetOwnerController final
{
public:
	class AController*                            OwnerControllerIn;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIInputProxyComponent_DebugResetOwnerController) == 0x000008, "Wrong alignment on AJBInGameAIInputProxyComponent_DebugResetOwnerController");
static_assert(sizeof(AJBInGameAIInputProxyComponent_DebugResetOwnerController) == 0x000008, "Wrong size on AJBInGameAIInputProxyComponent_DebugResetOwnerController");
static_assert(offsetof(AJBInGameAIInputProxyComponent_DebugResetOwnerController, OwnerControllerIn) == 0x000000, "Member 'AJBInGameAIInputProxyComponent_DebugResetOwnerController::OwnerControllerIn' has a wrong offset!");

// Function AJB.AJBInGameAIInputProxyComponent.SetMovement
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIInputProxyComponent_SetMovement final
{
public:
	float                                         Forward;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Turn;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUp;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBInGameAIInputProxyComponent_SetMovement) == 0x000004, "Wrong alignment on AJBInGameAIInputProxyComponent_SetMovement");
static_assert(sizeof(AJBInGameAIInputProxyComponent_SetMovement) == 0x000010, "Wrong size on AJBInGameAIInputProxyComponent_SetMovement");
static_assert(offsetof(AJBInGameAIInputProxyComponent_SetMovement, Forward) == 0x000000, "Member 'AJBInGameAIInputProxyComponent_SetMovement::Forward' has a wrong offset!");
static_assert(offsetof(AJBInGameAIInputProxyComponent_SetMovement, Right) == 0x000004, "Member 'AJBInGameAIInputProxyComponent_SetMovement::Right' has a wrong offset!");
static_assert(offsetof(AJBInGameAIInputProxyComponent_SetMovement, Turn) == 0x000008, "Member 'AJBInGameAIInputProxyComponent_SetMovement::Turn' has a wrong offset!");
static_assert(offsetof(AJBInGameAIInputProxyComponent_SetMovement, LookUp) == 0x00000C, "Member 'AJBInGameAIInputProxyComponent_SetMovement::LookUp' has a wrong offset!");

// Function AJB.AJBAMErrorObserverActor.FinishGameServerCheck
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishGameServerCheck final
{
public:
	EAJBTestModeGameServerError                   Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAMErrorObserverActor_FinishGameServerCheck) == 0x000001, "Wrong alignment on AJBAMErrorObserverActor_FinishGameServerCheck");
static_assert(sizeof(AJBAMErrorObserverActor_FinishGameServerCheck) == 0x000001, "Wrong size on AJBAMErrorObserverActor_FinishGameServerCheck");
static_assert(offsetof(AJBAMErrorObserverActor_FinishGameServerCheck, Result) == 0x000000, "Member 'AJBAMErrorObserverActor_FinishGameServerCheck::Result' has a wrong offset!");

// Function AJB.AJBAMErrorObserverActor.FinishUploapErrorLog
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishUploapErrorLog final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAMErrorObserverActor_FinishUploapErrorLog) == 0x000001, "Wrong alignment on AJBAMErrorObserverActor_FinishUploapErrorLog");
static_assert(sizeof(AJBAMErrorObserverActor_FinishUploapErrorLog) == 0x000001, "Wrong size on AJBAMErrorObserverActor_FinishUploapErrorLog");
static_assert(offsetof(AJBAMErrorObserverActor_FinishUploapErrorLog, bSuccess) == 0x000000, "Member 'AJBAMErrorObserverActor_FinishUploapErrorLog::bSuccess' has a wrong offset!");

// Function AJB.AJBAMErrorObserverActor.FinishUploapHeadClerk
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishUploapHeadClerk final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AJBAMErrorObserverActor_FinishUploapHeadClerk) == 0x000001, "Wrong alignment on AJBAMErrorObserverActor_FinishUploapHeadClerk");
static_assert(sizeof(AJBAMErrorObserverActor_FinishUploapHeadClerk) == 0x000001, "Wrong size on AJBAMErrorObserverActor_FinishUploapHeadClerk");
static_assert(offsetof(AJBAMErrorObserverActor_FinishUploapHeadClerk, bSuccess) == 0x000000, "Member 'AJBAMErrorObserverActor_FinishUploapHeadClerk::bSuccess' has a wrong offset!");

