#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AJBInGameStageFunctionLibrary

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetStageName_StartPoint
// 0x00C8 (0x00C8 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LStageId;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasOption_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStageID_StageTypeID;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue1;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint) == 0x0000C8, "Wrong size on AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, LevelName) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::LevelName' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, LStageId) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::LStageId' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GetAJBGameInstance_bSuccess) == 0x000038, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_HasOption_ReturnValue) == 0x000048, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_HasOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_GetStageID_StageTypeID) == 0x00004C, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_GetStageID_StageTypeID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_MakeLiteralString_ReturnValue) == 0x000050, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_IsEditor_ReturnValue) == 0x000060, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Len_ReturnValue) == 0x000064, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Left_ReturnValue) == 0x000070, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_BuildString_Int_ReturnValue) == 0x000098, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Conv_StringToName_ReturnValue1) == 0x0000A8, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Conv_StringToName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_BuildString_Int_ReturnValue1) == 0x0000B0, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_BuildString_Int_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint, CallFunc_Conv_StringToName_ReturnValue2) == 0x0000C0, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_StartPoint::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetStageNameBase
// 0x00C0 (0x00C0 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetStageNameBase final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetStageNameBase) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetStageNameBase");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetStageNameBase) == 0x0000C0, "Wrong size on AJBInGameStageFunctionLibrary_C_GetStageNameBase");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, LevelName) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::LevelName' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_GetAJBGameInstance_bSuccess) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_GetAreaTypeID_ReturnValue) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_GetStageIDByAreaType_StageID) == 0x000024, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, K2Node_MakeArray_Array) == 0x000080, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_Format_ReturnValue) == 0x000090, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageNameBase, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'AJBInGameStageFunctionLibrary_C_GetStageNameBase::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetStageName_Persistent
// 0x0040 (0x0040 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetStageName_Persistent final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetStageNameBase_LevelName;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetStageName_Persistent");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent) == 0x000040, "Wrong size on AJBInGameStageFunctionLibrary_C_GetStageName_Persistent");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, LevelName) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::LevelName' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, CallFunc_GetStageNameBase_LevelName) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::CallFunc_GetStageNameBase_LevelName' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageName_Persistent, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'AJBInGameStageFunctionLibrary_C_GetStageName_Persistent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetStageIDByAreaType
// 0x0060 (0x0060 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType final
{
public:
	int32                                         AreaType;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StageId;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBDamageAreaTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType) == 0x000060, "Wrong size on AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, AreaType) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::AreaType' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, __WorldContext) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, StageId) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::StageId' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'AJBInGameStageFunctionLibrary_C_GetStageIDByAreaType::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetDamegeAreaFileNameBase
// 0x0078 (0x0078 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 File_Name_Base;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBDamageAreaTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase) == 0x000078, "Wrong size on AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, File_Name_Base) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::File_Name_Base' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_GetAJBGameInstance_bSuccess) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_GetAreaTypeID_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'AJBInGameStageFunctionLibrary_C_GetDamegeAreaFileNameBase::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetPreLoadLevelList
// 0x00E8 (0x00E8 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                Pre_Load_Level_Primary_Asset_Id_List;              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBStageAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList) == 0x0000E8, "Wrong size on AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, Pre_Load_Level_Primary_Asset_Id_List) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::Pre_Load_Level_Primary_Asset_Id_List' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetAJBGameInstance_bSuccess) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetAreaTypeID_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetStageIDByAreaType_StageID) == 0x00002C, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'AJBInGameStageFunctionLibrary_C_GetPreLoadLevelList::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetLevelListNeedUnloadDuringOutGame
// 0x00E8 (0x00E8 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                Un_Load_Level_Primary_Asset_Id_List;               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBStageAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame) == 0x0000E8, "Wrong size on AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, Un_Load_Level_Primary_Asset_Id_List) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::Un_Load_Level_Primary_Asset_Id_List' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetAJBGameInstance_bSuccess) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetAreaTypeID_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetStageIDByAreaType_StageID) == 0x00002C, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'AJBInGameStageFunctionLibrary_C_GetLevelListNeedUnloadDuringOutGame::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetStageMapTexture
// 0x0178 (0x0178 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetStageMapTexture final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Map_Texture;                                       // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBStageAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetStageMapTexture");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture) == 0x000178, "Wrong size on AJBInGameStageFunctionLibrary_C_GetStageMapTexture");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, Map_Texture) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::Map_Texture' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetAJBGameInstance_bSuccess) == 0x000030, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000038, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetAreaTypeID_ReturnValue) == 0x000050, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Conv_IntToString_ReturnValue) == 0x000068, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetStageIDByAreaType_StageID) == 0x000078, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Conv_IntToString_ReturnValue1) == 0x000080, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000130, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000138, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Concat_StrStr_ReturnValue1) == 0x000148, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Concat_StrStr_ReturnValue2) == 0x000158, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetStageMapTexture, CallFunc_Concat_StrStr_ReturnValue3) == 0x000168, "Member 'AJBInGameStageFunctionLibrary_C_GetStageMapTexture::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetInGameDefaultBGMGameplayTag
// 0x00E0 (0x00E0 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BGMGameplayTag;                                    // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBStageAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag) == 0x0000E0, "Wrong size on AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, BGMGameplayTag) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::BGMGameplayTag' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetAJBGameInstance_bSuccess) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetAreaTypeID_ReturnValue) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetStageIDByAreaType_StageID) == 0x000024, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameDefaultBGMGameplayTag::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.GetInGameClimaxBGMGameplayTag
// 0x00E0 (0x00E0 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BGMGameplayTag;                                    // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAreaTypeID_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageIDByAreaType_StageID;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBStageAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag) == 0x000008, "Wrong alignment on AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag");
static_assert(sizeof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag) == 0x0000E0, "Wrong size on AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, __WorldContext) == 0x000000, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, BGMGameplayTag) == 0x000008, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::BGMGameplayTag' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetAJBGameInstance_bSuccess) == 0x000010, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000018, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetAreaTypeID_ReturnValue) == 0x000020, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetAreaTypeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetStageIDByAreaType_StageID) == 0x000024, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetStageIDByAreaType_StageID' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'AJBInGameStageFunctionLibrary_C_GetInGameClimaxBGMGameplayTag::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AJBInGameStageFunctionLibrary.AJBInGameStageFunctionLibrary_C.RandomAreaNo
// 0x01D0 (0x01D0 - 0x0000)
struct AJBInGameStageFunctionLibrary_C_RandomAreaNo final
{
public:
	bool                                          bIsTraining;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaNo;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturenAreaNo;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempRate;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomValue;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomMAX;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AreaNoKeys;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TMap<class FName, int32>                      AreaRate;                                          // 0x0038(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	class UDataTable*                             LiteralDamageAreaFileData;                         // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAvailableAllStages_ReturnValue;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
