#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBStartupHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBStartupHUD.BP_AJBStartupHUD_C
// 0x0020 (0x0538 - 0x0518)
class ABP_AJBStartupHUD_C final : public AAJBHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWB_AJBSystemCheck_C*                   SystemCheckUI;                                     // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ErrorWindow_C*                      ErrorWindow;                                       // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBStartupHUD(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ShowErrorWindow(EAJBErrorID ErrorID);
	void HideErrorWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBStartupHUD_C">();
	}
	static class ABP_AJBStartupHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBStartupHUD_C>();
	}
};
static_assert(alignof(ABP_AJBStartupHUD_C) == 0x000008, "Wrong alignment on ABP_AJBStartupHUD_C");
static_assert(sizeof(ABP_AJBStartupHUD_C) == 0x000538, "Wrong size on ABP_AJBStartupHUD_C");
static_assert(offsetof(ABP_AJBStartupHUD_C, UberGraphFrame) == 0x000518, "Member 'ABP_AJBStartupHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBStartupHUD_C, DefaultSceneRoot) == 0x000520, "Member 'ABP_AJBStartupHUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBStartupHUD_C, SystemCheckUI) == 0x000528, "Member 'ABP_AJBStartupHUD_C::SystemCheckUI' has a wrong offset!");
static_assert(offsetof(ABP_AJBStartupHUD_C, ErrorWindow) == 0x000530, "Member 'ABP_AJBStartupHUD_C::ErrorWindow' has a wrong offset!");

}

