#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageAreaFX_Stage02

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DamageAreaFX_Stage02.BP_DamageAreaFX_Stage02_C.ExecuteUbergraph_BP_DamageAreaFX_Stage02
// 0x0008 (0x0008 - 0x0000)
struct BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02) == 0x000004, "Wrong alignment on BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02");
static_assert(sizeof(BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02) == 0x000008, "Wrong size on BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02");
static_assert(offsetof(BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02, EntryPoint) == 0x000000, "Member 'BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000005, "Member 'BP_DamageAreaFX_Stage02_C_ExecuteUbergraph_BP_DamageAreaFX_Stage02::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");

}

