#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageAreaArms

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageAreaArms.BP_DamageAreaArms_C
// 0x0060 (0x0388 - 0x0328)
class ABP_DamageAreaArms_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_ENV_common_DMGAreaArm1;                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Alpha_12656A3B48C84B7720F3D18318183655; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_12656A3B48C84B7720F3D18318183655; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI;                                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         ArmMeshes;                                         // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       DMIs;                                              // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  Animation;                                         // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DamageAreaArms(int32 EntryPoint);
	void AppearDamageAreaFX();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageAreaArms_C">();
	}
	static class ABP_DamageAreaArms_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageAreaArms_C>();
	}
};
static_assert(alignof(ABP_DamageAreaArms_C) == 0x000008, "Wrong alignment on ABP_DamageAreaArms_C");
static_assert(sizeof(ABP_DamageAreaArms_C) == 0x000388, "Wrong size on ABP_DamageAreaArms_C");
static_assert(offsetof(ABP_DamageAreaArms_C, UberGraphFrame) == 0x000328, "Member 'ABP_DamageAreaArms_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, SK_ENV_common_DMGAreaArm1) == 0x000330, "Member 'ABP_DamageAreaArms_C::SK_ENV_common_DMGAreaArm1' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_DamageAreaArms_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, Timeline_0_Alpha_12656A3B48C84B7720F3D18318183655) == 0x000340, "Member 'ABP_DamageAreaArms_C::Timeline_0_Alpha_12656A3B48C84B7720F3D18318183655' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, Timeline_0__Direction_12656A3B48C84B7720F3D18318183655) == 0x000344, "Member 'ABP_DamageAreaArms_C::Timeline_0__Direction_12656A3B48C84B7720F3D18318183655' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, Timeline_0) == 0x000348, "Member 'ABP_DamageAreaArms_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, DMI) == 0x000350, "Member 'ABP_DamageAreaArms_C::DMI' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, ArmMeshes) == 0x000358, "Member 'ABP_DamageAreaArms_C::ArmMeshes' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, DMIs) == 0x000368, "Member 'ABP_DamageAreaArms_C::DMIs' has a wrong offset!");
static_assert(offsetof(ABP_DamageAreaArms_C, Animation) == 0x000378, "Member 'ABP_DamageAreaArms_C::Animation' has a wrong offset!");

}

