#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameFlowStateManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_GameFlowStateManager.BP_GameFlowStateManager_C.ExecuteUbergraph_BP_GameFlowStateManager
// 0x0008 (0x0008 - 0x0000)
struct BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager) == 0x000004, "Wrong alignment on BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager");
static_assert(sizeof(BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager) == 0x000008, "Wrong size on BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager");
static_assert(offsetof(BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager, EntryPoint) == 0x000000, "Member 'BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_GameFlowStateManager_C_ExecuteUbergraph_BP_GameFlowStateManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_GameFlowStateManager.BP_GameFlowStateManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GameFlowStateManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameFlowStateManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GameFlowStateManager_C_ReceiveTick");
static_assert(sizeof(BP_GameFlowStateManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_GameFlowStateManager_C_ReceiveTick");
static_assert(offsetof(BP_GameFlowStateManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GameFlowStateManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GameFlowStateManager.BP_GameFlowStateManager_C.FindStateObject
// 0x0018 (0x0018 - 0x0000)
struct BP_GameFlowStateManager_C_FindStateObject final
{
public:
	struct FGameplayTag                           FindStateTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindFlowState_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameFlowStateManager_C_FindStateObject) == 0x000008, "Wrong alignment on BP_GameFlowStateManager_C_FindStateObject");
static_assert(sizeof(BP_GameFlowStateManager_C_FindStateObject) == 0x000018, "Wrong size on BP_GameFlowStateManager_C_FindStateObject");
static_assert(offsetof(BP_GameFlowStateManager_C_FindStateObject, FindStateTag) == 0x000000, "Member 'BP_GameFlowStateManager_C_FindStateObject::FindStateTag' has a wrong offset!");
static_assert(offsetof(BP_GameFlowStateManager_C_FindStateObject, ReturnValue) == 0x000008, "Member 'BP_GameFlowStateManager_C_FindStateObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameFlowStateManager_C_FindStateObject, CallFunc_FindFlowState_ReturnValue) == 0x000010, "Member 'BP_GameFlowStateManager_C_FindStateObject::CallFunc_FindFlowState_ReturnValue' has a wrong offset!");

// Function BP_GameFlowStateManager.BP_GameFlowStateManager_C.ChangeState
// 0x0010 (0x0010 - 0x0000)
struct BP_GameFlowStateManager_C_ChangeState final
{
public:
	struct FGameplayTag                           NextStateTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeState_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameFlowStateManager_C_ChangeState) == 0x000008, "Wrong alignment on BP_GameFlowStateManager_C_ChangeState");
static_assert(sizeof(BP_GameFlowStateManager_C_ChangeState) == 0x000010, "Wrong size on BP_GameFlowStateManager_C_ChangeState");
static_assert(offsetof(BP_GameFlowStateManager_C_ChangeState, NextStateTag) == 0x000000, "Member 'BP_GameFlowStateManager_C_ChangeState::NextStateTag' has a wrong offset!");
static_assert(offsetof(BP_GameFlowStateManager_C_ChangeState, ReturnValue) == 0x000008, "Member 'BP_GameFlowStateManager_C_ChangeState::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameFlowStateManager_C_ChangeState, CallFunc_ChangeState_ReturnValue) == 0x000009, "Member 'BP_GameFlowStateManager_C_ChangeState::CallFunc_ChangeState_ReturnValue' has a wrong offset!");

// Function BP_GameFlowStateManager.BP_GameFlowStateManager_C.GetCurrentFlowState
// 0x0008 (0x0008 - 0x0000)
struct BP_GameFlowStateManager_C_GetCurrentFlowState final
{
public:
	struct FGameplayTag                           CurrentFlowState;                                  // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameFlowStateManager_C_GetCurrentFlowState) == 0x000008, "Wrong alignment on BP_GameFlowStateManager_C_GetCurrentFlowState");
static_assert(sizeof(BP_GameFlowStateManager_C_GetCurrentFlowState) == 0x000008, "Wrong size on BP_GameFlowStateManager_C_GetCurrentFlowState");
static_assert(offsetof(BP_GameFlowStateManager_C_GetCurrentFlowState, CurrentFlowState) == 0x000000, "Member 'BP_GameFlowStateManager_C_GetCurrentFlowState::CurrentFlowState' has a wrong offset!");

}

