#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerIconManager

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerIconManager.BP_PlayerIconManager_C.TryGetPlayerIcon
// 0x00F8 (0x00F8 - 0x0000)
struct BP_PlayerIconManager_C_TryGetPlayerIcon final
{
public:
	int32                                         IconIndex;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerIconPath_Path;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadTexture2DFromDisk_bOutValid;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LoadTexture2DFromDisk_OutWidth;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoadTexture2DFromDisk_OutHeight;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_LoadTexture2DFromDisk_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerIconManager_C_TryGetPlayerIcon) == 0x000008, "Wrong alignment on BP_PlayerIconManager_C_TryGetPlayerIcon");
static_assert(sizeof(BP_PlayerIconManager_C_TryGetPlayerIcon) == 0x0000F8, "Wrong size on BP_PlayerIconManager_C_TryGetPlayerIcon");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, IconIndex) == 0x000000, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::IconIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, ReturnValue) == 0x000008, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_GetPlayerIconPath_Path) == 0x000010, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_GetPlayerIconPath_Path' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Map_Find_Value) == 0x000088, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C0, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_LoadTexture2DFromDisk_bOutValid) == 0x0000D0, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_LoadTexture2DFromDisk_bOutValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_LoadTexture2DFromDisk_OutWidth) == 0x0000D4, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_LoadTexture2DFromDisk_OutWidth' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_LoadTexture2DFromDisk_OutHeight) == 0x0000D8, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_LoadTexture2DFromDisk_OutHeight' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_LoadTexture2DFromDisk_ReturnValue) == 0x0000E0, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_LoadTexture2DFromDisk_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_TryGetPlayerIcon, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000E8, "Member 'BP_PlayerIconManager_C_TryGetPlayerIcon::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BP_PlayerIconManager.BP_PlayerIconManager_C.GetPlayerIconPath
// 0x00C8 (0x00C8 - 0x0000)
struct BP_PlayerIconManager_C_GetPlayerIconPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LResult;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerIconDevelopPath_ReturnValue;     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerIconCabinetPath_ReturnValue;     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerIconEditorPath_ReturnValue;      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerIconDistributionPath_ReturnValue; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDistribution_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProjectDirectory_ReturnValue;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnablePlayerIconRelativePath_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerIconManager_C_GetPlayerIconPath) == 0x000008, "Wrong alignment on BP_PlayerIconManager_C_GetPlayerIconPath");
static_assert(sizeof(BP_PlayerIconManager_C_GetPlayerIconPath) == 0x0000C8, "Wrong size on BP_PlayerIconManager_C_GetPlayerIconPath");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, Path) == 0x000000, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::Path' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, LResult) == 0x000010, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::LResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_GetPlayerIconDevelopPath_ReturnValue) == 0x000020, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_GetPlayerIconDevelopPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_GetPlayerIconCabinetPath_ReturnValue) == 0x000030, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_GetPlayerIconCabinetPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_GetPlayerIconEditorPath_ReturnValue) == 0x000040, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_GetPlayerIconEditorPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_Concat_StrStr_ReturnValue1) == 0x000060, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_Concat_StrStr_ReturnValue2) == 0x000070, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_GetPlayerIconDistributionPath_ReturnValue) == 0x000080, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_GetPlayerIconDistributionPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_IsDistribution_ReturnValue) == 0x000090, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_IsDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_Concat_StrStr_ReturnValue3) == 0x000098, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_IsEditor_ReturnValue) == 0x0000A8, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_GetProjectDirectory_ReturnValue) == 0x0000B0, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_GetProjectDirectory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerIconManager_C_GetPlayerIconPath, CallFunc_IsEnablePlayerIconRelativePath_ReturnValue) == 0x0000C0, "Member 'BP_PlayerIconManager_C_GetPlayerIconPath::CallFunc_IsEnablePlayerIconRelativePath_ReturnValue' has a wrong offset!");

}

