#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QRCodeLib

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class QRCodeLib.CreateQRCode
// 0x0050 (0x0080 - 0x0030)
class UCreateQRCode final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   Success;                                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   Failed;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCreateQRCode* CreateQRCodeTexture(class UObject* WorldContextObject, const struct FQREncodeInfo& EncodeInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreateQRCode">();
	}
	static class UCreateQRCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateQRCode>();
	}
};
static_assert(alignof(UCreateQRCode) == 0x000008, "Wrong alignment on UCreateQRCode");
static_assert(sizeof(UCreateQRCode) == 0x000080, "Wrong size on UCreateQRCode");
static_assert(offsetof(UCreateQRCode, Success) == 0x000030, "Member 'UCreateQRCode::Success' has a wrong offset!");
static_assert(offsetof(UCreateQRCode, Failed) == 0x000040, "Member 'UCreateQRCode::Failed' has a wrong offset!");

// Class QRCodeLib.QRCodeDefine
// 0x0000 (0x0028 - 0x0028)
class UQRCodeDefine final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QRCodeDefine">();
	}
	static class UQRCodeDefine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQRCodeDefine>();
	}
};
static_assert(alignof(UQRCodeDefine) == 0x000008, "Wrong alignment on UQRCodeDefine");
static_assert(sizeof(UQRCodeDefine) == 0x000028, "Wrong size on UQRCodeDefine");

}

