#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBSystemCheckItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_AJBSystemCheckItem.WB_AJBSystemCheckItem_C.ExecuteUbergraph_WB_AJBSystemCheckItem
// 0x0270 (0x0270 - 0x0000)
struct WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x006C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOK1;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable5;                             // 0x0080(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x00C0(0x0018)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00D8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x00F8(0x0028)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0120(0x0008)(NoDestructor)
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x0128(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0138(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x0160(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SerialNumber;                   // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOK;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01A8(0x0018)()
	struct FLinearColor                           K2Node_Select2_Default;                            // 0x01C0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select3_Default;                            // 0x01D0(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor4;                     // 0x01E8(0x0028)()
	class FText                                   Temp_text_Variable2;                               // 0x0210(0x0018)()
	bool                                          Temp_bool_Variable4;                               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor5;                     // 0x0230(0x0028)()
	class FText                                   K2Node_Select4_Default;                            // 0x0258(0x0018)()
};
static_assert(alignof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem) == 0x000008, "Wrong alignment on WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem");
static_assert(sizeof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem) == 0x000270, "Wrong size on WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, EntryPoint) == 0x000000, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable) == 0x000004, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_bool_Variable) == 0x000014, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable1) == 0x000018, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable2) == 0x000028, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_bool_Variable1) == 0x000038, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_text_Variable) == 0x000040, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_bool_Variable2) == 0x000058, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable3) == 0x00005C, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable4) == 0x00006C, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_CustomEvent_bIsOK1) == 0x00007C, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_CustomEvent_bIsOK1' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_struct_Variable5) == 0x000080, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_bool_Variable3) == 0x0000B9, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_text_Variable1) == 0x0000C0, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Select_Default) == 0x0000D8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor1) == 0x0000F8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000120, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Select1_Default) == 0x000128, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor2) == 0x000138, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor3) == 0x000160, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Event_IsDesignTime) == 0x000188, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_CustomEvent_SerialNumber) == 0x000190, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_CustomEvent_SerialNumber' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_CustomEvent_bIsOK) == 0x0001A0, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_CustomEvent_bIsOK' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0001A8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Select2_Default) == 0x0001C0, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Select3_Default) == 0x0001D0, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor4) == 0x0001E8, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor4' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_text_Variable2) == 0x000210, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, Temp_bool_Variable4) == 0x000228, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_MakeStruct_SlateColor5) == 0x000230, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_MakeStruct_SlateColor5' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem, K2Node_Select4_Default) == 0x000258, "Member 'WB_AJBSystemCheckItem_C_ExecuteUbergraph_WB_AJBSystemCheckItem::K2Node_Select4_Default' has a wrong offset!");

// Function WB_AJBSystemCheckItem.WB_AJBSystemCheckItem_C.SetSerialNumber
// 0x0018 (0x0018 - 0x0000)
struct WB_AJBSystemCheckItem_C_SetSerialNumber final
{
public:
	class FString                                 SerialNumber;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsOK;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBSystemCheckItem_C_SetSerialNumber) == 0x000008, "Wrong alignment on WB_AJBSystemCheckItem_C_SetSerialNumber");
static_assert(sizeof(WB_AJBSystemCheckItem_C_SetSerialNumber) == 0x000018, "Wrong size on WB_AJBSystemCheckItem_C_SetSerialNumber");
static_assert(offsetof(WB_AJBSystemCheckItem_C_SetSerialNumber, SerialNumber) == 0x000000, "Member 'WB_AJBSystemCheckItem_C_SetSerialNumber::SerialNumber' has a wrong offset!");
static_assert(offsetof(WB_AJBSystemCheckItem_C_SetSerialNumber, bIsOK) == 0x000010, "Member 'WB_AJBSystemCheckItem_C_SetSerialNumber::bIsOK' has a wrong offset!");

// Function WB_AJBSystemCheckItem.WB_AJBSystemCheckItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_AJBSystemCheckItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBSystemCheckItem_C_PreConstruct) == 0x000001, "Wrong alignment on WB_AJBSystemCheckItem_C_PreConstruct");
static_assert(sizeof(WB_AJBSystemCheckItem_C_PreConstruct) == 0x000001, "Wrong size on WB_AJBSystemCheckItem_C_PreConstruct");
static_assert(offsetof(WB_AJBSystemCheckItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_AJBSystemCheckItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_AJBSystemCheckItem.WB_AJBSystemCheckItem_C.FinishCheck
// 0x0001 (0x0001 - 0x0000)
struct WB_AJBSystemCheckItem_C_FinishCheck final
{
public:
	bool                                          bIsOK;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBSystemCheckItem_C_FinishCheck) == 0x000001, "Wrong alignment on WB_AJBSystemCheckItem_C_FinishCheck");
static_assert(sizeof(WB_AJBSystemCheckItem_C_FinishCheck) == 0x000001, "Wrong size on WB_AJBSystemCheckItem_C_FinishCheck");
static_assert(offsetof(WB_AJBSystemCheckItem_C_FinishCheck, bIsOK) == 0x000000, "Member 'WB_AJBSystemCheckItem_C_FinishCheck::bIsOK' has a wrong offset!");

}

