#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBNOTICE

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_AJBNOTICE.WB_AJBNOTICE_C.ExecuteUbergraph_WB_AJBNOTICE
// 0x0098 (0x0098 - 0x0000)
struct WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateObj*                              CallFunc_FindStateFromPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStateFromPlayerController_FindResult; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState;                      // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeStateFromPlayerController_ReturnValue; // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NextState;                      // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE) == 0x000008, "Wrong alignment on WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE");
static_assert(sizeof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE) == 0x000098, "Wrong size on WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, EntryPoint) == 0x000000, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_FindStateFromPlayerController_ReturnValue) == 0x000008, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_FindStateFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_FindStateFromPlayerController_FindResult) == 0x000010, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_FindStateFromPlayerController_FindResult' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_CustomEvent_PrevState) == 0x000018, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_CustomEvent_PrevState' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_Event_MyGeometry) == 0x000030, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_ChangeStateFromPlayerController_ReturnValue) == 0x00006C, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_ChangeStateFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_FMin_ReturnValue) == 0x000078, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00007C, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_CustomEvent_NextState) == 0x000080, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_CustomEvent_NextState' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE, K2Node_CreateDelegate_OutputDelegate1) == 0x000088, "Member 'WB_AJBNOTICE_C_ExecuteUbergraph_WB_AJBNOTICE::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function WB_AJBNOTICE.WB_AJBNOTICE_C.OnEnd_NOTICE
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBNOTICE_C_OnEnd_NOTICE final
{
public:
	struct FGameplayTag                           NextState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBNOTICE_C_OnEnd_NOTICE) == 0x000008, "Wrong alignment on WB_AJBNOTICE_C_OnEnd_NOTICE");
static_assert(sizeof(WB_AJBNOTICE_C_OnEnd_NOTICE) == 0x000008, "Wrong size on WB_AJBNOTICE_C_OnEnd_NOTICE");
static_assert(offsetof(WB_AJBNOTICE_C_OnEnd_NOTICE, NextState) == 0x000000, "Member 'WB_AJBNOTICE_C_OnEnd_NOTICE::NextState' has a wrong offset!");

// Function WB_AJBNOTICE.WB_AJBNOTICE_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_AJBNOTICE_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBNOTICE_C_Tick) == 0x000004, "Wrong alignment on WB_AJBNOTICE_C_Tick");
static_assert(sizeof(WB_AJBNOTICE_C_Tick) == 0x00003C, "Wrong size on WB_AJBNOTICE_C_Tick");
static_assert(offsetof(WB_AJBNOTICE_C_Tick, MyGeometry) == 0x000000, "Member 'WB_AJBNOTICE_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_AJBNOTICE_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_AJBNOTICE_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_AJBNOTICE.WB_AJBNOTICE_C.OnBegin_NOTICE
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBNOTICE_C_OnBegin_NOTICE final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_AJBNOTICE_C_OnBegin_NOTICE) == 0x000008, "Wrong alignment on WB_AJBNOTICE_C_OnBegin_NOTICE");
static_assert(sizeof(WB_AJBNOTICE_C_OnBegin_NOTICE) == 0x000008, "Wrong size on WB_AJBNOTICE_C_OnBegin_NOTICE");
static_assert(offsetof(WB_AJBNOTICE_C_OnBegin_NOTICE, PrevState) == 0x000000, "Member 'WB_AJBNOTICE_C_OnBegin_NOTICE::PrevState' has a wrong offset!");

// Function WB_AJBNOTICE.WB_AJBNOTICE_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_AJBNOTICE_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_AJBNOTICE_C_PreConstruct) == 0x000001, "Wrong alignment on WB_AJBNOTICE_C_PreConstruct");
static_assert(sizeof(WB_AJBNOTICE_C_PreConstruct) == 0x000001, "Wrong size on WB_AJBNOTICE_C_PreConstruct");
static_assert(offsetof(WB_AJBNOTICE_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_AJBNOTICE_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

