#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_RST

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_RST.ABP_AJBInGameCharacter_RST_C
// 0x05B8 (0x0910 - 0x0358)
class UABP_AJBInGameCharacter_RST_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_5337AB7C4504DC8458C00E96EA4C7343; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_5337AB7C4504DC8458C00E96EA4C7343; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_5337AB7C4504DC8458C00E96EA4C7343; // 0x0378(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_405F7477464A98FCA1F122961370DC76; // 0x0440(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3F5EC3DE47BA25B7B50C0A98762FA0F7; // 0x0488(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A53E87D24CB66EBC182ECF9B0A561210; // 0x04F8(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_CE946DB14625BFC28EC511ADE8B82AFA; // 0x05D8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8E64FB3E4A16E96D0379AE8DF9761868; // 0x06B8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4ED10F7244DB48D3A82A91BE7500AF19; // 0x0708(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_DDF3A317462AC429A0AAAF80735F4D35; // 0x0758(0x00C8)()
	float                                         __SUBINSTANCE_LoopSkillAnimationRecoveryTime01_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __SUBINSTANCE_SkippableStartAnimationRemainingTime01_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __SUBINSTANCE_BS_SkillLoopAnimationLoop01_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_SkillLoopAnimationStart01_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __SUBINSTANCE_Base_R2_SkillAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnabledBase_R2_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __SUBINSTANCE_Ultimate_L1_SkillLoopAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnabledUltimate_L1_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845[0x3];                                      // 0x0845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_796D8A764E1F8C379FCF8DBB0D3A5B26; // 0x0848(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_RST(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameCharacter_RST_C">();
	}
	static class UABP_AJBInGameCharacter_RST_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_RST_C>();
	}
};
static_assert(alignof(UABP_AJBInGameCharacter_RST_C) == 0x000008, "Wrong alignment on UABP_AJBInGameCharacter_RST_C");
static_assert(sizeof(UABP_AJBInGameCharacter_RST_C) == 0x000910, "Wrong size on UABP_AJBInGameCharacter_RST_C");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameCharacter_RST_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_AS_DeathLoop_5337AB7C4504DC8458C00E96EA4C7343) == 0x000368, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_AS_DeathLoop_5337AB7C4504DC8458C00E96EA4C7343' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_AS_Idle_5337AB7C4504DC8458C00E96EA4C7343) == 0x000370, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_AS_Idle_5337AB7C4504DC8458C00E96EA4C7343' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_SubInstance_5337AB7C4504DC8458C00E96EA4C7343) == 0x000378, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_SubInstance_5337AB7C4504DC8458C00E96EA4C7343' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_Root_405F7477464A98FCA1F122961370DC76) == 0x000440, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_Root_405F7477464A98FCA1F122961370DC76' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_Slot_3F5EC3DE47BA25B7B50C0A98762FA0F7) == 0x000488, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_Slot_3F5EC3DE47BA25B7B50C0A98762FA0F7' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_LayeredBoneBlend_A53E87D24CB66EBC182ECF9B0A561210) == 0x0004F8, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_LayeredBoneBlend_A53E87D24CB66EBC182ECF9B0A561210' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_SaveCachedPose_CE946DB14625BFC28EC511ADE8B82AFA) == 0x0005D8, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_SaveCachedPose_CE946DB14625BFC28EC511ADE8B82AFA' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_UseCachedPose_8E64FB3E4A16E96D0379AE8DF9761868) == 0x0006B8, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_UseCachedPose_8E64FB3E4A16E96D0379AE8DF9761868' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_UseCachedPose_4ED10F7244DB48D3A82A91BE7500AF19) == 0x000708, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_UseCachedPose_4ED10F7244DB48D3A82A91BE7500AF19' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_SubInstance_DDF3A317462AC429A0AAAF80735F4D35) == 0x000758, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_SubInstance_DDF3A317462AC429A0AAAF80735F4D35' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_LoopSkillAnimationRecoveryTime01_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000820, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_LoopSkillAnimationRecoveryTime01_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_SkippableStartAnimationRemainingTime01_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000824, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_SkippableStartAnimationRemainingTime01_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_BS_SkillLoopAnimationLoop01_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000828, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_BS_SkillLoopAnimationLoop01_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_AS_SkillLoopAnimationStart01_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000830, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_AS_SkillLoopAnimationStart01_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_Base_R2_SkillAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000838, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_Base_R2_SkillAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_IsEnabledBase_R2_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x00083C, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_IsEnabledBase_R2_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_Ultimate_L1_SkillLoopAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000840, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_Ultimate_L1_SkillLoopAnimationIndex_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, __SUBINSTANCE_IsEnabledUltimate_L1_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000844, "Member 'UABP_AJBInGameCharacter_RST_C::__SUBINSTANCE_IsEnabledUltimate_L1_SkillLoopAnimation_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_RST_C, AnimGraphNode_SubInstance_796D8A764E1F8C379FCF8DBB0D3A5B26) == 0x000848, "Member 'UABP_AJBInGameCharacter_RST_C::AnimGraphNode_SubInstance_796D8A764E1F8C379FCF8DBB0D3A5B26' has a wrong offset!");

}

