#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_PPH

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_AJBInGameStand_PPH.ABP_AJBInGameStand_PPH_C.ExecuteUbergraph_ABP_AJBInGameStand_PPH
// 0x0148 (0x0148 - 0x0000)
struct ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item1;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue2;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue3;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue4;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue5;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item2;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue6;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item3;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue7;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue8;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue9;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue10;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue11;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item4;                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue12;           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item5;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue13;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue14;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue15;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue16;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue17;           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_PPH_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue6;                  // 0x0120(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOwnerMove_bCanMove;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH) == 0x000008, "Wrong alignment on ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH");
static_assert(sizeof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH) == 0x000148, "Wrong size on ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, EntryPoint) == 0x000000, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item) == 0x000010, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000014, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item1) == 0x000018, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue1) == 0x00001C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue2) == 0x000020, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue3) == 0x000024, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue4) == 0x000028, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue5) == 0x00002C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue1) == 0x00003C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item2) == 0x000048, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue6) == 0x00004C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item3) == 0x000050, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue7) == 0x000054, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue8) == 0x000058, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue9) == 0x00005C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue10) == 0x000060, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue11) == 0x000064, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue11' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue2) == 0x000068, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue3) == 0x000074, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item4) == 0x000080, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue12) == 0x000084, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue12' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Get_Item5) == 0x000088, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue13) == 0x00008C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue13' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue14) == 0x000090, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue14' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue15) == 0x000094, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue15' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue16) == 0x000098, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue16' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Conv_BoolToFloat_ReturnValue17) == 0x00009C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Conv_BoolToFloat_ReturnValue17' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue4) == 0x0000A0, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue5) == 0x0000AC, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, K2Node_Event_DeltaTimeX) == 0x0000B8, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_GetOwningActor_ReturnValue) == 0x0000C0, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_GetOwner_ReturnValue) == 0x0000D0, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000D8, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_IsValid_ReturnValue1) == 0x0000E1, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_GetMaxSpeed_ReturnValue) == 0x0000E4, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E8, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH) == 0x0000F0, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, K2Node_DynamicCast_bSuccess1) == 0x0000F8, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F9, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_GetVelocity_ReturnValue) == 0x000104, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Not_PreBool_ReturnValue) == 0x000110, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_BreakVector_X) == 0x000114, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_BreakVector_Y) == 0x000118, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_BreakVector_Z) == 0x00011C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_MakeVector_ReturnValue6) == 0x000120, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_MakeVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_IsValid_ReturnValue2) == 0x00012C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_VSize_ReturnValue) == 0x000130, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000134, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Not_PreBool_ReturnValue1) == 0x000138, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_CanOwnerMove_bCanMove) == 0x000139, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_CanOwnerMove_bCanMove' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Array_Length_ReturnValue) == 0x00013C, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'ABP_AJBInGameStand_PPH_C_ExecuteUbergraph_ABP_AJBInGameStand_PPH::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ABP_AJBInGameStand_PPH.ABP_AJBInGameStand_PPH_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AJBInGameStand_PPH_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AJBInGameStand_PPH.ABP_AJBInGameStand_PPH_C.CanOwnerMove
// 0x0002 (0x0002 - 0x0000)
struct ABP_AJBInGameStand_PPH_C_CanOwnerMove final
{
public:
	bool                                          bCanMove;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_AJBInGameStand_PPH_C_CanOwnerMove) == 0x000001, "Wrong alignment on ABP_AJBInGameStand_PPH_C_CanOwnerMove");
static_assert(sizeof(ABP_AJBInGameStand_PPH_C_CanOwnerMove) == 0x000002, "Wrong size on ABP_AJBInGameStand_PPH_C_CanOwnerMove");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_CanOwnerMove, bCanMove) == 0x000000, "Member 'ABP_AJBInGameStand_PPH_C_CanOwnerMove::bCanMove' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameStand_PPH_C_CanOwnerMove, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'ABP_AJBInGameStand_PPH_C_CanOwnerMove::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

