#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_DVL

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_DVL.ABP_AJBPostProcessHuman_RBControlled_DVL_C
// 0x06F8 (0x0A50 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_DVL_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_497CB86D46163AB817488C8BD05B2A9B; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3CCC50954D9A228E6521C3833B811DB9; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4ABC2AF24C5E476577D6B6B6A3339D13; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_62CC69FC4082C744B3C361915F0986EA; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_A2B1B46749F6EFAF872B618FE0091C00; // 0x09E0(0x0068)()
	bool                                          bPreReplay;                                        // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_DVL(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_DVL_AnimGraphNode_RigidBody_3CCC50954D9A228E6521C3833B811DB9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBPostProcessHuman_RBControlled_DVL_C">();
	}
	static class UABP_AJBPostProcessHuman_RBControlled_DVL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_DVL_C>();
	}
};
static_assert(alignof(UABP_AJBPostProcessHuman_RBControlled_DVL_C) == 0x000010, "Wrong alignment on UABP_AJBPostProcessHuman_RBControlled_DVL_C");
static_assert(sizeof(UABP_AJBPostProcessHuman_RBControlled_DVL_C) == 0x000A50, "Wrong size on UABP_AJBPostProcessHuman_RBControlled_DVL_C");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, AnimGraphNode_Root_497CB86D46163AB817488C8BD05B2A9B) == 0x000368, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::AnimGraphNode_Root_497CB86D46163AB817488C8BD05B2A9B' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, AnimGraphNode_RigidBody_3CCC50954D9A228E6521C3833B811DB9) == 0x0003B0, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::AnimGraphNode_RigidBody_3CCC50954D9A228E6521C3833B811DB9' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, AnimGraphNode_ComponentToLocalSpace_4ABC2AF24C5E476577D6B6B6A3339D13) == 0x000950, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::AnimGraphNode_ComponentToLocalSpace_4ABC2AF24C5E476577D6B6B6A3339D13' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, AnimGraphNode_LocalToComponentSpace_62CC69FC4082C744B3C361915F0986EA) == 0x000998, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::AnimGraphNode_LocalToComponentSpace_62CC69FC4082C744B3C361915F0986EA' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, AnimGraphNode_SubInput_A2B1B46749F6EFAF872B618FE0091C00) == 0x0009E0, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::AnimGraphNode_SubInput_A2B1B46749F6EFAF872B618FE0091C00' has a wrong offset!");
static_assert(offsetof(UABP_AJBPostProcessHuman_RBControlled_DVL_C, bPreReplay) == 0x000A48, "Member 'UABP_AJBPostProcessHuman_RBControlled_DVL_C::bPreReplay' has a wrong offset!");

}

