#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_ANS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_ANS.ABP_AJBInGameCharacter_ANS_C
// 0x09E0 (0x0D38 - 0x0358)
class UABP_AJBInGameCharacter_ANS_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66B940314704DEBD4CD77A8D84DF192C; // 0x0368(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_06E0B3604F7B0708AA9C94BEF821E2C6; // 0x03B8(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_E3EEA9F543B5412673B3EEAFF5AE6912; // 0x0408(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_78C5CC8C4DB16EC54B7FDCBDC0A0554A; // 0x04D0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_01FB974144CABB62EAAB48A2C511CF1D; // 0x05B0(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2DAA261143E86DDF258A67929746000B; // 0x0690(0x0070)()
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DownStart_620A05104E9E893207EAE3AE4F87B829; // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_620A05104E9E893207EAE3AE4F87B829; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpEnd_620A05104E9E893207EAE3AE4F87B829; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_620A05104E9E893207EAE3AE4F87B829; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_620A05104E9E893207EAE3AE4F87B829; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_620A05104E9E893207EAE3AE4F87B829; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_620A05104E9E893207EAE3AE4F87B829; // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_620A05104E9E893207EAE3AE4F87B829; // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_620A05104E9E893207EAE3AE4F87B829; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_620A05104E9E893207EAE3AE4F87B829; // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_620A05104E9E893207EAE3AE4F87B829; // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_620A05104E9E893207EAE3AE4F87B829; // 0x0758(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E4417B3C4EE5FC07DBED519A8273607C; // 0x0820(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A74F40E7457FE858B21990B83B52FBE1; // 0x0868(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ACA85F3B4CDCC6563BF8FA9F853A9943; // 0x09C8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15BED7BC4E071DB720B394ABCE68078B; // 0x0A10(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_FE875F4C4038ECD2820274A51A093036; // 0x0A58(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_80A982FF4697600D9A4EFE81AF064CA4; // 0x0BB8(0x0160)()
	bool                                          bCriticalFlow;                                     // 0x0D18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsPreReplay;                                      // 0x0D19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1A[0x2];                                      // 0x0D1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HairRotationDefault;                               // 0x0D1C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               HairRotationPreReplay;                             // 0x0D28(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByJump;                           // 0x0D34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDuringEmote;                                      // 0x0D35(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_ANS_AnimGraphNode_ModifyBone_FE875F4C4038ECD2820274A51A093036();
	void ExecuteUbergraph_ABP_AJBInGameCharacter_ANS(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_ANS_AnimGraphNode_ModifyBone_80A982FF4697600D9A4EFE81AF064CA4();
	void OnJump();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_ANS_AnimGraphNode_ModifyBone_A74F40E7457FE858B21990B83B52FBE1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBInGameCharacter_ANS_C">();
	}
	static class UABP_AJBInGameCharacter_ANS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_ANS_C>();
	}
};
static_assert(alignof(UABP_AJBInGameCharacter_ANS_C) == 0x000008, "Wrong alignment on UABP_AJBInGameCharacter_ANS_C");
static_assert(sizeof(UABP_AJBInGameCharacter_ANS_C) == 0x000D38, "Wrong size on UABP_AJBInGameCharacter_ANS_C");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBInGameCharacter_ANS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_UseCachedPose_66B940314704DEBD4CD77A8D84DF192C) == 0x000368, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_UseCachedPose_66B940314704DEBD4CD77A8D84DF192C' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_UseCachedPose_06E0B3604F7B0708AA9C94BEF821E2C6) == 0x0003B8, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_UseCachedPose_06E0B3604F7B0708AA9C94BEF821E2C6' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_SubInstance_E3EEA9F543B5412673B3EEAFF5AE6912) == 0x000408, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_SubInstance_E3EEA9F543B5412673B3EEAFF5AE6912' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_SaveCachedPose_78C5CC8C4DB16EC54B7FDCBDC0A0554A) == 0x0004D0, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_SaveCachedPose_78C5CC8C4DB16EC54B7FDCBDC0A0554A' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_LayeredBoneBlend_01FB974144CABB62EAAB48A2C511CF1D) == 0x0005B0, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_LayeredBoneBlend_01FB974144CABB62EAAB48A2C511CF1D' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_Slot_2DAA261143E86DDF258A67929746000B) == 0x000690, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_Slot_2DAA261143E86DDF258A67929746000B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_DownStart_620A05104E9E893207EAE3AE4F87B829) == 0x000700, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_DownStart_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_JumpLoop_620A05104E9E893207EAE3AE4F87B829) == 0x000708, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_JumpLoop_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_JumpEnd_620A05104E9E893207EAE3AE4F87B829) == 0x000710, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_JumpEnd_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_JumpStart_620A05104E9E893207EAE3AE4F87B829) == 0x000718, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_JumpStart_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_DeathLoop_620A05104E9E893207EAE3AE4F87B829) == 0x000720, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_DeathLoop_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_Dash_620A05104E9E893207EAE3AE4F87B829) == 0x000728, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_Dash_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_BS_Run_620A05104E9E893207EAE3AE4F87B829) == 0x000730, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_BS_Run_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_BS_CWalk_620A05104E9E893207EAE3AE4F87B829) == 0x000738, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_BS_CWalk_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_BS_Walk_620A05104E9E893207EAE3AE4F87B829) == 0x000740, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_BS_Walk_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_CIdle_620A05104E9E893207EAE3AE4F87B829) == 0x000748, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_CIdle_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, __SUBINSTANCE_AS_Idle_620A05104E9E893207EAE3AE4F87B829) == 0x000750, "Member 'UABP_AJBInGameCharacter_ANS_C::__SUBINSTANCE_AS_Idle_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_SubInstance_620A05104E9E893207EAE3AE4F87B829) == 0x000758, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_SubInstance_620A05104E9E893207EAE3AE4F87B829' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_Root_E4417B3C4EE5FC07DBED519A8273607C) == 0x000820, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_Root_E4417B3C4EE5FC07DBED519A8273607C' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_ModifyBone_A74F40E7457FE858B21990B83B52FBE1) == 0x000868, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_ModifyBone_A74F40E7457FE858B21990B83B52FBE1' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_LocalToComponentSpace_ACA85F3B4CDCC6563BF8FA9F853A9943) == 0x0009C8, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_LocalToComponentSpace_ACA85F3B4CDCC6563BF8FA9F853A9943' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_ComponentToLocalSpace_15BED7BC4E071DB720B394ABCE68078B) == 0x000A10, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_ComponentToLocalSpace_15BED7BC4E071DB720B394ABCE68078B' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_ModifyBone_FE875F4C4038ECD2820274A51A093036) == 0x000A58, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_ModifyBone_FE875F4C4038ECD2820274A51A093036' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, AnimGraphNode_ModifyBone_80A982FF4697600D9A4EFE81AF064CA4) == 0x000BB8, "Member 'UABP_AJBInGameCharacter_ANS_C::AnimGraphNode_ModifyBone_80A982FF4697600D9A4EFE81AF064CA4' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, bCriticalFlow) == 0x000D18, "Member 'UABP_AJBInGameCharacter_ANS_C::bCriticalFlow' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, bIsPreReplay) == 0x000D19, "Member 'UABP_AJBInGameCharacter_ANS_C::bIsPreReplay' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, HairRotationDefault) == 0x000D1C, "Member 'UABP_AJBInGameCharacter_ANS_C::HairRotationDefault' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, HairRotationPreReplay) == 0x000D28, "Member 'UABP_AJBInGameCharacter_ANS_C::HairRotationPreReplay' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, bDisableRigidBodyByJump) == 0x000D34, "Member 'UABP_AJBInGameCharacter_ANS_C::bDisableRigidBodyByJump' has a wrong offset!");
static_assert(offsetof(UABP_AJBInGameCharacter_ANS_C, bDuringEmote) == 0x000D35, "Member 'UABP_AJBInGameCharacter_ANS_C::bDuringEmote' has a wrong offset!");

}

