#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBOutGameCharacter_DBI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AJBOutGameCharacter_DBI.ABP_AJBOutGameCharacter_DBI_C
// 0x03C0 (0x0718 - 0x0358)
class UABP_AJBOutGameCharacter_DBI_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_086AE3F64FE6361A1EB5868C081EB45F; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6750037A45C57007A8AC94AD7FC117BE; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F46CD85F43820716CBBCCFB9A5D0F3F9; // 0x03F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3F4CD57F44C1AEFADD138C8D1FBADA5F; // 0x0440(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_573E4EBD41741A29D3F439B71F28CF44; // 0x04F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6637E62E4F40448C84D67B972BF75770; // 0x0538(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B1A26A79470D3145B2DDCBA48ED363BF; // 0x05E8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9C4909D04F18358B181B65AC3654262E; // 0x0630(0x00E0)()
	bool                                          bGood;                                             // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimNotify_OnStateEntered_Idle();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBOutGameCharacter_DBI_AnimGraphNode_TransitionResult_F46CD85F43820716CBBCCFB9A5D0F3F9();
	void ExecuteUbergraph_ABP_AJBOutGameCharacter_DBI(int32 EntryPoint);
	void PlayAnimationGood();
	void ResetAnimationFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AJBOutGameCharacter_DBI_C">();
	}
	static class UABP_AJBOutGameCharacter_DBI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBOutGameCharacter_DBI_C>();
	}
};
static_assert(alignof(UABP_AJBOutGameCharacter_DBI_C) == 0x000008, "Wrong alignment on UABP_AJBOutGameCharacter_DBI_C");
static_assert(sizeof(UABP_AJBOutGameCharacter_DBI_C) == 0x000718, "Wrong size on UABP_AJBOutGameCharacter_DBI_C");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, UberGraphFrame) == 0x000360, "Member 'UABP_AJBOutGameCharacter_DBI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_Root_086AE3F64FE6361A1EB5868C081EB45F) == 0x000368, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_Root_086AE3F64FE6361A1EB5868C081EB45F' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_TransitionResult_6750037A45C57007A8AC94AD7FC117BE) == 0x0003B0, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_TransitionResult_6750037A45C57007A8AC94AD7FC117BE' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_TransitionResult_F46CD85F43820716CBBCCFB9A5D0F3F9) == 0x0003F8, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_TransitionResult_F46CD85F43820716CBBCCFB9A5D0F3F9' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_SequencePlayer_3F4CD57F44C1AEFADD138C8D1FBADA5F) == 0x000440, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_SequencePlayer_3F4CD57F44C1AEFADD138C8D1FBADA5F' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_StateResult_573E4EBD41741A29D3F439B71F28CF44) == 0x0004F0, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_StateResult_573E4EBD41741A29D3F439B71F28CF44' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_SequencePlayer_6637E62E4F40448C84D67B972BF75770) == 0x000538, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_SequencePlayer_6637E62E4F40448C84D67B972BF75770' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_StateResult_B1A26A79470D3145B2DDCBA48ED363BF) == 0x0005E8, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_StateResult_B1A26A79470D3145B2DDCBA48ED363BF' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, AnimGraphNode_StateMachine_9C4909D04F18358B181B65AC3654262E) == 0x000630, "Member 'UABP_AJBOutGameCharacter_DBI_C::AnimGraphNode_StateMachine_9C4909D04F18358B181B65AC3654262E' has a wrong offset!");
static_assert(offsetof(UABP_AJBOutGameCharacter_DBI_C, bGood) == 0x000710, "Member 'UABP_AJBOutGameCharacter_DBI_C::bGood' has a wrong offset!");

}

