#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBVolumeDetection

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_AJBVolumeDetection.BI_AJBVolumeDetection_C.OnVolumeBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBVolumeDetection_C_OnVolumeBeginOverlap final
{
public:
	class UPrimitiveComponent*                    Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBVolumeDetection_C_OnVolumeBeginOverlap) == 0x000008, "Wrong alignment on BI_AJBVolumeDetection_C_OnVolumeBeginOverlap");
static_assert(sizeof(BI_AJBVolumeDetection_C_OnVolumeBeginOverlap) == 0x000008, "Wrong size on BI_AJBVolumeDetection_C_OnVolumeBeginOverlap");
static_assert(offsetof(BI_AJBVolumeDetection_C_OnVolumeBeginOverlap, Volume) == 0x000000, "Member 'BI_AJBVolumeDetection_C_OnVolumeBeginOverlap::Volume' has a wrong offset!");

// Function BI_AJBVolumeDetection.BI_AJBVolumeDetection_C.OnVolumeEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBVolumeDetection_C_OnVolumeEndOverlap final
{
public:
	class UPrimitiveComponent*                    Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBVolumeDetection_C_OnVolumeEndOverlap) == 0x000008, "Wrong alignment on BI_AJBVolumeDetection_C_OnVolumeEndOverlap");
static_assert(sizeof(BI_AJBVolumeDetection_C_OnVolumeEndOverlap) == 0x000008, "Wrong size on BI_AJBVolumeDetection_C_OnVolumeEndOverlap");
static_assert(offsetof(BI_AJBVolumeDetection_C_OnVolumeEndOverlap, Volume) == 0x000000, "Member 'BI_AJBVolumeDetection_C_OnVolumeEndOverlap::Volume' has a wrong offset!");

}

