#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBStandInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_AJBStandInterface.BI_AJBStandInterface_C.IsContinuousAccompany
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBStandInterface_C_IsContinuousAccompany final
{
public:
	bool                                          IsContinuousAccompany_0;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_AJBStandInterface_C_IsContinuousAccompany) == 0x000001, "Wrong alignment on BI_AJBStandInterface_C_IsContinuousAccompany");
static_assert(sizeof(BI_AJBStandInterface_C_IsContinuousAccompany) == 0x000001, "Wrong size on BI_AJBStandInterface_C_IsContinuousAccompany");
static_assert(offsetof(BI_AJBStandInterface_C_IsContinuousAccompany, IsContinuousAccompany_0) == 0x000000, "Member 'BI_AJBStandInterface_C_IsContinuousAccompany::IsContinuousAccompany_0' has a wrong offset!");

// Function BI_AJBStandInterface.BI_AJBStandInterface_C.OnPreEmoteAccompany
// 0x0028 (0x0028 - 0x0000)
struct BI_AJBStandInterface_C_OnPreEmoteAccompany final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Montage;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BI_AJBStandInterface_C_OnPreEmoteAccompany) == 0x000008, "Wrong alignment on BI_AJBStandInterface_C_OnPreEmoteAccompany");
static_assert(sizeof(BI_AJBStandInterface_C_OnPreEmoteAccompany) == 0x000028, "Wrong size on BI_AJBStandInterface_C_OnPreEmoteAccompany");
static_assert(offsetof(BI_AJBStandInterface_C_OnPreEmoteAccompany, Montage) == 0x000000, "Member 'BI_AJBStandInterface_C_OnPreEmoteAccompany::Montage' has a wrong offset!");

}

