#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_HamonTypeSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_HamonTypeSkill.BI_HamonTypeSkill_C.IsHamonRateEnabledSkill
// 0x0001 (0x0001 - 0x0000)
struct BI_HamonTypeSkill_C_IsHamonRateEnabledSkill final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_HamonTypeSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong alignment on BI_HamonTypeSkill_C_IsHamonRateEnabledSkill");
static_assert(sizeof(BI_HamonTypeSkill_C_IsHamonRateEnabledSkill) == 0x000001, "Wrong size on BI_HamonTypeSkill_C_IsHamonRateEnabledSkill");
static_assert(offsetof(BI_HamonTypeSkill_C_IsHamonRateEnabledSkill, IsEnabled) == 0x000000, "Member 'BI_HamonTypeSkill_C_IsHamonRateEnabledSkill::IsEnabled' has a wrong offset!");

// Function BI_HamonTypeSkill.BI_HamonTypeSkill_C.ShouldApplyHamonRateDirectly
// 0x0001 (0x0001 - 0x0000)
struct BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly final
{
public:
	bool                                          ShouldApplyDirectly;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong alignment on BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly");
static_assert(sizeof(BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly) == 0x000001, "Wrong size on BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly");
static_assert(offsetof(BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly, ShouldApplyDirectly) == 0x000000, "Member 'BI_HamonTypeSkill_C_ShouldApplyHamonRateDirectly::ShouldApplyDirectly' has a wrong offset!");

// Function BI_HamonTypeSkill.BI_HamonTypeSkill_C.GetVampireDamageRate
// 0x0004 (0x0004 - 0x0000)
struct BI_HamonTypeSkill_C_GetVampireDamageRate final
{
public:
	float                                         VampireDamageRate;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_HamonTypeSkill_C_GetVampireDamageRate) == 0x000004, "Wrong alignment on BI_HamonTypeSkill_C_GetVampireDamageRate");
static_assert(sizeof(BI_HamonTypeSkill_C_GetVampireDamageRate) == 0x000004, "Wrong size on BI_HamonTypeSkill_C_GetVampireDamageRate");
static_assert(offsetof(BI_HamonTypeSkill_C_GetVampireDamageRate, VampireDamageRate) == 0x000000, "Member 'BI_HamonTypeSkill_C_GetVampireDamageRate::VampireDamageRate' has a wrong offset!");

}

