#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_TheWorldInterface

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BI_TheWorldInterface.BI_TheWorldInterface_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BI_TheWorldInterface_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_TheWorldInterface_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BI_TheWorldInterface_C_NotifyTheWorld");
static_assert(sizeof(BI_TheWorldInterface_C_NotifyTheWorld) == 0x000010, "Wrong size on BI_TheWorldInterface_C_NotifyTheWorld");
static_assert(offsetof(BI_TheWorldInterface_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BI_TheWorldInterface_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BI_TheWorldInterface_C_NotifyTheWorld, Time) == 0x000008, "Member 'BI_TheWorldInterface_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BI_TheWorldInterface_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BI_TheWorldInterface_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BI_TheWorldInterface_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BI_TheWorldInterface_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BI_TheWorldInterface_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BI_TheWorldInterface_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

}

