#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAMErrorObserver

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE) == 0x000001, "Wrong alignment on BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE) == 0x000001, "Wrong size on BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnFailed_4B5302E34BD16D7D1A2675A29CC08CCE::Result' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE) == 0x000001, "Wrong alignment on BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE) == 0x000001, "Wrong size on BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnSuccess_4B5302E34BD16D7D1A2675A29CC08CCE::Result' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnFailed_D9CA2ADB437F46A15B6391A1E461AA99
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99 final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RemaingNum;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99) == 0x000004, "Wrong alignment on BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99) == 0x000008, "Wrong size on BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99, RemaingNum) == 0x000004, "Member 'BP_AJBAMErrorObserver_C_OnFailed_D9CA2ADB437F46A15B6391A1E461AA99::RemaingNum' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99 final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RemaingNum;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99) == 0x000004, "Wrong alignment on BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99) == 0x000008, "Wrong size on BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99::Result' has a wrong offset!");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99, RemaingNum) == 0x000004, "Member 'BP_AJBAMErrorObserver_C_OnSuccess_D9CA2ADB437F46A15B6391A1E461AA99::RemaingNum' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnFailed_C44477C54F59034606B5528B92003E96
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96 final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96) == 0x000001, "Wrong alignment on BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96) == 0x000001, "Wrong size on BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnFailed_C44477C54F59034606B5528B92003E96::Result' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnSuccess_C44477C54F59034606B5528B92003E96
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96 final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96) == 0x000001, "Wrong alignment on BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96) == 0x000001, "Wrong size on BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96, Result) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnSuccess_C44477C54F59034606B5528B92003E96::Result' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.OnShowErrorWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAMErrorObserver_C_OnShowErrorWindow final
{
public:
	EAJBErrorID                                   ErrorID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_OnShowErrorWindow) == 0x000001, "Wrong alignment on BP_AJBAMErrorObserver_C_OnShowErrorWindow");
static_assert(sizeof(BP_AJBAMErrorObserver_C_OnShowErrorWindow) == 0x000001, "Wrong size on BP_AJBAMErrorObserver_C_OnShowErrorWindow");
static_assert(offsetof(BP_AJBAMErrorObserver_C_OnShowErrorWindow, ErrorID) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_OnShowErrorWindow::ErrorID' has a wrong offset!");

// Function BP_AJBAMErrorObserver.BP_AJBAMErrorObserver_C.ExecuteUbergraph_BP_AJBAMErrorObserver
// 0x01B0 (0x01B0 - 0x0000)
struct BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result3;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RemaingNum1;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result, int32 RemaingNum)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result2;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RemaingNum;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAJBNetAPIResult Result, int32 RemaingNum)> K2Node_CreateDelegate_OutputDelegate1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              Temp_byte_Variable1;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UAmwSystemCheck*                        CallFunc_AmwSystenCheck_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable2;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBErrorID                                   K2Node_Event_ErrorID;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetErrorText_ReturnValue;                 // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetErrorNo_ReturnValue;                   // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	class UAJBNetAPI*                             CallFunc_Request_SysServeralive_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result4;                        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate6;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UNetHttp*                               CallFunc_Create_ReturnValue1;                      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI_UploadHeadClerk*             CallFunc_Request_UploadHeadClerk_ReturnValue;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result5;                        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AmwEmoneyCancelNoWait_ReturnValue;        // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate7;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishedCheckLocalNetwork_ReturnValue;  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBNetAPI*                             CallFunc_Request_SysMachineError_ReturnValue;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver) == 0x000008, "Wrong alignment on BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver");
static_assert(sizeof(BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver) == 0x0001B0, "Wrong size on BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver");
static_assert(offsetof(BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver, EntryPoint) == 0x000000, "Member 'BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver, K2Node_CustomEvent_Result3) == 0x000004, "Member 'BP_AJBAMErrorObserver_C_ExecuteUbergraph_BP_AJBAMErrorObserver::K2Node_CustomEvent_Result3' has a wrong offset!");
