#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBFerocious

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBFerocious.BP_AJBFerocious_C.ExecuteUbergraph_BP_AJBFerocious
// 0x0330 (0x0330 - 0x0000)
struct BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Passive_Ferocious_C*                K2Node_DynamicCast_AsWB_Passive_Ferocious;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActiveForOwner;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActiveForMovableStand;               // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_FGO_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag;                       // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SerialNumber;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AttackDistance;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_KilledCharacterId;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWithSeparatedStandAttack;      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bHitEnemysSeparatedStand;       // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFirstBlood;                    // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_UltimateSkillSerialNumberIfInEffect; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DeadPlayerId;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsLastDefeated;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPlayerKill;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSpecialKill;                   // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSelfKill;                      // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool bWithSeparatedStandAttack, bool bHitEnemysSeparatedStand, bool bFirstBlood, int32 UltimateSkillSerialNumberIfInEffect, float ElapsedTime, int32 DeadPlayerId, bool bIsLastDefeated, bool bPlayerKill, bool bSpecialKill, bool bSelfKill)> K2Node_CreateDelegate_OutputDelegate; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_FGO_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO1; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_PPH_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH;      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckState_bMatch;                        // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue11;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character9;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x0290(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x02A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02E8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0300(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious) == 0x000008, "Wrong alignment on BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious");
static_assert(sizeof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious) == 0x000330, "Wrong size on BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, EntryPoint) == 0x000000, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsWB_Passive_Ferocious) == 0x000028, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsWB_Passive_Ferocious' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue1) == 0x000038, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000040, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsValid_ReturnValue1) == 0x000049, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue2) == 0x000050, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000058, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess3) == 0x000060, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsDedicatedServer_ReturnValue) == 0x000061, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsValid_ReturnValue2) == 0x000062, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_Operator) == 0x000068, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_Time) == 0x000070, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_Timing) == 0x000074, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bEnable) == 0x000075, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bOperatorIsEmpty) == 0x000076, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue3) == 0x000078, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000080, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess4) == 0x000088, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bTriggeredByStand1) == 0x000089, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetObjectClass_ReturnValue) == 0x000090, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bTriggeredByStand) == 0x000098, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue4) == 0x0000A0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0000A8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess5) == 0x0000B0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_HasLocalSharedController_ReturnValue) == 0x0000B1, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B2, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Conv_NameToText_ReturnValue) == 0x0000B8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue5) == 0x000110, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000118, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess6) == 0x000120, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000128, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000130, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, Temp_float_Variable) == 0x000134, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000138, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue6) == 0x000140, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_EndPlayReason) == 0x000148, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000150, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess7) == 0x000158, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000160, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess8) == 0x000168, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_NegateVector_ReturnValue) == 0x00016C, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000178, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bActiveForOwner) == 0x000180, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bActiveForOwner' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Event_bActiveForMovableStand) == 0x000181, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Event_bActiveForMovableStand' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue7) == 0x000188, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x000190, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess9) == 0x000198, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000199, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO) == 0x0001A0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess10) == 0x0001A8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_SkillTag) == 0x0001B0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_SerialNumber) == 0x0001B8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_AttackDistance) == 0x0001BC, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_AttackDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_KilledCharacterId) == 0x0001C0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_KilledCharacterId' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bWithSeparatedStandAttack) == 0x0001C1, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bWithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bHitEnemysSeparatedStand) == 0x0001C2, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bHitEnemysSeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bFirstBlood) == 0x0001C3, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bFirstBlood' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_UltimateSkillSerialNumberIfInEffect) == 0x0001C4, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_UltimateSkillSerialNumberIfInEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_ElapsedTime) == 0x0001C8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_DeadPlayerId) == 0x0001CC, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_DeadPlayerId' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bIsLastDefeated) == 0x0001D0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bIsLastDefeated' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bPlayerKill) == 0x0001D1, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bPlayerKill' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bSpecialKill) == 0x0001D2, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bSpecialKill' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CustomEvent_bSelfKill) == 0x0001D3, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CustomEvent_bSelfKill' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_BooleanOR_ReturnValue) == 0x0001D4, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Not_PreBool_ReturnValue) == 0x0001D5, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue8) == 0x0001E8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue9) == 0x0001F0, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x0001F8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess11) == 0x000200, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x000208, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess12) == 0x000210, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO1) == 0x000218, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_FGO1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess13) == 0x000220, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000228, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess14) == 0x000230, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH) == 0x000238, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_PPH' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess15) == 0x000240, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue10) == 0x000248, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, Temp_float_Variable1) == 0x000250, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000258, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess16) == 0x000260, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000261, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x000262, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_CheckState_bMatch) == 0x000263, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_CheckState_bMatch' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, Temp_bool_Variable) == 0x000264, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_Select_Default) == 0x000268, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetOwner_ReturnValue11) == 0x000270, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetOwner_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_AsBP_AJBIn_Game_Character9) == 0x000278, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_AsBP_AJBIn_Game_Character9' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_DynamicCast_bSuccess17) == 0x000280, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_GetCharacterName_CharacterName) == 0x000288, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Conv_NameToText_ReturnValue1) == 0x000290, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_MakeStruct_FormatArgumentData1) == 0x0002A8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, K2Node_MakeArray_Array) == 0x0002E8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Not_PreBool_ReturnValue1) == 0x0002F8, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Format_ReturnValue) == 0x000300, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Conv_TextToString_ReturnValue) == 0x000318, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious, CallFunc_Conv_StringToName_ReturnValue) == 0x000328, "Member 'BP_AJBFerocious_C_ExecuteUbergraph_BP_AJBFerocious::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_AJBFerocious.BP_AJBFerocious_C.OnKill
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBFerocious_C_OnKill final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         KilledCharacterId;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithSeparatedStandAttack;                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHitEnemysSeparatedStand;                          // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstBlood;                                       // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         UltimateSkillSerialNumberIfInEffect;               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeadPlayerId;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLastDefeated;                                   // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayerKill;                                       // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSpecialKill;                                      // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfKill;                                         // 0x0023(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBFerocious_C_OnKill) == 0x000008, "Wrong alignment on BP_AJBFerocious_C_OnKill");
static_assert(sizeof(BP_AJBFerocious_C_OnKill) == 0x000028, "Wrong size on BP_AJBFerocious_C_OnKill");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, SkillTag) == 0x000000, "Member 'BP_AJBFerocious_C_OnKill::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, SerialNumber) == 0x000008, "Member 'BP_AJBFerocious_C_OnKill::SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, AttackDistance) == 0x00000C, "Member 'BP_AJBFerocious_C_OnKill::AttackDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, KilledCharacterId) == 0x000010, "Member 'BP_AJBFerocious_C_OnKill::KilledCharacterId' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bWithSeparatedStandAttack) == 0x000011, "Member 'BP_AJBFerocious_C_OnKill::bWithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bHitEnemysSeparatedStand) == 0x000012, "Member 'BP_AJBFerocious_C_OnKill::bHitEnemysSeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bFirstBlood) == 0x000013, "Member 'BP_AJBFerocious_C_OnKill::bFirstBlood' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, UltimateSkillSerialNumberIfInEffect) == 0x000014, "Member 'BP_AJBFerocious_C_OnKill::UltimateSkillSerialNumberIfInEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, ElapsedTime) == 0x000018, "Member 'BP_AJBFerocious_C_OnKill::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, DeadPlayerId) == 0x00001C, "Member 'BP_AJBFerocious_C_OnKill::DeadPlayerId' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bIsLastDefeated) == 0x000020, "Member 'BP_AJBFerocious_C_OnKill::bIsLastDefeated' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bPlayerKill) == 0x000021, "Member 'BP_AJBFerocious_C_OnKill::bPlayerKill' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bSpecialKill) == 0x000022, "Member 'BP_AJBFerocious_C_OnKill::bSpecialKill' has a wrong offset!");
static_assert(offsetof(BP_AJBFerocious_C_OnKill, bSelfKill) == 0x000023, "Member 'BP_AJBFerocious_C_OnKill::bSelfKill' has a wrong offset!");

// Function BP_AJBFerocious.BP_AJBFerocious_C.TryDestroyStandLoopParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBFerocious_C_TryDestroyStandLoopParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBFerocious_C_TryDestroyStandLoopParticle) == 0x000001, "Wrong alignment on BP_AJBFerocious_C_TryDestroyStandLoopParticle");
static_assert(sizeof(BP_AJBFerocious_C_TryDestroyStandLoopParticle) == 0x000001, "Wrong size on BP_AJBFerocious_C_TryDestroyStandLoopParticle");
static_assert(offsetof(BP_AJBFerocious_C_TryDestroyStandLoopParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBFerocious_C_TryDestroyStandLoopParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBFerocious.BP_AJBFerocious_C.ChangeFerociousStatus
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AJBFerocious_C_ChangeFerociousStatus final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface2; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface3; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface4; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
