#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem_SoulBubble

#include "Basic.hpp"

#include "E_StencilDigit_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.ExecuteUbergraph_BP_AJBInGameItem_SoulBubble
// 0x0290 (0x0290 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate; // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP1;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess1;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_Event_TargetCharacter;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSpaceShaving1;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_Event_HitCharacter;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSpaceShaving;                        // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsumableCharacter_IsConsumable;       // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacter1;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBSoulBubbleAffecter_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_BubbleLocation;                 // 0x0144(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1; // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP2;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess2;       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetPairCharacterBP_PairCharacterBP;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP3;    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess3;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetPairCharacterBP_PairCharacterBP1;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacter;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x021C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameItem_SP_C*                 CallFunc_FinishSpawningActor_ReturnValue1;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldWaitRupturing_ShouldWait;           // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0287(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble) == 0x000010, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble) == 0x000290, "Wrong size on BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR) == 0x000010, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue1) == 0x000020, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000028, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000030, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000038, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000058, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_float_Variable) == 0x00005C, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue1) == 0x000064, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000068, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_int_Variable) == 0x00006C, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue2) == 0x000078, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_CharacterBP1) == 0x000080, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_bSuccess1) == 0x000088, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue2) == 0x000089, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsServer_ReturnValue) == 0x00008A, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue3) == 0x00008B, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_Operator) == 0x000090, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_Time) == 0x000098, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_Timing) == 0x00009C, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_bEnable) == 0x00009D, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_bOperatorIsEmpty) == 0x00009E, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_TargetCharacter) == 0x0000A0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_bSpaceShaving1) == 0x0000A8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_bSpaceShaving1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_HitCharacter) == 0x0000B0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_PlayerIndex) == 0x0000B8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_bSpaceShaving) == 0x0000BC, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_bSpaceShaving' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsConsumableCharacter_IsConsumable) == 0x0000BD, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsConsumableCharacter_IsConsumable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetTransform_ReturnValue) == 0x0000C0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue4) == 0x0000F0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_Event_EndPlayReason) == 0x0000F1, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue3) == 0x0000F8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_TargetCharacter1) == 0x000108, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_bSpaceShaving1) == 0x000110, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_bSpaceShaving1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000114, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_FinishSpawningActor_ReturnValue) == 0x000120, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000128, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue5) == 0x000134, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000138, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsDedicatedServer_ReturnValue) == 0x000140, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_BubbleLocation) == 0x000144, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_BubbleLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000150, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000158, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsServer_ReturnValue1) == 0x000160, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_DamageType) == 0x000168, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_DeadActor) == 0x000170, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_DamageCauser) == 0x000178, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CreateDelegate_OutputDelegate1) == 0x000180, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue6) == 0x000190, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_CallbackType) == 0x000191, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_CallbackInfo) == 0x000198, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue4) == 0x0001A0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_SwitchEnum_CmpSuccess) == 0x0001A8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_CharacterBP2) == 0x0001B0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_CharacterBP2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_bSuccess2) == 0x0001B8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue7) == 0x0001B9, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetPairCharacterBP_PairCharacterBP) == 0x0001C0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetPairCharacterBP_PairCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue8) == 0x0001C8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x0001D0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetOwner_ReturnValue5) == 0x0001D8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_CharacterBP3) == 0x0001E0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_CharacterBP3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetAJBCharacterFromActor_bSuccess3) == 0x0001E8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetAJBCharacterFromActor_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue9) == 0x0001E9, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetPairCharacterBP_PairCharacterBP1) == 0x0001F0, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetPairCharacterBP_PairCharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsValid_ReturnValue10) == 0x0001F8, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_bool_Has_Been_Initd_Variable) == 0x0001F9, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_GetObjectClass_ReturnValue) == 0x000200, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000208, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000209, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_TargetCharacter) == 0x000210, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, K2Node_CustomEvent_bSpaceShaving) == 0x000218, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::K2Node_CustomEvent_bSpaceShaving' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00021C, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000228, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000270, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_FinishSpawningActor_ReturnValue1) == 0x000278, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_bool_IsClosed_Variable) == 0x000280, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_ShouldWaitRupturing_ShouldWait) == 0x000281, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_ShouldWaitRupturing_ShouldWait' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000282, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsServer_ReturnValue2) == 0x000283, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000284, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, CallFunc_IsServer_ReturnValue3) == 0x000285, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::CallFunc_IsServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_bool_Has_Been_Initd_Variable1) == 0x000286, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble, Temp_bool_IsClosed_Variable1) == 0x000287, "Member 'BP_AJBInGameItem_SoulBubble_C_ExecuteUbergraph_BP_AJBInGameItem_SoulBubble::Temp_bool_IsClosed_Variable1' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.OverrideSprinkelBehavior_Server
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server) == 0x000010, "Wrong size on BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server, TargetCharacter) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_OverrideSprinkelBehavior_Server::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.Internal_OnEnd_SoulBubbleLoopSE
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE) == 0x000010, "Wrong size on BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE, CallbackType) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE::CallbackType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE, CallbackInfo) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_Internal_OnEnd_SoulBubbleLoopSE::CallbackInfo' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.OnPairDead_Server
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server) == 0x000018, "Wrong size on BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server, DamageType) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server, DeadActor) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server, DamageCauser) == 0x000010, "Member 'BP_AJBInGameItem_SoulBubble_C_OnPairDead_Server::DamageCauser' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.MC_OnRuptureBubble
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble final
{
public:
	struct FVector                                BubbleLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble) == 0x000004, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble) == 0x00000C, "Wrong size on BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble, BubbleLocation) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_MC_OnRuptureBubble::BubbleLocation' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.RuptureBubble_Server
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server) == 0x000010, "Wrong size on BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server, TargetCharacter) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_RuptureBubble_Server::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.OnConsumedServer
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_OnConsumedServer final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_OnConsumedServer) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_OnConsumedServer");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_OnConsumedServer) == 0x000010, "Wrong size on BP_AJBInGameItem_SoulBubble_C_OnConsumedServer");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OnConsumedServer, TargetCharacter) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_OnConsumedServer::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_OnConsumedServer, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_OnConsumedServer::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBInGameItem_SoulBubble_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBInGameItem_SoulBubble.BP_AJBInGameItem_SoulBubble_C.IsConsumableCharacter
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameItem_SoulBubble_C_IsConsumableCharacter final
{
public:
