#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRobSdDebuff

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRobSdDebuff.BP_AJBRobSdDebuff_C.ExecuteUbergraph_BP_AJBRobSdDebuff
// 0x0128 (0x0128 - 0x0000)
struct BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bTriggeredByStand1;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTriggeredByStand;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue1;      // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue2;      // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_IsAlive;                          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue3;      // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTagWithFloat_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_AddGameplayTagWithFloat_self1_CastInput; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self_CastInput; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self1_CastInput; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldSpawnEndParticle_bShould;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue1;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckSpecifiedPassiveActive_bValid;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff) == 0x000008, "Wrong alignment on BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff");
static_assert(sizeof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff) == 0x000128, "Wrong size on BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, EntryPoint) == 0x000000, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_Operator) == 0x000008, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_Time) == 0x000010, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_Timing) == 0x000014, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_bEnable) == 0x000015, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_bOperatorIsEmpty) == 0x000016, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_bTriggeredByStand1) == 0x000017, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_bTriggeredByStand1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000018, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Event_bTriggeredByStand) == 0x000020, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Event_bTriggeredByStand' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_MakeLiteralGameplayTag_ReturnValue1) == 0x000030, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_MakeLiteralGameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_MakeLiteralGameplayTag_ReturnValue2) == 0x000038, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_MakeLiteralGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, Temp_float_Variable) == 0x000048, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000050, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsAlive_IsAlive) == 0x000059, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsAlive_IsAlive' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_GetOwner_ReturnValue1) == 0x000060, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_MakeLiteralGameplayTag_ReturnValue3) == 0x000068, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_MakeLiteralGameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000070, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_AddGameplayTagWithFloat_self_CastInput) == 0x000080, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_AddGameplayTagWithFloat_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_AddGameplayTagWithFloat_self1_CastInput) == 0x000090, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_AddGameplayTagWithFloat_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A0, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, Temp_float_Variable1) == 0x0000A4, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, Temp_bool_Variable) == 0x0000A8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000A9, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_Select_Default) == 0x0000AC, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B0, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_GetOwner_ReturnValue2) == 0x0000B8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x0000C0, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x0000C8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_RemoveGameplayTag_self_CastInput) == 0x0000D8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_RemoveGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_RemoveGameplayTag_self1_CastInput) == 0x0000E8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_RemoveGameplayTag_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_ShouldSpawnEndParticle_bShould) == 0x0000F8, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_ShouldSpawnEndParticle_bShould' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1) == 0x000100, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsGameplayTagValid_ReturnValue1) == 0x000108, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsGameplayTagValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsValid_ReturnValue1) == 0x000109, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x00010A, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsValid_ReturnValue2) == 0x00010B, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_IsValid_ReturnValue3) == 0x00010C, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_CheckSpecifiedPassiveActive_bValid) == 0x000120, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_CheckSpecifiedPassiveActive_bValid' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_Not_PreBool_ReturnValue) == 0x000121, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff, CallFunc_BooleanAND_ReturnValue) == 0x000122, "Member 'BP_AJBRobSdDebuff_C_ExecuteUbergraph_BP_AJBRobSdDebuff::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBRobSdDebuff.BP_AJBRobSdDebuff_C.ShouldSpawnEndParticle
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShould;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckSpecifiedPassiveActive_bValid;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle) == 0x000008, "Wrong alignment on BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle");
static_assert(sizeof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle) == 0x000028, "Wrong size on BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, CharacterBP) == 0x000000, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, bShould) == 0x000008, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::bShould' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, CallFunc_CheckSpecifiedPassiveActive_bValid) == 0x000020, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::CallFunc_CheckSpecifiedPassiveActive_bValid' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BP_AJBRobSdDebuff_C_ShouldSpawnEndParticle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBRobSdDebuff.BP_AJBRobSdDebuff_C.OnActionInactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRobSdDebuff_C_OnActionInactivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRobSdDebuff_C_OnActionInactivate) == 0x000001, "Wrong alignment on BP_AJBRobSdDebuff_C_OnActionInactivate");
static_assert(sizeof(BP_AJBRobSdDebuff_C_OnActionInactivate) == 0x000001, "Wrong size on BP_AJBRobSdDebuff_C_OnActionInactivate");
static_assert(offsetof(BP_AJBRobSdDebuff_C_OnActionInactivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBRobSdDebuff_C_OnActionInactivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBRobSdDebuff.BP_AJBRobSdDebuff_C.OnActionActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRobSdDebuff_C_OnActionActivate final
{
public:
	bool                                          bTriggeredByStand;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRobSdDebuff_C_OnActionActivate) == 0x000001, "Wrong alignment on BP_AJBRobSdDebuff_C_OnActionActivate");
static_assert(sizeof(BP_AJBRobSdDebuff_C_OnActionActivate) == 0x000001, "Wrong size on BP_AJBRobSdDebuff_C_OnActionActivate");
static_assert(offsetof(BP_AJBRobSdDebuff_C_OnActionActivate, bTriggeredByStand) == 0x000000, "Member 'BP_AJBRobSdDebuff_C_OnActionActivate::bTriggeredByStand' has a wrong offset!");

// Function BP_AJBRobSdDebuff.BP_AJBRobSdDebuff_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRobSdDebuff_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRobSdDebuff_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBRobSdDebuff_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBRobSdDebuff_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBRobSdDebuff_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBRobSdDebuff_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBRobSdDebuff_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBRobSdDebuff_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBRobSdDebuff_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBRobSdDebuff_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRobSdDebuff_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBRobSdDebuff_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

}

