#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneAffecter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter
// 0x0340 (0x0340 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0040(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DamageDecal_LastingBase_C*          CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                K2Node_Event_Location;                             // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Radius;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestore;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CurrentTime;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StartWithRandamDelayGionAndSE;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameAIEnvironmentComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DamageDecal_LastingBase_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP1;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess1;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName1;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue2;             // 0x0210(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue3;             // 0x0228(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0240(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0280(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x02D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue1;           // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317[0x1];                                      // 0x0317(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DamageDecal_LastingBase_C*          CallFunc_Array_Get_Item1;                          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bEnableTheWorld;                      // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_327[0x1];                                      // 0x0327(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter) == 0x000010, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter) == 0x000340, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, EntryPoint) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_bool_Variable) == 0x000004, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000028, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000030, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetCharacterName_CharacterName) == 0x000038, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_NameToText_ReturnValue) == 0x000040, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_int_Array_Index_Variable1) == 0x0000A0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_int_Loop_Counter_Variable1) == 0x0000A4, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Add_IntInt_ReturnValue1) == 0x0000A8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_NameToText_ReturnValue1) == 0x0000C0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeStruct_FormatArgumentData1) == 0x0000D8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Location) == 0x000128, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Scale) == 0x000134, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Radius) == 0x000138, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Radius' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_SerialNumber) == 0x00013C, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_bRestore) == 0x000140, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_bRestore' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_CurrentTime) == 0x000144, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_CurrentTime' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_StartWithRandamDelayGionAndSE) == 0x000148, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_StartWithRandamDelayGionAndSE' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Format_ReturnValue) == 0x000150, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_TextToString_ReturnValue) == 0x000168, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000178, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_StringToName_ReturnValue) == 0x000180, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetGameMode_ReturnValue) == 0x0001C8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetComponentByClass_ReturnValue) == 0x0001D0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_IsValid_ReturnValue1) == 0x0001E0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Array_Add_ReturnValue) == 0x0001E4, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetObjectClass_ReturnValue1) == 0x0001E8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetOwner_ReturnValue1) == 0x0001F0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetAJBCharacterFromActor_CharacterBP1) == 0x0001F8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetAJBCharacterFromActor_CharacterBP1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetAJBCharacterFromActor_bSuccess1) == 0x000200, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetAJBCharacterFromActor_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_IsValid_ReturnValue2) == 0x000201, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_GetCharacterName_CharacterName1) == 0x000208, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_GetCharacterName_CharacterName1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_NameToText_ReturnValue2) == 0x000210, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_NameToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_NameToText_ReturnValue3) == 0x000228, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_NameToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeStruct_FormatArgumentData2) == 0x000240, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeStruct_FormatArgumentData3) == 0x000280, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_MakeArray_Array1) == 0x0002C0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Format_ReturnValue1) == 0x0002D0, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_TextToString_ReturnValue1) == 0x0002E8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_TextToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Conv_StringToName_ReturnValue1) == 0x0002F8, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Conv_StringToName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Add_FloatFloat_ReturnValue) == 0x000300, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Operator) == 0x000308, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Time) == 0x000310, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_Timing) == 0x000314, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_bEnable) == 0x000315, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_bOperatorIsEmpty) == 0x000316, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Array_Get_Item1) == 0x000318, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Array_Length_ReturnValue1) == 0x000320, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_IsValid_ReturnValue3) == 0x000324, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, CallFunc_Less_IntInt_ReturnValue1) == 0x000325, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Event_bEnableTheWorld) == 0x000326, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Event_bEnableTheWorld' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_float_Variable) == 0x000328, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, Temp_float_Variable1) == 0x00032C, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter, K2Node_Select_Default) == 0x000330, "Member 'BP_AJBCrossfireHurricaneAffecter_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.GetCauserOwnerCharacterBP
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP) == 0x000008, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP) == 0x000028, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP, CharacterBP) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP::CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000018, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000020, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetCauserOwnerCharacterBP::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.OnAddToMultipleLocationsCore
// 0x0024 (0x0024 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_0;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_0;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber_0;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestore;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentTime_0;                                     // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartWithRandamDelayGionAndSE;                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore) == 0x000004, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore) == 0x000024, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, Location) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, Scale_0) == 0x00000C, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::Scale_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, Radius_0) == 0x000010, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::Radius_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, SerialNumber_0) == 0x000014, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::SerialNumber_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, bRestore) == 0x000018, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::bRestore' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, CurrentTime_0) == 0x00001C, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::CurrentTime_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore, StartWithRandamDelayGionAndSE) == 0x000020, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnAddToMultipleLocationsCore::StartWithRandamDelayGionAndSE' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.GetPassiveSkillTag
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag final
{
public:
	struct FGameplayTag                           PassiveSkillTag_0;                                 // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag) == 0x000008, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag) == 0x000008, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag, PassiveSkillTag_0) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetPassiveSkillTag::PassiveSkillTag_0' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.GetDuration
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_GetDuration final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_GetDuration) == 0x000004, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_GetDuration");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_GetDuration) == 0x000004, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_GetDuration");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_GetDuration, Duration) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_GetDuration::Duration' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.OnTheWorldChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged final
{
public:
	bool                                          bEnableTheWorld_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged) == 0x000001, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged) == 0x000001, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged, bEnableTheWorld_0) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_OnTheWorldChanged::bEnableTheWorld_0' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBCrossfireHurricaneAffecter_C_NotifyTheWorld::Timing' has a wrong offset!");
