#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRadioChat

#include "Basic.hpp"

#include "ST_RadioChatInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.ExecuteUbergraph_BP_AJBRadioChat
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RadioChatInfo                      K2Node_CustomEvent_ChatInfo;                       // 0x0008(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat) == 0x000008, "Wrong alignment on BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat");
static_assert(sizeof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat) == 0x000048, "Wrong size on BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat");
static_assert(offsetof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat, EntryPoint) == 0x000000, "Member 'BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat, K2Node_CustomEvent_ChatInfo) == 0x000008, "Member 'BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat::K2Node_CustomEvent_ChatInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000038, "Member 'BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.OnClickedButton
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBRadioChat_C_OnClickedButton final
{
public:
	struct FST_RadioChatInfo                      ChatInfo;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRadioChat_C_OnClickedButton) == 0x000008, "Wrong alignment on BP_AJBRadioChat_C_OnClickedButton");
static_assert(sizeof(BP_AJBRadioChat_C_OnClickedButton) == 0x000028, "Wrong size on BP_AJBRadioChat_C_OnClickedButton");
static_assert(offsetof(BP_AJBRadioChat_C_OnClickedButton, ChatInfo) == 0x000000, "Member 'BP_AJBRadioChat_C_OnClickedButton::ChatInfo' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.SetupWidget
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBRadioChat_C_SetupWidget final
{
public:
	class UWB_RadioChat_C*                        RadioChatWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FST_RadioChatInfo& ChatInfo)> K2Node_CreateDelegate_OutputDelegate;  // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FST_RadioChatInfo& ChatInfo)> K2Node_CreateDelegate_OutputDelegate1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_SetupWidget) == 0x000008, "Wrong alignment on BP_AJBRadioChat_C_SetupWidget");
static_assert(sizeof(BP_AJBRadioChat_C_SetupWidget) == 0x000038, "Wrong size on BP_AJBRadioChat_C_SetupWidget");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, RadioChatWidget) == 0x000000, "Member 'BP_AJBRadioChat_C_SetupWidget::RadioChatWidget' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, Controller) == 0x000008, "Member 'BP_AJBRadioChat_C_SetupWidget::Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AJBRadioChat_C_SetupWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, CallFunc_IsValid_ReturnValue1) == 0x000011, "Member 'BP_AJBRadioChat_C_SetupWidget::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AJBRadioChat_C_SetupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetupWidget, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'BP_AJBRadioChat_C_SetupWidget::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.SetEnableChat
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRadioChat_C_SetEnableChat final
{
public:
	bool                                          bEnable_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRadioChat_C_SetEnableChat) == 0x000008, "Wrong alignment on BP_AJBRadioChat_C_SetEnableChat");
static_assert(sizeof(BP_AJBRadioChat_C_SetEnableChat) == 0x000010, "Wrong size on BP_AJBRadioChat_C_SetEnableChat");
static_assert(offsetof(BP_AJBRadioChat_C_SetEnableChat, bEnable_0) == 0x000000, "Member 'BP_AJBRadioChat_C_SetEnableChat::bEnable_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_SetEnableChat, Controller) == 0x000008, "Member 'BP_AJBRadioChat_C_SetEnableChat::Controller' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRadioChat_C_Initialize final
{
public:
	class AAJBInGameCharacter*                    TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsPair_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_Initialize) == 0x000008, "Wrong alignment on BP_AJBRadioChat_C_Initialize");
static_assert(sizeof(BP_AJBRadioChat_C_Initialize) == 0x000010, "Wrong size on BP_AJBRadioChat_C_Initialize");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, TargetCharacter_0) == 0x000000, "Member 'BP_AJBRadioChat_C_Initialize::TargetCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBRadioChat_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, CallFunc_IsLocallyControlled_ReturnValue) == 0x000009, "Member 'BP_AJBRadioChat_C_Initialize::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, CallFunc_IsValid_ReturnValue1) == 0x00000A, "Member 'BP_AJBRadioChat_C_Initialize::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, CallFunc_IsValid_ReturnValue2) == 0x00000B, "Member 'BP_AJBRadioChat_C_Initialize::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRadioChat_C_Initialize, CallFunc_PlayModeIsPair_ReturnValue) == 0x00000C, "Member 'BP_AJBRadioChat_C_Initialize::CallFunc_PlayModeIsPair_ReturnValue' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.CloseChatList
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_CloseChatList final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_CloseChatList) == 0x000001, "Wrong alignment on BP_AJBRadioChat_C_CloseChatList");
static_assert(sizeof(BP_AJBRadioChat_C_CloseChatList) == 0x000001, "Wrong size on BP_AJBRadioChat_C_CloseChatList");
static_assert(offsetof(BP_AJBRadioChat_C_CloseChatList, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBRadioChat_C_CloseChatList::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.CollapsedWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_CollapsedWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_CollapsedWidget) == 0x000001, "Wrong alignment on BP_AJBRadioChat_C_CollapsedWidget");
static_assert(sizeof(BP_AJBRadioChat_C_CollapsedWidget) == 0x000001, "Wrong size on BP_AJBRadioChat_C_CollapsedWidget");
static_assert(offsetof(BP_AJBRadioChat_C_CollapsedWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBRadioChat_C_CollapsedWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.ShowWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_ShowWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRadioChat_C_ShowWidget) == 0x000001, "Wrong alignment on BP_AJBRadioChat_C_ShowWidget");
static_assert(sizeof(BP_AJBRadioChat_C_ShowWidget) == 0x000001, "Wrong size on BP_AJBRadioChat_C_ShowWidget");
static_assert(offsetof(BP_AJBRadioChat_C_ShowWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AJBRadioChat_C_ShowWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

