#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameGion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_GionInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameGion.BP_AJBInGameGion_C.ExecuteUbergraph_BP_AJBInGameGion
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOwner;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion) == 0x000004, "Wrong alignment on BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion");
static_assert(sizeof(BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion) == 0x00000C, "Wrong size on BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion");
static_assert(offsetof(BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion, EntryPoint) == 0x000000, "Member 'BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion, K2Node_CustomEvent_IsOwner) == 0x000004, "Member 'BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion::K2Node_CustomEvent_IsOwner' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_AJBInGameGion_C_ExecuteUbergraph_BP_AJBInGameGion::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGameGion.BP_AJBInGameGion_C.OnActiveEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameGion_C_OnActiveEffect final
{
public:
	bool                                          IsOwner;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameGion_C_OnActiveEffect) == 0x000001, "Wrong alignment on BP_AJBInGameGion_C_OnActiveEffect");
static_assert(sizeof(BP_AJBInGameGion_C_OnActiveEffect) == 0x000001, "Wrong size on BP_AJBInGameGion_C_OnActiveEffect");
static_assert(offsetof(BP_AJBInGameGion_C_OnActiveEffect, IsOwner) == 0x000000, "Member 'BP_AJBInGameGion_C_OnActiveEffect::IsOwner' has a wrong offset!");

// Function BP_AJBInGameGion.BP_AJBInGameGion_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameGion_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameGion_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBInGameGion_C_ReceiveTick");
static_assert(sizeof(BP_AJBInGameGion_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBInGameGion_C_ReceiveTick");
static_assert(offsetof(BP_AJBInGameGion_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBInGameGion_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGameGion.BP_AJBInGameGion_C.SetupEffect
// 0x0368 (0x0368 - 0x0000)
struct BP_AJBInGameGion_C_SetupEffect final
{
public:
	struct FST_GionInfo                           GionInfo_0;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0060(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0120(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array1;                           // 0x0130(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_AJBMultiSphereTraceForObjects_OutHits;    // 0x0140(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_AJBMultiSphereTraceForObjects_ReturnValue; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0204(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0248(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0254(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_AJBInGameIndoorVolumeComponent_C*> CallFunc_GetComponentsByClass_ReturnValue;   // 0x0268(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameIndoorVolumeComponent_C*   CallFunc_Array_Get_Item1;                          // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x029C(0x000C)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x02B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x02D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBInGameGion_C_SetupEffect) == 0x000008, "Wrong alignment on BP_AJBInGameGion_C_SetupEffect");
static_assert(sizeof(BP_AJBInGameGion_C_SetupEffect) == 0x000368, "Wrong size on BP_AJBInGameGion_C_SetupEffect");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, GionInfo_0) == 0x000000, "Member 'BP_AJBInGameGion_C_SetupEffect::GionInfo_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, Location) == 0x000060, "Member 'BP_AJBInGameGion_C_SetupEffect::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000070, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000F8, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, Temp_int_Loop_Counter_Variable) == 0x0000FC, "Member 'BP_AJBInGameGion_C_SetupEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, Temp_int_Array_Index_Variable) == 0x000104, "Member 'BP_AJBInGameGion_C_SetupEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, Temp_int_Array_Index_Variable1) == 0x000108, "Member 'BP_AJBInGameGion_C_SetupEffect::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_AJBInGameGion_C_SetupEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000120, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, K2Node_MakeArray_Array1) == 0x000130, "Member 'BP_AJBInGameGion_C_SetupEffect::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_AJBMultiSphereTraceForObjects_OutHits) == 0x000140, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_AJBMultiSphereTraceForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_AJBMultiSphereTraceForObjects_ReturnValue) == 0x000150, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_AJBMultiSphereTraceForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Array_Get_Item) == 0x000158, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E0, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E1, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_Location) == 0x0001EC, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_Normal) == 0x000204, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_FaceIndex) == 0x000244, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_TraceStart) == 0x000248, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_BreakHitResult_TraceEnd) == 0x000254, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Array_Length_ReturnValue) == 0x000260, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_GetComponentsByClass_ReturnValue) == 0x000268, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000278, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Array_Get_Item1) == 0x000280, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Array_Length_ReturnValue1) == 0x000288, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, Temp_int_Loop_Counter_Variable1) == 0x00028C, "Member 'BP_AJBInGameGion_C_SetupEffect::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_GetPlayerController_ReturnValue) == 0x000290, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Less_IntInt_ReturnValue1) == 0x000298, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_GetCameraRotation_ReturnValue) == 0x00029C, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Add_IntInt_ReturnValue1) == 0x0002A8, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_MakeVector_ReturnValue) == 0x0002AC, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0002B8, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_Add_VectorVector_ReturnValue) == 0x0002C4, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0002D0, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_SetupEffect, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002E0, "Member 'BP_AJBInGameGion_C_SetupEffect::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_AJBInGameGion.BP_AJBInGameGion_C.GetScaleWidgetFromSameRoom
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEffectScaleFromSameRoom_Scale;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom) == 0x000008, "Wrong alignment on BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom");
static_assert(sizeof(BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom) == 0x000018, "Wrong size on BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom");
static_assert(offsetof(BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom, Scale) == 0x000000, "Member 'BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom::Scale' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom, CallFunc_GetEffectScaleFromSameRoom_Scale) == 0x000010, "Member 'BP_AJBInGameGion_C_GetScaleWidgetFromSameRoom::CallFunc_GetEffectScaleFromSameRoom_Scale' has a wrong offset!");

}

