#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDebugAIEnvironmentVisualizer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDebugAIEnvironmentVisualizer.BP_AJBDebugAIEnvironmentVisualizer_C.ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer) == 0x000004, "Wrong alignment on BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer");
static_assert(sizeof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer) == 0x000050, "Wrong size on BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, EntryPoint) == 0x000000, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_X) == 0x000004, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_Z) == 0x00000C, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_MakeVector_ReturnValue1) == 0x00001C, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_X1) == 0x00002C, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_Y1) == 0x000030, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_BreakVector_Z1) == 0x000034, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_MakeVector_ReturnValue2) == 0x000038, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer, CallFunc_MakeVector_ReturnValue3) == 0x000044, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ExecuteUbergraph_BP_AJBDebugAIEnvironmentVisualizer::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");

// Function BP_AJBDebugAIEnvironmentVisualizer.BP_AJBDebugAIEnvironmentVisualizer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick");
static_assert(sizeof(BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBDebugAIEnvironmentVisualizer.BP_AJBDebugAIEnvironmentVisualizer_C.SetShowDebugStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus) == 0x000001, "Wrong alignment on BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus");
static_assert(sizeof(BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus) == 0x000001, "Wrong size on BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus");
static_assert(offsetof(BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus, bShow) == 0x000000, "Member 'BP_AJBDebugAIEnvironmentVisualizer_C_SetShowDebugStatus::bShow' has a wrong offset!");

}

