#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOnlineBeaconClient

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBOnlineBeaconClient.BP_AJBOnlineBeaconClient_C.ExecuteUbergraph_BP_AJBOnlineBeaconClient
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient) == 0x000004, "Wrong alignment on BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient");
static_assert(sizeof(BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient) == 0x000008, "Wrong size on BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient");
static_assert(offsetof(BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient, EntryPoint) == 0x000000, "Member 'BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_AJBOnlineBeaconClient_C_ExecuteUbergraph_BP_AJBOnlineBeaconClient::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_AJBOnlineBeaconClient.BP_AJBOnlineBeaconClient_C.IsJoinBeacon
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBOnlineBeaconClient_C_IsJoinBeacon final
{
public:
	bool                                          bRepJoined_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBOnlineBeaconClient_C_IsJoinBeacon) == 0x000001, "Wrong alignment on BP_AJBOnlineBeaconClient_C_IsJoinBeacon");
static_assert(sizeof(BP_AJBOnlineBeaconClient_C_IsJoinBeacon) == 0x000001, "Wrong size on BP_AJBOnlineBeaconClient_C_IsJoinBeacon");
static_assert(offsetof(BP_AJBOnlineBeaconClient_C_IsJoinBeacon, bRepJoined_0) == 0x000000, "Member 'BP_AJBOnlineBeaconClient_C_IsJoinBeacon::bRepJoined_0' has a wrong offset!");

}

