#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBattleGameMode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBattleGameMode.BP_AJBBattleGameMode_C.ExecuteUbergraph_BP_AJBBattleGameMode
// 0x0528 (0x0528 - 0x0000)
struct BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate;      // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate1;     // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable1;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableRedis_ReturnValue;                // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitializedNPC_ReturnValue;             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeStateFromGameMode_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitializedNPC_ReturnValue1;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_CurrentFlowState;     // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeOnlineBeacon_ReturnValue;       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSecond)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ChangeState_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGamePlayerController_C*> CallFunc_GetAllActorsOfClass_OutActors;           // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGamePlayerController_C*        CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameItem_SP_C*>         CallFunc_GetAllActorsOfClass_OutActors1;           // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns;                    // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         K2Node_CustomEvent_AreaTypeID;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate3;     // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGamePlayerController_C*        K2Node_CustomEvent_PlayerController;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasOption_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateObject_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateObject_ReturnValue1;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateObject_ReturnValue2;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateObject_ReturnValue3;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PrevState3;                     // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSecond3;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NextState2;                     // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeState_ReturnValue1;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PrevState2;                     // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PrevState1;                     // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSecond2;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckExitGame_ReturnValue;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_ExitingController;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x01E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State2; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PrevState;                      // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSecond1;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NextState1;                     // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers; // 0x0240(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_Array_Get_Item2;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers1; // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetControlledCharacter_AsBP_AJBIn_Game_Character; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_Array_Get_Item3;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller1; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacter_CharacterBP;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacter_bSuccess;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDeathAndEnd_ReturnValue;                // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State3; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate4;     // 0x02C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02E0(0x0008)(NoDestructor)
	bool                                          CallFunc_IsEnableRedis_ReturnValue1;               // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x02F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x0300(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_AJBInGameCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate7; // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSecond;                    // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGamePlayerController_C*> CallFunc_GetAllActorsOfClass_OutActors2;          // 0x0330(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsEnableRedis_ReturnValue2;               // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeState_ReturnValue2;                 // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue1;                         // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0368(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_TimespanTimespan_ReturnValue;     // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373[0x1];                                      // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInGameStartFadeOutTime_ReturnValue;    // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate8;     // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float DeltaSecond)>            K2Node_CreateDelegate_OutputDelegate9;             // 0x0398(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue2;         // 0x03B8(0x0008)(NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NextState;                      // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue3;         // 0x03D8(0x0008)(NoDestructor)
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate12;    // 0x03E0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDamageAreaParamInitialized_bDamageAreaParamInitialized; // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State4; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaSecond)>            K2Node_CreateDelegate_OutputDelegate13;            // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ChangeState_ReturnValue3;                 // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns1;                   // 0x0430(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item4;                          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Revive_bSuccess;                          // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x044D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue1;                  // 0x044E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableRedis_ReturnValue3;               // 0x044F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Character;                      // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State5; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers2; // 0x0460(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_Array_Get_Item5;                          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller2; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B[0x5];                                      // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameWatcherCamera_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Watcher_Camera; // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& PrevState)> K2Node_CreateDelegate_OutputDelegate14;    // 0x04B0(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_AJBInGameItem_SP_C*                 CallFunc_Array_Get_Item6;                          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGameInstance_C*                  K2Node_DynamicCast_AsBP_AJBGame_Instance;          // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x04E0(0x0008)(NoDestructor)
	bool                                          CallFunc_PlayModeIsPair_ReturnValue;               // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetStageName_StartPoint_LevelName;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSecond)>            K2Node_CreateDelegate_OutputDelegate15;            // 0x0500(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameState_C*               CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State6; // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0523(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode) == 0x000008, "Wrong alignment on BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode");
static_assert(sizeof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode) == 0x000528, "Wrong size on BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, EntryPoint) == 0x000000, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_IsShipping_ReturnValue) == 0x000004, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_bool_True_if_break_was_hit_Variable) == 0x000006, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Not_PreBool_ReturnValue1) == 0x00000C, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Array_Index_Variable1) == 0x000010, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_bool_Has_Been_Initd_Variable) == 0x000029, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_IsDedicatedServer_ReturnValue) == 0x00002A, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Loop_Counter_Variable1) == 0x000048, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Array_Index_Variable2) == 0x00004C, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Add_IntInt_ReturnValue1) == 0x000050, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_bool_True_if_break_was_hit_Variable1) == 0x000054, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_bool_True_if_break_was_hit_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Not_PreBool_ReturnValue2) == 0x000055, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_IsEnableRedis_ReturnValue) == 0x000056, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_IsEnableRedis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_IsInitializedNPC_ReturnValue) == 0x000057, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_IsInitializedNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_ChangeStateFromGameMode_ReturnValue) == 0x000059, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_ChangeStateFromGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_IsInitializedNPC_ReturnValue1) == 0x00005A, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_IsInitializedNPC_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetCurrentFlowState_CurrentFlowState) == 0x000060, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetCurrentFlowState_CurrentFlowState' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAJBGameInstance_bSuccess) == 0x000068, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000070, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000078, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_BooleanAND_ReturnValue1) == 0x000079, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_InitializeOnlineBeacon_ReturnValue) == 0x00007A, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_InitializeOnlineBeacon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CreateDelegate_OutputDelegate2) == 0x000080, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_ChangeState_ReturnValue) == 0x000090, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_ChangeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAllActorsOfClass_OutActors) == 0x000098, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAllActorsOfClass_OutActors1) == 0x0000B8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Loop_Counter_Variable2) == 0x0000C8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Array_Length_ReturnValue1) == 0x0000CC, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Add_IntInt_ReturnValue2) == 0x0000D0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Loop_Counter_Variable3) == 0x0000D4, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Add_IntInt_ReturnValue3) == 0x0000D8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Array_Index_Variable3) == 0x0000DC, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State) == 0x0000E0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetJoinPawns_OutPawns) == 0x0000E8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetJoinPawns_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_AreaTypeID) == 0x0000F8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_AreaTypeID' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Array_Get_Item1) == 0x000100, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Array_Length_ReturnValue2) == 0x000108, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAJBGameInstance_bSuccess1) == 0x00010C, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000110, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CreateDelegate_OutputDelegate3) == 0x000118, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_PlayerController) == 0x000128, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State1) == 0x000130, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_HasOption_ReturnValue) == 0x000138, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_HasOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Array_Index_Variable4) == 0x00013C, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_FindStateObject_ReturnValue) == 0x000140, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_FindStateObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_FindStateObject_ReturnValue1) == 0x000148, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_FindStateObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_FindStateObject_ReturnValue2) == 0x000150, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_FindStateObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_FindStateObject_ReturnValue3) == 0x000158, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_FindStateObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_PrevState3) == 0x000160, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_PrevState3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_DeltaSecond3) == 0x000168, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_DeltaSecond3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_NextState2) == 0x000170, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_NextState2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_ChangeState_ReturnValue1) == 0x000178, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_ChangeState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_PrevState2) == 0x000180, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_PrevState2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_PrevState1) == 0x000188, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_PrevState1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_CustomEvent_DeltaSecond2) == 0x000190, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_CustomEvent_DeltaSecond2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_CheckExitGame_ReturnValue) == 0x000194, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_CheckExitGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, Temp_int_Loop_Counter_Variable4) == 0x000198, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Less_IntInt_ReturnValue1) == 0x00019C, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Add_IntInt_ReturnValue4) == 0x0001A0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_Event_ExitingController) == 0x0001A8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_Event_ExitingController' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_Event_NewPlayer) == 0x0001B0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_DynamicCast_AsPlayer_Controller) == 0x0001B8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Concat_StrStr_ReturnValue) == 0x0001C8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Conv_ByteToString_ReturnValue) == 0x0001D8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Now_ReturnValue) == 0x0001E8, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Concat_StrStr_ReturnValue1) == 0x0001F0, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_Concat_StrStr_ReturnValue2) == 0x000200, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode, CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State2) == 0x000210, "Member 'BP_AJBBattleGameMode_C_ExecuteUbergraph_BP_AJBBattleGameMode::CallFunc_GetBattleGameState_AsBP_AJBBattle_Game_State2' has a wrong offset!");
