#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRedBindSkill

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.ExecuteUbergraph_BP_AJBRedBindSkill
// 0x0210 (0x0210 - 0x0000)
struct BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlacement;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_MGR_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_MGR;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00AC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_GetGameplayTags_self_CastInput; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0128(0x0020)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPossiblePlacement;                   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DuringTheWorld_Result;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0xE];                                      // 0x0162(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Transform;                            // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GenerateSerialNumber_SerialNumber;        // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAddPassive_bShouldAddPassive;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable1;                             // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill) == 0x000010, "Wrong alignment on BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill");
static_assert(sizeof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill) == 0x000210, "Wrong size on BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, EntryPoint) == 0x000000, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_bPlacement) == 0x000004, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_Actor) == 0x000008, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_Operator) == 0x000010, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_Time) == 0x000018, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_Timing) == 0x00001C, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_bEnable) == 0x00001D, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_bOperatorIsEmpty) == 0x00001E, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000030, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000038, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_bool_Variable) == 0x000041, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000048, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000050, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess1) == 0x000058, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000060, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_MGR) == 0x000068, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_MGR' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000078, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess3) == 0x000080, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000084, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000090, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x0000A0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x0000A8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000AC, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x0000C4, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_VSize_ReturnValue) == 0x0000C8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_float_Variable) == 0x0000CC, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000E0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0000E8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_MakeVector_ReturnValue1) == 0x0000F0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000100, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess4) == 0x000108, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000109, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000110, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetGameplayTags_self_CastInput) == 0x000118, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000128, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwner_ReturnValue) == 0x000148, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_HasTag_ReturnValue) == 0x000150, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_bPossiblePlacement) == 0x000151, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_DuringTheWorld_Result) == 0x000152, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_DuringTheWorld_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_struct_Variable) == 0x000158, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000161, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_Transform) == 0x000170, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Event_TargetActor) == 0x0001A0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Event_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0001A8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess5) == 0x0001B8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0001C0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_DynamicCast_bSuccess6) == 0x0001C8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GenerateSerialNumber_SerialNumber) == 0x0001CC, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GenerateSerialNumber_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_GetOwner_ReturnValue1) == 0x0001D0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_ShouldAddPassive_bShouldAddPassive) == 0x0001D8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_ShouldAddPassive_bShouldAddPassive' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_struct_Variable1) == 0x0001E0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_bool_Variable1) == 0x0001E8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, Temp_float_Variable1) == 0x0001EC, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Select_Default) == 0x0001F0, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, K2Node_Select1_Default) == 0x0001F8, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000200, "Member 'BP_AJBRedBindSkill_C_ExecuteUbergraph_BP_AJBRedBindSkill::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.OnSpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRedBindSkill_C_OnSpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRedBindSkill_C_OnSpawnObject) == 0x000008, "Wrong alignment on BP_AJBRedBindSkill_C_OnSpawnObject");
static_assert(sizeof(BP_AJBRedBindSkill_C_OnSpawnObject) == 0x000010, "Wrong size on BP_AJBRedBindSkill_C_OnSpawnObject");
static_assert(offsetof(BP_AJBRedBindSkill_C_OnSpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBRedBindSkill_C_OnSpawnObject::bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_OnSpawnObject, Actor) == 0x000008, "Member 'BP_AJBRedBindSkill_C_OnSpawnObject::Actor' has a wrong offset!");

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.SpawnNewObject
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBRedBindSkill_C_SpawnNewObject final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 TargetActor;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRedBindSkill_C_SpawnNewObject) == 0x000010, "Wrong alignment on BP_AJBRedBindSkill_C_SpawnNewObject");
static_assert(sizeof(BP_AJBRedBindSkill_C_SpawnNewObject) == 0x000040, "Wrong size on BP_AJBRedBindSkill_C_SpawnNewObject");
static_assert(offsetof(BP_AJBRedBindSkill_C_SpawnNewObject, Transform) == 0x000000, "Member 'BP_AJBRedBindSkill_C_SpawnNewObject::Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_SpawnNewObject, TargetActor) == 0x000030, "Member 'BP_AJBRedBindSkill_C_SpawnNewObject::TargetActor' has a wrong offset!");

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.ShouldAddPassive
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBRedBindSkill_C_ShouldAddPassive final
{
public:
	class AAJBInGameCharacterBase*                DamagedCharacterBase;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAddPassive;                                 // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDisablePassive_bDisablePassive;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCritical_IsCritical;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRedBindSkill_C_ShouldAddPassive) == 0x000008, "Wrong alignment on BP_AJBRedBindSkill_C_ShouldAddPassive");
static_assert(sizeof(BP_AJBRedBindSkill_C_ShouldAddPassive) == 0x000040, "Wrong size on BP_AJBRedBindSkill_C_ShouldAddPassive");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, DamagedCharacterBase) == 0x000000, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::DamagedCharacterBase' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, DamageCauser) == 0x000008, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, bShouldAddPassive) == 0x000010, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::bShouldAddPassive' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, K2Node_DynamicCast_AsBI_AJBInterface) == 0x000018, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::K2Node_DynamicCast_AsBI_AJBInterface' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, CallFunc_CheckDisablePassive_bDisablePassive) == 0x000029, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::CallFunc_CheckDisablePassive_bDisablePassive' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_ShouldAddPassive, CallFunc_IsCritical_IsCritical) == 0x000039, "Member 'BP_AJBRedBindSkill_C_ShouldAddPassive::CallFunc_IsCritical_IsCritical' has a wrong offset!");

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.CheckAnyExclusionPassiveActive
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValid;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBActionBase_C*                    K2Node_DynamicCast_AsBP_AJBAction_Base;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive) == 0x000008, "Wrong alignment on BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive");
static_assert(sizeof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive) == 0x000048, "Wrong size on BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, Target) == 0x000000, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::Target' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, bValid) == 0x000008, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::bValid' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, K2Node_DynamicCast_AsBP_AJBAction_Base) == 0x000038, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::K2Node_DynamicCast_AsBP_AJBAction_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_CheckActive_bActive) == 0x000041, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_AJBRedBindSkill_C_CheckAnyExclusionPassiveActive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBRedBindSkill.BP_AJBRedBindSkill_C.TraceObjectTransform
// 0x02D0 (0x02D0 - 0x0000)
struct BP_AJBRedBindSkill_C_TraceObjectTransform final
{
public:
	bool                                          bPossiblePlacement_0;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	class AActor*                                 TargetActor;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TempTransform;                                     // 0x0050(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FVector                                TempTraceEndLocation;                              // 0x0080(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempTraceStartLocation;                            // 0x008C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_AJBMultiSphereTraceForObjects_OutHits;    // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_AJBMultiSphereTraceForObjects_ReturnValue; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_Barrier_C>         K2Node_DynamicCast_AsBI_Barrier;                   // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStopDirectAttackGuide_bIsStop;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameWindow_C*                  K2Node_DynamicCast_AsBP_AJBIn_Game_Window;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAddPassive_bShouldAddPassive;       // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAnyExclusionPassiveActive_bValid;    // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPair_bPairCharacter;                    // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0xF];                                      // 0x0241(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterCondition_bIgnore;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTraceInfo_bTracable;                   // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTraceInfo_TraceStartLocation;          // 0x0284(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTraceInfo_TraceEndLocation;            // 0x0290(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRedBindSkill_C_TraceObjectTransform) == 0x000010, "Wrong alignment on BP_AJBRedBindSkill_C_TraceObjectTransform");
static_assert(sizeof(BP_AJBRedBindSkill_C_TraceObjectTransform) == 0x0002D0, "Wrong size on BP_AJBRedBindSkill_C_TraceObjectTransform");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, bPossiblePlacement_0) == 0x000000, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::bPossiblePlacement_0' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, Transform) == 0x000010, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, TargetActor) == 0x000040, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, TempTransform) == 0x000050, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::TempTransform' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, TempTraceEndLocation) == 0x000080, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::TempTraceEndLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, TempTraceStartLocation) == 0x00008C, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::TempTraceStartLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, CallFunc_GetOwner_ReturnValue1) == 0x0000A8, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0000B0, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000B8, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBRedBindSkill_C_TraceObjectTransform, CallFunc_AJBMultiSphereTraceForObjects_OutHits) == 0x0000D8, "Member 'BP_AJBRedBindSkill_C_TraceObjectTransform::CallFunc_AJBMultiSphereTraceForObjects_OutHits' has a wrong offset!");
