#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPlacementDynamicBase

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.ExecuteUbergraph_BP_AJBPlacementDynamicBase
// 0x0260 (0x0260 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBeBroken;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOtherCharacter;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue1;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bBeBroken1;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOtherCharacter1;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamagedActor;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DamageForHPAP;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DamageForAAP;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CutDamage;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_DamageType;                           // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SerialNumber;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePriority                               K2Node_Event_DamagePriority;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AttackDistance;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WithSeparatedStandAttack;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_HitEnemysSeparatedStand;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrateAP;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNotUseCollision;                     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsEndured;                            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBDamageDisplayParams                K2Node_Event_DamageDisplayParams;                  // 0x0050(0x0030)(NoDestructor)
	struct FAJBDamageDisplayProperty              K2Node_Event_DamageDisplayProperty;                // 0x0080(0x0003)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConsumeDamage_EffectiveDamage;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_EffectiveValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageCauser1;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPenetrating;                         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_FactorTag;                            // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInvalidDamage;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPair_bPairCharacter;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0120(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x012C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsBroken;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue2;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBroken_bIsBroken;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBroken_bIsBroken1;                      // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken1;           // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue3;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue4;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue5;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue3;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect2; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue6;          // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue4;         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x0210(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue5;         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue1;     // 0x0238(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue5;     // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect3; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase) == 0x000008, "Wrong alignment on BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase) == 0x000260, "Wrong size on BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, EntryPoint) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_bBeBroken) == 0x000004, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_bBeBroken' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_bOtherCharacter) == 0x000005, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_bOtherCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000006, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue1) == 0x000007, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_bBeBroken1) == 0x000008, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_bBeBroken1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_bOtherCharacter1) == 0x000009, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_bOtherCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamagedActor) == 0x000010, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamagedActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageForHPAP) == 0x000018, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageForHPAP' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageForAAP) == 0x00001C, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageForAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_CutDamage) == 0x000020, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_CutDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageType) == 0x000028, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_SerialNumber) == 0x000030, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamagePriority) == 0x000034, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamagePriority' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_AttackDistance) == 0x000038, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_AttackDistance' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageCauser) == 0x000040, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_WithSeparatedStandAttack) == 0x000048, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_WithSeparatedStandAttack' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_HitEnemysSeparatedStand) == 0x000049, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_HitEnemysSeparatedStand' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bPenetrateAP) == 0x00004A, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bPenetrateAP' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bNotUseCollision) == 0x00004B, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_IsEndured) == 0x00004C, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_IsEndured' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageDisplayParams) == 0x000050, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageDisplayParams' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageDisplayProperty) == 0x000080, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageDisplayProperty' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_ConsumeDamage_EffectiveDamage) == 0x000084, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_ConsumeDamage_EffectiveDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsValid_ReturnValue1) == 0x000089, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000090, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000098, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x0000A8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x0000B0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsValid_ReturnValue2) == 0x0000BC, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_Operator) == 0x0000C0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_Time) == 0x0000C8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_Timing) == 0x0000CC, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bEnable) == 0x0000CD, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bOperatorIsEmpty) == 0x0000CE, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_EffectiveValue) == 0x0000D0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_EffectiveValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_GetOwner_ReturnValue) == 0x0000D8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000E0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_DamageCauser1) == 0x0000F0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_HitLocation) == 0x0000F8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bPenetrating) == 0x000104, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bPenetrating' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_FactorTag) == 0x000108, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_FactorTag' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_bInvalidDamage) == 0x000110, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_bInvalidDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000111, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsPair_bPairCharacter) == 0x000112, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsPair_bPairCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000113, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_BooleanOR_ReturnValue) == 0x000114, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_Not_PreBool_ReturnValue) == 0x000115, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue2) == 0x000118, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000120, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x00012C, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CustomEvent_bIsBroken) == 0x000138, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CustomEvent_bIsBroken' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000140, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue2) == 0x000148, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsBroken_bIsBroken) == 0x000149, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsBroken_bIsBroken' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_BooleanAND_ReturnValue) == 0x00014A, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsBroken_bIsBroken1) == 0x00014B, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsBroken_bIsBroken1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_GetOwner_ReturnValue1) == 0x000150, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsServer_ReturnValue) == 0x000158, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000160, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_bSuccess1) == 0x000168, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000169, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_TryToSpeakVoice_bWillBeSpoken1) == 0x00016A, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_TryToSpeakVoice_bWillBeSpoken1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_GetOwner_ReturnValue2) == 0x000170, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000178, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_bSuccess2) == 0x000180, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_float_Variable) == 0x000184, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_GetOwner_ReturnValue3) == 0x000188, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000190, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_bSuccess3) == 0x000198, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue3) == 0x000199, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_HasLocalSharedController_ReturnValue) == 0x00019A, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_bool_Has_Been_Initd_Variable) == 0x00019B, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsServer_ReturnValue1) == 0x00019C, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect1) == 0x0001A0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsValid_ReturnValue3) == 0x0001A8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue4) == 0x0001A9, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001AA, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_float_Variable1) == 0x0001AC, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_bool_IsClosed_Variable) == 0x0001B0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue5) == 0x0001B1, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0001B2, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_bool_IsClosed_Variable1) == 0x0001B3, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_bool_Variable) == 0x0001B4, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Select_Default) == 0x0001B8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsValid_ReturnValue4) == 0x0001BC, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_GetOwner_ReturnValue4) == 0x0001C0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue3) == 0x0001C8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x0001D0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_DynamicCast_bSuccess4) == 0x0001D8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue3) == 0x0001DC, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect2) == 0x0001E8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0001F0, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, Temp_bool_Has_Been_Initd_Variable1) == 0x0001F1, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsGameplayTagValid_ReturnValue6) == 0x0001F2, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsGameplayTagValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0001F3, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_CreateDelegate_OutputDelegate) == 0x0001F8, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue4) == 0x000208, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue4) == 0x000210, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000220, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000228, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetRootComponent_ReturnValue5) == 0x000230, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetRootComponent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentRotation_ReturnValue1) == 0x000238, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentRotation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_K2_GetComponentLocation_ReturnValue5) == 0x000244, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_K2_GetComponentLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect3) == 0x000250, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase, K2Node_Event_EndPlayReason) == 0x000258, "Member 'BP_AJBPlacementDynamicBase_C_ExecuteUbergraph_BP_AJBPlacementDynamicBase::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AJBPlacementDynamicBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AJBPlacementDynamicBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.MC_NotifyDamage
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_MC_NotifyDamage final
{
public:
	bool                                          bIsBroken;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_MC_NotifyDamage) == 0x000001, "Wrong alignment on BP_AJBPlacementDynamicBase_C_MC_NotifyDamage");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_MC_NotifyDamage) == 0x000001, "Wrong size on BP_AJBPlacementDynamicBase_C_MC_NotifyDamage");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_MC_NotifyDamage, bIsBroken) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_MC_NotifyDamage::bIsBroken' has a wrong offset!");

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.ROC_NotifyDamage
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage final
{
public:
	int32                                         EffectiveValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage) == 0x000004, "Wrong alignment on BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage) == 0x000004, "Wrong size on BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage, EffectiveValue) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_ROC_NotifyDamage::EffectiveValue' has a wrong offset!");

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.BeginStateClearing_Dynamic
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic final
{
public:
	bool                                          bBeBroken;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOtherCharacter;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic) == 0x000001, "Wrong alignment on BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic) == 0x000002, "Wrong size on BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic, bBeBroken) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic::bBeBroken' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic, bOtherCharacter) == 0x000001, "Member 'BP_AJBPlacementDynamicBase_C_BeginStateClearing_Dynamic::bOtherCharacter' has a wrong offset!");

// Function BP_AJBPlacementDynamicBase.BP_AJBPlacementDynamicBase_C.ROC_OnDamage
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBPlacementDynamicBase_C_ROC_OnDamage final
{
public:
	bool                                          bBeBroken;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOtherCharacter;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPlacementDynamicBase_C_ROC_OnDamage) == 0x000001, "Wrong alignment on BP_AJBPlacementDynamicBase_C_ROC_OnDamage");
static_assert(sizeof(BP_AJBPlacementDynamicBase_C_ROC_OnDamage) == 0x000002, "Wrong size on BP_AJBPlacementDynamicBase_C_ROC_OnDamage");
static_assert(offsetof(BP_AJBPlacementDynamicBase_C_ROC_OnDamage, bBeBroken) == 0x000000, "Member 'BP_AJBPlacementDynamicBase_C_ROC_OnDamage::bBeBroken' has a wrong offset!");
