#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGamePlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.ExecuteUbergraph_BP_AJBInGamePlayerCameraManager
// 0x0158 (0x0158 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         Temp_float_Variable3;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable4;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     CallFunc_Array_Get_Item1;                          // 0x0078(0x0010)(NoDestructor)
	struct FWeightedBlendable                     K2Node_SetFieldsInStruct_StructOut;                // 0x0088(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable5;                              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue1;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue1;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDamageAreaLocal_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Exists_bExists;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InDamageArea_ReturnValue;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InDamageArea_ReturnValue1;                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDamageAreaLocal_C*               CallFunc_GetComponentByClass_ReturnValue1;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DamageAreaAvailable_ReturnValue;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable6;                              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable1;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager) == 0x000008, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager) == 0x000158, "Wrong size on BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, EntryPoint) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable) == 0x00000C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable1) == 0x000010, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000014, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x000015, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Has_Been_Initd_Variable) == 0x000016, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable2) == 0x000018, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_IsClosed_Variable) == 0x00001C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Variable) == 0x00001D, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_IsClosed_Variable1) == 0x00001E, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Has_Been_Initd_Variable1) == 0x00001F, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Variable1) == 0x000020, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetAllActorsWithTag_OutActors) == 0x000028, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable3) == 0x000038, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_DynamicCast_AsPost_Process_Volume) == 0x000048, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable4) == 0x00005C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Variable2) == 0x000064, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Has_Been_Initd_Variable2) == 0x000065, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_CustomEvent_Enable) == 0x000066, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000068, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000070, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_IsClosed_Variable2) == 0x000072, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Array_Get_Item1) == 0x000078, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_SetFieldsInStruct_StructOut) == 0x000088, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Array_Length_ReturnValue1) == 0x000098, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetCameraLocation_ReturnValue) == 0x00009C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Less_IntInt_ReturnValue1) == 0x0000A8, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable5) == 0x0000AC, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000B0, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetOwningPlayerController_ReturnValue1) == 0x0000B8, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetOwningPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetViewTarget_ReturnValue) == 0x0000C0, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetPlayerController_ReturnValue) == 0x0000C8, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000DC, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_BooleanAND_ReturnValue) == 0x0000DD, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_BooleanAND_ReturnValue1) == 0x0000DE, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_Select_Default) == 0x0000E0, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetGameState_ReturnValue) == 0x0000E8, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x0000F0, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_DynamicCast_bSuccess1) == 0x0000F8, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetGameState_ReturnValue1) == 0x000100, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetGameState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000108, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_Exists_bExists) == 0x000110, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_Exists_bExists' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_InDamageArea_ReturnValue) == 0x000111, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_InDamageArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_InDamageArea_ReturnValue1) == 0x000112, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_InDamageArea_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetGameState_ReturnValue2) == 0x000118, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_BooleanOR_ReturnValue) == 0x000120, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_GetComponentByClass_ReturnValue1) == 0x000128, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_IsValid_ReturnValue1) == 0x000130, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_DamageAreaAvailable_ReturnValue) == 0x000131, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_DamageAreaAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_float_Variable6) == 0x000134, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_float_Variable6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_CustomEvent_bEnable1) == 0x000138, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_CustomEvent_bEnable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, Temp_bool_Variable3) == 0x000139, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_Select1_Default) == 0x00013C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_CustomEvent_bEnable) == 0x000140, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_Select2_Default) == 0x000144, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_FInterpTo_ReturnValue) == 0x000148, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00014C, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager, K2Node_Select3_Default) == 0x000150, "Member 'BP_AJBInGamePlayerCameraManager_C_ExecuteUbergraph_BP_AJBInGamePlayerCameraManager::K2Node_Select3_Default' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.ChangeBitesTheDustEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect) == 0x000001, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect) == 0x000001, "Wrong size on BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect, bEnable) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_ChangeBitesTheDustEffect::bEnable' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.ChangeCrimsonDimensionEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect) == 0x000001, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect) == 0x000001, "Wrong size on BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect, bEnable) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_ChangeCrimsonDimensionEffect::bEnable' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.ChangeTheWorldEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect) == 0x000001, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect) == 0x000001, "Wrong size on BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect, Enable) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_ChangeTheWorldEffect::Enable' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_ReceiveTick");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBInGamePlayerCameraManager_C_ReceiveTick");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.SetPostProcessMaterialBlendWeight
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Weight;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight) == 0x000004, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight) == 0x00000C, "Wrong size on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight, MaterialIndex) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight::MaterialIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight, Weight) == 0x000004, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight::Weight' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000009, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialBlendWeight::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.SetPostProcessMaterialObject
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoInsert;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTempInsert;                                       // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExistPostProcessMaterialFromIndex_bExist; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0028(0x0010)(NoDestructor)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable1;              // 0x0038(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(NoDestructor)
	bool                                          CallFunc_CompareParentMaterial_bMatch;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject) == 0x000008, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject) == 0x000068, "Wrong size on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, MaterialIndex) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::MaterialIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, Object) == 0x000008, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::Object' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, bAutoInsert) == 0x000010, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::bAutoInsert' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, bTempInsert) == 0x000011, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::bTempInsert' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_CheckExistPostProcessMaterialFromIndex_bExist) == 0x000012, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_CheckExistPostProcessMaterialFromIndex_bExist' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Not_PreBool_ReturnValue1) == 0x000019, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, Temp_int_Variable) == 0x00001C, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, K2Node_MakeStruct_WeightedBlendable) == 0x000028, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, K2Node_MakeStruct_WeightedBlendable1) == 0x000038, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::K2Node_MakeStruct_WeightedBlendable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_CompareParentMaterial_bMatch) == 0x000060, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_CompareParentMaterial_bMatch' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000061, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterialObject::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.SetPostProcessMaterial
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial final
{
public:
	class UMaterialInterface*                     PostProcessMaterial;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PostProcesIndex;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResultMaterialIndex;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial) == 0x000008, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial) == 0x000040, "Wrong size on BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, PostProcessMaterial) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::PostProcessMaterial' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, PostProcesIndex) == 0x000008, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::PostProcesIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, IsEnable) == 0x00000C, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::IsEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, ResultMaterialIndex) == 0x000010, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::ResultMaterialIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, K2Node_MakeStruct_WeightedBlendable) == 0x000018, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00002C, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_Array_Find_ReturnValue) == 0x000034, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BP_AJBInGamePlayerCameraManager_C_SetPostProcessMaterial::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C.PrepareDamageAreaDynamicMaterialInstance
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance final
{
public:
	struct FWeightedBlendable                     CallFunc_Array_Get_Item;                           // 0x0000(0x0010)(NoDestructor)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance) == 0x000008, "Wrong alignment on BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance");
static_assert(sizeof(BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance) == 0x000028, "Wrong size on BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance, CallFunc_Array_Get_Item) == 0x000000, "Member 'BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance, K2Node_DynamicCast_AsMaterial_Interface) == 0x000010, "Member 'BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGamePlayerCameraManager_C_PrepareDamageAreaDynamicMaterialInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
