#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_DOH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_DOH.BP_AJBInGameCharacter_DOH_C
// 0x00A0 (0x1850 - 0x17B0)
class ABP_AJBInGameCharacter_DOH_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_DOH_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBMostHigh_C*                      BP_AJBMostHigh;                                    // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRRForceSkyMoveDVManager_C*       BP_AJBRRForceSkyMoveDVManager;                     // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRuthlessBloodsuck_C*             BP_AJBRuthlessBloodsuck;                           // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRoadRollerSkill_C*               BP_AJBRoadRollerSkill;                             // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGlimpseOfForceSkill_C*           BP_AJBGlimpseOfForceSkill;                         // 0x17D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBMudaRushWLDSill_C*               BP_AJBWRYRushWLDSill;                              // 0x17D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyWLDSkill_C*             BP_AJBAccompanyWLDSkill;                           // 0x17E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Lookup_Rotation_Rate_DFB5AE1E44D23071B27BB1B07FE25FE9; // 0x17E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Lookup__Direction_DFB5AE1E44D23071B27BB1B07FE25FE9; // 0x17EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17ED[0x3];                                     // 0x17ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Lookup;                        // 0x17F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Start_Rotation_Rate_0BE103434AA1AEA1855C948D6960E9F6; // 0x17F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Start__Direction_0BE103434AA1AEA1855C948D6960E9F6; // 0x17FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17FD[0x3];                                     // 0x17FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Start;                         // 0x1800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_End__Direction_D3A98B734A124BBD817194AFC70176A5; // 0x1808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1809[0x7];                                     // 0x1809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_End;                           // 0x1810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Finish__Direction_6C1D7BC942571857ED7CB98ADBA301C1; // 0x1818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1819[0x7];                                     // 0x1819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Finish;                        // 0x1820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_FullAttack__Direction_EBFC46974C105E8E89FFC4A4A5B58174; // 0x1828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1829[0x7];                                     // 0x1829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_FullAttack;                    // 0x1830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Landing_Rotation_Pitch_52E0FA2D4B81F71871C674BBB74985EF; // 0x1838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Landing__Direction_52E0FA2D4B81F71871C674BBB74985EF; // 0x183C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183D[0x3];                                     // 0x183D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Landing;                       // 0x1840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseRootBoneRotationOnRoadRoller;                  // 0x1848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1849[0x3];                                     // 0x1849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionBeforePitch;                              // 0x184C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_DOH(int32 EntryPoint);
	void BeginRoadRollerDirection_End();
	void BeginRoadRollerDirection_Finish();
	void BeginRoadRollerDirection_FullAttack();
	void BeginRoadRollerDirection_Landing();
	void BeginRoadRollerDirection_Lookup();
	void BeginRoadRollerDirection_Start();
	void RoadRollerDirection_Lookup__UpdateFunc();
	void RoadRollerDirection_Lookup__FinishedFunc();
	void RoadRollerDirection_Start__UpdateFunc();
	void RoadRollerDirection_Start__FinishedFunc();
	void RoadRollerDirection_End__UpdateFunc();
	void RoadRollerDirection_End__FinishedFunc();
	void RoadRollerDirection_Finish__UpdateFunc();
	void RoadRollerDirection_Finish__FinishedFunc();
	void RoadRollerDirection_FullAttack__UpdateFunc();
	void RoadRollerDirection_FullAttack__FinishedFunc();
	void RoadRollerDirection_Landing__UpdateFunc();
	void RoadRollerDirection_Landing__FinishedFunc();
	void GetCurrentRotatePitch(float* Pitch);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void OnReleasedInteract();
	void OnReleasedCrouch();
	void OnPressedCrouch();
	void OnPressedJump();
	void OnReleasedJump();
	void PressedButton_Ultimate();
	void PressedButton_Basic();
	void ROC_GiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageReceiver, bool RemainHP, bool DamageIsCut, int32 SerialNumber, bool DamageReceiverIsPlayer, bool bWithSeparatedStandAttack, bool bHitEnemysSeparateStand, bool bSelfDamage, bool IsEndured);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void ConsumeGrowup(const struct FGameplayTag& Growup, float Value, float TotalValue, const class FText& SpecifiedText, bool bRewind, int32 CurrentSP);
	void OnBeforeInteract(bool* bShouldInteract);
	void ShouldRecordHistoryReplayServer(bool* bShouldRecord);
	void CheckErrorConditionOperator(class AActor* InteractActor, bool* bErrorCondition, uint8* ErrorType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_DOH_C">();
	}
	static class ABP_AJBInGameCharacter_DOH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_DOH_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_DOH_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_DOH_C");
static_assert(sizeof(ABP_AJBInGameCharacter_DOH_C) == 0x001850, "Wrong size on ABP_AJBInGameCharacter_DOH_C");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, UberGraphFrame_BP_AJBInGameCharacter_DOH_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_DOH_C::UberGraphFrame_BP_AJBInGameCharacter_DOH_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBMostHigh) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBMostHigh' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBRRForceSkyMoveDVManager) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBRRForceSkyMoveDVManager' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBRuthlessBloodsuck) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBRuthlessBloodsuck' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBRoadRollerSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBRoadRollerSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBGlimpseOfForceSkill) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBGlimpseOfForceSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBWRYRushWLDSill) == 0x0017D8, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBWRYRushWLDSill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, BP_AJBAccompanyWLDSkill) == 0x0017E0, "Member 'ABP_AJBInGameCharacter_DOH_C::BP_AJBAccompanyWLDSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Lookup_Rotation_Rate_DFB5AE1E44D23071B27BB1B07FE25FE9) == 0x0017E8, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Lookup_Rotation_Rate_DFB5AE1E44D23071B27BB1B07FE25FE9' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Lookup__Direction_DFB5AE1E44D23071B27BB1B07FE25FE9) == 0x0017EC, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Lookup__Direction_DFB5AE1E44D23071B27BB1B07FE25FE9' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Lookup) == 0x0017F0, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Lookup' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Start_Rotation_Rate_0BE103434AA1AEA1855C948D6960E9F6) == 0x0017F8, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Start_Rotation_Rate_0BE103434AA1AEA1855C948D6960E9F6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Start__Direction_0BE103434AA1AEA1855C948D6960E9F6) == 0x0017FC, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Start__Direction_0BE103434AA1AEA1855C948D6960E9F6' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Start) == 0x001800, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Start' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_End__Direction_D3A98B734A124BBD817194AFC70176A5) == 0x001808, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_End__Direction_D3A98B734A124BBD817194AFC70176A5' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_End) == 0x001810, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_End' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Finish__Direction_6C1D7BC942571857ED7CB98ADBA301C1) == 0x001818, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Finish__Direction_6C1D7BC942571857ED7CB98ADBA301C1' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Finish) == 0x001820, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Finish' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_FullAttack__Direction_EBFC46974C105E8E89FFC4A4A5B58174) == 0x001828, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_FullAttack__Direction_EBFC46974C105E8E89FFC4A4A5B58174' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_FullAttack) == 0x001830, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_FullAttack' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Landing_Rotation_Pitch_52E0FA2D4B81F71871C674BBB74985EF) == 0x001838, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Landing_Rotation_Pitch_52E0FA2D4B81F71871C674BBB74985EF' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Landing__Direction_52E0FA2D4B81F71871C674BBB74985EF) == 0x00183C, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Landing__Direction_52E0FA2D4B81F71871C674BBB74985EF' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, RoadRollerDirection_Landing) == 0x001840, "Member 'ABP_AJBInGameCharacter_DOH_C::RoadRollerDirection_Landing' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, bUseRootBoneRotationOnRoadRoller) == 0x001848, "Member 'ABP_AJBInGameCharacter_DOH_C::bUseRootBoneRotationOnRoadRoller' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_DOH_C, DirectionBeforePitch) == 0x00184C, "Member 'ABP_AJBInGameCharacter_DOH_C::DirectionBeforePitch' has a wrong offset!");

}

