#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBActionLogSender_Character

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.ExecuteUbergraph_BP_AJBActionLogSender_Character
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerMatchingPlayerIndex;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairMatchingPlayerIndex;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionLogIndex2;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionLogIndex, const struct FGameplayTag& VoiceTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_PlayerIndex1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionLogIndex1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionLogIndex3;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_VoiceTag;                       // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionLogIndex;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeMessageTextByActionLog_Result;        // 0x0070(0x0018)()
	bool                                          CallFunc_MakeMessageTextByActionLog_bSuccess;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character) == 0x000008, "Wrong alignment on BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character) == 0x000090, "Wrong size on BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, EntryPoint) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_PlayerMatchingPlayerIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_PlayerMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_PairMatchingPlayerIndex) == 0x000008, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_PairMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_ActionLogIndex2) == 0x00000C, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_ActionLogIndex2' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_PlayerIndex1) == 0x000020, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_PlayerIndex1' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_ActionLogIndex1) == 0x000024, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_ActionLogIndex1' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000028, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000030, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_ActionLogIndex3) == 0x000038, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_ActionLogIndex3' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_VoiceTag) == 0x000040, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_VoiceTag' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_MakeLiteralInt_ReturnValue) == 0x000048, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000058, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_PlayerIndex) == 0x000064, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, K2Node_CustomEvent_ActionLogIndex) == 0x000068, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::K2Node_CustomEvent_ActionLogIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_MakeMessageTextByActionLog_Result) == 0x000070, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_MakeMessageTextByActionLog_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character, CallFunc_MakeMessageTextByActionLog_bSuccess) == 0x000088, "Member 'BP_AJBActionLogSender_Character_C_ExecuteUbergraph_BP_AJBActionLogSender_Character::CallFunc_MakeMessageTextByActionLog_bSuccess' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.PlayerSendMessage_Local
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionLogIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local) == 0x000004, "Wrong alignment on BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local) == 0x000008, "Wrong size on BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local, PlayerIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local, ActionLogIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_PlayerSendMessage_Local::ActionLogIndex' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.ROC_PlayerSendMessage
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionLogIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage) == 0x000004, "Wrong alignment on BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage) == 0x000008, "Wrong size on BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage, PlayerIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage, ActionLogIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_ROC_PlayerSendMessage::ActionLogIndex' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.ROS_PlayerSendMessage
// 0x000C (0x000C - 0x0000)
struct BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage final
{
public:
	int32                                         PlayerMatchingPlayerIndex;                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PairMatchingPlayerIndex;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionLogIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage) == 0x000004, "Wrong alignment on BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage) == 0x00000C, "Wrong size on BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage, PlayerMatchingPlayerIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage::PlayerMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage, PairMatchingPlayerIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage::PairMatchingPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage, ActionLogIndex) == 0x000008, "Member 'BP_AJBActionLogSender_Character_C_ROS_PlayerSendMessage::ActionLogIndex' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.OnPlayRadioChat
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBActionLogSender_Character_C_OnPlayRadioChat final
{
public:
	int32                                         ActionLogIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VoiceTag;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_OnPlayRadioChat) == 0x000008, "Wrong alignment on BP_AJBActionLogSender_Character_C_OnPlayRadioChat");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_OnPlayRadioChat) == 0x000010, "Wrong size on BP_AJBActionLogSender_Character_C_OnPlayRadioChat");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_OnPlayRadioChat, ActionLogIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_OnPlayRadioChat::ActionLogIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_OnPlayRadioChat, VoiceTag) == 0x000008, "Member 'BP_AJBActionLogSender_Character_C_OnPlayRadioChat::VoiceTag' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.SendLocalPair
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBActionLogSender_Character_C_SendLocalPair final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionLogIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_DynamicCast_AsAJBIn_Game_Character;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_SendLocalPair) == 0x000008, "Wrong alignment on BP_AJBActionLogSender_Character_C_SendLocalPair");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_SendLocalPair) == 0x000030, "Wrong size on BP_AJBActionLogSender_Character_C_SendLocalPair");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, PlayerIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, ActionLogIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::ActionLogIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, K2Node_DynamicCast_AsAJBIn_Game_Character) == 0x000010, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::K2Node_DynamicCast_AsAJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendLocalPair, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'BP_AJBActionLogSender_Character_C_SendLocalPair::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_AJBActionLogSender_Character.BP_AJBActionLogSender_Character_C.SendWatcherAndSpectator
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionLogIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGamePlayerController_C*> LPlayerControllers;                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameWatcherCamera_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Watcher_Camera; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator) == 0x000008, "Wrong alignment on BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator");
static_assert(sizeof(BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator) == 0x000090, "Wrong size on BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator, PlayerIndex) == 0x000000, "Member 'BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator, ActionLogIndex) == 0x000004, "Member 'BP_AJBActionLogSender_Character_C_SendWatcherAndSpectator::ActionLogIndex' has a wrong offset!");
