#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTutorialTriggerAggregator

#include "Basic.hpp"

#include "ETutorialType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_DamageInfo_structs.hpp"
#include "ST_TutorialMessageQueuedItem_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "ST_TutorialMessageInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBTutorialTriggerAggregator.BP_AJBTutorialTriggerAggregator_C.ExecuteUbergraph_BP_AJBTutorialTriggerAggregator
// 0x0308 (0x0308 - 0x0000)
struct BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue1;                         // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue3;                         // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable4;                                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue4;                         // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable5;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable5;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType1;                    // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByStatus1;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByAAP1;             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDamageInfo_bResult;                    // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FST_DamageInfo                         CallFunc_GetDamageInfo_DamageInfo;                 // 0x00F4(0x0003)(HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue1;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable6;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable7;                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_TriggerTag1;                    // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue2;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsRemainHP;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByStatus;           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByAAP;              // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable6;                      // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable8;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable7;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess;  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_TriggerTag;                     // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_IntParam;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LivingPlayerCount;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag2_CmpSuccess;  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkillType;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable8;                      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentHP;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_GionInfoBitMask;                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable9;                // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable10;               // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable9;                      // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16F[0x1];                                      // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue1;   // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue1;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue2;   // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue2;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable11;               // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue3;   // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue3;             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x01B0(0x0008)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue4;   // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue4;             // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable10;                     // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameHUD_C*                     K2Node_DynamicCast_AsBP_AJBIn_Game_HUD;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable11;                     // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable12;               // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable12;                     // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLivingPlayerCount_Count;               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue2;         // 0x0278(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue3;         // 0x02A0(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue4;         // 0x02A8(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue5;         // 0x02B0(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue6;         // 0x02C8(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue7;         // 0x02D0(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue8;         // 0x02D8(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue9;         // 0x02F8(0x0008)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator) == 0x000008, "Wrong alignment on BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator");
static_assert(sizeof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator) == 0x000308, "Wrong size on BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, EntryPoint) == 0x000000, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bEnable) == 0x000004, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Now_ReturnValue) == 0x000008, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable) == 0x000010, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Less_IntInt_ReturnValue) == 0x000019, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue1) == 0x00001C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable1) == 0x000020, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue2) == 0x000024, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Less_IntInt_ReturnValue1) == 0x000028, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Now_ReturnValue1) == 0x000030, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Now_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable) == 0x000039, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable1) == 0x000050, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable1) == 0x000051, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CreateDelegate_OutputDelegate1) == 0x000058, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable2) == 0x000068, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue3) == 0x000078, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Less_IntInt_ReturnValue2) == 0x00007C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Now_ReturnValue2) == 0x000080, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Now_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable2) == 0x000088, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable2) == 0x000089, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable3) == 0x00008C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Now_ReturnValue3) == 0x000090, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Now_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue4) == 0x000098, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Less_IntInt_ReturnValue3) == 0x00009C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable4) == 0x0000A0, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Now_ReturnValue4) == 0x0000A8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Now_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue5) == 0x0000B0, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable3) == 0x0000B4, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable3) == 0x0000B5, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue6) == 0x0000C8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000CC, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable4) == 0x0000CD, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable4) == 0x0000CE, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_int_Variable5) == 0x0000D0, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Add_IntInt_ReturnValue7) == 0x0000D4, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable5) == 0x0000D8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable5) == 0x0000D9, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DA, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_DamageType1) == 0x0000E0, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_DamageType1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_DamageCauser1) == 0x0000E8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bRemainHP) == 0x0000F0, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bDamageIsCutByStatus1) == 0x0000F1, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bDamageIsCutByStatus1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bDamageIsCutByAAP1) == 0x0000F2, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bDamageIsCutByAAP1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GetDamageInfo_bResult) == 0x0000F3, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GetDamageInfo_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GetDamageInfo_DamageInfo) == 0x0000F4, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GetDamageInfo_DamageInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_MatchesTag_ReturnValue) == 0x0000F7, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_MatchesTag_ReturnValue1) == 0x0000F8, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_MatchesTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable6) == 0x0000F9, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable6' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable7) == 0x0000FA, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable7' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_TriggerTag1) == 0x000100, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_TriggerTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_MatchesTag_ReturnValue2) == 0x000108, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_MatchesTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000109, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_DamageType) == 0x000110, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_DamageCauser) == 0x000118, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bIsRemainHP) == 0x000120, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bIsRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bDamageIsCutByStatus) == 0x000121, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bDamageIsCutByStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_bDamageIsCutByAAP) == 0x000122, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_bDamageIsCutByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable6) == 0x000123, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable6' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_MakeLiteralInt_ReturnValue) == 0x000124, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable8) == 0x000128, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable8' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable7) == 0x000129, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable7' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_Tag) == 0x000130, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess) == 0x000138, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::GameplayTagsK2Node_SwitchGameplayTag1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_TriggerTag) == 0x000140, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_TriggerTag' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_IntParam) == 0x000148, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_IntParam' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_LivingPlayerCount) == 0x00014C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_LivingPlayerCount' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, GameplayTagsK2Node_SwitchGameplayTag2_CmpSuccess) == 0x000150, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::GameplayTagsK2Node_SwitchGameplayTag2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_SkillType) == 0x000154, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_SkillType' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Conv_IntToByte_ReturnValue) == 0x000158, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GetValidValue_ReturnValue) == 0x000159, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015A, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x00015B, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable8) == 0x00015C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable8' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_CurrentHP) == 0x000160, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_CurrentHP' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, K2Node_CustomEvent_GionInfoBitMask) == 0x000164, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::K2Node_CustomEvent_GionInfoBitMask' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000168, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000169, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable9) == 0x00016A, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable9' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_Has_Been_Initd_Variable10) == 0x00016B, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_Has_Been_Initd_Variable10' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x00016C, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, Temp_bool_IsClosed_Variable9) == 0x00016D, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::Temp_bool_IsClosed_Variable9' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Not_PreBool_ReturnValue1) == 0x00016E, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000170, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator, CallFunc_GetTotalSeconds_ReturnValue) == 0x000178, "Member 'BP_AJBTutorialTriggerAggregator_C_ExecuteUbergraph_BP_AJBTutorialTriggerAggregator::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
