#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBExtendBPLock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBExtendBPLock.BP_AJBExtendBPLock_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBExtendBPLock_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UNetHttp*                               HttpObject;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ExtendTimer;                                       // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UNetHttp*                               ServerAliveHttp;                                   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ServerAliveTimer;                                  // 0x0110(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBExtendBPLock(int32 EntryPoint);
	void ExtendBPLockOnce();
	void StartExtend();
	void EndServerAlive();
	void EndExtend();
	void OnTimer_ServerAlive();
	void StartServerAlive();
	void OnTime_ExtendBPLock();
	void OnSuccess_EED4777E43895CCF25E6458A00C156D7(EAJBNetAPIResult Result, int32 NextExtendSpan);
	void OnFailed_EED4777E43895CCF25E6458A00C156D7(EAJBNetAPIResult Result, int32 NextExtendSpan);
	void OnSuccess_791251A64772546BFE11A39E14D98DB1(EAJBNetAPIResult Result, int32 NextExtendSpan);
	void OnFailed_791251A64772546BFE11A39E14D98DB1(EAJBNetAPIResult Result, int32 NextExtendSpan);
	void OnSuccess_3D3C7C5945F352C2BD3B3CB70BF3A2F7(EAJBNetAPIResult Result);
	void OnFailed_3D3C7C5945F352C2BD3B3CB70BF3A2F7(EAJBNetAPIResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBExtendBPLock_C">();
	}
	static class UBP_AJBExtendBPLock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBExtendBPLock_C>();
	}
};
static_assert(alignof(UBP_AJBExtendBPLock_C) == 0x000008, "Wrong alignment on UBP_AJBExtendBPLock_C");
static_assert(sizeof(UBP_AJBExtendBPLock_C) == 0x000118, "Wrong size on UBP_AJBExtendBPLock_C");
static_assert(offsetof(UBP_AJBExtendBPLock_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AJBExtendBPLock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AJBExtendBPLock_C, HttpObject) == 0x0000F8, "Member 'UBP_AJBExtendBPLock_C::HttpObject' has a wrong offset!");
static_assert(offsetof(UBP_AJBExtendBPLock_C, ExtendTimer) == 0x000100, "Member 'UBP_AJBExtendBPLock_C::ExtendTimer' has a wrong offset!");
static_assert(offsetof(UBP_AJBExtendBPLock_C, ServerAliveHttp) == 0x000108, "Member 'UBP_AJBExtendBPLock_C::ServerAliveHttp' has a wrong offset!");
static_assert(offsetof(UBP_AJBExtendBPLock_C, ServerAliveTimer) == 0x000110, "Member 'UBP_AJBExtendBPLock_C::ServerAliveTimer' has a wrong offset!");

}

