#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.ExecuteUbergraph_BP_AJBInGameItem
// 0x0160 (0x0160 - 0x0000)
struct BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_Character;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation; // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_TargetCharacter;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_HitCharacter;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving2;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPvENPC_IsPvENPC;                        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_HitCharacter1;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSpaceShaving3;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetPoliticTarget_TargetCharacter;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGetOnSpaceShaving_bGet;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPvENPC_IsPvENPC1;                       // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue1;    // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem");
static_assert(sizeof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem) == 0x000160, "Wrong size on BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, EntryPoint) == 0x000000, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_Character) == 0x000008, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_bSpaceShaving1) == 0x000010, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_bSpaceShaving1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000018, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation) == 0x000024, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_GetGenerateParticleRelativeLocationFromCapsuleCenter_RelativeLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000030, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsDedicatedServer_ReturnValue) == 0x000038, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_TargetCharacter) == 0x000040, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_bSpaceShaving) == 0x000048, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_bSpaceShaving' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000058, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_HitCharacter) == 0x000060, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_PlayerIndex) == 0x000068, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_bSpaceShaving2) == 0x00006C, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_bSpaceShaving2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller) == 0x000078, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsPvENPC_IsPvENPC) == 0x000081, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsPvENPC_IsPvENPC' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsValid_ReturnValue1) == 0x000083, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000084, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue) == 0x000085, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_HitCharacter1) == 0x000088, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_HitCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_CustomEvent_bSpaceShaving3) == 0x000090, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_CustomEvent_bSpaceShaving3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_GetPoliticTarget_TargetCharacter) == 0x000098, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_GetPoliticTarget_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_CheckGetOnSpaceShaving_bGet) == 0x0000A0, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_CheckGetOnSpaceShaving_bGet' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue1) == 0x0000A1, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_Not_PreBool_ReturnValue1) == 0x0000A2, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_Not_PreBool_ReturnValue2) == 0x0000A3, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000A8, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B0, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherComp) == 0x0000B8, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000C0, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000C4, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_ComponentBoundEvent_SweepResult) == 0x0000C8, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000150, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, K2Node_DynamicCast_bSuccess1) == 0x000158, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_HasLocalSharedController_ReturnValue) == 0x000159, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_IsPvENPC_IsPvENPC1) == 0x00015A, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_IsPvENPC_IsPvENPC1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue2) == 0x00015B, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_Not_PreBool_ReturnValue3) == 0x00015C, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_CharacterBehaviorMatches_ReturnValue1) == 0x00015D, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_CharacterBehaviorMatches_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue3) == 0x00015E, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem, CallFunc_BooleanAND_ReturnValue4) == 0x00015F, "Member 'BP_AJBInGameItem_C_ExecuteUbergraph_BP_AJBInGameItem::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.OnConsumedServer
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_OnConsumedServer final
{
public:
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_OnConsumedServer) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_OnConsumedServer");
static_assert(sizeof(BP_AJBInGameItem_C_OnConsumedServer) == 0x000010, "Wrong size on BP_AJBInGameItem_C_OnConsumedServer");
static_assert(offsetof(BP_AJBInGameItem_C_OnConsumedServer, TargetCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_OnConsumedServer::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_OnConsumedServer, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_C_OnConsumedServer::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.MC_RequestConsumeEffect
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_MC_RequestConsumeEffect final
{
public:
	class ABP_AJBInGameCharacter_C*               Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_MC_RequestConsumeEffect) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_MC_RequestConsumeEffect");
static_assert(sizeof(BP_AJBInGameItem_C_MC_RequestConsumeEffect) == 0x000010, "Wrong size on BP_AJBInGameItem_C_MC_RequestConsumeEffect");
static_assert(offsetof(BP_AJBInGameItem_C_MC_RequestConsumeEffect, Character) == 0x000000, "Member 'BP_AJBInGameItem_C_MC_RequestConsumeEffect::Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_MC_RequestConsumeEffect, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_C_MC_RequestConsumeEffect::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.TryConsume
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_TryConsume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_TryConsume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_TryConsume");
static_assert(sizeof(BP_AJBInGameItem_C_TryConsume) == 0x000010, "Wrong size on BP_AJBInGameItem_C_TryConsume");
static_assert(offsetof(BP_AJBInGameItem_C_TryConsume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_TryConsume::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_TryConsume, PlayerIndex) == 0x000008, "Member 'BP_AJBInGameItem_C_TryConsume::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_TryConsume, bSpaceShaving) == 0x00000C, "Member 'BP_AJBInGameItem_C_TryConsume::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.OnROS_Consume
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_OnROS_Consume final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpaceShaving;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_OnROS_Consume) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_OnROS_Consume");
static_assert(sizeof(BP_AJBInGameItem_C_OnROS_Consume) == 0x000010, "Wrong size on BP_AJBInGameItem_C_OnROS_Consume");
static_assert(offsetof(BP_AJBInGameItem_C_OnROS_Consume, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_OnROS_Consume::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_OnROS_Consume, bSpaceShaving) == 0x000008, "Member 'BP_AJBInGameItem_C_OnROS_Consume::bSpaceShaving' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AJBInGameItem_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.GetPoliticTarget
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBInGameItem_C_GetPoliticTarget final
{
public:
	class ABP_AJBInGameCharacter_C*               HitCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               TargetCharacter;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBInGameCharacterProperty_C> K2Node_DynamicCast_AsBI_AJBIn_Game_Character_Property; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetPropertyOwnerCharacterBP_CharacterBP;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_GetPoliticTarget) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_GetPoliticTarget");
static_assert(sizeof(BP_AJBInGameItem_C_GetPoliticTarget) == 0x000038, "Wrong size on BP_AJBInGameItem_C_GetPoliticTarget");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, HitCharacter) == 0x000000, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, TargetCharacter) == 0x000008, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, K2Node_DynamicCast_AsBI_AJBIn_Game_Character_Property) == 0x000010, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::K2Node_DynamicCast_AsBI_AJBIn_Game_Character_Property' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, CallFunc_GetPropertyOwnerCharacterBP_CharacterBP) == 0x000028, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::CallFunc_GetPropertyOwnerCharacterBP_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_GetPoliticTarget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AJBInGameItem_C_GetPoliticTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameItem.BP_AJBInGameItem_C.CheckGetOnSpaceShaving
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameItem_C_CheckGetOnSpaceShaving final
{
public:
	class AActor*                                 SkillOwner;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGet;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameItem_C_CheckGetOnSpaceShaving) == 0x000008, "Wrong alignment on BP_AJBInGameItem_C_CheckGetOnSpaceShaving");
static_assert(sizeof(BP_AJBInGameItem_C_CheckGetOnSpaceShaving) == 0x000010, "Wrong size on BP_AJBInGameItem_C_CheckGetOnSpaceShaving");
static_assert(offsetof(BP_AJBInGameItem_C_CheckGetOnSpaceShaving, SkillOwner) == 0x000000, "Member 'BP_AJBInGameItem_C_CheckGetOnSpaceShaving::SkillOwner' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameItem_C_CheckGetOnSpaceShaving, bGet) == 0x000008, "Member 'BP_AJBInGameItem_C_CheckGetOnSpaceShaving::bGet' has a wrong offset!");

}

