#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRecordingEmphasizeActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBRecordingEmphasizeActor.BP_AJBRecordingEmphasizeActor_C.ExecuteUbergraph_BP_AJBRecordingEmphasizeActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActivate;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor) == 0x000004, "Wrong alignment on BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor");
static_assert(sizeof(BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor) == 0x000008, "Wrong size on BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor, EntryPoint) == 0x000000, "Member 'BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor, K2Node_Event_bActivate) == 0x000004, "Member 'BP_AJBRecordingEmphasizeActor_C_ExecuteUbergraph_BP_AJBRecordingEmphasizeActor::K2Node_Event_bActivate' has a wrong offset!");

// Function BP_AJBRecordingEmphasizeActor.BP_AJBRecordingEmphasizeActor_C.CheckRecordingTargetSelf
// 0x0058 (0x0058 - 0x0000)
struct BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf final
{
public:
	bool                                          bTarget;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ViewTargetOwner;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRecording_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf) == 0x000008, "Wrong alignment on BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf");
static_assert(sizeof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf) == 0x000058, "Wrong size on BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, bTarget) == 0x000000, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::bTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, ViewTargetOwner) == 0x000008, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::ViewTargetOwner' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000010, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed) == 0x000018, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor) == 0x000020, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000030, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_GetViewTargetActor_ViewTargetActor1) == 0x000040, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_GetViewTargetActor_ViewTargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf, CallFunc_Array_Contains_ReturnValue) == 0x000051, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckRecordingTargetSelf::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_AJBRecordingEmphasizeActor.BP_AJBRecordingEmphasizeActor_C.GetDarbysAssassinColor
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor) == 0x000004, "Wrong alignment on BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor");
static_assert(sizeof(BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor) == 0x000010, "Wrong size on BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor, Color) == 0x000000, "Member 'BP_AJBRecordingEmphasizeActor_C_GetDarbysAssassinColor::Color' has a wrong offset!");

// Function BP_AJBRecordingEmphasizeActor.BP_AJBRecordingEmphasizeActor_C.ChangeEffectActivate
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate) == 0x000001, "Wrong alignment on BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate");
static_assert(sizeof(BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate) == 0x000001, "Wrong size on BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate, bActivate) == 0x000000, "Member 'BP_AJBRecordingEmphasizeActor_C_ChangeEffectActivate::bActivate' has a wrong offset!");

// Function BP_AJBRecordingEmphasizeActor.BP_AJBRecordingEmphasizeActor_C.CheckEffectActivate
// 0x0070 (0x0070 - 0x0000)
struct BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate final
{
public:
	bool                                          bActivate;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTempActivate;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRecordingTargetSelf_bTarget;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveBitesTheDust_ReturnValue;      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_FlowState;            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPair_bPairCharacter;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEffectActivate_bActivate;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate) == 0x000008, "Wrong alignment on BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate");
static_assert(sizeof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate) == 0x000070, "Wrong size on BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, bActivate) == 0x000000, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, bTempActivate) == 0x000001, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::bTempActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_CheckRecordingTargetSelf_bTarget) == 0x000002, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_CheckRecordingTargetSelf_bTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_CheckActiveBitesTheDust_ReturnValue) == 0x000003, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_CheckActiveBitesTheDust_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_PlayModeEquals_bResult) == 0x000004, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x000028, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x000030, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x000038, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_GetCurrentFlowState_FlowState) == 0x000040, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_GetCurrentFlowState_FlowState' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_MatchesAnyTags_ReturnValue) == 0x000050, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000058, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_IsPair_bPairCharacter) == 0x000062, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_IsPair_bPairCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_Not_PreBool_ReturnValue1) == 0x000063, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_Not_PreBool_ReturnValue2) == 0x000064, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_IsValid_ReturnValue) == 0x000065, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_CharacterBehaviorMatches_ReturnValue) == 0x000066, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_CharacterBehaviorMatches_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_Not_PreBool_ReturnValue3) == 0x000067, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue1) == 0x000068, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_CheckEffectActivate_bActivate) == 0x000069, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_CheckEffectActivate_bActivate' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue2) == 0x00006A, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue3) == 0x00006B, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue4) == 0x00006C, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate, CallFunc_BooleanAND_ReturnValue5) == 0x00006D, "Member 'BP_AJBRecordingEmphasizeActor_C_CheckEffectActivate::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");

}

