#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBitesTheDustSkill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.ExecuteUbergraph_BP_AJBBitesTheDustSkill
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBitesTheDustAffecter_C*          K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBSkillAffecterBase_C*             CallFunc_GetSkillAffecterServer_SkillAffecter;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill) == 0x000008, "Wrong alignment on BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill) == 0x000050, "Wrong size on BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, EntryPoint) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter) == 0x000008, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_IsServer_ReturnValue) == 0x000011, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_GetSkillAffecterServer_SkillAffecter) == 0x000018, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_GetSkillAffecterServer_SkillAffecter' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000020, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000028, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_Event_Value1) == 0x000034, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_Event_Value1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, K2Node_Event_Value) == 0x00003C, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_FTrunc_ReturnValue1) == 0x000044, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_FTrunc_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'BP_AJBBitesTheDustSkill_C_ExecuteUbergraph_BP_AJBBitesTheDustSkill::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.ShouldRemainHP
// 0x0088 (0x0088 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_ShouldRemainHP final
{
public:
	bool                                          bShouldRemain;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DuringTheWorld_Result;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_CanUseSkill_TagContainer;                 // 0x0010(0x0020)()
	bool                                          CallFunc_CanUseSkill_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckValidState_bValidState;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckForceFireSkill_bForceFireSkill;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUltimateAvailableNum_Num;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckForceFireSkill_bForceFireSkill1;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP) == 0x000008, "Wrong alignment on BP_AJBBitesTheDustSkill_C_ShouldRemainHP");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP) == 0x000088, "Wrong size on BP_AJBBitesTheDustSkill_C_ShouldRemainHP");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, bShouldRemain) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::bShouldRemain' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_DuringTheWorld_Result) == 0x000001, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_DuringTheWorld_Result' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_CanUseSkill_TagContainer) == 0x000010, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_CanUseSkill_TagContainer' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_CanUseSkill_ReturnValue) == 0x000030, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_CanUseSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000038, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000048, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_CheckValidState_bValidState) == 0x000050, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_CheckValidState_bValidState' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000058, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_CheckForceFireSkill_bForceFireSkill) == 0x000061, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_CheckForceFireSkill_bForceFireSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_GetUltimateAvailableNum_Num) == 0x000064, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_GetUltimateAvailableNum_Num' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000069, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000070, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000078, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, K2Node_DynamicCast_bSuccess2) == 0x000080, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_CheckForceFireSkill_bForceFireSkill1) == 0x000081, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_CheckForceFireSkill_bForceFireSkill1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_BooleanOR_ReturnValue) == 0x000082, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ShouldRemainHP, CallFunc_Not_PreBool_ReturnValue1) == 0x000083, "Member 'BP_AJBBitesTheDustSkill_C_ShouldRemainHP::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.GetSkillAffecterServer
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer final
{
public:
	class UClass*                                 AffecterClass;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBSkillAffecterBase_C*             SkillAffecter_0;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBSkillAffecterBase_C*             CallFunc_SpawnSkillAffecterCore_SkillAffecterBase; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBitesTheDustAffecter_C*          K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer) == 0x000008, "Wrong alignment on BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer) == 0x000040, "Wrong size on BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, AffecterClass) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::AffecterClass' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, SkillAffecter_0) == 0x000008, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::SkillAffecter_0' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, CallFunc_SpawnSkillAffecterCore_SkillAffecterBase) == 0x000010, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::CallFunc_SpawnSkillAffecterCore_SkillAffecterBase' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter) == 0x000018, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::K2Node_DynamicCast_AsBP_AJBBites_the_Dust_Affecter' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000030, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_AJBBitesTheDustSkill_C_GetSkillAffecterServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.ActiveBitesTheDust
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameState_C*               K2Node_DynamicCast_AsBP_AJBBattle_Game_State;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust) == 0x000008, "Wrong alignment on BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust) == 0x000018, "Wrong size on BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust, K2Node_DynamicCast_AsBP_AJBBattle_Game_State) == 0x000008, "Member 'BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust::K2Node_DynamicCast_AsBP_AJBBattle_Game_State' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_AJBBitesTheDustSkill_C_ActiveBitesTheDust::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.PowerUpServer
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_PowerUpServer final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_PowerUpServer) == 0x000004, "Wrong alignment on BP_AJBBitesTheDustSkill_C_PowerUpServer");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_PowerUpServer) == 0x000004, "Wrong size on BP_AJBBitesTheDustSkill_C_PowerUpServer");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_PowerUpServer, Value) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_PowerUpServer::Value' has a wrong offset!");

// Function BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C.PowerDown_Server
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBBitesTheDustSkill_C_PowerDown_Server final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBBitesTheDustSkill_C_PowerDown_Server) == 0x000004, "Wrong alignment on BP_AJBBitesTheDustSkill_C_PowerDown_Server");
static_assert(sizeof(BP_AJBBitesTheDustSkill_C_PowerDown_Server) == 0x000004, "Wrong size on BP_AJBBitesTheDustSkill_C_PowerDown_Server");
static_assert(offsetof(BP_AJBBitesTheDustSkill_C_PowerDown_Server, Value) == 0x000000, "Member 'BP_AJBBitesTheDustSkill_C_PowerDown_Server::Value' has a wrong offset!");

}

