#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCharacterInfoUIFollowerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent
// 0x0218 (0x0218 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_UI_FollowPairInfo_C*                CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0020(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x00E0(0x0020)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_BattleRecord_C*                     CallFunc_GetBattleRecord_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0134(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_FollowingPlayer;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x01E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0200(0x0018)()
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent) == 0x000008, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent) == 0x000218, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, EntryPoint) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000005, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000008, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue) == 0x000010, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetCharacterInfoFlowWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue1) == 0x000018, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000020, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x0000A8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0000B0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetGameplayTags_TagContainerCopy) == 0x0000E0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000100, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000104, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_MatchesAnyTags_ReturnValue) == 0x000105, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000106, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000108, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetBattleRecord_ReturnValue) == 0x000110, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetBattleRecord_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000118, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00011C, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetParent_ReturnValue) == 0x000120, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_GetDesiredSize_ReturnValue) == 0x000134, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000140, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_BreakVector2D_X) == 0x0001C8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_BreakVector2D_Y) == 0x0001CC, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001D0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_Event_DeltaSeconds) == 0x0001D4, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_CustomEvent_FollowingPlayer) == 0x0001D8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_CustomEvent_FollowingPlayer' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, Temp_text_Variable) == 0x0001E0, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, CallFunc_IsValid_ReturnValue3) == 0x0001F8, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, Temp_bool_Variable) == 0x0001F9, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent, K2Node_Select_Default) == 0x000200, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ExecuteUbergraph_BP_AJBCharacterInfoUIFollowerComponent::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.TryActiveComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent final
{
public:
	class ABP_AJBInGameCharacter_C*               FollowingPlayer_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent) == 0x000008, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent) == 0x000008, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent, FollowingPlayer_0) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_TryActiveComponent::FollowingPlayer_0' has a wrong offset!");

// Function BP_AJBCharacterInfoUIFollowerComponent.BP_AJBCharacterInfoUIFollowerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick");
static_assert(sizeof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick");
static_assert(offsetof(BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBCharacterInfoUIFollowerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

