#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameAIController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.ExecuteUbergraph_BP_AJBInGameAIController
// 0x01D8 (0x01D8 - 0x0000)
struct BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AAIController* AIController, const struct FGameplayTag& DamageType)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UBehaviorTreeComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPair_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTreeComponent*                 CallFunc_GetComponentByClass_ReturnValue1;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPair_ReturnValue1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue;       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue;       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue1;      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue1;      // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue2;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue2;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay2;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_ComponentBoundEvent_UpdatedActors;          // 0x0040(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBehaviorTreeComponent*                 CallFunc_GetComponentByClass_ReturnValue2;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue3;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue3;      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue1;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent1;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue1;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue2;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent2;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue2;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue3;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent3;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue3;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          K2Node_CustomEvent_BehaviorTreeAsset;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          K2Node_CustomEvent_BehaviorSubTreeAsset;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue4;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent4;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue4;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue4;      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue4;      // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue5;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue5;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue1;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          K2Node_CustomEvent_SubTreeAsset;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTreeComponent*                 CallFunc_GetComponentByClass_ReturnValue3;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAILevelSetupFinished_ReturnValue6;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStatusCaption_ReturnValue;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsComponentInitialized_ReturnValue6;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          K2Node_CustomEvent_BehaviorTree;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay1;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent5;       // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue5;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue5;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue6;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent6;       // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue6;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController");
static_assert(sizeof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController) == 0x0001D8, "Wrong size on BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, EntryPoint) == 0x000000, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_HasPair_ReturnValue) == 0x000020, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_HasPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_GetComponentByClass_ReturnValue1) == 0x000028, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_HasPair_ReturnValue1) == 0x000030, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_HasPair_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsValid_ReturnValue1) == 0x000031, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue) == 0x000032, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue) == 0x000033, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue1) == 0x000035, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue1) == 0x000036, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue1) == 0x000037, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue2) == 0x000038, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue2) == 0x000039, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue2) == 0x00003A, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_Delay2) == 0x00003C, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_Delay2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_ComponentBoundEvent_UpdatedActors) == 0x000040, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_ComponentBoundEvent_UpdatedActors' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_AIController) == 0x000050, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_DamageType) == 0x000058, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_GetComponentByClass_ReturnValue2) == 0x000060, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsValid_ReturnValue2) == 0x000068, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue3) == 0x000069, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue3) == 0x00006A, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue) == 0x00006B, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue3) == 0x00006C, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent) == 0x000070, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue) == 0x000078, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue1) == 0x000079, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent1) == 0x000080, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue1) == 0x000088, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue2) == 0x000089, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent2) == 0x000090, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue2) == 0x000098, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue3) == 0x000099, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent3) == 0x0000A0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue3) == 0x0000A8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_BehaviorTreeAsset) == 0x0000B0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_BehaviorTreeAsset' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_BehaviorSubTreeAsset) == 0x0000B8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_BehaviorSubTreeAsset' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_Conv_ObjectToString_ReturnValue) == 0x0000C0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue4) == 0x0000D1, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent4) == 0x0000D8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue4) == 0x0000E0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue4) == 0x0000E1, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue4) == 0x0000E2, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue4) == 0x0000E3, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_K2_GetPawn_ReturnValue) == 0x0000E8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue5) == 0x0000F0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000F8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue5) == 0x000101, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue5) == 0x000102, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_K2_GetPawn_ReturnValue1) == 0x000108, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_K2_GetPawn_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000110, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_SubTreeAsset) == 0x000120, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_SubTreeAsset' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_GetComponentByClass_ReturnValue3) == 0x000128, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsValid_ReturnValue3) == 0x000130, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsAILevelSetupFinished_ReturnValue6) == 0x000131, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsAILevelSetupFinished_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_GetStatusCaption_ReturnValue) == 0x000138, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_GetStatusCaption_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_IsComponentInitialized_ReturnValue6) == 0x000148, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_IsComponentInitialized_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_BooleanAND_ReturnValue6) == 0x000160, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_Concat_StrStr_ReturnValue1) == 0x000168, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_Concat_StrStr_ReturnValue2) == 0x000178, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000188, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_Event_Operator) == 0x000190, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_Event_Time) == 0x000198, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_Event_Timing) == 0x00019C, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_Event_bEnable) == 0x00019D, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_Event_bOperatorIsEmpty) == 0x00019E, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_BehaviorTree) == 0x0001A0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_BehaviorTree' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_Delay1) == 0x0001A8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_Delay1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent5) == 0x0001B0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue5) == 0x0001B8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue5) == 0x0001B9, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, K2Node_CustomEvent_Delay) == 0x0001BC, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_RunBehaviorTree_ReturnValue6) == 0x0001C0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_RunBehaviorTree_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_BlackboardComponent6) == 0x0001C8, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_BlackboardComponent6' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController, CallFunc_UseBlackboard_ReturnValue6) == 0x0001D0, "Member 'BP_AJBInGameAIController_C_ExecuteUbergraph_BP_AJBInGameAIController::CallFunc_UseBlackboard_ReturnValue6' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.StartPvEBattleBehavior
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameAIController_C_StartPvEBattleBehavior final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_StartPvEBattleBehavior) == 0x000004, "Wrong alignment on BP_AJBInGameAIController_C_StartPvEBattleBehavior");
static_assert(sizeof(BP_AJBInGameAIController_C_StartPvEBattleBehavior) == 0x000004, "Wrong size on BP_AJBInGameAIController_C_StartPvEBattleBehavior");
static_assert(offsetof(BP_AJBInGameAIController_C_StartPvEBattleBehavior, Delay) == 0x000000, "Member 'BP_AJBInGameAIController_C_StartPvEBattleBehavior::Delay' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.StartSpecialBehavior
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIController_C_StartSpecialBehavior final
{
public:
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_StartSpecialBehavior) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_StartSpecialBehavior");
static_assert(sizeof(BP_AJBInGameAIController_C_StartSpecialBehavior) == 0x000010, "Wrong size on BP_AJBInGameAIController_C_StartSpecialBehavior");
static_assert(offsetof(BP_AJBInGameAIController_C_StartSpecialBehavior, BehaviorTree) == 0x000000, "Member 'BP_AJBInGameAIController_C_StartSpecialBehavior::BehaviorTree' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_StartSpecialBehavior, Delay) == 0x000008, "Member 'BP_AJBInGameAIController_C_StartSpecialBehavior::Delay' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIController_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameAIController_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBInGameAIController_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBInGameAIController_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBInGameAIController_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBInGameAIController_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBInGameAIController_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBInGameAIController_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBInGameAIController_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBInGameAIController_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.SetSubTreeDynamic
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIController_C_SetSubTreeDynamic final
{
public:
	class UBehaviorTree*                          SubTreeAsset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_SetSubTreeDynamic) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_SetSubTreeDynamic");
static_assert(sizeof(BP_AJBInGameAIController_C_SetSubTreeDynamic) == 0x000008, "Wrong size on BP_AJBInGameAIController_C_SetSubTreeDynamic");
static_assert(offsetof(BP_AJBInGameAIController_C_SetSubTreeDynamic, SubTreeAsset) == 0x000000, "Member 'BP_AJBInGameAIController_C_SetSubTreeDynamic::SubTreeAsset' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.DebugStartTestBehavior
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIController_C_DebugStartTestBehavior final
{
public:
	class UBehaviorTree*                          BehaviorTreeAsset;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          BehaviorSubTreeAsset;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_DebugStartTestBehavior) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_DebugStartTestBehavior");
static_assert(sizeof(BP_AJBInGameAIController_C_DebugStartTestBehavior) == 0x000010, "Wrong size on BP_AJBInGameAIController_C_DebugStartTestBehavior");
static_assert(offsetof(BP_AJBInGameAIController_C_DebugStartTestBehavior, BehaviorTreeAsset) == 0x000000, "Member 'BP_AJBInGameAIController_C_DebugStartTestBehavior::BehaviorTreeAsset' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_DebugStartTestBehavior, BehaviorSubTreeAsset) == 0x000008, "Member 'BP_AJBInGameAIController_C_DebugStartTestBehavior::BehaviorSubTreeAsset' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.OnDead
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIController_C_OnDead final
{
public:
	class AAIController*                          AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_OnDead) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_OnDead");
static_assert(sizeof(BP_AJBInGameAIController_C_OnDead) == 0x000010, "Wrong size on BP_AJBInGameAIController_C_OnDead");
static_assert(offsetof(BP_AJBInGameAIController_C_OnDead, AIController) == 0x000000, "Member 'BP_AJBInGameAIController_C_OnDead::AIController' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_OnDead, DamageType) == 0x000008, "Member 'BP_AJBInGameAIController_C_OnDead::DamageType' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature final
{
public:
	TArray<class AActor*>                         UpdatedActors;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature");
static_assert(sizeof(BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature");
static_assert(offsetof(BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature, UpdatedActors) == 0x000000, "Member 'BP_AJBInGameAIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature::UpdatedActors' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.StartNormalBattleBehavior
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameAIController_C_StartNormalBattleBehavior final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_StartNormalBattleBehavior) == 0x000004, "Wrong alignment on BP_AJBInGameAIController_C_StartNormalBattleBehavior");
static_assert(sizeof(BP_AJBInGameAIController_C_StartNormalBattleBehavior) == 0x000004, "Wrong size on BP_AJBInGameAIController_C_StartNormalBattleBehavior");
static_assert(offsetof(BP_AJBInGameAIController_C_StartNormalBattleBehavior, Delay) == 0x000000, "Member 'BP_AJBInGameAIController_C_StartNormalBattleBehavior::Delay' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.IsRunning
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameAIController_C_IsRunning final
{
public:
	bool                                          bRunning_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameAIController_C_IsRunning) == 0x000001, "Wrong alignment on BP_AJBInGameAIController_C_IsRunning");
static_assert(sizeof(BP_AJBInGameAIController_C_IsRunning) == 0x000001, "Wrong size on BP_AJBInGameAIController_C_IsRunning");
static_assert(offsetof(BP_AJBInGameAIController_C_IsRunning, bRunning_0) == 0x000000, "Member 'BP_AJBInGameAIController_C_IsRunning::bRunning_0' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.IsStoppingOrNotMoving
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) BP_AJBInGameAIController_C_IsStoppingOrNotMoving final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputMoveClear_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_IsStoppingOrNotMoving");
static_assert(sizeof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving) == 0x000018, "Wrong size on BP_AJBInGameAIController_C_IsStoppingOrNotMoving");
static_assert(offsetof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving, ReturnValue) == 0x000000, "Member 'BP_AJBInGameAIController_C_IsStoppingOrNotMoving::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BP_AJBInGameAIController_C_IsStoppingOrNotMoving::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving, CallFunc_GetValueAsBool_ReturnValue) == 0x000010, "Member 'BP_AJBInGameAIController_C_IsStoppingOrNotMoving::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving, CallFunc_IsInputMoveClear_ReturnValue) == 0x000011, "Member 'BP_AJBInGameAIController_C_IsStoppingOrNotMoving::CallFunc_IsInputMoveClear_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameAIController_C_IsStoppingOrNotMoving, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BP_AJBInGameAIController_C_IsStoppingOrNotMoving::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.GetAILevel
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameAIController_C_GetAILevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_GetAILevel) == 0x000004, "Wrong alignment on BP_AJBInGameAIController_C_GetAILevel");
static_assert(sizeof(BP_AJBInGameAIController_C_GetAILevel) == 0x000004, "Wrong size on BP_AJBInGameAIController_C_GetAILevel");
static_assert(offsetof(BP_AJBInGameAIController_C_GetAILevel, ReturnValue) == 0x000000, "Member 'BP_AJBInGameAIController_C_GetAILevel::ReturnValue' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.SetContextActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIController_C_SetContextActor final
{
public:
	class AActor*                                 ContextActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_SetContextActor) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_SetContextActor");
static_assert(sizeof(BP_AJBInGameAIController_C_SetContextActor) == 0x000008, "Wrong size on BP_AJBInGameAIController_C_SetContextActor");
static_assert(offsetof(BP_AJBInGameAIController_C_SetContextActor, ContextActor_0) == 0x000000, "Member 'BP_AJBInGameAIController_C_SetContextActor::ContextActor_0' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.GetContextActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIController_C_GetContextActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_GetContextActor) == 0x000008, "Wrong alignment on BP_AJBInGameAIController_C_GetContextActor");
static_assert(sizeof(BP_AJBInGameAIController_C_GetContextActor) == 0x000008, "Wrong size on BP_AJBInGameAIController_C_GetContextActor");
static_assert(offsetof(BP_AJBInGameAIController_C_GetContextActor, ReturnValue) == 0x000000, "Member 'BP_AJBInGameAIController_C_GetContextActor::ReturnValue' has a wrong offset!");

// Function BP_AJBInGameAIController.BP_AJBInGameAIController_C.GetCameraForwardVector
// 0x05A0 (0x05A0 - 0x0000)
struct BP_AJBInGameAIController_C_GetCameraForwardVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimalViewInfo                       CallFunc_GetCameraView_DesiredView;                // 0x0020(0x0570)()
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0590(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameAIController_C_GetCameraForwardVector) == 0x000010, "Wrong alignment on BP_AJBInGameAIController_C_GetCameraForwardVector");
static_assert(sizeof(BP_AJBInGameAIController_C_GetCameraForwardVector) == 0x0005A0, "Wrong size on BP_AJBInGameAIController_C_GetCameraForwardVector");
static_assert(offsetof(BP_AJBInGameAIController_C_GetCameraForwardVector, ReturnValue) == 0x000000, "Member 'BP_AJBInGameAIController_C_GetCameraForwardVector::ReturnValue' has a wrong offset!");
