#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStand_STP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.ExecuteUbergraph_BP_AJBInGameStand_STP
// 0x0098 (0x0098 - 0x0000)
struct BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP");
static_assert(sizeof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP) == 0x000098, "Wrong size on BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, EntryPoint) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CustomEvent_NotifyName4) == 0x000008, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CustomEvent_NotifyName3) == 0x000020, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CustomEvent_NotifyName2) == 0x000038, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CustomEvent_NotifyName1) == 0x000050, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CreateDelegate_OutputDelegate3) == 0x000058, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CustomEvent_NotifyName) == 0x000068, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, K2Node_CreateDelegate_OutputDelegate4) == 0x000070, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, Temp_name_Variable) == 0x000080, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000088, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_AJBInGameStand_STP_C_ExecuteUbergraph_BP_AJBInGameStand_STP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.OnCompleted_5EDF146F4C6E8062265D078AB1120449
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449");
static_assert(sizeof(BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong size on BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449");
static_assert(offsetof(BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_OnCompleted_5EDF146F4C6E8062265D078AB1120449::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.OnBlendOut_5EDF146F4C6E8062265D078AB1120449
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449");
static_assert(sizeof(BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong size on BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449");
static_assert(offsetof(BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_OnBlendOut_5EDF146F4C6E8062265D078AB1120449::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.OnInterrupted_5EDF146F4C6E8062265D078AB1120449
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449");
static_assert(sizeof(BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong size on BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449");
static_assert(offsetof(BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_OnInterrupted_5EDF146F4C6E8062265D078AB1120449::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449");
static_assert(sizeof(BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong size on BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449");
static_assert(offsetof(BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_OnNotifyBegin_5EDF146F4C6E8062265D078AB1120449::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449");
static_assert(sizeof(BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449) == 0x000008, "Wrong size on BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449");
static_assert(offsetof(BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449, NotifyName) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_OnNotifyEnd_5EDF146F4C6E8062265D078AB1120449::NotifyName' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetAttackRange
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBInGameStand_STP_C_GetAttackRange final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetAttackRange) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_GetAttackRange");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetAttackRange) == 0x000040, "Wrong size on BP_AJBInGameStand_STP_C_GetAttackRange");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, AttackRange) == 0x000004, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::AttackRange' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_BreakVector_X) == 0x00002C, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_BreakVector_Z) == 0x000034, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackRange, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00003C, "Member 'BP_AJBInGameStand_STP_C_GetAttackRange::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetAttackCollisionRadius
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBInGameStand_STP_C_GetAttackCollisionRadius final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_GetAttackCollisionRadius");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius) == 0x000030, "Wrong size on BP_AJBInGameStand_STP_C_GetAttackCollisionRadius");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, Radius) == 0x000004, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::Radius' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackCollisionRadius, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBInGameStand_STP_C_GetAttackCollisionRadius::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetAttackLocation
// 0x0068 (0x0068 - 0x0000)
struct BP_AJBInGameStand_STP_C_GetAttackLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFixedLocation_Location;                // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0040(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetAttackLocation) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_GetAttackLocation");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetAttackLocation) == 0x000068, "Wrong size on BP_AJBInGameStand_STP_C_GetAttackLocation");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, TargetLocation) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, Location) == 0x00000C, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000020, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_GetFixedLocation_Location) == 0x00002C, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_GetFixedLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_FindLookAtRotation_ReturnValue) == 0x000040, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000050, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetAttackLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x00005C, "Member 'BP_AJBInGameStand_STP_C_GetAttackLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetStandAttackOffset
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBInGameStand_STP_C_GetStandAttackOffset final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StandAttackOffset;                                 // 0x0004(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBCloseRangeSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetStandAttackOffset) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_GetStandAttackOffset");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetStandAttackOffset) == 0x000038, "Wrong size on BP_AJBInGameStand_STP_C_GetStandAttackOffset");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, StandAttackOffset) == 0x000004, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::StandAttackOffset' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000018, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetStandAttackOffset, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AJBInGameStand_STP_C_GetStandAttackOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetCloseRangeLaunchedActor
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LaunchedActor;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor) == 0x000008, "Wrong alignment on BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor) == 0x000010, "Wrong size on BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor, LaunchedActor) == 0x000008, "Member 'BP_AJBInGameStand_STP_C_GetCloseRangeLaunchedActor::LaunchedActor' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetDamageActorTargetLocation
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation) == 0x000004, "Wrong alignment on BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation) == 0x00000C, "Wrong size on BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation, Location) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetDamageActorTargetLocation::Location' has a wrong offset!");

// Function BP_AJBInGameStand_STP.BP_AJBInGameStand_STP_C.GetLaunchedActorHomeLocation
// 0x001C (0x001C - 0x0000)
struct BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation final
{
public:
	int32                                         CloseRangeSkillNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFixedLocation_Location;                // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation) == 0x000004, "Wrong alignment on BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation");
static_assert(sizeof(BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation) == 0x00001C, "Wrong size on BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation, CloseRangeSkillNo) == 0x000000, "Member 'BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation::CloseRangeSkillNo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation, Location) == 0x000004, "Member 'BP_AJBInGameStand_STP_C_GetLaunchedActorHomeLocation::Location' has a wrong offset!");
