#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSignalPin_ItemBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBSignalPinBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBSignalPin_ItemBase.BP_AJBSignalPin_ItemBase_C
// 0x0020 (0x0388 - 0x0368)
class ABP_AJBSignalPin_ItemBase_C : public ABP_AJBSignalPinBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBSignalPin_ItemBase_C;         // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 ItemClass;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameItem_C*                    TargetItemActor;                                   // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBUIMapManager_C*                  MapManagerCache;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBSignalPin_ItemBase(int32 EntryPoint);
	void SetTargetItem();
	void OnItemConsume(class AAJBInGameCharacter* Character);
	void GetTargetItem(class AActor** TargetItem);
	void DestroyItemSignalPin();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBSignalPin_ItemBase_C">();
	}
	static class ABP_AJBSignalPin_ItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBSignalPin_ItemBase_C>();
	}
};
static_assert(alignof(ABP_AJBSignalPin_ItemBase_C) == 0x000008, "Wrong alignment on ABP_AJBSignalPin_ItemBase_C");
static_assert(sizeof(ABP_AJBSignalPin_ItemBase_C) == 0x000388, "Wrong size on ABP_AJBSignalPin_ItemBase_C");
static_assert(offsetof(ABP_AJBSignalPin_ItemBase_C, UberGraphFrame_BP_AJBSignalPin_ItemBase_C) == 0x000368, "Member 'ABP_AJBSignalPin_ItemBase_C::UberGraphFrame_BP_AJBSignalPin_ItemBase_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBSignalPin_ItemBase_C, ItemClass) == 0x000370, "Member 'ABP_AJBSignalPin_ItemBase_C::ItemClass' has a wrong offset!");
static_assert(offsetof(ABP_AJBSignalPin_ItemBase_C, TargetItemActor) == 0x000378, "Member 'ABP_AJBSignalPin_ItemBase_C::TargetItemActor' has a wrong offset!");
static_assert(offsetof(ABP_AJBSignalPin_ItemBase_C, MapManagerCache) == 0x000380, "Member 'ABP_AJBSignalPin_ItemBase_C::MapManagerCache' has a wrong offset!");

}

