#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBEpitaph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBSupportSkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBEpitaph.BP_AJBEpitaph_C
// 0x0018 (0x0170 - 0x0158)
class UBP_AJBEpitaph_C final : public UBP_AJBSupportSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBEpitaph_C;                    // 0x0158(0x0008)(Transient, DuplicateTransient)
	bool                                          bIsStandProhibition;                               // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsSpectatorTarget;                                // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsWatchTarget;                                    // 0x0162(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsVisible;                                        // 0x0163(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDeadOwner;                                      // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AreaDisplayTime;                                   // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBeforeRedcution;                                // 0x016C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBEpitaph(int32 EntryPoint);
	void MC_OwnerIsDead();
	void ROS_OwnerIsDead();
	void OnCompletedReduction();
	void OnProceedReduction(float Radius, const struct FVector& Location, float RemainingTime);
	void OnBegin();
	void OnChangeSpactatorTarget();
	void OnDie(bool bWillRessurect, bool bIsLastDefeated, bool bDiedOfKillZ);
	void CheckAdvanceAreaActivate();
	void SetAdvanceAreaVisibility(bool IsVisible);
	void OnPassiveRemoved(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void OnPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void ReceiveTick(float DeltaSeconds);
	void OnRep_bIsDeadOwner();
	void OnCancel();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBEpitaph_C">();
	}
	static class UBP_AJBEpitaph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBEpitaph_C>();
	}
};
static_assert(alignof(UBP_AJBEpitaph_C) == 0x000008, "Wrong alignment on UBP_AJBEpitaph_C");
static_assert(sizeof(UBP_AJBEpitaph_C) == 0x000170, "Wrong size on UBP_AJBEpitaph_C");
static_assert(offsetof(UBP_AJBEpitaph_C, UberGraphFrame_BP_AJBEpitaph_C) == 0x000158, "Member 'UBP_AJBEpitaph_C::UberGraphFrame_BP_AJBEpitaph_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsStandProhibition) == 0x000160, "Member 'UBP_AJBEpitaph_C::bIsStandProhibition' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsSpectatorTarget) == 0x000161, "Member 'UBP_AJBEpitaph_C::bIsSpectatorTarget' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsWatchTarget) == 0x000162, "Member 'UBP_AJBEpitaph_C::bIsWatchTarget' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsVisible) == 0x000163, "Member 'UBP_AJBEpitaph_C::bIsVisible' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsDeadOwner) == 0x000164, "Member 'UBP_AJBEpitaph_C::bIsDeadOwner' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, AreaDisplayTime) == 0x000168, "Member 'UBP_AJBEpitaph_C::AreaDisplayTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBEpitaph_C, bIsBeforeRedcution) == 0x00016C, "Member 'UBP_AJBEpitaph_C::bIsBeforeRedcution' has a wrong offset!");

}

