#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_KWK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_KWK.BP_AJBInGameCharacter_KWK_C
// 0x0030 (0x17E0 - 0x17B0)
class ABP_AJBInGameCharacter_KWK_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_KWK_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBBitesTheDustSkill_C*             BP_AJBBitesTheDustSkill;                           // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAirBombSkill_C*                  BP_AJBAirBombSkill;                                // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBKillerRushSkill_C*               BP_AJBKillerRushSkill;                             // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyKQSSkill_C*             BP_AJBAccompanyKQSSkill;                           // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bContinuedAccompany;                               // 0x17D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_KWK(int32 EntryPoint);
	void InactiveContinuedAccompany();
	void ActiveContinuedAccompany();
	void UpdateShotPoasibilityKWK(float Delta);
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SkillInactivated(class UBP_AJBSkillBase_C* InactivatedSkill);
	void UpdateShotPossibility(float Delta);
	void OnBeforeInteract(bool* bShouldInteract);
	void PreConsumeHP(int32 LeftDamageForHP, const struct FGameplayTag& DamageType, bool bPenetrateAP, int32* OverrideLeftDamageForHP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_KWK_C">();
	}
	static class ABP_AJBInGameCharacter_KWK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_KWK_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_KWK_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_KWK_C");
static_assert(sizeof(ABP_AJBInGameCharacter_KWK_C) == 0x0017E0, "Wrong size on ABP_AJBInGameCharacter_KWK_C");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, UberGraphFrame_BP_AJBInGameCharacter_KWK_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_KWK_C::UberGraphFrame_BP_AJBInGameCharacter_KWK_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, BP_AJBBitesTheDustSkill) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_KWK_C::BP_AJBBitesTheDustSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, BP_AJBAirBombSkill) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_KWK_C::BP_AJBAirBombSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, BP_AJBKillerRushSkill) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_KWK_C::BP_AJBKillerRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, BP_AJBAccompanyKQSSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_KWK_C::BP_AJBAccompanyKQSSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_KWK_C, bContinuedAccompany) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_KWK_C::bContinuedAccompany' has a wrong offset!");

}

