#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTailRushSkill

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBTailRushSkill.BP_AJBTailRushSkill_C.ExecuteUbergraph_BP_AJBTailRushSkill
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameStand_ECH_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill) == 0x000008, "Wrong alignment on BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill");
static_assert(sizeof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill) == 0x000030, "Wrong size on BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, EntryPoint) == 0x000000, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x000008, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000010, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH) == 0x000020, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand_ECH' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'BP_AJBTailRushSkill_C_ExecuteUbergraph_BP_AJBTailRushSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_AJBTailRushSkill.BP_AJBTailRushSkill_C.TryGetDamageActor
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBTailRushSkill_C_TryGetDamageActor final
{
public:
	class ABP_AJBDamageActor_C*                   DamageActor_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_CloseRangeLauncherStandInterface_C> K2Node_DynamicCast_AsBI_Close_Range_Launcher_Stand_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDamageActor_C*                   CallFunc_TryGetDamageActor_DamageActor;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCloseRangeLaunchedActor_LaunchedActor; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBTailRushSkill_C_TryGetDamageActor) == 0x000008, "Wrong alignment on BP_AJBTailRushSkill_C_TryGetDamageActor");
static_assert(sizeof(BP_AJBTailRushSkill_C_TryGetDamageActor) == 0x000048, "Wrong size on BP_AJBTailRushSkill_C_TryGetDamageActor");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, DamageActor_0) == 0x000000, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::DamageActor_0' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, CallFunc_GetOwnerStand_ReturnValue) == 0x000008, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x000010, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, K2Node_DynamicCast_AsBI_Close_Range_Launcher_Stand_Interface) == 0x000020, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::K2Node_DynamicCast_AsBI_Close_Range_Launcher_Stand_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, CallFunc_TryGetDamageActor_DamageActor) == 0x000038, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::CallFunc_TryGetDamageActor_DamageActor' has a wrong offset!");
static_assert(offsetof(BP_AJBTailRushSkill_C_TryGetDamageActor, CallFunc_GetCloseRangeLaunchedActor_LaunchedActor) == 0x000040, "Member 'BP_AJBTailRushSkill_C_TryGetDamageActor::CallFunc_GetCloseRangeLaunchedActor_LaunchedActor' has a wrong offset!");

}

