#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHamonStatus

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.ExecuteUbergraph_BP_AJBHamonStatus
// 0x0428 (0x0428 - 0x0000)
struct BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable2;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable1;                       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0168(0x0018)()
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0040)(HasGetValueTypeHash)
	class UBP_AJBSkillBase_C*                     CallFunc_GetBasicSkill_BasicSkill;                 // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByStatus;           // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCutByAAP;              // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsEndured;                      // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bBitesTheDust;                  // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue6;                    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue7;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character5;     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> CallFunc_RemoveGameplayTag_self_CastInput; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag)> K2Node_CreateDelegate_OutputDelegate1; // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue8;                    // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character6;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bBitesTheDust)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_AJBHamonMode_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCharacterBehavior_Active_bReturnValue; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue9;                    // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character7;     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP, bool IsEndured)> K2Node_CreateDelegate_OutputDelegate3; // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag;                      // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0320(0x0020)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue10;                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPassiveTagProhibition_bProhibitionTag; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character8;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterName_CharacterName;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue1;             // 0x0378(0x0018)()
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0398(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03E8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Gauge;                          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsHamonMode;                   // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0420(0x0008)(NoDestructor)
};
static_assert(alignof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus) == 0x000008, "Wrong alignment on BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus");
static_assert(sizeof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus) == 0x000428, "Wrong size on BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, EntryPoint) == 0x000000, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue1) == 0x000028, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_FloatToString_ReturnValue1) == 0x000038, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_FloatToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_ByteToString_ReturnValue) == 0x000048, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue2) == 0x000058, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue3) == 0x000068, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_BoolToString_ReturnValue) == 0x000078, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue4) == 0x000088, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue5) == 0x000098, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue6) == 0x0000A8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetObjectClass_ReturnValue) == 0x0000B8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Concat_StrStr_ReturnValue7) == 0x0000C0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_DeltaTime) == 0x0000D0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D4, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000D5, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000D6, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0000D7, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_DeltaSeconds) == 0x0000D8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000F0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue1) == 0x000100, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000108, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000110, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent) == 0x000120, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_RequestWwiseEventAttachedOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_HasLocalSharedController_ReturnValue) == 0x000128, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000129, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_IsDedicatedServer_ReturnValue) == 0x00012A, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bEnable2) == 0x000130, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bEnable2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bEnable1) == 0x000131, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bEnable1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue2) == 0x000138, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000140, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess2) == 0x000148, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000150, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect) == 0x000158, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_RequestParticleEffectAttachedOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue3) == 0x000160, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_NameToText_ReturnValue) == 0x000168, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000180, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess3) == 0x000188, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetBasicSkill_BasicSkill) == 0x0001D0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetBasicSkill_BasicSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_Damage) == 0x0001D8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_DamageType) == 0x0001E0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_DamageCauser) == 0x0001E8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bRemainHP) == 0x0001F0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bDamageIsCutByStatus) == 0x0001F1, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bDamageIsCutByStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bDamageIsCutByAAP) == 0x0001F2, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bDamageIsCutByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_IsEndured) == 0x0001F3, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_IsEndured' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue4) == 0x0001F8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000200, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000208, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess4) == 0x000210, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000211, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue5) == 0x000218, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000220, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess5) == 0x000228, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bBitesTheDust) == 0x000229, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bBitesTheDust' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x00022A, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue6) == 0x000230, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000238, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess6) == 0x000240, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue7) == 0x000248, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character5) == 0x000250, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character5' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess7) == 0x000258, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_RemoveGameplayTag_self_CastInput) == 0x000260, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_RemoveGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000270, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bEnable) == 0x000280, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CreateDelegate_OutputDelegate1) == 0x000288, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue8) == 0x000298, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character6) == 0x0002A0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character6' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess8) == 0x0002A8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x0002B0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess9) == 0x0002C0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CreateDelegate_OutputDelegate2) == 0x0002C8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetComponentByClass_ReturnValue) == 0x0002D8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_CheckCharacterBehavior_Active_bReturnValue) == 0x0002E0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_CheckCharacterBehavior_Active_bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_CheckActive_bActive) == 0x0002E1, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Not_PreBool_ReturnValue1) == 0x0002E2, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_IsValid_ReturnValue) == 0x0002E3, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Not_PreBool_ReturnValue2) == 0x0002E4, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue9) == 0x0002E8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character7) == 0x0002F0, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character7' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess10) == 0x0002F8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_IsValid_ReturnValue1) == 0x0002F9, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CreateDelegate_OutputDelegate3) == 0x000300, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_AddCondition) == 0x000310, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_SecondTag) == 0x000318, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000320, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetOwner_ReturnValue10) == 0x000340, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetOwner_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_CheckPassiveTagProhibition_bProhibitionTag) == 0x000348, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_CheckPassiveTagProhibition_bProhibitionTag' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_AsBP_AJBIn_Game_Character8) == 0x000350, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_AsBP_AJBIn_Game_Character8' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_DynamicCast_bSuccess11) == 0x000358, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetCharacterName_CharacterName) == 0x000360, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetCharacterName_CharacterName' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetAJBGameInstance_bSuccess) == 0x000368, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000370, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_NameToText_ReturnValue1) == 0x000378, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_NameToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_IsPlayingReplay_ReturnValue) == 0x000390, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_MakeStruct_FormatArgumentData1) == 0x000398, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_MakeArray_Array) == 0x0003D8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Format_ReturnValue) == 0x0003E8, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_TextToString_ReturnValue) == 0x000400, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_Conv_StringToName_ReturnValue) == 0x000410, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_Gauge) == 0x000418, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_Gauge' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, K2Node_CustomEvent_bIsHamonMode) == 0x00041C, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::K2Node_CustomEvent_bIsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000420, "Member 'BP_AJBHamonStatus_C_ExecuteUbergraph_BP_AJBHamonStatus::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.ROS_Replicate_SkipOwner_UIStatus
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus final
{
public:
	float                                         Gauge_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHamonMode_0;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus) == 0x000004, "Wrong alignment on BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus");
static_assert(sizeof(BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus) == 0x000008, "Wrong size on BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus");
static_assert(offsetof(BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus, Gauge_0) == 0x000000, "Member 'BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus::Gauge_0' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus, bIsHamonMode_0) == 0x000004, "Member 'BP_AJBHamonStatus_C_ROS_Replicate_SkipOwner_UIStatus::bIsHamonMode_0' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.OnPassiveAdded
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBHamonStatus_C_OnPassiveAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHamonStatus_C_OnPassiveAdded) == 0x000008, "Wrong alignment on BP_AJBHamonStatus_C_OnPassiveAdded");
static_assert(sizeof(BP_AJBHamonStatus_C_OnPassiveAdded) == 0x000010, "Wrong size on BP_AJBHamonStatus_C_OnPassiveAdded");
static_assert(offsetof(BP_AJBHamonStatus_C_OnPassiveAdded, AddCondition) == 0x000000, "Member 'BP_AJBHamonStatus_C_OnPassiveAdded::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnPassiveAdded, SecondTag) == 0x000008, "Member 'BP_AJBHamonStatus_C_OnPassiveAdded::SecondTag' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.MC_ChangeHamonMode
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBHamonStatus_C_MC_ChangeHamonMode final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHamonStatus_C_MC_ChangeHamonMode) == 0x000001, "Wrong alignment on BP_AJBHamonStatus_C_MC_ChangeHamonMode");
static_assert(sizeof(BP_AJBHamonStatus_C_MC_ChangeHamonMode) == 0x000001, "Wrong size on BP_AJBHamonStatus_C_MC_ChangeHamonMode");
static_assert(offsetof(BP_AJBHamonStatus_C_MC_ChangeHamonMode, bEnable) == 0x000000, "Member 'BP_AJBHamonStatus_C_MC_ChangeHamonMode::bEnable' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.OnBecomeLastSurvivor
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBHamonStatus_C_OnBecomeLastSurvivor final
{
public:
	bool                                          bBitesTheDust;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHamonStatus_C_OnBecomeLastSurvivor) == 0x000001, "Wrong alignment on BP_AJBHamonStatus_C_OnBecomeLastSurvivor");
static_assert(sizeof(BP_AJBHamonStatus_C_OnBecomeLastSurvivor) == 0x000001, "Wrong size on BP_AJBHamonStatus_C_OnBecomeLastSurvivor");
static_assert(offsetof(BP_AJBHamonStatus_C_OnBecomeLastSurvivor, bBitesTheDust) == 0x000000, "Member 'BP_AJBHamonStatus_C_OnBecomeLastSurvivor::bBitesTheDust' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.OnReceiveDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBHamonStatus_C_OnReceiveDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCutByStatus;                              // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCutByAAP;                                 // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEndured;                                         // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBHamonStatus_C_OnReceiveDamage) == 0x000008, "Wrong alignment on BP_AJBHamonStatus_C_OnReceiveDamage");
static_assert(sizeof(BP_AJBHamonStatus_C_OnReceiveDamage) == 0x000020, "Wrong size on BP_AJBHamonStatus_C_OnReceiveDamage");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, Damage) == 0x000000, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, DamageType) == 0x000008, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, DamageCauser) == 0x000010, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, bRemainHP) == 0x000018, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, bDamageIsCutByStatus) == 0x000019, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::bDamageIsCutByStatus' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, bDamageIsCutByAAP) == 0x00001A, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::bDamageIsCutByAAP' has a wrong offset!");
static_assert(offsetof(BP_AJBHamonStatus_C_OnReceiveDamage, IsEndured) == 0x00001B, "Member 'BP_AJBHamonStatus_C_OnReceiveDamage::IsEndured' has a wrong offset!");

// Function BP_AJBHamonStatus.BP_AJBHamonStatus_C.ROS_ChangeHamonMode
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBHamonStatus_C_ROS_ChangeHamonMode final
{
public:
