#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDamageImpulseBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDamageImpulseBase.BP_AJBDamageImpulseBase_C.ExecuteUbergraph_BP_AJBDamageImpulseBase
// 0x03E0 (0x03E0 - 0x0000)
struct BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetDamageImpulseTargetActors_OutActors;   // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds3;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckShouldCancel_bShouldCancel;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue1;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue2;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_BlockingRushOperatorInterface_C> K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface; // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_KillNum;                        // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MostDamagedPhase;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface;              // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface1;             // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface2;             // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_Barrier_C>         K2Node_DynamicCast_AsBI_Barrier;                   // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBStickyDiveSkill_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIgnoreImpulseVoice_bInclude;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillActive_ReturnValue;                // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInteractAction_C*                CallFunc_GetComponentByClass_ReturnValue1;         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInRange_bInRange;                    // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x02E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bBitesTheDust)>           K2Node_CreateDelegate_OutputDelegate;              // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0314(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue3;              // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0340(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0394(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckState_bMatch;                        // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue1;          // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bBitesTheDust;                  // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetCauserOwnerCharacterBP_CharacterBP;    // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetCauserOwnerCharacterBP_CharacterBP1;   // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTargetSelf_bTarget;                  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDisableDamage_bDisableDamage;        // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDamage_bNoDamage;                    // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DamageProcessCore_bRemainHP;              // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF[0x1];                                      // 0x03BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DamageProcessCore_DamagedPhase;           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDamageOverlap_bShouldOverlap;       // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C7[0x1];                                      // 0x03C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_GetCauserOwnerCharacterBP_CharacterBP2;   // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase) == 0x000008, "Wrong alignment on BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase");
static_assert(sizeof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase) == 0x0003E0, "Wrong size on BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, EntryPoint) == 0x000000, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDamageImpulseTargetActors_OutActors) == 0x000008, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDamageImpulseTargetActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds) == 0x000018, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x000021, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x000022, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000030, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000038, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds1) == 0x000040, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds2) == 0x000044, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000048, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000058, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_DeltaSeconds3) == 0x000060, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_DeltaSeconds3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckShouldCancel_bShouldCancel) == 0x000064, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckShouldCancel_bShouldCancel' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable) == 0x000070, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Operator) == 0x000078, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Time) == 0x000080, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_Timing) == 0x000084, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_bEnable) == 0x000085, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_bOperatorIsEmpty) == 0x000086, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000088, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Variable) == 0x000094, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000098, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0000A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000AC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_bool_Variable) == 0x0000B0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x0000B4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0000B8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000C4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000CC, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x0000D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x0000D4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue) == 0x0000D8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue1) == 0x0000E8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Conv_IntToString_ReturnValue2) == 0x000100, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue) == 0x000118, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue) == 0x000120, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue1) == 0x000140, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue1) == 0x000150, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue2) == 0x000160, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue3) == 0x000170, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue4) == 0x000180, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue5) == 0x000190, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable1) == 0x0001A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001A4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetDisplayName_ReturnValue2) == 0x0001A8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue6) == 0x0001B8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_TargetActor) == 0x0001C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue7) == 0x0001D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface) == 0x0001E0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_Blocking_Rush_Operator_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Concat_StrStr_ReturnValue8) == 0x0001F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000208, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable2) == 0x00020C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000210, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Select_Default) == 0x000214, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000218, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_float_Variable3) == 0x00021C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000220, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000224, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue1) == 0x000228, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue1) == 0x00022C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsServer_ReturnValue2) == 0x000230, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetPlayerController_ReturnValue) == 0x000238, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetViewTarget_ReturnValue) == 0x000240, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Array_Index_Variable) == 0x000248, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_KillNum) == 0x00024C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_KillNum' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CustomEvent_MostDamagedPhase) == 0x000250, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CustomEvent_MostDamagedPhase' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Array_Get_Item) == 0x000258, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface) == 0x000260, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess1) == 0x000270, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface1) == 0x000278, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess2) == 0x000288, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_AJBInterface2) == 0x000290, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_AJBInterface2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess3) == 0x0002A0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_AsBI_Barrier) == 0x0002A8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_AsBI_Barrier' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_DynamicCast_bSuccess4) == 0x0002B8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetComponentByClass_ReturnValue) == 0x0002C0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsIgnoreImpulseVoice_bInclude) == 0x0002C8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsIgnoreImpulseVoice_bInclude' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue1) == 0x0002C9, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue) == 0x0002CA, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsSkillActive_ReturnValue) == 0x0002CB, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsSkillActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetObjectClass_ReturnValue) == 0x0002D0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_GetComponentByClass_ReturnValue1) == 0x0002D8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_ClassIsChildOf_ReturnValue) == 0x0002E0, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_IsValid_ReturnValue2) == 0x0002E1, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_ClassIsChildOf_ReturnValue1) == 0x0002E2, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_BooleanOR_ReturnValue) == 0x0002E3, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Not_PreBool_ReturnValue1) == 0x0002E4, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_CheckInRange_bInRange) == 0x0002E5, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_CheckInRange_bInRange' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0002E8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_CreateDelegate_OutputDelegate) == 0x0002F8, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Add_IntInt_ReturnValue2) == 0x000308, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, Temp_int_Variable1) == 0x00030C, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, CallFunc_Greater_IntInt_ReturnValue) == 0x000310, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase, K2Node_Event_EndPlayReason) == 0x000311, "Member 'BP_AJBDamageImpulseBase_C_ExecuteUbergraph_BP_AJBDamageImpulseBase::K2Node_Event_EndPlayReason' has a wrong offset!");
