#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIMessenger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBAIMessenger.BP_AJBAIMessenger_C.ExecuteUbergraph_BP_AJBAIMessenger
// 0x0620 (0x0620 - 0x0000)
struct BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerID1;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location4;                      // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ControllerName;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_PlayerID2;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_StatusLabel;                    // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInputMoveClear;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInSaferArea;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location5;                      // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_InputDestination;               // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_FinalDestination;               // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_LockedTags;                     // 0x00C0(0x0020)()
	class APawn*                                  K2Node_CustomEvent_Pawn;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow;                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDebugAICharacterVisualizer_C*    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow1;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameAIEnvironmentComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerID;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_AJBDebugAIEnvironmentVisualizer_C*  CallFunc_FinishSpawningActor_ReturnValue1;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugAIEventReplayClient_C*         CallFunc_FinishSpawningActor_ReturnValue2;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBDebugAICharacterVisualizer_C*> CallFunc_Map_Values_Values;                   // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                K2Node_CustomEvent_SaferAreaLocation;              // 0x01D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SaferAreaRadius;                // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBDebugAICharacterVisualizer_C*    CallFunc_Array_Get_Item;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_SafeAreaLocation;               // 0x01F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SafeAreaRadius;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugAIEventReplayClient_C*         CallFunc_FinishSpawningActor_ReturnValue3;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_DebugMenuIndex1;                // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DebugMenuIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NPC_Id1;                        // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NPC_Id;                         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Log;                            // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller1;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue1;                 // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue4;               // 0x02C0(0x0030)(IsPlainOldData, NoDestructor)
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue1;         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugAIEventReplayClient_C*         CallFunc_FinishSpawningActor_ReturnValue4;         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue5;               // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugAIEventReplayClient_C*         CallFunc_FinishSpawningActor_ReturnValue5;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_AddComponentByClass_ReturnValue;          // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDebugAINPCSpawnPreviewerComponent_C* CallFunc_GetComponentByClass_ReturnValue2;     // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AILevel1;                       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue1;                  // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0398(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDebugAICharacterVisualizer_C*    CallFunc_Map_Find_Value;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBDebugAINPCSpawnPreviewerComponent_C* CallFunc_GetComponentByClass_ReturnValue3;     // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPreviewedSpawnLocation_ReturnValue;    // 0x03C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x03D0(0x0020)()
	struct FVector                                K2Node_CustomEvent_Location3;                      // 0x03F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x03FC(0x000C)(IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_AILevel;                        // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue2;                 // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location2;                      // 0x0418(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bNavMesh;                       // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue4;         // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0430(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_Tags;                           // 0x0440(0x0020)()
	struct FVector                                K2Node_CustomEvent_VectorIn2;                      // 0x0460(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDebugAICharacterVisualizer_C*    CallFunc_Map_Find_Value1;                          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue1;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue3;                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue5;         // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller2;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A2[0x2];                                      // 0x04A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index1;                         // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime1;                   // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag2;                           // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_V1;                             // 0x04B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_V2;                             // 0x04C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag1;                           // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VectorIn1;                      // 0x04E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDebugAICharacterVisualizer_C*    CallFunc_Map_Find_Value2;                          // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue2;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FA[0x6];                                      // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue2;                  // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue1; // 0x0510(0x0020)()
	class UBP_AJBDebugAINPCSpawnPreviewerComponent_C* CallFunc_GetComponentByClass_ReturnValue6;     // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0538(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VectorIn;                       // 0x0540(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPreviewedSpawnLocation_ReturnValue1;   // 0x0550(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_GionEffectType1;                // 0x0560(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_GionOwner1;                     // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location1;                      // 0x0570(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AI_AddZ_ReturnValue;                      // 0x057C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_GionEffectType;                 // 0x05A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_GionOwner;                      // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x05B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue4;                 // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue7;         // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue5;                 // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBInGameAIDirectorComponent*          CallFunc_GetComponentByClass_ReturnValue8;         // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue13;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x05F4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0604(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger) == 0x000010, "Wrong alignment on BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger");
static_assert(sizeof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger) == 0x000620, "Wrong size on BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, EntryPoint) == 0x000000, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, Temp_struct_Variable) == 0x000004, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_PlayerID1) == 0x000020, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_PlayerID1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Location4) == 0x000024, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Location4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_ControllerName) == 0x000030, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_ControllerName' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_AsPlayer_Controller) == 0x000040, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_PlayerID2) == 0x000080, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_PlayerID2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_StatusLabel) == 0x000088, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_StatusLabel' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_bInputMoveClear) == 0x000098, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_bInputMoveClear' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_bInSaferArea) == 0x000099, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_bInSaferArea' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Location5) == 0x00009C, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Location5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_InputDestination) == 0x0000A8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_InputDestination' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_FinalDestination) == 0x0000B4, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_FinalDestination' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_LockedTags) == 0x0000C0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_LockedTags' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Pawn) == 0x0000E0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_bShow) == 0x0000F0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_bShow1) == 0x000100, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_bShow1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetGameMode_ReturnValue) == 0x000108, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue) == 0x000110, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue1) == 0x000119, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_PlayerID) == 0x00011C, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_PlayerID' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_DamageType) == 0x000120, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue1) == 0x000130, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Remove_ReturnValue) == 0x000160, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000168, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue2) == 0x000170, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue1) == 0x0001A0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x0001A8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue2) == 0x0001B0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, Temp_int_Array_Index_Variable) == 0x0001B8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Values_Values) == 0x0001C0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_SaferAreaLocation) == 0x0001D0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_SaferAreaLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_SaferAreaRadius) == 0x0001DC, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_SaferAreaRadius' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue2) == 0x0001EC, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_SafeAreaLocation) == 0x0001F0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_SafeAreaLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_SafeAreaRadius) == 0x0001FC, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_SafeAreaRadius' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue3) == 0x000200, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3) == 0x000230, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue3) == 0x000238, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue3) == 0x000240, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_DebugMenuIndex1) == 0x000244, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_DebugMenuIndex1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_DebugMenuIndex) == 0x000248, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_DebugMenuIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_NPC_Id1) == 0x00024C, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_NPC_Id1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_NPC_Id) == 0x000250, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_NPC_Id' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Log) == 0x000258, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Log' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue4) == 0x000268, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Conv_IntToString_ReturnValue) == 0x000270, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Concat_StrStr_ReturnValue) == 0x000280, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetOwner_ReturnValue1) == 0x000290, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Concat_StrStr_ReturnValue1) == 0x000298, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_AsPlayer_Controller1) == 0x0002A8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_AsPlayer_Controller1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_bSuccess1) == 0x0002B0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetGameMode_ReturnValue1) == 0x0002B8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetGameMode_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue4) == 0x0002C0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue1) == 0x0002F0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4) == 0x0002F8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue4) == 0x000300, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue5) == 0x000308, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeTransform_ReturnValue5) == 0x000310, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5) == 0x000340, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_FinishSpawningActor_ReturnValue5) == 0x000348, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_FinishSpawningActor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetPlayerController_ReturnValue) == 0x000350, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_K2_GetPawn_ReturnValue) == 0x000358, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, Temp_int_Loop_Counter_Variable) == 0x000360, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_AddComponentByClass_ReturnValue) == 0x000368, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Less_IntInt_ReturnValue) == 0x000370, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Add_IntInt_ReturnValue) == 0x000374, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue2) == 0x000378, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_AILevel1) == 0x000380, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_AILevel1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue6) == 0x000384, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetPlayerController_ReturnValue1) == 0x000388, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_K2_GetPawn_ReturnValue1) == 0x000390, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_K2_GetPawn_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000398, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Find_Value) == 0x0003A8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Find_ReturnValue) == 0x0003B0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue3) == 0x0003B8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue7) == 0x0003C0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetPreviewedSpawnLocation_ReturnValue) == 0x0003C4, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetPreviewedSpawnLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0003D0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Location3) == 0x0003F0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Location3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Rotation) == 0x0003FC, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_AILevel) == 0x000408, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_AILevel' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetGameMode_ReturnValue2) == 0x000410, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetGameMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Location2) == 0x000418, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Location2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_bNavMesh) == 0x000424, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_bNavMesh' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue4) == 0x000428, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Add_VectorVector_ReturnValue) == 0x000430, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue8) == 0x00043C, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Tags) == 0x000440, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Tags' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_VectorIn2) == 0x000460, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_VectorIn2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Find_Value1) == 0x000470, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Find_Value1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_Map_Find_ReturnValue1) == 0x000478, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_Map_Find_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetGameMode_ReturnValue3) == 0x000480, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetGameMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetOwner_ReturnValue2) == 0x000488, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_GetComponentByClass_ReturnValue5) == 0x000490, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_GetComponentByClass_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_AsPlayer_Controller2) == 0x000498, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_AsPlayer_Controller2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_DynamicCast_bSuccess2) == 0x0004A0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, CallFunc_IsValid_ReturnValue9) == 0x0004A1, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Index1) == 0x0004A4, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Index1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_ElapsedTime1) == 0x0004A8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_ElapsedTime1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_Tag2) == 0x0004B0, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_Tag2' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_V1) == 0x0004B8, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_V1' has a wrong offset!");
static_assert(offsetof(BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger, K2Node_CustomEvent_V2) == 0x0004C4, "Member 'BP_AJBAIMessenger_C_ExecuteUbergraph_BP_AJBAIMessenger::K2Node_CustomEvent_V2' has a wrong offset!");
