#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_LongPressInteractGenerateEffects_Local

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimNotify_LongPressInteractGenerateEffects_Local.BP_AnimNotify_LongPressInteractGenerateEffects_Local_C.Received_Notify
// 0x0058 (0x0058 - 0x0000)
struct BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_AJBLongPressInteract_C*>     CallFunc_GetComponentsByClass_ReturnValue;         // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBLongPressInteract_C*             CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify) == 0x000008, "Wrong alignment on BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify");
static_assert(sizeof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify) == 0x000058, "Wrong size on BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, MeshComp) == 0x000000, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, Animation) == 0x000008, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, ReturnValue) == 0x000010, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_IsValid_ReturnValue1) == 0x000050, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_AnimNotify_LongPressInteractGenerateEffects_Local_C_Received_Notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

