#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_ABC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_ABC.BP_AJBInGameCharacter_ABC_C
// 0x0040 (0x17F0 - 0x17B0)
class ABP_AJBInGameCharacter_ABC_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_ABC_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBRecording_C*                     BP_AJBRecording;                                   // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBTrackerManager_C*                BP_AJBTrackerManager;                              // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBReplay_C*                        BP_AJBReplay;                                      // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGangReadinessSkill_C*            BP_AJBGangReadinessSkill;                          // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDubbingSkill_C*                  BP_AJBDubbingSkill;                                // 0x17D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBMoodyRushSkill_C*                BP_AJBMoodyRushSkill;                              // 0x17D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyMDBSkill_C*             BP_AJBAccompanyMDBSkill;                           // 0x17E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_MDB_C*           MDBCharacterBP;                                    // 0x17E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_ABC(int32 EntryPoint);
	void NotifyTheWorldOnEventGraph(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ShouldValidDamageType(const struct FGameplayTag& DamageType, bool bPenetrateAP, bool* bValid);
	void GetPropertyStand(class ABP_AJBInGameCharacter_C** PropertyStandBP);
	void CheckExistPropertyStand(bool* bExist);
	void CheckTransfer(bool* bTransfer);
	void OnRep_MatchingPlayerIndex();
	void TryToShareMatchingPlayerIndexWithStand(int32 MatchingPlayerIndex_0);
	void SetupSharedController();
	void ReceiveBeginPlay();
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void PressedButton_ActiveBase();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void UserConstructionScript();
	void CalcDamageRate(class AActor* DamagedActor, const struct FGameplayTag& DamageType, float* DamageRate);
	void PredictionAttackHit(bool* bHit);
	void PreConsumeHP(int32 LeftDamageForHP, const struct FGameplayTag& DamageType, bool bPenetrateAP, int32* OverrideLeftDamageForHP);
	void OnBeforeInteract(bool* bShouldInteract);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_ABC_C">();
	}
	static class ABP_AJBInGameCharacter_ABC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_ABC_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_ABC_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_ABC_C");
static_assert(sizeof(ABP_AJBInGameCharacter_ABC_C) == 0x0017F0, "Wrong size on ABP_AJBInGameCharacter_ABC_C");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, UberGraphFrame_BP_AJBInGameCharacter_ABC_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_ABC_C::UberGraphFrame_BP_AJBInGameCharacter_ABC_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBRecording) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBRecording' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBTrackerManager) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBTrackerManager' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBReplay) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBReplay' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBGangReadinessSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBGangReadinessSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBDubbingSkill) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBDubbingSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBMoodyRushSkill) == 0x0017D8, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBMoodyRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, BP_AJBAccompanyMDBSkill) == 0x0017E0, "Member 'ABP_AJBInGameCharacter_ABC_C::BP_AJBAccompanyMDBSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_ABC_C, MDBCharacterBP) == 0x0017E8, "Member 'ABP_AJBInGameCharacter_ABC_C::MDBCharacterBP' has a wrong offset!");

}

