#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBGlimpseOfForceEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBGlimpseOfForceEffect.BP_AJBGlimpseOfForceEffect_C
// 0x0040 (0x0368 - 0x0328)
class ABP_AJBGlimpseOfForceEffect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PP1_NewTrack_0_770F809A4AB7C4D955D4D6AB7DB4719A;   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PP1_RadialBlurScale_770F809A4AB7C4D955D4D6AB7DB4719A; // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PP1__Direction_770F809A4AB7C4D955D4D6AB7DB4719A;   // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PP1;                                               // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PostProcessMaterial;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PostProcessIndex;                                  // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_PP1;                                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBGlimpseOfForceEffect(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Fire();
	void PP1__UpdateFunc();
	void PP1__FinishedFunc();
	void UserConstructionScript();
	void SetPostProcessEnable(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBGlimpseOfForceEffect_C">();
	}
	static class ABP_AJBGlimpseOfForceEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBGlimpseOfForceEffect_C>();
	}
};
static_assert(alignof(ABP_AJBGlimpseOfForceEffect_C) == 0x000008, "Wrong alignment on ABP_AJBGlimpseOfForceEffect_C");
static_assert(sizeof(ABP_AJBGlimpseOfForceEffect_C) == 0x000368, "Wrong size on ABP_AJBGlimpseOfForceEffect_C");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, UberGraphFrame) == 0x000328, "Member 'ABP_AJBGlimpseOfForceEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_AJBGlimpseOfForceEffect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PP1_NewTrack_0_770F809A4AB7C4D955D4D6AB7DB4719A) == 0x000338, "Member 'ABP_AJBGlimpseOfForceEffect_C::PP1_NewTrack_0_770F809A4AB7C4D955D4D6AB7DB4719A' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PP1_RadialBlurScale_770F809A4AB7C4D955D4D6AB7DB4719A) == 0x00033C, "Member 'ABP_AJBGlimpseOfForceEffect_C::PP1_RadialBlurScale_770F809A4AB7C4D955D4D6AB7DB4719A' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PP1__Direction_770F809A4AB7C4D955D4D6AB7DB4719A) == 0x000340, "Member 'ABP_AJBGlimpseOfForceEffect_C::PP1__Direction_770F809A4AB7C4D955D4D6AB7DB4719A' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PP1) == 0x000348, "Member 'ABP_AJBGlimpseOfForceEffect_C::PP1' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PostProcessMaterial) == 0x000350, "Member 'ABP_AJBGlimpseOfForceEffect_C::PostProcessMaterial' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, PostProcessIndex) == 0x000358, "Member 'ABP_AJBGlimpseOfForceEffect_C::PostProcessIndex' has a wrong offset!");
static_assert(offsetof(ABP_AJBGlimpseOfForceEffect_C, DMI_PP1) == 0x000360, "Member 'ABP_AJBGlimpseOfForceEffect_C::DMI_PP1' has a wrong offset!");

}

