#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneImpulse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBDamageImpulseBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBCrossfireHurricaneImpulse.BP_AJBCrossfireHurricaneImpulse_C
// 0x0028 (0x04D8 - 0x04B0)
class ABP_AJBCrossfireHurricaneImpulse_C : public ABP_AJBDamageImpulseBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCrossfireHurricaneImpulse_C;  // 0x04B0(0x0008)(Transient, DuplicateTransient)
	float                                         BurningTime;                                       // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharaParamElementName;                             // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AffecterClass;                                     // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMultipleLocations;                              // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AfterSpawnCheckTraceBuffer;                        // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCrossfireHurricaneImpulse(int32 EntryPoint);
	class UAJBInGameSkillComponent* GetSkillClass(class AActor* Owner_0);
	void ShouldAddCFHAffecter(TArray<struct FHitResult>& HitResults, bool* bShouldAdd);
	void OnBeginState_Active();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBCrossfireHurricaneImpulse_C">();
	}
	static class ABP_AJBCrossfireHurricaneImpulse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCrossfireHurricaneImpulse_C>();
	}
};
static_assert(alignof(ABP_AJBCrossfireHurricaneImpulse_C) == 0x000008, "Wrong alignment on ABP_AJBCrossfireHurricaneImpulse_C");
static_assert(sizeof(ABP_AJBCrossfireHurricaneImpulse_C) == 0x0004D8, "Wrong size on ABP_AJBCrossfireHurricaneImpulse_C");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, UberGraphFrame_BP_AJBCrossfireHurricaneImpulse_C) == 0x0004B0, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::UberGraphFrame_BP_AJBCrossfireHurricaneImpulse_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, BurningTime) == 0x0004B8, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::BurningTime' has a wrong offset!");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, CharaParamElementName) == 0x0004C0, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::CharaParamElementName' has a wrong offset!");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, AffecterClass) == 0x0004C8, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::AffecterClass' has a wrong offset!");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, UseMultipleLocations) == 0x0004D0, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::UseMultipleLocations' has a wrong offset!");
static_assert(offsetof(ABP_AJBCrossfireHurricaneImpulse_C, AfterSpawnCheckTraceBuffer) == 0x0004D4, "Member 'ABP_AJBCrossfireHurricaneImpulse_C::AfterSpawnCheckTraceBuffer' has a wrong offset!");

}

