#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDebugAINPCSpawnPreviewerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C.ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent
// 0x01C0 (0x01C0 - 0x0000)
struct BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0094(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x014C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0158(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0164(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent) == 0x000008, "Wrong alignment on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent");
static_assert(sizeof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent) == 0x0001C0, "Wrong size on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, EntryPoint) == 0x000000, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000020, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x00002C, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, Temp_object_Variable) == 0x000038, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_GetActorUpVector_ReturnValue) == 0x00004C, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000064, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_GetActorForwardVector_ReturnValue) == 0x000070, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00007C, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000088, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Add_VectorVector_ReturnValue1) == 0x000094, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Add_VectorVector_ReturnValue2) == 0x0000A0, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_Add_VectorVector_ReturnValue3) == 0x0000AC, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000B8, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000140, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x000141, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000142, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_Time) == 0x000144, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_Distance) == 0x000148, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_Location) == 0x00014C, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x000158, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_Normal) == 0x000164, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_FaceIndex) == 0x0001A4, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent, CallFunc_BreakHitResult_TraceEnd) == 0x0001B4, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ExecuteUbergraph_BP_AJBDebugAINPCSpawnPreviewerComponent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick");
static_assert(sizeof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C.ToggleIsPreviewActive
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive) == 0x000001, "Wrong alignment on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive");
static_assert(sizeof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive) == 0x000001, "Wrong size on BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_ToggleIsPreviewActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C.GetPreviewedSpawnLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation) == 0x000004, "Wrong alignment on BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation");
static_assert(sizeof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation) == 0x000018, "Wrong size on BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation, ReturnValue) == 0x000000, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x00000C, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_GetPreviewedSpawnLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_AJBDebugAINPCSpawnPreviewerComponent.BP_AJBDebugAINPCSpawnPreviewerComponent_C.IsPreviewActive
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive) == 0x000001, "Wrong alignment on BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive");
static_assert(sizeof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive) == 0x000001, "Wrong size on BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive");
static_assert(offsetof(BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive, ReturnValue) == 0x000000, "Member 'BP_AJBDebugAINPCSpawnPreviewerComponent_C_IsPreviewActive::ReturnValue' has a wrong offset!");

}

