#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHighlightSpectatorPawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBHighlightSpectatorPawn.BP_AJBHighlightSpectatorPawn_C.ExecuteUbergraph_BP_AJBHighlightSpectatorPawn
// 0x0288 (0x0288 - 0x0000)
struct BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFocusActor_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameMovableStand_C*            K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0068(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00F0(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_RotatorToString_ReturnValue;         // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue2;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult1;   // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue1;         // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_RotatorToString_ReturnValue1;        // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn) == 0x000008, "Wrong alignment on BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn");
static_assert(sizeof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn) == 0x000288, "Wrong size on BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, EntryPoint) == 0x000000, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_GetAJBGameInstance_bSuccess) == 0x000008, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000010, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_GetFocusActor_ReturnValue) == 0x000018, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_GetFocusActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000028, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_FloatToString_ReturnValue) == 0x000030, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000050, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand) == 0x000058, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000068, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000F0, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_RotatorToString_ReturnValue) == 0x000100, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_RotatorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000110, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000120, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_FloatToString_ReturnValue1) == 0x000130, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_FloatToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_FloatToString_ReturnValue2) == 0x000140, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_FloatToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_K2_SetRelativeLocation_SweepHitResult1) == 0x000150, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_K2_SetRelativeLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_VectorToString_ReturnValue) == 0x0001D8, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_VectorToString_ReturnValue1) == 0x0001E8, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_VectorToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue1) == 0x0001F8, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue2) == 0x000208, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue3) == 0x000218, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Conv_RotatorToString_ReturnValue1) == 0x000228, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Conv_RotatorToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue4) == 0x000238, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue5) == 0x000248, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue6) == 0x000258, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue7) == 0x000268, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn, CallFunc_Concat_StrStr_ReturnValue8) == 0x000278, "Member 'BP_AJBHighlightSpectatorPawn_C_ExecuteUbergraph_BP_AJBHighlightSpectatorPawn::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");

// Function BP_AJBHighlightSpectatorPawn.BP_AJBHighlightSpectatorPawn_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBHighlightSpectatorPawn_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBHighlightSpectatorPawn_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBHighlightSpectatorPawn_C_ReceiveTick");
static_assert(sizeof(BP_AJBHighlightSpectatorPawn_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBHighlightSpectatorPawn_C_ReceiveTick");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBHighlightSpectatorPawn_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBHighlightSpectatorPawn.BP_AJBHighlightSpectatorPawn_C.SetPostProcess
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBHighlightSpectatorPawn_C_SetPostProcess final
{
public:
	TArray<struct FWeightedBlendable>             Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBHighlightSpectatorPawn_C_SetPostProcess) == 0x000008, "Wrong alignment on BP_AJBHighlightSpectatorPawn_C_SetPostProcess");
static_assert(sizeof(BP_AJBHighlightSpectatorPawn_C_SetPostProcess) == 0x000010, "Wrong size on BP_AJBHighlightSpectatorPawn_C_SetPostProcess");
static_assert(offsetof(BP_AJBHighlightSpectatorPawn_C_SetPostProcess, Array) == 0x000000, "Member 'BP_AJBHighlightSpectatorPawn_C_SetPostProcess::Array' has a wrong offset!");

}

