#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBZipper_Preview

#include "Basic.hpp"

#include "BP_AJBZipper_Dummy_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBZipper_Preview.BP_AJBZipper_Preview_C
// 0x0028 (0x03C0 - 0x0398)
class ABP_AJBZipper_Preview_C final : public ABP_AJBZipper_Dummy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBZipper_Preview_C;             // 0x0398(0x0008)(Transient, DuplicateTransient)
	class UMaterialInstance*                      Material_OK;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_NG;                                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_OK;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_NG;                                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBZipper_Preview(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetVisibility(bool NewVisibility);
	void ChangeMesh(class UStaticMesh* NewStaticMesh);
	void ChangeVisual(bool bPossiblePlacement);
	void ChangeMaterial(bool bCanSetting);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBZipper_Preview_C">();
	}
	static class ABP_AJBZipper_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBZipper_Preview_C>();
	}
};
static_assert(alignof(ABP_AJBZipper_Preview_C) == 0x000008, "Wrong alignment on ABP_AJBZipper_Preview_C");
static_assert(sizeof(ABP_AJBZipper_Preview_C) == 0x0003C0, "Wrong size on ABP_AJBZipper_Preview_C");
static_assert(offsetof(ABP_AJBZipper_Preview_C, UberGraphFrame_BP_AJBZipper_Preview_C) == 0x000398, "Member 'ABP_AJBZipper_Preview_C::UberGraphFrame_BP_AJBZipper_Preview_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipper_Preview_C, Material_OK) == 0x0003A0, "Member 'ABP_AJBZipper_Preview_C::Material_OK' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipper_Preview_C, Material_NG) == 0x0003A8, "Member 'ABP_AJBZipper_Preview_C::Material_NG' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipper_Preview_C, DMI_OK) == 0x0003B0, "Member 'ABP_AJBZipper_Preview_C::DMI_OK' has a wrong offset!");
static_assert(offsetof(ABP_AJBZipper_Preview_C, DMI_NG) == 0x0003B8, "Member 'ABP_AJBZipper_Preview_C::DMI_NG' has a wrong offset!");

}

