#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrimsonDimensionSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.ExecuteUbergraph_BP_AJBCrimsonDimensionSkill
// 0x0280 (0x0280 - 0x0000)
struct BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue3;    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue4;    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameStand*                        CallFunc_GetOwnerStand_ReturnValue1;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue7;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBSkillAffecterBase_C*             CallFunc_GetSkillAffecterServer_SkillAffecter;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPossibleAction_bPossibleAction;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPossibleAction;                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag1;                      // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_SkillTag;                       // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EffectiveTimeSec;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUpdateEvenIfNotInGameplay;     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOverwrite;                     // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLeftActiveTime_Time;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0200(0x0008)(NoDestructor)
	TDelegate<void(const struct FGameplayTag& SkillTag, float EffectiveTimeSec, bool bUpdateEvenIfNotInGameplay, bool bOverwrite)> K2Node_CreateDelegate_OutputDelegate6; // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item1;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& SkillTag)> K2Node_CreateDelegate_OutputDelegate7;      // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_Skill_CrimsonDimension_C*           K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension;   // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_CrimsonDimension_C*           K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension1;  // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Skill_CrimsonDimension_C*           K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension2;  // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill) == 0x000280, "Wrong size on BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, EntryPoint) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000010, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000030, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x000044, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_NotifyName2) == 0x000050, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_NotifyName1) == 0x000058, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000060, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, Temp_int_Loop_Counter_Variable1) == 0x000070, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Add_IntInt_ReturnValue1) == 0x000074, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, Temp_int_Array_Index_Variable1) == 0x000078, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x000080, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue1) == 0x000088, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000089, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000090, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsServer_ReturnValue) == 0x000098, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue2) == 0x000099, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_HasLocalSharedController_ReturnValue2) == 0x00009A, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_NotifyName3) == 0x0000A0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsServer_ReturnValue1) == 0x0000A8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerStand_ReturnValue) == 0x0000C0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x0000C8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand) == 0x0000D0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue3) == 0x0000D9, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_HasLocalSharedController_ReturnValue3) == 0x0000DA, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_HasLocalSharedController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0000E0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsServer_ReturnValue2) == 0x0000E8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue4) == 0x0000E9, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_HasLocalSharedController_ReturnValue4) == 0x0000EA, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_HasLocalSharedController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetValidValue_ReturnValue) == 0x0000EB, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_SwitchEnum_CmpSuccess) == 0x0000EC, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerStand_ReturnValue1) == 0x000100, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerStand_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x000108, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1) == 0x000110, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Stand1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000120, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess3) == 0x000128, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000130, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess4) == 0x000140, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000148, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue5) == 0x000150, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000151, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_NotifyName) == 0x000158, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_NotifyName4) == 0x000160, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwnerCharacter_ReturnValue7) == 0x000168, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwnerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000170, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess5) == 0x000178, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1) == 0x000180, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess6) == 0x000190, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_Event_DeltaSeconds) == 0x000194, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetSkillAffecterServer_SkillAffecter) == 0x000198, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetSkillAffecterServer_SkillAffecter' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_CheckPossibleAction_bPossibleAction) == 0x0001A0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_CheckPossibleAction_bPossibleAction' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001A1, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_bPossibleAction) == 0x0001A2, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_bPossibleAction' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate4) == 0x0001A8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_SkillTag1) == 0x0001B8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_SkillTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, Temp_name_Variable) == 0x0001C0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0001C8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_SkillTag) == 0x0001D0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_EffectiveTimeSec) == 0x0001D8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_EffectiveTimeSec' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_bUpdateEvenIfNotInGameplay) == 0x0001DC, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_bUpdateEvenIfNotInGameplay' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CustomEvent_bOverwrite) == 0x0001DD, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CustomEvent_bOverwrite' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_EqualEqual_GameplayTag_ReturnValue1) == 0x0001DE, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_EqualEqual_GameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue6) == 0x0001DF, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetLeftActiveTime_Time) == 0x0001E0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetLeftActiveTime_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwner_ReturnValue) == 0x0001E8, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate5) == 0x0001F0, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000200, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate6) == 0x000208, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_GetOwner_ReturnValue1) == 0x000218, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Array_Length_ReturnValue) == 0x000228, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Less_IntInt_ReturnValue) == 0x00022C, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Array_Get_Item1) == 0x000230, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Array_Length_ReturnValue1) == 0x000238, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_Less_IntInt_ReturnValue1) == 0x00023C, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_CreateDelegate_OutputDelegate7) == 0x000240, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension) == 0x000250, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess7) == 0x000258, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension1) == 0x000260, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension1' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess8) == 0x000268, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_IsValid_ReturnValue7) == 0x000269, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x00026A, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension2) == 0x000270, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_AsWB_Skill_Crimson_Dimension2' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, K2Node_DynamicCast_bSuccess9) == 0x000278, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000279, "Member 'BP_AJBCrimsonDimensionSkill_C_ExecuteUbergraph_BP_AJBCrimsonDimensionSkill::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnSkillEffectiveTimeDetermined
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined final
{
public:
	struct FGameplayTag                           SkillTag_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         EffectiveTimeSec;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateEvenIfNotInGameplay;                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOverwrite;                                        // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined) == 0x000010, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined, SkillTag_0) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined::SkillTag_0' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined, EffectiveTimeSec) == 0x000008, "Member 'BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined::EffectiveTimeSec' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined, bUpdateEvenIfNotInGameplay) == 0x00000C, "Member 'BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined::bUpdateEvenIfNotInGameplay' has a wrong offset!");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined, bOverwrite) == 0x00000D, "Member 'BP_AJBCrimsonDimensionSkill_C_OnSkillEffectiveTimeDetermined::bOverwrite' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnSkillSucceeded_Local
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local final
{
public:
	struct FGameplayTag                           SkillTag_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local, SkillTag_0) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnSkillSucceeded_Local::SkillTag_0' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.MC_OnActive
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBCrimsonDimensionSkill_C_MC_OnActive final
{
public:
	bool                                          bPossibleAction;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_MC_OnActive) == 0x000001, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_MC_OnActive");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_MC_OnActive) == 0x000001, "Wrong size on BP_AJBCrimsonDimensionSkill_C_MC_OnActive");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_MC_OnActive, bPossibleAction) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_MC_OnActive::bPossibleAction' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnCompleted_7B45FB9D406D5826C78546BC24CFD738
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738, NotifyName) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnCompleted_7B45FB9D406D5826C78546BC24CFD738::NotifyName' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnBlendOut_7B45FB9D406D5826C78546BC24CFD738
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738, NotifyName) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnBlendOut_7B45FB9D406D5826C78546BC24CFD738::NotifyName' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnInterrupted_7B45FB9D406D5826C78546BC24CFD738
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738, NotifyName) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnInterrupted_7B45FB9D406D5826C78546BC24CFD738::NotifyName' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738, NotifyName) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738::NotifyName' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong alignment on BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738");
static_assert(sizeof(BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738) == 0x000008, "Wrong size on BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738");
static_assert(offsetof(BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738, NotifyName) == 0x000000, "Member 'BP_AJBCrimsonDimensionSkill_C_OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738::NotifyName' has a wrong offset!");

// Function BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C.SpawnSkillAffecterCore
// 0x0080 (0x0080 - 0x0000)
struct BP_AJBCrimsonDimensionSkill_C_SpawnSkillAffecterCore final
{
public:
	class UClass*                                 AffecterClass;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBSkillAffecterBase_C*             SkillAffecterBase;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
