#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBShotPreviewSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSnipeSkill_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBShotPreviewSkill.BP_AJBShotPreviewSkill_C
// 0x00F8 (0x0380 - 0x0288)
class UBP_AJBShotPreviewSkill_C : public UBP_AJBSnipeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBShotPreviewSkill_C;           // 0x0288(0x0008)(Transient, DuplicateTransient)
	bool                                          bReserveAction;                                    // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0xF];                                      // 0x0291(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ShotTransform;                                     // 0x02A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPossibleShot;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ElementName_Projectile;                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReservedShot;                                     // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PreviewObject;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJB3DGuide_C*                       ThreeDGuideObject;                                 // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypes_ProjectileHit;                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         GuideSimFrequency;                                 // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GuideMaxSimTime_s_;                                // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             PlacementTransform;                                // 0x0310(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        PathPositions;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTag                           ShootSETag;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShootGionTag;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ActionTime_s_;                                     // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SpawnPreviewClass;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShootVoiceTag;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ThreeDGuideClass;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBShotPreviewSkill(int32 EntryPoint);
	void DestroyPreviewObject_Local();
	void TickState_Ready();
	void MC_BeginState_Action();
	void ROS_BeginState_Action();
	void BeginStateAction();
	void OnStateEnd();
	void OnCompleted_9BAF806A4E52D9B5590ED89FD84C3498(class FName NotifyName);
	void OnBlendOut_9BAF806A4E52D9B5590ED89FD84C3498(class FName NotifyName);
	void OnInterrupted_9BAF806A4E52D9B5590ED89FD84C3498(class FName NotifyName);
	void OnNotifyBegin_9BAF806A4E52D9B5590ED89FD84C3498(class FName NotifyName);
	void OnNotifyEnd_9BAF806A4E52D9B5590ED89FD84C3498(class FName NotifyName);
	void UpdateShotInfo();
	void TryDestroyPreviewObject();
	void TrySpawnPreviewObject();
	void UpdateTraceInfo();
	void ApplyTraceInfo();
	void ReserveAction();
	void GetPoliticActionTime(float* ActionTime);
	void OnStateAction();
	void OnStateReady();
	void TickStateAction();
	void OnCancel();
	void OnActive();
	void OnInactive();
	void OnReady();
	void ReceiveTick(float DeltaSeconds);
	void InitializeVariables();

	bool IsInPreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBShotPreviewSkill_C">();
	}
	static class UBP_AJBShotPreviewSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBShotPreviewSkill_C>();
	}
};
static_assert(alignof(UBP_AJBShotPreviewSkill_C) == 0x000010, "Wrong alignment on UBP_AJBShotPreviewSkill_C");
static_assert(sizeof(UBP_AJBShotPreviewSkill_C) == 0x000380, "Wrong size on UBP_AJBShotPreviewSkill_C");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, UberGraphFrame_BP_AJBShotPreviewSkill_C) == 0x000288, "Member 'UBP_AJBShotPreviewSkill_C::UberGraphFrame_BP_AJBShotPreviewSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, bReserveAction) == 0x000290, "Member 'UBP_AJBShotPreviewSkill_C::bReserveAction' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ShotTransform) == 0x0002A0, "Member 'UBP_AJBShotPreviewSkill_C::ShotTransform' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, bPossibleShot) == 0x0002D0, "Member 'UBP_AJBShotPreviewSkill_C::bPossibleShot' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ElementName_Projectile) == 0x0002D8, "Member 'UBP_AJBShotPreviewSkill_C::ElementName_Projectile' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, bReservedShot) == 0x0002E0, "Member 'UBP_AJBShotPreviewSkill_C::bReservedShot' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, PreviewObject) == 0x0002E8, "Member 'UBP_AJBShotPreviewSkill_C::PreviewObject' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ThreeDGuideObject) == 0x0002F0, "Member 'UBP_AJBShotPreviewSkill_C::ThreeDGuideObject' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ObjectTypes_ProjectileHit) == 0x0002F8, "Member 'UBP_AJBShotPreviewSkill_C::ObjectTypes_ProjectileHit' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, GuideSimFrequency) == 0x000308, "Member 'UBP_AJBShotPreviewSkill_C::GuideSimFrequency' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, GuideMaxSimTime_s_) == 0x00030C, "Member 'UBP_AJBShotPreviewSkill_C::GuideMaxSimTime_s_' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, PlacementTransform) == 0x000310, "Member 'UBP_AJBShotPreviewSkill_C::PlacementTransform' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, PathPositions) == 0x000340, "Member 'UBP_AJBShotPreviewSkill_C::PathPositions' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ShootSETag) == 0x000350, "Member 'UBP_AJBShotPreviewSkill_C::ShootSETag' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ShootGionTag) == 0x000358, "Member 'UBP_AJBShotPreviewSkill_C::ShootGionTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ActionTime_s_) == 0x000360, "Member 'UBP_AJBShotPreviewSkill_C::ActionTime_s_' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, SpawnPreviewClass) == 0x000368, "Member 'UBP_AJBShotPreviewSkill_C::SpawnPreviewClass' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ShootVoiceTag) == 0x000370, "Member 'UBP_AJBShotPreviewSkill_C::ShootVoiceTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBShotPreviewSkill_C, ThreeDGuideClass) == 0x000378, "Member 'UBP_AJBShotPreviewSkill_C::ThreeDGuideClass' has a wrong offset!");

}

