#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBMoodyRushSkill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBMoodyRushSkill.BP_AJBMoodyRushSkill_C.ExecuteUbergraph_BP_AJBMoodyRushSkill
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_DecideTarget_TargetActor;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_DecideTarget_TargetComponent;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DecideTarget_TargetHitLocation;           // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DecideTarget_TargetLocation;              // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRecording_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSpeakVoice_bWillBeSpoken;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill) == 0x000008, "Wrong alignment on BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill");
static_assert(sizeof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill) == 0x000050, "Wrong size on BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, EntryPoint) == 0x000000, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_DecideTarget_TargetActor) == 0x000010, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_DecideTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_DecideTarget_TargetComponent) == 0x000018, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_DecideTarget_TargetComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_DecideTarget_TargetHitLocation) == 0x000020, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_DecideTarget_TargetHitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_DecideTarget_TargetLocation) == 0x00002C, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_DecideTarget_TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x000040, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_TryToSpeakVoice_bWillBeSpoken) == 0x000049, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_TryToSpeakVoice_bWillBeSpoken' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, CallFunc_Array_Contains_ReturnValue) == 0x00004A, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill, K2Node_SwitchEnum_CmpSuccess) == 0x00004B, "Member 'BP_AJBMoodyRushSkill_C_ExecuteUbergraph_BP_AJBMoodyRushSkill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_AJBMoodyRushSkill.BP_AJBMoodyRushSkill_C.DecideTarget
// 0x00C0 (0x00C0 - 0x0000)
struct BP_AJBMoodyRushSkill_C_DecideTarget final
{
public:
	class AActor*                                 TargetActor_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        TargetComponent_0;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetHitLocation_0;                               // 0x0010(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation_0;                                  // 0x001C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempTargetLocation;                                // 0x0028(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempTargetHitTraceEndLocation;                     // 0x0034(0x000C)(Edit, BlueprintVisible, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               TempOwnerCharacterBP;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameStand_C*                   TempOwnerStandBP;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempStandHomeLocation;                             // 0x0050(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                TempTargetCharacter;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempDirection;                                     // 0x0068(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_DecideTarget_TargetActor;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_DecideTarget_TargetComponent;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DecideTarget_TargetHitLocation;           // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DecideTarget_TargetLocation;              // 0x0094(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRecording_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBMoodyRushSkill_C_DecideTarget) == 0x000008, "Wrong alignment on BP_AJBMoodyRushSkill_C_DecideTarget");
static_assert(sizeof(BP_AJBMoodyRushSkill_C_DecideTarget) == 0x0000C0, "Wrong size on BP_AJBMoodyRushSkill_C_DecideTarget");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TargetActor_0) == 0x000000, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TargetActor_0' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TargetComponent_0) == 0x000008, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TargetComponent_0' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TargetHitLocation_0) == 0x000010, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TargetHitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TargetLocation_0) == 0x00001C, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TargetLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempTargetLocation) == 0x000028, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempTargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempTargetHitTraceEndLocation) == 0x000034, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempTargetHitTraceEndLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempOwnerCharacterBP) == 0x000040, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempOwnerCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempOwnerStandBP) == 0x000048, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempOwnerStandBP' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempStandHomeLocation) == 0x000050, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempStandHomeLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempTargetCharacter) == 0x000060, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempTargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, TempDirection) == 0x000068, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::TempDirection' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_DecideTarget_TargetActor) == 0x000078, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_DecideTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_DecideTarget_TargetComponent) == 0x000080, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_DecideTarget_TargetComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_DecideTarget_TargetHitLocation) == 0x000088, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_DecideTarget_TargetHitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_DecideTarget_TargetLocation) == 0x000094, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_DecideTarget_TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A8, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_DecideTarget, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000B8, "Member 'BP_AJBMoodyRushSkill_C_DecideTarget::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");

// Function BP_AJBMoodyRushSkill.BP_AJBMoodyRushSkill_C.CalcCollisionEndLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation final
{
public:
	struct FVector                                EndLocation;                                       // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcCollisionEndLocation_EndLocation;     // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRecording_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation) == 0x000008, "Wrong alignment on BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation");
static_assert(sizeof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation) == 0x000030, "Wrong size on BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation, EndLocation) == 0x000000, "Member 'BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation::EndLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation, CallFunc_CalcCollisionEndLocation_EndLocation) == 0x00000C, "Member 'BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation::CallFunc_CalcCollisionEndLocation_EndLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AJBMoodyRushSkill_C_CalcCollisionEndLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

