#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneBurn

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AJBCrossfireHurricaneBurn.BP_AJBCrossfireHurricaneBurn_C.ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn) == 0x000008, "Wrong alignment on BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn");
static_assert(sizeof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn) == 0x000050, "Wrong size on BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, EntryPoint) == 0x000000, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn, CallFunc_Concat_StrStr_ReturnValue1) == 0x000040, "Member 'BP_AJBCrossfireHurricaneBurn_C_ExecuteUbergraph_BP_AJBCrossfireHurricaneBurn::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BP_AJBCrossfireHurricaneBurn.BP_AJBCrossfireHurricaneBurn_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBCrossfireHurricaneBurn_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBCrossfireHurricaneBurn_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBCrossfireHurricaneBurn_C_ReceiveTick");
static_assert(sizeof(BP_AJBCrossfireHurricaneBurn_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBCrossfireHurricaneBurn_C_ReceiveTick");
static_assert(offsetof(BP_AJBCrossfireHurricaneBurn_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBCrossfireHurricaneBurn_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

