#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBattleGameState

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBBattleGameState.BP_AJBBattleGameState_C.ExecuteUbergraph_BP_AJBBattleGameState
// 0x05B0 (0x05B0 - 0x0000)
struct BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0020(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDateTime                              CallFunc_Now_ReturnValue1;                         // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_______________Variable;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       Temp_wildcard_Variable;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_CustomEvent_BattleStartGameTime;            // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_CustomEvent_PlayerController;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LivingPlayerCount;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LivingPlayerCountWithoutCPU;    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_______________Variable1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue3;                         // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RemainingTime;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue1;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns;                    // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetElapsedInGameTimespan_ReturnValue;     // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Private_IsPlayingReplay_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameTimeRecorder_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_Array_Get_Item1;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Private_IsPlayingReplay_ReturnValue1;     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameTimeRecorder_C*            CallFunc_FinishSpawningActor_ReturnValue1;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue4;                         // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerCount;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairCount;                      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPairCount_Svr__Num;                    // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorMainCharacter1;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorPairCharacter1;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastDefeatedCharacter1;         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LastDefeatedMatchingPlayerIndex; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldPayAttentionTo2ndOnCut1; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBattleGameMode_C*                K2Node_DynamicCast_AsBP_AJBBattle_Game_Mode;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentFlowState_CurrentFlowState;     // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns1;                   // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue;     // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorMainCharacter;      // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastSurvivorPairCharacter;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_LastDefeatedCharacter;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_LastDamageCauser;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       K2Node_MakeArray_Array;                            // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item2;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeathAndEnd_ReturnValue;                // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item3;                          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers; // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable4;                                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item4;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable5;                                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeIsPair_ReturnValue;               // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesCharacterHavePlayerController_ReturnValue; // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerMatchingIndexIdByActor_PlayerMatchingIndex; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue1;    // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E[0x2];                                      // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue5;                         // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBBitesTheDustAffecter_C*          K2Node_CustomEvent_Affecter1;                      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBitesTheDustAffecter_C*          K2Node_CustomEvent_Affecter;                       // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfoByPlayerIDPureFunction_Out; // 0x03B8(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfoByPlayerIDPureFunction_ReturnValue; // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable6;                                // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterBehaviorMatches_ReturnValue2;    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B[0x1];                                      // 0x044B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select1_Default;                            // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBHighlightManager*                   CallFunc_GetHighlightManager_HighlightManager;     // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue6;                         // 0x0480(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0498(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04B8(0x0008)(NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x04C0(0x0018)()
	class ABP_AJBHighlightPlayerController_C*     K2Node_DynamicCast_AsBP_AJBHighlight_Player_Controller; // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x04E8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0530(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0548(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0588(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0598(0x0018)()
};
static_assert(alignof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState) == 0x000010, "Wrong alignment on BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState");
static_assert(sizeof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState) == 0x0005B0, "Wrong size on BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, EntryPoint) == 0x000000, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue) == 0x000008, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsServer_ReturnValue) == 0x000011, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_IsClosed_Variable) == 0x000012, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Has_Been_Initd_Variable1) == 0x000018, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsServer_ReturnValue1) == 0x000019, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_IsClosed_Variable1) == 0x00001A, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00001B, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetDebugTags_ReturnValue) == 0x000020, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_HasTag_ReturnValue) == 0x000040, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Operator) == 0x000048, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Time) == 0x000050, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_Timing) == 0x000054, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_bEnable) == 0x000055, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_bOperatorIsEmpty) == 0x000056, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_SwitchEnum_CmpSuccess) == 0x000057, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue1) == 0x000058, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable1) == 0x000060, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetTotalSeconds_ReturnValue) == 0x000070, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_______________Variable) == 0x00007C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_______________Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Variable) == 0x000080, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000081, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000088, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_wildcard_Variable) == 0x000090, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue1) == 0x0000A0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_BattleStartGameTime) == 0x0000A8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_BattleStartGameTime' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PlayerController) == 0x0000B8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_Event_DeltaSeconds) == 0x0000C0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue1) == 0x0000C4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LivingPlayerCount) == 0x0000C8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LivingPlayerCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LivingPlayerCountWithoutCPU) == 0x0000CC, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LivingPlayerCountWithoutCPU' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_______________Variable1) == 0x0000D0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_______________Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000D8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue2) == 0x0000F8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue3) == 0x000100, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Array_Index_Variable2) == 0x000108, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_RemainingTime) == 0x00010C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_RemainingTime' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue) == 0x000110, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetElapsedGameTimespan_FromBeforeCountDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetTotalSeconds_ReturnValue1) == 0x000118, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetTotalSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetJoinPawns_OutPawns) == 0x000120, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetJoinPawns_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue2) == 0x000130, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Length_ReturnValue3) == 0x000134, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Subtract_IntInt_ReturnValue) == 0x000138, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Subtract_IntInt_ReturnValue1) == 0x00013C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetElapsedInGameTimespan_ReturnValue) == 0x000140, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetElapsedInGameTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Private_IsPlayingReplay_ReturnValue) == 0x000148, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Private_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetAllActorsOfClass_OutActors) == 0x000150, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_Get_Item1) == 0x000160, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000168, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable) == 0x00016C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001A0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001A8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Private_IsPlayingReplay_ReturnValue1) == 0x0001B0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Private_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable1) == 0x0001B4, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue2) == 0x0001B8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_MakeTransform_ReturnValue1) == 0x0001C0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x0001F8, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_FinishSpawningActor_ReturnValue1) == 0x000200, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable1) == 0x000208, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue3) == 0x00020C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable2) == 0x000210, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Loop_Counter_Variable2) == 0x000214, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Add_IntInt_ReturnValue4) == 0x00021C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_int_Variable3) == 0x000220, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_Now_ReturnValue4) == 0x000228, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_Now_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_Has_Been_Initd_Variable2) == 0x000230, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PlayerCount) == 0x000234, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PlayerCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_PairCount) == 0x000238, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_PairCount' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, CallFunc_GetPairCount_Svr__Num) == 0x00023C, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::CallFunc_GetPairCount_Svr__Num' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, Temp_bool_IsClosed_Variable2) == 0x000240, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastSurvivorMainCharacter1) == 0x000248, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastSurvivorMainCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState, K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex) == 0x000250, "Member 'BP_AJBBattleGameState_C_ExecuteUbergraph_BP_AJBBattleGameState::K2Node_CustomEvent_LastSurvivorMainMatchingPlayerIndex' has a wrong offset!");
