#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_FGO

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBInGameCharacter_FGO.BP_AJBInGameCharacter_FGO_C
// 0x0030 (0x17E0 - 0x17B0)
class ABP_AJBInGameCharacter_FGO_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_FGO_C;        // 0x17A8(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBFerociousTemperamentSkill_C*     BP_AJBFerociousTemperamentSkill;                   // 0x17B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBKillerHazeSkill_C*               BP_AJBKillerHazeSkill;                             // 0x17B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBPurpleRushSkill_C*               BP_AJBPurpleRushSkill;                             // 0x17C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyPPHSkill_C*             BP_AJBAccompanyPPHSkill;                           // 0x17C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bContinuedAccompany;                               // 0x17D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_FGO(int32 EntryPoint);
	void InactiveContinuedAccompany();
	void ActiveContinuedAccompany();
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void OnGivePassiveSkillServer(class UObject* HitTarget, const struct FGameplayTag& Tag, class UObject* Causer, const struct FGameplayTag& CauserType, int32 SerialNumber);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Ultimate();
	void PressedButton_Basic();
	void Resurrection_Impl(float InvincibleTimeSec, bool bAPMax, bool bRecoveryUltimateUseCount);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SkillInactivated(class UBP_AJBSkillBase_C* InactivatedSkill);
	void CanEmote(struct FGameplayTagContainer* FailureFactor, struct FGameplayTagContainer* FailureSkills, bool* bCanEmote);
	void OnBeforeInteract(bool* bShouldInteract);
	void CheckAnySkillActiveOnTiltOneDash(bool* bAnySkillActive);
	void CheckSidlingOnTiltOnce(bool* bSidling);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBInGameCharacter_FGO_C">();
	}
	static class ABP_AJBInGameCharacter_FGO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_FGO_C>();
	}
};
static_assert(alignof(ABP_AJBInGameCharacter_FGO_C) == 0x000010, "Wrong alignment on ABP_AJBInGameCharacter_FGO_C");
static_assert(sizeof(ABP_AJBInGameCharacter_FGO_C) == 0x0017E0, "Wrong size on ABP_AJBInGameCharacter_FGO_C");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, UberGraphFrame_BP_AJBInGameCharacter_FGO_C) == 0x0017A8, "Member 'ABP_AJBInGameCharacter_FGO_C::UberGraphFrame_BP_AJBInGameCharacter_FGO_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, BP_AJBFerociousTemperamentSkill) == 0x0017B0, "Member 'ABP_AJBInGameCharacter_FGO_C::BP_AJBFerociousTemperamentSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, BP_AJBKillerHazeSkill) == 0x0017B8, "Member 'ABP_AJBInGameCharacter_FGO_C::BP_AJBKillerHazeSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, BP_AJBPurpleRushSkill) == 0x0017C0, "Member 'ABP_AJBInGameCharacter_FGO_C::BP_AJBPurpleRushSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, BP_AJBAccompanyPPHSkill) == 0x0017C8, "Member 'ABP_AJBInGameCharacter_FGO_C::BP_AJBAccompanyPPHSkill' has a wrong offset!");
static_assert(offsetof(ABP_AJBInGameCharacter_FGO_C, bContinuedAccompany) == 0x0017D0, "Member 'ABP_AJBInGameCharacter_FGO_C::bContinuedAccompany' has a wrong offset!");

}

