#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBStoneOraRushSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBMiddleRangeSkill_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBStoneOraRushSkill.BP_AJBStoneOraRushSkill_C
// 0x0018 (0x0438 - 0x0420)
class UBP_AJBStoneOraRushSkill_C final : public UBP_AJBMiddleRangeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBStoneOraRushSkill_C;          // 0x0420(0x0008)(Transient, DuplicateTransient)
	class ABP_AJBInGameStand_STF_C*               STF_Ref;                                           // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnotherAttackBeginMontage;                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBStoneOraRushSkill(int32 EntryPoint);
	void NextAttackArmIsR(bool* Result);
	void ChangeArmVisibility(bool bIsR, bool bIsLaunching);
	void ChangeArmsVisibility(bool bLeftArmIsLaunching, bool bRightArmIsLaunching);
	void OnEndState(bool bCancel, bool bRestore);
	void OnRepeatCountChanged();
	void PlaySkillBeginAnimation();
	void TryGetDamageActor(class ABP_AJBDamageActor_C** DamageActor_0);
	void ReceiveBeginPlay();
	void OnActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBStoneOraRushSkill_C">();
	}
	static class UBP_AJBStoneOraRushSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBStoneOraRushSkill_C>();
	}
};
static_assert(alignof(UBP_AJBStoneOraRushSkill_C) == 0x000008, "Wrong alignment on UBP_AJBStoneOraRushSkill_C");
static_assert(sizeof(UBP_AJBStoneOraRushSkill_C) == 0x000438, "Wrong size on UBP_AJBStoneOraRushSkill_C");
static_assert(offsetof(UBP_AJBStoneOraRushSkill_C, UberGraphFrame_BP_AJBStoneOraRushSkill_C) == 0x000420, "Member 'UBP_AJBStoneOraRushSkill_C::UberGraphFrame_BP_AJBStoneOraRushSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBStoneOraRushSkill_C, STF_Ref) == 0x000428, "Member 'UBP_AJBStoneOraRushSkill_C::STF_Ref' has a wrong offset!");
static_assert(offsetof(UBP_AJBStoneOraRushSkill_C, AnotherAttackBeginMontage) == 0x000430, "Member 'UBP_AJBStoneOraRushSkill_C::AnotherAttackBeginMontage' has a wrong offset!");

}

