#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPlacementTrapBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPlacementTrapBase.BP_AJBPlacementTrapBase_C.ExecuteUbergraph_BP_AJBPlacementTrapBase
// 0x0350 (0x0350 - 0x0000)
struct BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_CustomEvent_HitCharacter;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComponent;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex1;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult1;                   // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBI_AJBInterface_C>    K2Node_DynamicCast_AsBI_AJBInterface;              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckTargetSelf_bTarget;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AdditionalHitJudgment_bResult;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_DynamicCast_AsAJBIn_Game_Character_Base1;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckState_bMatch;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCollisionEnable_bEnable;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          K2Node_CustomEvent_BoxCollision;                   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0180(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BoxCollisionProcessOnOverlap_bDestroyed;  // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                K2Node_Event_HitCharacter;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Causer;                               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                K2Node_Event_HitCharacter1;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Causer1;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue2;    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CallFunc_RequestParticleEffectOnLocal_ParticleEffect; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0254(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0264(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBInGameAIEnvironmentComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate; // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_1;     // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1; // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPair_bPairCharacter;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue3;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue4;                    // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckState_bMatch1;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue1;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase) == 0x000008, "Wrong alignment on BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase");
static_assert(sizeof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase) == 0x000350, "Wrong size on BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, EntryPoint) == 0x000000, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_HitCharacter) == 0x000008, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OverlappedComponent1) == 0x000018, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OverlappedComponent1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherActor1) == 0x000020, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherComponent) == 0x000028, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherBodyIndex1) == 0x000030, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherBodyIndex1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_bFromSweep1) == 0x000034, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_bFromSweep1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_SweepResult1) == 0x000038, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_SweepResult1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsBI_AJBInterface) == 0x0000C0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsBI_AJBInterface' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base) == 0x0000D8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess1) == 0x0000E0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_CheckTargetSelf_bTarget) == 0x0000E1, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_CheckTargetSelf_bTarget' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetObjectClass_ReturnValue) == 0x0000E8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed) == 0x0000F0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_TryGetPropertyOwnerCharacterFromActor_bSucceed' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor) == 0x0000F8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_TryGetPropertyOwnerCharacterFromActor_OutActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_ClassIsChildOf_ReturnValue) == 0x000100, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_AdditionalHitJudgment_bResult) == 0x000101, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_AdditionalHitJudgment_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_Not_PreBool_ReturnValue) == 0x000102, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_BooleanAND_ReturnValue) == 0x000103, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsAJBIn_Game_Character_Base1) == 0x000108, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsAJBIn_Game_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess2) == 0x000110, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_HasLocalSharedController_ReturnValue) == 0x000111, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBGameInstance_bSuccess) == 0x000113, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000118, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_CheckState_bMatch) == 0x000120, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_CheckState_bMatch' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsPlayingReplay_ReturnValue) == 0x000121, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000122, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000123, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000128, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetPlayerController_ReturnValue) == 0x000130, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000138, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller) == 0x000140, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess3) == 0x000148, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_float_Variable) == 0x00014C, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_CheckCollisionEnable_bEnable) == 0x000150, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_CheckCollisionEnable_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_BoxCollision) == 0x000158, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_BoxCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OverlappedComponent) == 0x000160, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherActor) == 0x000168, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherComp) == 0x000170, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_OtherBodyIndex) == 0x000178, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_bFromSweep) == 0x00017C, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CustomEvent_SweepResult) == 0x000180, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_Operator) == 0x000208, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_Time) == 0x000210, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_Timing) == 0x000214, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_bEnable) == 0x000215, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_bOperatorIsEmpty) == 0x000216, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_BoxCollisionProcessOnOverlap_bDestroyed) == 0x000217, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_BoxCollisionProcessOnOverlap_bDestroyed' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsServer_ReturnValue) == 0x000218, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_Not_PreBool_ReturnValue1) == 0x000219, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_HitCharacter) == 0x000220, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_HitCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_Causer) == 0x000228, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_HitCharacter1) == 0x000230, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_HitCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_Causer1) == 0x000238, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_Causer1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000240, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_HasLocalSharedController_ReturnValue2) == 0x000241, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_HasLocalSharedController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000242, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_RequestParticleEffectOnLocal_ParticleEffect) == 0x000248, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_RequestParticleEffectOnLocal_ParticleEffect' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000250, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000251, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000254, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_bool_IsClosed_Variable) == 0x000260, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000264, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetOwner_ReturnValue1) == 0x000270, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetGameMode_ReturnValue) == 0x000278, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue3) == 0x000280, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetComponentByClass_ReturnValue) == 0x000288, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsValid_ReturnValue1) == 0x000290, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsServer_ReturnValue1) == 0x000291, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000298, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x0002A0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_float_Variable1) == 0x0002A4, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetOwner_ReturnValue2) == 0x0002A8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0002B0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess4) == 0x0002B8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetOwner_ReturnValue3) == 0x0002C0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue4) == 0x0002C8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_CreateDelegate_OutputDelegate) == 0x0002D0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_bool_Has_Been_Initd_Variable) == 0x0002E0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsServer_ReturnValue2) == 0x0002E1, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_bool_Variable) == 0x0002E2, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Select_Default) == 0x0002E8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetOwner_ReturnValue4) == 0x0002F0, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x0002F8, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_DynamicCast_bSuccess5) == 0x000300, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_RequestGion_AkComponent__LocalOnly_1) == 0x000308, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_RequestGion_AkComponent__LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1) == 0x000310, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsPair_bPairCharacter) == 0x000311, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsPair_bPairCharacter' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetPlayerController_ReturnValue1) == 0x000318, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_Not_PreBool_ReturnValue2) == 0x000320, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetViewTarget_ReturnValue) == 0x000328, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x000330, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000338, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsServer_ReturnValue3) == 0x000339, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00033A, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsDedicatedServer_ReturnValue5) == 0x00033B, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsServer_ReturnValue4) == 0x00033C, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, Temp_bool_Variable1) == 0x00033D, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Event_DeltaSeconds) == 0x000340, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, K2Node_Select1_Default) == 0x000344, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_CheckState_bMatch1) == 0x000348, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_CheckState_bMatch1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_IsGameplayTagValid_ReturnValue1) == 0x000349, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_IsGameplayTagValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase, CallFunc_BooleanAND_ReturnValue1) == 0x00034A, "Member 'BP_AJBPlacementTrapBase_C_ExecuteUbergraph_BP_AJBPlacementTrapBase::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BP_AJBPlacementTrapBase.BP_AJBPlacementTrapBase_C.OnComponentBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap) == 0x000008, "Wrong alignment on BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap");
static_assert(sizeof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap) == 0x0000A8, "Wrong size on BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, OverlappedComponent) == 0x000000, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, OtherActor) == 0x000008, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, OtherComp) == 0x000010, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, bFromSweep) == 0x00001C, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap, SweepResult) == 0x000020, "Member 'BP_AJBPlacementTrapBase_C_OnComponentBeginOverlap::SweepResult' has a wrong offset!");

// Function BP_AJBPlacementTrapBase.BP_AJBPlacementTrapBase_C.BindOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBPlacementTrapBase_C_BindOverlap final
{
public:
	class UBoxComponent*                          BoxCollision;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementTrapBase_C_BindOverlap) == 0x000008, "Wrong alignment on BP_AJBPlacementTrapBase_C_BindOverlap");
static_assert(sizeof(BP_AJBPlacementTrapBase_C_BindOverlap) == 0x000008, "Wrong size on BP_AJBPlacementTrapBase_C_BindOverlap");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_BindOverlap, BoxCollision) == 0x000000, "Member 'BP_AJBPlacementTrapBase_C_BindOverlap::BoxCollision' has a wrong offset!");

// Function BP_AJBPlacementTrapBase.BP_AJBPlacementTrapBase_C.OnHit
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBPlacementTrapBase_C_OnHit final
{
public:
	class AAJBInGameCharacterBase*                HitCharacter_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPlacementTrapBase_C_OnHit) == 0x000008, "Wrong alignment on BP_AJBPlacementTrapBase_C_OnHit");
static_assert(sizeof(BP_AJBPlacementTrapBase_C_OnHit) == 0x000008, "Wrong size on BP_AJBPlacementTrapBase_C_OnHit");
static_assert(offsetof(BP_AJBPlacementTrapBase_C_OnHit, HitCharacter_0) == 0x000000, "Member 'BP_AJBPlacementTrapBase_C_OnHit::HitCharacter_0' has a wrong offset!");

// Function BP_AJBPlacementTrapBase.BP_AJBPlacementTrapBase_C.OnBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AJBPlacementTrapBase_C_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AJBPlacementTrapBase_C_OnBeginOverlap) == 0x000008, "Wrong alignment on BP_AJBPlacementTrapBase_C_OnBeginOverlap");
static_assert(sizeof(BP_AJBPlacementTrapBase_C_OnBeginOverlap) == 0x0000A8, "Wrong size on BP_AJBPlacementTrapBase_C_OnBeginOverlap");
