#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectile_BubbleLauncher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher
// 0x0130 (0x0130 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeadShot;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPenetrate;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFirstHit;                            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CuttingRate;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisableDamage;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bReflect;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_ReflectRotation;                      // 0x0034(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBlocking;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_ReflectSkillTag;                      // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAvoidSkill;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class USceneComponent*>                Temp_wildcard_Variable;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHamonMode;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHamonStatusTag_HamonStatusTag;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHamonStatus_IsHamonMode;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBBubbleLauncherImpulse_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCollisionEnabled_ReturnValue;        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHamonTargetTag_HamonTargetTag;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameProjectile_Straight_C*     K2Node_Event_ReflectedProjectile;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AJBInGameProjectile_BubbleLauncher_C* K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher) == 0x000010, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher) == 0x000130, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, EntryPoint) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_HitActor) == 0x000008, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_HitLocation) == 0x000010, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_HitNormal) == 0x00001C, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bHeadShot) == 0x000028, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bPenetrate) == 0x000029, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bPenetrate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bFirstHit) == 0x00002A, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bFirstHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_CuttingRate) == 0x00002C, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bDisableDamage) == 0x000030, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bReflect) == 0x000031, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bReflect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_ReflectRotation) == 0x000034, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_ReflectRotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bBlocking) == 0x000040, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bBlocking' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_ReflectSkillTag) == 0x000048, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_ReflectSkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_bAvoidSkill) == 0x000050, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_bAvoidSkill' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, Temp_wildcard_Variable) == 0x000090, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_BooleanOR_ReturnValue) == 0x0000A4, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_DeltaSeconds) == 0x0000AC, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_CustomEvent_IsHamonMode) == 0x0000B8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_CustomEvent_IsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GetHamonStatusTag_HamonStatusTag) == 0x0000C0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GetHamonStatusTag_HamonStatusTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Array_Contains_ReturnValue) == 0x0000C8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GetHamonStatus_IsHamonMode) == 0x0000C9, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GetHamonStatus_IsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000CA, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_BooleanAND_ReturnValue) == 0x0000CB, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GetOwner_ReturnValue) == 0x0000D0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000D8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F0, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_K2_IsCollisionEnabled_ReturnValue) == 0x0000FC, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_K2_IsCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GetHamonTargetTag_HamonTargetTag) == 0x000100, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GetHamonTargetTag_HamonTargetTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_Event_ReflectedProjectile) == 0x000108, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_Event_ReflectedProjectile' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, CallFunc_GetComponentsByTag_ReturnValue) == 0x000110, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher) == 0x000120, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_DynamicCast_AsBP_AJBIn_Game_Projectile_Bubble_Launcher' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher, K2Node_DynamicCast_bSuccess1) == 0x000128, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ExecuteUbergraph_BP_AJBInGameProjectile_BubbleLauncher::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.OnProjectileReflected_Server
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server final
{
public:
	class ABP_AJBInGameProjectile_Straight_C*     ReflectedProjectile;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server) == 0x000008, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server) == 0x000008, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server, ReflectedProjectile) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnProjectileReflected_Server::ReflectedProjectile' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.MC_InitHamonStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus final
{
public:
	bool                                          IsHamonMode_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus) == 0x000001, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus) == 0x000001, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus, IsHamonMode_0) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_MC_InitHamonStatus::IsHamonMode_0' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.GetHamonStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus final
{
public:
	bool                                          IsHamonMode_0;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus) == 0x000001, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus) == 0x000001, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus, IsHamonMode_0) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatus::IsHamonMode_0' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.InitHamonStatus_Server
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server final
{
public:
	bool                                          IsHamonMode_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server) == 0x000001, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server) == 0x000001, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server, IsHamonMode_0) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_InitHamonStatus_Server::IsHamonMode_0' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.GetHamonStatusTag
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag final
{
public:
	class FName                                   HamonStatusTag;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHamonStatus_IsHamonMode;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag) == 0x000008, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag) == 0x000030, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, HamonStatusTag) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::HamonStatusTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, Temp_bool_Variable) == 0x000008, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, Temp_name_Variable) == 0x000010, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, Temp_name_Variable1) == 0x000018, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, CallFunc_GetHamonStatus_IsHamonMode) == 0x000020, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::CallFunc_GetHamonStatus_IsHamonMode' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag, K2Node_Select_Default) == 0x000028, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonStatusTag::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.GetHamonTargetTag
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag final
{
public:
	class FName                                   HamonTargetTag;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag) == 0x000008, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag) == 0x000010, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag, HamonTargetTag) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag::HamonTargetTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetHamonTargetTag::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.ShouldProcessCuttingDamage
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage final
{
public:
	bool                                          bHeadShot;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShould;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldProcessCuttingDamage_bShould;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPoliticDamage_Damage;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage) == 0x000004, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage) == 0x00000C, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, bHeadShot) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, bShould) == 0x000001, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::bShould' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, CallFunc_ShouldProcessCuttingDamage_bShould) == 0x000002, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::CallFunc_ShouldProcessCuttingDamage_bShould' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, CallFunc_GetPoliticDamage_Damage) == 0x000004, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::CallFunc_GetPoliticDamage_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ShouldProcessCuttingDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.OnROS_ProjectileHit
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeadShot;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPenetrate_0;                                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFirstHit;                                         // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CuttingRate;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableDamage;                                    // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReflect;                                          // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReflectRotation;                                   // 0x002C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          bBlocking;                                         // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReflectSkillTag_0;                                 // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bAvoidSkill;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit) == 0x000008, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit) == 0x000050, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, HitActor) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::HitActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, HitLocation_0) == 0x000008, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, HitNormal_0) == 0x000014, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::HitNormal_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bHeadShot) == 0x000020, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bPenetrate_0) == 0x000021, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bPenetrate_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bFirstHit) == 0x000022, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bFirstHit' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, CuttingRate) == 0x000024, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::CuttingRate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bDisableDamage) == 0x000028, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bDisableDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bReflect) == 0x000029, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bReflect' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, ReflectRotation) == 0x00002C, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::ReflectRotation' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bBlocking) == 0x000038, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bBlocking' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, ReflectSkillTag_0) == 0x000040, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::ReflectSkillTag_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit, bAvoidSkill) == 0x000048, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_OnROS_ProjectileHit::bAvoidSkill' has a wrong offset!");

// Function BP_AJBInGameProjectile_BubbleLauncher.BP_AJBInGameProjectile_BubbleLauncher_C.GetPoliticDamage
// 0x0090 (0x0090 - 0x0000)
struct BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage final
{
public:
	bool                                          bHeadShot;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Damage_0;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_wildcard_Variable;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPoliticDamage_Damage;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHamonStatusAttackRate_CurrentAttackRate; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHamonStatus_IsHamonMode;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_CSR_C*           K2Node_DynamicCast_AsBP_AJBIn_Game_Character_CSR;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_HamonTypeSkill_C>  CallFunc_IsHamonRateEnabledSkill_self_CastInput;   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHamonRateEnabledSkill_IsEnabled;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_HamonTypeSkill_C>  CallFunc_ShouldApplyHamonRateDirectly_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldApplyHamonRateDirectly_ShouldApplyDirectly; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage) == 0x000008, "Wrong alignment on BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage");
static_assert(sizeof(BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage) == 0x000090, "Wrong size on BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage, bHeadShot) == 0x000000, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage::bHeadShot' has a wrong offset!");
static_assert(offsetof(BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage, Damage_0) == 0x000004, "Member 'BP_AJBInGameProjectile_BubbleLauncher_C_GetPoliticDamage::Damage_0' has a wrong offset!");
