#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGamePvE_EnemySpawnManager

#include "Basic.hpp"

#include "EPvEGameDifficulty_structs.hpp"
#include "ST_AJBInGamePvE_EnemyInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "ST_AJBInGamePvE_BossSpawnTableRow_structs.hpp"
#include "ST_AJBInGamePvE_BossInfo_structs.hpp"
#include "E_AJBInGamePvE_GamePhase_structs.hpp"
#include "ST_AJBInGamePvE_EnemySpawnTableRow_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager
// 0x0308 (0x0308 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Temp_wildcard_Variable;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBInGamePvE_BossSpawnTableRow     CallFunc_Array_Get_Item;                           // 0x007C(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPvERemainingTimeInPhase_RemainingTimeInPhase; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_BossID;                         // 0x00A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AJBInGamePvE_BossInfo              CallFunc_FindBossDataByID_BossData;                // 0x00A8(0x0038)(HasGetValueTypeHash)
	class ABP_AJBInGamePvE_EnemySpawnVolume_C*    CallFunc_GetRandomSpawnArea_SpawnArea;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBInGamePvE_EnemyInfo             CallFunc_ConvertBossDataToEnemyData_EnemyInfo;     // 0x00E8(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPvEGameDifficulty                            CallFunc_GetPvEDifficulty_Difficulty;              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPvECurrentWaveIndex_WaveIndex;         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableToSpawnEnemies_IsEnableToSpawnEnemies; // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping; // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> K2Node_CustomEvent_AreaTargets;               // 0x0158(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<int32>                                 K2Node_CustomEvent_SpawnCounts;                    // 0x0168(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FST_AJBInGamePvE_EnemySpawnTableRow    CallFunc_GetCurrentSpawnSetCache_CurrentSpawnSet;  // 0x0178(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item1;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_ConvertSpawnSetToArray_SpawnAmountsInRow; // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FST_AJBInGamePvE_EnemyInfo>     CallFunc_SelectRandomEnemiesWithoutDuplication_RandomEnemies; // 0x01B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePvE_EnemySpawnVolume_C*    CallFunc_Array_Get_Item2;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabledToRespawnEnemies_IsEnabledToRespawn; // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0200(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBPvEGameState_IsValid;               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBPvEGameState_C*                  CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState;  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    K2Node_MakeStruct_MatchingPlayerInfo;              // 0x0250(0x0088)()
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item3;                          // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping1; // 0x02F0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager) == 0x000308, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, EntryPoint) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_Operator) == 0x000008, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_Time) == 0x000010, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_Timing) == 0x000014, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_bEnable) == 0x000015, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_bOperatorIsEmpty) == 0x000016, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_Variable) == 0x000017, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_int_Variable) == 0x00001C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000038, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Add_IntInt_ReturnValue1) == 0x00004C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_wildcard_Variable) == 0x000050, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000064, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Max_ReturnValue) == 0x00006C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_IsServer_ReturnValue) == 0x000074, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Length_ReturnValue1) == 0x000078, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Get_Item) == 0x00007C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Greater_IntInt_ReturnValue) == 0x00008C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Length_ReturnValue2) == 0x000090, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetPvERemainingTimeInPhase_RemainingTimeInPhase) == 0x000098, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetPvERemainingTimeInPhase_RemainingTimeInPhase' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_CustomEvent_BossID) == 0x0000A0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_CustomEvent_BossID' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_FindBossDataByID_BossData) == 0x0000A8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_FindBossDataByID_BossData' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetRandomSpawnArea_SpawnArea) == 0x0000E0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetRandomSpawnArea_SpawnArea' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_ConvertBossDataToEnemyData_EnemyInfo) == 0x0000E8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_ConvertBossDataToEnemyData_EnemyInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000118, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetPvEDifficulty_Difficulty) == 0x000119, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetPvEDifficulty_Difficulty' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetPvECurrentWaveIndex_WaveIndex) == 0x00011C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetPvECurrentWaveIndex_WaveIndex' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000121, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_BooleanAND_ReturnValue) == 0x000122, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_int_Loop_Counter_Variable1) == 0x000138, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Subtract_IntInt_ReturnValue1) == 0x00013C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000140, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_Has_Been_Initd_Variable1) == 0x000141, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_IsClosed_Variable1) == 0x000142, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_IsEnableToSpawnEnemies_IsEnableToSpawnEnemies) == 0x000143, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_IsEnableToSpawnEnemies_IsEnableToSpawnEnemies' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping) == 0x000148, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_CustomEvent_AreaTargets) == 0x000158, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_CustomEvent_AreaTargets' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_CustomEvent_SpawnCounts) == 0x000168, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_CustomEvent_SpawnCounts' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetCurrentSpawnSetCache_CurrentSpawnSet) == 0x000178, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetCurrentSpawnSetCache_CurrentSpawnSet' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Get_Item1) == 0x000198, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_ConvertSpawnSetToArray_SpawnAmountsInRow) == 0x0001A0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_ConvertSpawnSetToArray_SpawnAmountsInRow' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_SelectRandomEnemiesWithoutDuplication_RandomEnemies) == 0x0001B0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_SelectRandomEnemiesWithoutDuplication_RandomEnemies' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Length_ReturnValue3) == 0x0001C0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Get_Item2) == 0x0001C8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Length_ReturnValue4) == 0x0001D0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Min_ReturnValue) == 0x0001D4, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Subtract_IntInt_ReturnValue2) == 0x0001D8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001DC, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_IsEnabledToRespawnEnemies_IsEnabledToRespawn) == 0x0001DD, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_IsEnabledToRespawnEnemies_IsEnabledToRespawn' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_BooleanAND_ReturnValue1) == 0x0001DE, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_IsEditor_ReturnValue) == 0x0001DF, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetAJBGameInstance_bSuccess) == 0x0001E0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0001E8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_Has_Been_Initd_Variable2) == 0x0001F0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Map_Length_ReturnValue) == 0x0001F4, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Add_IntInt_ReturnValue2) == 0x0001F8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_MakeLiteralText_ReturnValue) == 0x000200, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Conv_TextToString_ReturnValue) == 0x000218, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Conv_IntToByte_ReturnValue) == 0x000228, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_MakeLiteralString_ReturnValue) == 0x000230, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetAJBPvEGameState_IsValid) == 0x000240, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetAJBPvEGameState_IsValid' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState) == 0x000248, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_MakeStruct_MatchingPlayerInfo) == 0x000250, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_MakeStruct_MatchingPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_int_Array_Index_Variable1) == 0x0002D8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_Array_Get_Item3) == 0x0002DC, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_float_Variable) == 0x0002E0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_float_Variable1) == 0x0002E4, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Select_Default) == 0x0002E8, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, K2Node_Event_DeltaSeconds) == 0x0002EC, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping1) == 0x0002F0, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager, Temp_bool_IsClosed_Variable2) == 0x000300, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ExecuteUbergraph_BP_AJBInGamePvE_EnemySpawnManager::Temp_bool_IsClosed_Variable2' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.SpawnEnemies
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies final
{
public:
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> AreaTargets;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<int32>                                 SpawnCounts;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies) == 0x000020, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies, AreaTargets) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies::AreaTargets' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies, SpawnCounts) == 0x000010, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_SpawnEnemies::SpawnCounts' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.SpawnBoss
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss final
{
public:
	int32                                         BossID;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss) == 0x000004, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss) == 0x000004, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss, BossID) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_SpawnBoss::BossID' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.ShuffleSpawnAreaMapping
// 0x0040 (0x0040 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping final
{
public:
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> ShuffledSpawnAreaMapping;                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePvE_EnemySpawnVolume_C*    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> CallFunc_GetAllActorsOfClass_OutActors;       // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping) == 0x000040, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, ShuffledSpawnAreaMapping) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::ShuffledSpawnAreaMapping' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_Add_IntInt_ReturnValue1) == 0x00001C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_IsEditor_ReturnValue) == 0x00002D, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_ShuffleSpawnAreaMapping::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.GetShuffledSpawnAreaMap
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap final
{
public:
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> ShuffledSpawnAreaMap_0;                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class ABP_AJBInGamePvE_EnemySpawnVolume_C*> CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping; // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap) == 0x000028, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap, ShuffledSpawnAreaMap_0) == 0x000000, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap::ShuffledSpawnAreaMap_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap, CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping) == 0x000010, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap::CallFunc_ShuffleSpawnAreaMapping_ShuffledSpawnAreaMapping' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_AJBInGamePvE_EnemySpawnManager_C_GetShuffledSpawnAreaMap::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBInGamePvE_EnemySpawnManager.BP_AJBInGamePvE_EnemySpawnManager_C.ConvertSpawnSetToArray
// 0x0058 (0x0058 - 0x0000)
struct BP_AJBInGamePvE_EnemySpawnManager_C_ConvertSpawnSetToArray final
{
public:
	struct FST_AJBInGamePvE_EnemySpawnTableRow    Row;                                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<int32>                                 SpawnAmountsInRow;                                 // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<int32>                                 ReturnValue;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInGamePvE_EnemySpawnManager_C_ConvertSpawnSetToArray) == 0x000008, "Wrong alignment on BP_AJBInGamePvE_EnemySpawnManager_C_ConvertSpawnSetToArray");
static_assert(sizeof(BP_AJBInGamePvE_EnemySpawnManager_C_ConvertSpawnSetToArray) == 0x000058, "Wrong size on BP_AJBInGamePvE_EnemySpawnManager_C_ConvertSpawnSetToArray");
