#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPurpleRushSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBCloseRangeSkill_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBPurpleRushSkill.BP_AJBPurpleRushSkill_C
// 0x0050 (0x0450 - 0x0400)
class UBP_AJBPurpleRushSkill_C final : public UBP_AJBCloseRangeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBPurpleRushSkill_C;            // 0x0400(0x0008)(Transient, DuplicateTransient)
	float                                         ActiveTime;                                        // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveTimeDarkPlace;                               // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PassiveSkillTime;                                  // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleOnFerocious;                                  // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverridedScale;                                    // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__BP_AJBPurpleRushSkill_C_3;                      // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__BP_AJBPurpleRushSkill_C_4;                      // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__BP_AJBPurpleRushSkill_C_5;                      // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CrackGionTag;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CrackSETag;                                        // 0x0430(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageDecal;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageDecalRupture;                                // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDecrease;                                         // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBPurpleRushSkill(int32 EntryPoint);
	void OnDecreaseCapsule(const struct FVector& Location, bool bDecrease_0);
	void MC_DecreaseCapsule(const struct FVector& Location, bool bDecrease_0);
	void ROS_DecreaseCapsule(const struct FVector& Location, bool bDecrease_0);
	void CalcActiveTime(float* ActiveTime_0);
	void CheckHitAny(class AActor* HitActor, class UActorComponent* HitComponent, bool* bHit);
	void OnDash(uint8 RepeatCount_0, bool bRedash);
	void HitWait(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, float CuttingRate, EPhysicalSurface SurfaceType, bool bDisableDamage, bool bInvincible, bool bIsPenetration, bool bBlockedByAAP, bool bHeadShot, bool bAvoidSkill);
	void CalcDashSpeed(float* DashSpeed);
	void CalcBackSpeedRange(float* BackSpeedMin, float* BackSpeedMax);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBPurpleRushSkill_C">();
	}
	static class UBP_AJBPurpleRushSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBPurpleRushSkill_C>();
	}
};
static_assert(alignof(UBP_AJBPurpleRushSkill_C) == 0x000008, "Wrong alignment on UBP_AJBPurpleRushSkill_C");
static_assert(sizeof(UBP_AJBPurpleRushSkill_C) == 0x000450, "Wrong size on UBP_AJBPurpleRushSkill_C");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, UberGraphFrame_BP_AJBPurpleRushSkill_C) == 0x000400, "Member 'UBP_AJBPurpleRushSkill_C::UberGraphFrame_BP_AJBPurpleRushSkill_C' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, ActiveTime) == 0x000408, "Member 'UBP_AJBPurpleRushSkill_C::ActiveTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, ActiveTimeDarkPlace) == 0x00040C, "Member 'UBP_AJBPurpleRushSkill_C::ActiveTimeDarkPlace' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, PassiveSkillTime) == 0x000410, "Member 'UBP_AJBPurpleRushSkill_C::PassiveSkillTime' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, ScaleOnFerocious) == 0x000414, "Member 'UBP_AJBPurpleRushSkill_C::ScaleOnFerocious' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, OverridedScale) == 0x000418, "Member 'UBP_AJBPurpleRushSkill_C::OverridedScale' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, s__BP_AJBPurpleRushSkill_C_3) == 0x00041C, "Member 'UBP_AJBPurpleRushSkill_C::s__BP_AJBPurpleRushSkill_C_3' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, s__BP_AJBPurpleRushSkill_C_4) == 0x000420, "Member 'UBP_AJBPurpleRushSkill_C::s__BP_AJBPurpleRushSkill_C_4' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, s__BP_AJBPurpleRushSkill_C_5) == 0x000424, "Member 'UBP_AJBPurpleRushSkill_C::s__BP_AJBPurpleRushSkill_C_5' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, CrackGionTag) == 0x000428, "Member 'UBP_AJBPurpleRushSkill_C::CrackGionTag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, CrackSETag) == 0x000430, "Member 'UBP_AJBPurpleRushSkill_C::CrackSETag' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, DamageDecal) == 0x000438, "Member 'UBP_AJBPurpleRushSkill_C::DamageDecal' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, DamageDecalRupture) == 0x000440, "Member 'UBP_AJBPurpleRushSkill_C::DamageDecalRupture' has a wrong offset!");
static_assert(offsetof(UBP_AJBPurpleRushSkill_C, bDecrease) == 0x000448, "Member 'UBP_AJBPurpleRushSkill_C::bDecrease' has a wrong offset!");

}

