#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInvasionOfMetallicaSkill

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill
// 0x02C0 (0x02C0 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCharacterBehavior_Critical_bReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBIronsandCamouflage_C*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActive_bActive;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag)> K2Node_CreateDelegate_OutputDelegate1; // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors;          // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision, bool bSelfDamage)> K2Node_CreateDelegate_OutputDelegate2; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Transform;                            // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_TargetActor1;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character2;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateSerialNumber_SerialNumber;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPossiblePlacement;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_RemoveCondition;                // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag1;                     // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_CustomEvent_CharacterBP;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_AddCondition;                   // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_SecondTag;                      // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x01C0(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPassiveTagProhibition_bProhibitionTag; // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors1;         // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Damage;                         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRemainHP;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDamageIsCut;                   // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bNotUseCollision;               // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSelfDamage;                    // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetValidatedActorsServer_Actors2;         // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item1;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character3;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlacement;                           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item2;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character4;     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x029C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value1;                               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill) == 0x000010, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill) == 0x0002C0, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, EntryPoint) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Value) == 0x000004, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000028, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000030, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000038, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000048, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_CheckCharacterBehavior_Critical_bReturnValue) == 0x000051, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_CheckCharacterBehavior_Critical_bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_bool_Has_Been_Initd_Variable) == 0x000068, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_CheckActive_bActive) == 0x000079, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_CheckActive_bActive' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsServer_ReturnValue) == 0x00007A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Operator) == 0x000080, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Time) == 0x000088, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Timing) == 0x00008C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bEnable) == 0x00008D, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bOperatorIsEmpty) == 0x00008E, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate1) == 0x000090, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Not_PreBool_ReturnValue1) == 0x0000A0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable1) == 0x0000A4, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_bool_IsClosed_Variable) == 0x0000A8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue1) == 0x0000AC, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors) == 0x0000B0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Transform) == 0x0000E0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Transform' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_TargetActor1) == 0x000110, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_TargetActor1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character2) == 0x000120, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess2) == 0x000128, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000130, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess3) == 0x000140, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable1) == 0x000144, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GenerateSerialNumber_SerialNumber) == 0x000148, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GenerateSerialNumber_SerialNumber' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x00014C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000150, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwner_ReturnValue1) == 0x000158, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bPossiblePlacement) == 0x000160, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bPossiblePlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_TargetActor) == 0x000168, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Add_ReturnValue) == 0x000170, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_RemoveCondition) == 0x000178, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_RemoveCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_SecondTag1) == 0x000180, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_SecondTag1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_CharacterBP) == 0x000188, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_CharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Loop_Counter_Variable2) == 0x000190, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_MatchesTag_ReturnValue) == 0x000194, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_IntInt_ReturnValue2) == 0x000198, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Find_ReturnValue) == 0x00019C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001A0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001A1, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_BooleanAND_ReturnValue) == 0x0001A2, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_AddCondition) == 0x0001A8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_SecondTag) == 0x0001B0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_SecondTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0001B8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0001C0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsValid_ReturnValue1) == 0x0001E0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_CheckPassiveTagProhibition_bProhibitionTag) == 0x0001E1, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_CheckPassiveTagProhibition_bProhibitionTag' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_HasLocalSharedController_ReturnValue) == 0x0001E2, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors1) == 0x0001E8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue1) == 0x000200, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue1) == 0x000204, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_Damage) == 0x000208, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_DamageType) == 0x000210, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_DamageCauser) == 0x000218, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bRemainHP) == 0x000220, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bDamageIsCut) == 0x000221, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bNotUseCollision) == 0x000222, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_CustomEvent_bSelfDamage) == 0x000223, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_CustomEvent_bSelfDamage' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetValidatedActorsServer_Actors2) == 0x000228, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetValidatedActorsServer_Actors2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Not_PreBool_ReturnValue2) == 0x000238, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item1) == 0x000240, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Length_ReturnValue2) == 0x000248, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_IsServer_ReturnValue1) == 0x00024C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Less_IntInt_ReturnValue2) == 0x00024D, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000250, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character3) == 0x000258, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character3' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess4) == 0x000260, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000264, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_bPlacement) == 0x000268, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Actor) == 0x000270, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, Temp_int_Array_Index_Variable2) == 0x000278, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000280, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Array_Get_Item2) == 0x000288, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_AsBP_AJBIn_Game_Character4) == 0x000290, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_AsBP_AJBIn_Game_Character4' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_DynamicCast_bSuccess5) == 0x000298, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00029C, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x0002A8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x0002B0, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, K2Node_Event_Value1) == 0x0002B4, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::K2Node_Event_Value1' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002B8, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ExecuteUbergraph_BP_AJBInvasionOfMetallicaSkill::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnSpawnObject
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject final
{
public:
	bool                                          bPlacement;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject) == 0x000010, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject, bPlacement) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject::bPlacement' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject, Actor) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnSpawnObject::Actor' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.ReceiveDamageServer
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer final
{
public:
	int32                                         Damage_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemainHP;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageIsCut;                                      // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotUseCollision;                                  // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelfDamage;                                       // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer) == 0x000020, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, Damage_0) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::Damage_0' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, DamageType) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, DamageCauser) == 0x000010, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bRemainHP) == 0x000018, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bRemainHP' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bDamageIsCut) == 0x000019, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bDamageIsCut' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bNotUseCollision) == 0x00001A, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bNotUseCollision' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer, bSelfDamage) == 0x00001B, "Member 'BP_AJBInvasionOfMetallicaSkill_C_ReceiveDamageServer::bSelfDamage' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnPassiveAdded
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded final
{
public:
	struct FGameplayTag                           AddCondition;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded) == 0x000008, "Wrong alignment on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded");
static_assert(sizeof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded) == 0x000010, "Wrong size on BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded, AddCondition) == 0x000000, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded::AddCondition' has a wrong offset!");
static_assert(offsetof(BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded, SecondTag) == 0x000008, "Member 'BP_AJBInvasionOfMetallicaSkill_C_OnPassiveAdded::SecondTag' has a wrong offset!");

// Function BP_AJBInvasionOfMetallicaSkill.BP_AJBInvasionOfMetallicaSkill_C.OnPassiveRemoved
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBInvasionOfMetallicaSkill_C_OnPassiveRemoved final
{
public:
	struct FGameplayTag                           RemoveCondition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
