#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJB3DGuide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AJB3DGuide.BP_AJB3DGuide_C.UpdateGuide
// 0x0180 (0x0180 - 0x0000)
struct BP_AJB3DGuide_C_UpdateGuide final
{
public:
	TArray<struct FVector>                        PathPositions;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	float                                         TempMaxLength;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempCurrentInstanceCount;                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempDesiredNum;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item1;                          // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item2;                          // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item3;                          // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue2;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x008C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable1;                                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue5;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInstance_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJB3DGuide_C_UpdateGuide) == 0x000010, "Wrong alignment on BP_AJB3DGuide_C_UpdateGuide");
static_assert(sizeof(BP_AJB3DGuide_C_UpdateGuide) == 0x000180, "Wrong size on BP_AJB3DGuide_C_UpdateGuide");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, PathPositions) == 0x000000, "Member 'BP_AJB3DGuide_C_UpdateGuide::PathPositions' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, TempMaxLength) == 0x000010, "Member 'BP_AJB3DGuide_C_UpdateGuide::TempMaxLength' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, TempCurrentInstanceCount) == 0x000014, "Member 'BP_AJB3DGuide_C_UpdateGuide::TempCurrentInstanceCount' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, TempDesiredNum) == 0x000018, "Member 'BP_AJB3DGuide_C_UpdateGuide::TempDesiredNum' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_IsValidIndex_ReturnValue1) == 0x000028, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_IsValidIndex_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Get_Item) == 0x00002C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Get_Item1) == 0x000038, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Length_ReturnValue1) == 0x000054, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_int_Variable) == 0x000058, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000064, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Get_Item2) == 0x000068, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000074, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Add_IntInt_ReturnValue1) == 0x000078, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_Get_Item3) == 0x00007C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Array_IsValidIndex_ReturnValue2) == 0x000088, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Array_IsValidIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_FindLookAtRotation_ReturnValue) == 0x00008C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x000098, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_VSize_ReturnValue1) == 0x0000A4, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_VSize_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue2) == 0x0000AC, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue3) == 0x0000B4, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue4) == 0x0000B8, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Greater_IntInt_ReturnValue1) == 0x0000BD, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x0000BE, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Add_IntInt_ReturnValue2) == 0x0000C8, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_int_Variable1) == 0x000100, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Subtract_IntInt_ReturnValue5) == 0x000104, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Subtract_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_AddInstance_ReturnValue) == 0x000108, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x00010C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Add_IntInt_ReturnValue3) == 0x000110, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_float_Variable) == 0x000114, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_RemoveInstance_ReturnValue) == 0x000118, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_RemoveInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_GetInstanceCount_ReturnValue) == 0x00011C, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, Temp_bool_Variable) == 0x000120, "Member 'BP_AJB3DGuide_C_UpdateGuide::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, K2Node_Select_Default) == 0x000124, "Member 'BP_AJB3DGuide_C_UpdateGuide::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000134, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_MakeTransform_ReturnValue1) == 0x000140, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJB3DGuide_C_UpdateGuide, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000170, "Member 'BP_AJB3DGuide_C_UpdateGuide::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");

}

