#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPvEGameMode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBPvEGameMode.BP_AJBPvEGameMode_C.ExecuteUbergraph_BP_AJBPvEGameMode
// 0x0598 (0x0598 - 0x0000)
struct BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x0010(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NextState)> K2Node_CreateDelegate_OutputDelegate;      // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAJBInGameCharacterBase*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class AAJBInGameCharacterBase*                CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameRessurectionComponent_C*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NextState;                      // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UStateObj*                              CallFunc_FindStateObject_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPvEPlayMode_IsPvEPlayMode;              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue1;                  // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchingPlayerInfo>            CallFunc_Map_Values_Values;                        // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers; // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item1;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns;                    // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetJoinPlayerControllers_OutPlayerControllers1; // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item2;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGamePlayerController_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller1; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetJoinPawns_OutPawns1;                   // 0x0208(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item3;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBPvEGameState_IsValid;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBPvEGameState_C*                  CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item4;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCharacterIdFromActor_CharacterId;      // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0260(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCharacterTagFromCharacter_CharacterTag; // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetPairCharacterBP_PairCharacterBP;       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBCharacterInfo                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x02D8(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x03E0(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0430(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0448(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue1;           // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1; // 0x0478(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class ABP_AJBInGameCharacter_C*>       CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0488(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               CallFunc_Array_Get_Item5;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_DamageType;                     // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPvENPC_IsPvENPC;                        // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBPvEGameState_IsValid1;              // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBPvEGameState_C*                  CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState1; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_PrevState;                            // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1_Default;                            // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    K2Node_MakeStruct_MatchingPlayerInfo;              // 0x0510(0x0088)()
};
static_assert(alignof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode) == 0x000008, "Wrong alignment on BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode");
static_assert(sizeof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode) == 0x000598, "Wrong size on BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, EntryPoint) == 0x000000, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_PlayModeEquals_bResult) == 0x000004, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_wildcard_Variable) == 0x000008, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x000010, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x000098, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000099, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable1) == 0x0000A8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable1) == 0x0000C0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue1) == 0x0000C4, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable2) == 0x0000C8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_Variable) == 0x0000CC, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Not_PreBool_ReturnValue) == 0x0000CD, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsShipping_ReturnValue) == 0x0000CE, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Not_PreBool_ReturnValue1) == 0x0000CF, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_bSuccess) == 0x0000D0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0000D8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000E0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Map_Length_ReturnValue) == 0x0000F8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetComponentByClass_ReturnValue) == 0x000100, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000108, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable2) == 0x000114, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue2) == 0x000118, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CustomEvent_NextState) == 0x000120, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CustomEvent_NextState' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_FindStateObject_ReturnValue) == 0x000128, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_FindStateObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsEditor_ReturnValue) == 0x000130, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsPvEPlayMode_IsPvEPlayMode) == 0x000131, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsPvEPlayMode_IsPvEPlayMode' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsShipping_ReturnValue1) == 0x000132, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsShipping_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Not_PreBool_ReturnValue2) == 0x000133, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Not_PreBool_ReturnValue3) == 0x000134, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_BooleanAND_ReturnValue) == 0x000135, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000136, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000138, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_BooleanAND_ReturnValue1) == 0x000140, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Map_Values_Values) == 0x000148, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Map_Keys_Keys) == 0x000158, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetJoinPlayerControllers_OutPlayerControllers) == 0x000168, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetJoinPlayerControllers_OutPlayerControllers' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable3) == 0x000178, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item1) == 0x000180, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue3) == 0x000188, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller) == 0x000190, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue1) == 0x00019C, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable3) == 0x0001A0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue1) == 0x0001A4, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetJoinPawns_OutPawns) == 0x0001A8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetJoinPawns_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue2) == 0x0001B8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable4) == 0x0001BC, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue2) == 0x0001C0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue4) == 0x0001C4, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable4) == 0x0001C8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_bSuccess2) == 0x0001CC, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x0001D0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetJoinPlayerControllers_OutPlayerControllers1) == 0x0001D8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetJoinPlayerControllers_OutPlayerControllers1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001E8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item2) == 0x0001F0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller1) == 0x0001F8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_DynamicCast_AsBP_AJBIn_Game_Player_Controller1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_DynamicCast_bSuccess1) == 0x000200, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue3) == 0x000204, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetJoinPawns_OutPawns1) == 0x000208, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetJoinPawns_OutPawns1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_Has_Been_Initd_Variable) == 0x000218, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item3) == 0x000220, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue4) == 0x000228, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Loop_Counter_Variable5) == 0x00022C, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue3) == 0x000230, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue4) == 0x000231, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue5) == 0x000234, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBPvEGameState_IsValid) == 0x000238, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBPvEGameState_IsValid' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState) == 0x000240, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_int_Array_Index_Variable5) == 0x000248, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item4) == 0x000250, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Add_IntInt_ReturnValue6) == 0x000258, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetCharacterIdFromActor_CharacterId) == 0x00025C, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetCharacterIdFromActor_CharacterId' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_MakeStruct_FormatArgumentData) == 0x000260, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_IntToString_ReturnValue) == 0x0002A0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_IntToByte_ReturnValue) == 0x0002B0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetCharacterTagFromCharacter_CharacterTag) == 0x0002B8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetCharacterTagFromCharacter_CharacterTag' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetPairCharacterBP_PairCharacterBP) == 0x0002C0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetPairCharacterBP_PairCharacterBP' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetTagName_ReturnValue) == 0x0002C8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Find_ReturnValue) == 0x0002D0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002D8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003C0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_IntToString_ReturnValue1) == 0x0003C8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Greater_IntInt_ReturnValue) == 0x0003D8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_MakeStruct_FormatArgumentData1) == 0x0003E0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_TextToString_ReturnValue) == 0x000420, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_MakeArray_Array) == 0x000430, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000440, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Format_ReturnValue) == 0x000448, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_BooleanAND_ReturnValue2) == 0x000460, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_TextToString_ReturnValue1) == 0x000468, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_TextToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CreateDelegate_OutputDelegate1) == 0x000478, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAllActorsOfClass_OutActors1) == 0x000488, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_IsClosed_Variable) == 0x000498, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Get_Item5) == 0x0004A0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Array_Length_ReturnValue5) == 0x0004A8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CustomEvent_DamageType) == 0x0004B0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CustomEvent_DeadActor) == 0x0004B8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_CustomEvent_DamageCauser) == 0x0004C0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Less_IntInt_ReturnValue5) == 0x0004C8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_IsPvENPC_IsPvENPC) == 0x0004C9, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_IsPvENPC_IsPvENPC' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Not_PreBool_ReturnValue4) == 0x0004CA, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBPvEGameState_IsValid1) == 0x0004CB, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBPvEGameState_IsValid1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState1) == 0x0004D0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_GetAJBPvEGameState_BP_AJB_PvE_GameState1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_Event_PrevState) == 0x0004D8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_Event_PrevState' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_Variable1) == 0x0004E0, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, Temp_bool_Variable2) == 0x0004E1, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_Select_Default) == 0x0004E8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_Select1_Default) == 0x0004F8, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, CallFunc_Conv_IntToString_ReturnValue2) == 0x000500, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode, K2Node_MakeStruct_MatchingPlayerInfo) == 0x000510, "Member 'BP_AJBPvEGameMode_C_ExecuteUbergraph_BP_AJBPvEGameMode::K2Node_MakeStruct_MatchingPlayerInfo' has a wrong offset!");

// Function BP_AJBPvEGameMode.BP_AJBPvEGameMode_C.Debug_SetupCharacters
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBPvEGameMode_C_Debug_SetupCharacters final
{
public:
	struct FGameplayTag                           NextState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPvEGameMode_C_Debug_SetupCharacters) == 0x000008, "Wrong alignment on BP_AJBPvEGameMode_C_Debug_SetupCharacters");
static_assert(sizeof(BP_AJBPvEGameMode_C_Debug_SetupCharacters) == 0x000008, "Wrong size on BP_AJBPvEGameMode_C_Debug_SetupCharacters");
static_assert(offsetof(BP_AJBPvEGameMode_C_Debug_SetupCharacters, NextState) == 0x000000, "Member 'BP_AJBPvEGameMode_C_Debug_SetupCharacters::NextState' has a wrong offset!");

// Function BP_AJBPvEGameMode.BP_AJBPvEGameMode_C.OnCharacterDead
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBPvEGameMode_C_OnCharacterDead final
{
public:
	struct FGameplayTag                           DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DeadActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPvEGameMode_C_OnCharacterDead) == 0x000008, "Wrong alignment on BP_AJBPvEGameMode_C_OnCharacterDead");
static_assert(sizeof(BP_AJBPvEGameMode_C_OnCharacterDead) == 0x000018, "Wrong size on BP_AJBPvEGameMode_C_OnCharacterDead");
static_assert(offsetof(BP_AJBPvEGameMode_C_OnCharacterDead, DamageType) == 0x000000, "Member 'BP_AJBPvEGameMode_C_OnCharacterDead::DamageType' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_OnCharacterDead, DeadActor) == 0x000008, "Member 'BP_AJBPvEGameMode_C_OnCharacterDead::DeadActor' has a wrong offset!");
static_assert(offsetof(BP_AJBPvEGameMode_C_OnCharacterDead, DamageCauser) == 0x000010, "Member 'BP_AJBPvEGameMode_C_OnCharacterDead::DamageCauser' has a wrong offset!");

// Function BP_AJBPvEGameMode.BP_AJBPvEGameMode_C.OnBegin_Gameplay
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBPvEGameMode_C_OnBegin_Gameplay final
{
public:
	struct FGameplayTag                           PrevState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBPvEGameMode_C_OnBegin_Gameplay) == 0x000008, "Wrong alignment on BP_AJBPvEGameMode_C_OnBegin_Gameplay");
static_assert(sizeof(BP_AJBPvEGameMode_C_OnBegin_Gameplay) == 0x000008, "Wrong size on BP_AJBPvEGameMode_C_OnBegin_Gameplay");
static_assert(offsetof(BP_AJBPvEGameMode_C_OnBegin_Gameplay, PrevState) == 0x000000, "Member 'BP_AJBPvEGameMode_C_OnBegin_Gameplay::PrevState' has a wrong offset!");

}

