#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSkillIconHandler

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.ExecuteUbergraph_BP_AJBSkillIconHandler
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler) == 0x000004, "Wrong alignment on BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler");
static_assert(sizeof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler) == 0x000010, "Wrong size on BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler, EntryPoint) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler, CallFunc_IsValid_ReturnValue1) == 0x000005, "Member 'BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_AJBSkillIconHandler_C_ExecuteUbergraph_BP_AJBSkillIconHandler::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBSkillIconHandler_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AJBSkillIconHandler_C_ReceiveTick");
static_assert(sizeof(BP_AJBSkillIconHandler_C_ReceiveTick) == 0x000004, "Wrong size on BP_AJBSkillIconHandler_C_ReceiveTick");
static_assert(offsetof(BP_AJBSkillIconHandler_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.Initialize
// 0x0078 (0x0078 - 0x0000)
struct BP_AJBSkillIconHandler_C_Initialize final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBSkillIconInfo                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNoUpdateRequiredCounter_bResult;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetSkillUnlockTag_ReturnValue;         // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_TryGetSkillUnlockTag_OutTag;              // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_Initialize) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_Initialize");
static_assert(sizeof(BP_AJBSkillIconHandler_C_Initialize) == 0x000078, "Wrong size on BP_AJBSkillIconHandler_C_Initialize");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_GetTagName_ReturnValue) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_BuildString_Name_ReturnValue) == 0x000050, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_IsNoUpdateRequiredCounter_bResult) == 0x000060, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_IsNoUpdateRequiredCounter_bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_TryGetSkillUnlockTag_ReturnValue) == 0x000062, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_TryGetSkillUnlockTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_TryGetSkillUnlockTag_OutTag) == 0x000068, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_TryGetSkillUnlockTag_OutTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_Initialize, CallFunc_IsValid_ReturnValue1) == 0x000070, "Member 'BP_AJBSkillIconHandler_C_Initialize::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.SetupSkillComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBSkillIconHandler_C_SetupSkillComponent final
{
public:
	class UBP_AJBSkillBase_C*                     Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_bIsValid;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameHUD*                          CallFunc_GetAJBInGameHUD_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBInGameSkillWidget*                  CallFunc_TryCreateSkillWidget_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_SetupSkillComponent) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_SetupSkillComponent");
static_assert(sizeof(BP_AJBSkillIconHandler_C_SetupSkillComponent) == 0x000020, "Wrong size on BP_AJBSkillIconHandler_C_SetupSkillComponent");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, Component) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::Component' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, CallFunc_IsValid_ReturnValue1) == 0x000009, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, CallFunc_GetAJBInGameHUD_bIsValid) == 0x00000A, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::CallFunc_GetAJBInGameHUD_bIsValid' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, CallFunc_GetAJBInGameHUD_ReturnValue) == 0x000010, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::CallFunc_GetAJBInGameHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupSkillComponent, CallFunc_TryCreateSkillWidget_ReturnValue) == 0x000018, "Member 'BP_AJBSkillIconHandler_C_SetupSkillComponent::CallFunc_TryCreateSkillWidget_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.SetupWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSkillIconHandler_C_SetupWidget final
{
public:
	class UWB_SkillIcon_C*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_SetupWidget) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_SetupWidget");
static_assert(sizeof(BP_AJBSkillIconHandler_C_SetupWidget) == 0x000008, "Wrong size on BP_AJBSkillIconHandler_C_SetupWidget");
static_assert(offsetof(BP_AJBSkillIconHandler_C_SetupWidget, Widget) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_SetupWidget::Widget' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.OnSkillGrownup
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBSkillIconHandler_C_OnSkillGrownup final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGrownup;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_OnSkillGrownup) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_OnSkillGrownup");
static_assert(sizeof(BP_AJBSkillIconHandler_C_OnSkillGrownup) == 0x000010, "Wrong size on BP_AJBSkillIconHandler_C_OnSkillGrownup");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillGrownup, GameplayTag) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_OnSkillGrownup::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillGrownup, Value) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_OnSkillGrownup::Value' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillGrownup, bGrownup) == 0x00000C, "Member 'BP_AJBSkillIconHandler_C_OnSkillGrownup::bGrownup' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillGrownup, CallFunc_MatchesTag_ReturnValue) == 0x00000D, "Member 'BP_AJBSkillIconHandler_C_OnSkillGrownup::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.OnSkillNumUpdated
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBSkillIconHandler_C_OnSkillNumUpdated final
{
public:
	struct FGameplayTag                           SkillTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_OnSkillNumUpdated");
static_assert(sizeof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated) == 0x000010, "Wrong size on BP_AJBSkillIconHandler_C_OnSkillNumUpdated");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated, SkillTag) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_OnSkillNumUpdated::SkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated, LeftNum) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_OnSkillNumUpdated::LeftNum' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_AJBSkillIconHandler_C_OnSkillNumUpdated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_OnSkillNumUpdated, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00000D, "Member 'BP_AJBSkillIconHandler_C_OnSkillNumUpdated::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.TryGetSkillUnlockTag
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OutTag;                                            // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable5;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeGameplayTagByName_OutTag;             // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeGameplayTagByName_ReturnValue;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag");
static_assert(sizeof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag) == 0x0000B8, "Wrong size on BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, ReturnValue) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, OutTag) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::OutTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_byte_Variable) == 0x000010, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable) == 0x000018, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable1) == 0x000028, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable2) == 0x000038, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable3) == 0x000048, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable4) == 0x000058, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, Temp_string_Variable5) == 0x000068, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::Temp_string_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, K2Node_Select_Default) == 0x000088, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, CallFunc_Concat_StrStr_ReturnValue1) == 0x000098, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, CallFunc_MakeGameplayTagByName_OutTag) == 0x0000A8, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::CallFunc_MakeGameplayTagByName_OutTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag, CallFunc_MakeGameplayTagByName_ReturnValue) == 0x0000B0, "Member 'BP_AJBSkillIconHandler_C_TryGetSkillUnlockTag::CallFunc_MakeGameplayTagByName_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.IsNoUpdateRequiredCounter
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LNotUpdateSkillTagNames;                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FString                                 LSkillTag;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter");
static_assert(sizeof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter) == 0x0000A0, "Wrong size on BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, bResult) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::bResult' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, LNotUpdateSkillTagNames) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::LNotUpdateSkillTagNames' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, LSkillTag) == 0x000018, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::LSkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_GetTagName_ReturnValue) == 0x000048, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Split_LeftS) == 0x000060, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Split_RightS) == 0x000070, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Split_ReturnValue) == 0x000080, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00009C, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'BP_AJBSkillIconHandler_C_IsNoUpdateRequiredCounter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.UpdateSkillIcon
// 0x0170 (0x0170 - 0x0000)
struct BP_AJBSkillIconHandler_C_UpdateSkillIcon final
{
public:
	float                                         LCharacterMP;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LNotUpdateSkillTagNames;                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FString                                 LSkillTag;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0040(0x0020)()
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0078(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_1; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPoliticConsumptionMP_ConsumptionMP;    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPoliticConsumptionMP_ConsumptionMP1;   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_2; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue1;      // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetPoliticConsumptionMP_ConsumptionMP2;   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue1; // 0x0108(0x0020)()
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue1;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetGrowupSkillSPByGrowupTag_bSuccess;  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TryGetGrowupSkillSPByGrowupTag_SP;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue2; // 0x0148(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue2;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_UpdateSkillIcon) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_UpdateSkillIcon");
static_assert(sizeof(BP_AJBSkillIconHandler_C_UpdateSkillIcon) == 0x000170, "Wrong size on BP_AJBSkillIconHandler_C_UpdateSkillIcon");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, LCharacterMP) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::LCharacterMP' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, LNotUpdateSkillTagNames) == 0x000008, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::LNotUpdateSkillTagNames' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, LSkillTag) == 0x000018, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::LSkillTag' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000040, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000060, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000078, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_HasAnyTags_ReturnValue) == 0x000098, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_) == 0x00009C, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_FFloor_ReturnValue) == 0x0000A4, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_1) == 0x0000A8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Not_PreBool_ReturnValue1) == 0x0000AD, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticConsumptionMP_ConsumptionMP) == 0x0000B0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticConsumptionMP_ConsumptionMP' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0000B8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x0000C0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_bSuccess1) == 0x0000C8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0000CC, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_FTrunc_ReturnValue) == 0x0000D0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticConsumptionMP_ConsumptionMP1) == 0x0000D8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticConsumptionMP_ConsumptionMP1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_2) == 0x0000DC, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticContinuedConsumptionMP__s__ContinuedConsumptionMP__s_2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E1, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_NearlyEqual_FloatFloat_ReturnValue1) == 0x0000E2, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_NearlyEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_BooleanOR_ReturnValue) == 0x0000E3, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetPoliticConsumptionMP_ConsumptionMP2) == 0x0000E4, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetPoliticConsumptionMP_ConsumptionMP2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0000E8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_IsValid_ReturnValue1) == 0x0000E9, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetTagName_ReturnValue) == 0x0000F0, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_BuildString_Name_ReturnValue) == 0x0000F8, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue1) == 0x000108, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x000128, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_HasAnyTags_ReturnValue1) == 0x000130, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_HasAnyTags_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000138, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, K2Node_DynamicCast_bSuccess2) == 0x000140, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_TryGetGrowupSkillSPByGrowupTag_bSuccess) == 0x000141, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_TryGetGrowupSkillSPByGrowupTag_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_TryGetGrowupSkillSPByGrowupTag_SP) == 0x000144, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_TryGetGrowupSkillSPByGrowupTag_SP' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue2) == 0x000148, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_HasAnyTags_ReturnValue2) == 0x000168, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_HasAnyTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000169, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AJBSkillIconHandler_C_UpdateSkillIcon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00016A, "Member 'BP_AJBSkillIconHandler_C_UpdateSkillIcon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AJBSkillIconHandler.BP_AJBSkillIconHandler_C.GetSkillIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBSkillIconHandler_C_GetSkillIcon final
{
public:
	class UWB_SkillIcon_C*                        TargetWidget_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBSkillIconHandler_C_GetSkillIcon) == 0x000008, "Wrong alignment on BP_AJBSkillIconHandler_C_GetSkillIcon");
static_assert(sizeof(BP_AJBSkillIconHandler_C_GetSkillIcon) == 0x000008, "Wrong size on BP_AJBSkillIconHandler_C_GetSkillIcon");
static_assert(offsetof(BP_AJBSkillIconHandler_C_GetSkillIcon, TargetWidget_0) == 0x000000, "Member 'BP_AJBSkillIconHandler_C_GetSkillIcon::TargetWidget_0' has a wrong offset!");

}

