#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRollerImpulseBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBDamageImpulseBase_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AJBRoadRollerImpulseBase.BP_AJBRoadRollerImpulseBase_C
// 0x0018 (0x04C8 - 0x04B0)
class ABP_AJBRoadRollerImpulseBase_C : public ABP_AJBDamageImpulseBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRoadRollerImpulseBase_C;      // 0x04B0(0x0008)(Transient, DuplicateTransient)
	class FName                                   ParamContentName;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DamageDecal_C*                      DamageDecal;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRoadRollerImpulseBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AJBRoadRollerImpulseBase_C">();
	}
	static class ABP_AJBRoadRollerImpulseBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBRoadRollerImpulseBase_C>();
	}
};
static_assert(alignof(ABP_AJBRoadRollerImpulseBase_C) == 0x000008, "Wrong alignment on ABP_AJBRoadRollerImpulseBase_C");
static_assert(sizeof(ABP_AJBRoadRollerImpulseBase_C) == 0x0004C8, "Wrong size on ABP_AJBRoadRollerImpulseBase_C");
static_assert(offsetof(ABP_AJBRoadRollerImpulseBase_C, UberGraphFrame_BP_AJBRoadRollerImpulseBase_C) == 0x0004B0, "Member 'ABP_AJBRoadRollerImpulseBase_C::UberGraphFrame_BP_AJBRoadRollerImpulseBase_C' has a wrong offset!");
static_assert(offsetof(ABP_AJBRoadRollerImpulseBase_C, ParamContentName) == 0x0004B8, "Member 'ABP_AJBRoadRollerImpulseBase_C::ParamContentName' has a wrong offset!");
static_assert(offsetof(ABP_AJBRoadRollerImpulseBase_C, DamageDecal) == 0x0004C0, "Member 'ABP_AJBRoadRollerImpulseBase_C::DamageDecal' has a wrong offset!");

}

