#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_AkEventWithGion

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"
#include "AnimNotify_AkEvent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_AkEventWithGion.BP_AnimNotify_AkEventWithGion_C
// 0x0028 (0x0090 - 0x0068)
class UBP_AnimNotify_AkEventWithGion_C final : public UAnimNotify_AkEvent_C
{
public:
	bool                                          DisplayGion;                                       // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GionTag;                                           // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpanwedSpaceInOwnersEnv;                           // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GionSpawnedSpace                            SpanwedSpaceInNotOwnersEnv;                        // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           WwiseEventTag;                                     // 0x0080(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreAIGion;                                     // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimNotify_AkEventWithGion_C">();
	}
	static class UBP_AnimNotify_AkEventWithGion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_AkEventWithGion_C>();
	}
};
static_assert(alignof(UBP_AnimNotify_AkEventWithGion_C) == 0x000008, "Wrong alignment on UBP_AnimNotify_AkEventWithGion_C");
static_assert(sizeof(UBP_AnimNotify_AkEventWithGion_C) == 0x000090, "Wrong size on UBP_AnimNotify_AkEventWithGion_C");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, DisplayGion) == 0x000068, "Member 'UBP_AnimNotify_AkEventWithGion_C::DisplayGion' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, GionTag) == 0x000070, "Member 'UBP_AnimNotify_AkEventWithGion_C::GionTag' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, SpanwedSpaceInOwnersEnv) == 0x000078, "Member 'UBP_AnimNotify_AkEventWithGion_C::SpanwedSpaceInOwnersEnv' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, SpanwedSpaceInNotOwnersEnv) == 0x000079, "Member 'UBP_AnimNotify_AkEventWithGion_C::SpanwedSpaceInNotOwnersEnv' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, WwiseEventTag) == 0x000080, "Member 'UBP_AnimNotify_AkEventWithGion_C::WwiseEventTag' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotify_AkEventWithGion_C, bIgnoreAIGion) == 0x000088, "Member 'UBP_AnimNotify_AkEventWithGion_C::bIgnoreAIGion' has a wrong offset!");

}

