#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBVirusCapsuleUIHandler

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AJBVirusCapsuleUIHandler.BP_AJBVirusCapsuleUIHandler_C.ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActiveBehavior                      Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterActiveBehavior                      K2Node_CustomEvent_NextBehavior;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler) == 0x000004, "Wrong alignment on BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler");
static_assert(sizeof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler) == 0x000010, "Wrong size on BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, EntryPoint) == 0x000000, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable) == 0x000004, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable1) == 0x000005, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable2) == 0x000006, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable3) == 0x000007, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable4) == 0x000008, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable5) == 0x000009, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable6) == 0x00000A, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, Temp_byte_Variable7) == 0x00000B, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, K2Node_CustomEvent_NextBehavior) == 0x00000C, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::K2Node_CustomEvent_NextBehavior' has a wrong offset!");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler, K2Node_Select_Default) == 0x00000D, "Member 'BP_AJBVirusCapsuleUIHandler_C_ExecuteUbergraph_BP_AJBVirusCapsuleUIHandler::K2Node_Select_Default' has a wrong offset!");

// Function BP_AJBVirusCapsuleUIHandler.BP_AJBVirusCapsuleUIHandler_C.OnCharacterActiveBehaviorChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged final
{
public:
	ECharacterActiveBehavior                      NextBehavior;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged) == 0x000001, "Wrong alignment on BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged");
static_assert(sizeof(BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged) == 0x000001, "Wrong size on BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged, NextBehavior) == 0x000000, "Member 'BP_AJBVirusCapsuleUIHandler_C_OnCharacterActiveBehaviorChanged::NextBehavior' has a wrong offset!");

// Function BP_AJBVirusCapsuleUIHandler.BP_AJBVirusCapsuleUIHandler_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBVirusCapsuleUIHandler_C_Initialize final
{
public:
	class AAJBInGameCharacter*                    TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVirusCapsuleUIHandler_C_Initialize) == 0x000008, "Wrong alignment on BP_AJBVirusCapsuleUIHandler_C_Initialize");
static_assert(sizeof(BP_AJBVirusCapsuleUIHandler_C_Initialize) == 0x000008, "Wrong size on BP_AJBVirusCapsuleUIHandler_C_Initialize");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_Initialize, TargetCharacter_0) == 0x000000, "Member 'BP_AJBVirusCapsuleUIHandler_C_Initialize::TargetCharacter_0' has a wrong offset!");

// Function BP_AJBVirusCapsuleUIHandler.BP_AJBVirusCapsuleUIHandler_C.SetupWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBVirusCapsuleUIHandler_C_SetupWidget final
{
public:
	class UWB_VirusCapsuleList_C*                 VirusCapsuleListWidget_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AJBVirusCapsuleUIHandler_C_SetupWidget) == 0x000008, "Wrong alignment on BP_AJBVirusCapsuleUIHandler_C_SetupWidget");
static_assert(sizeof(BP_AJBVirusCapsuleUIHandler_C_SetupWidget) == 0x000008, "Wrong size on BP_AJBVirusCapsuleUIHandler_C_SetupWidget");
static_assert(offsetof(BP_AJBVirusCapsuleUIHandler_C_SetupWidget, VirusCapsuleListWidget_0) == 0x000000, "Member 'BP_AJBVirusCapsuleUIHandler_C_SetupWidget::VirusCapsuleListWidget_0' has a wrong offset!");

}

