#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaSelectModelLoader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ObjectLoader_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharaSelectModelLoader.BP_CharaSelectModelLoader_C
// 0x0028 (0x0360 - 0x0338)
class ABP_CharaSelectModelLoader_C final : public ABP_ObjectLoader_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(Transient, DuplicateTransient)
	UMulticastDelegateProperty_                   OnLoadedMannequinClass;                            // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnLoadedCardTexture;                               // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_CharaSelectModelLoader(int32 EntryPoint);
	void BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_1_OnLoadedObjectDispatcher__DelegateSignature(const class FString& LoadId, class UObject* LoadedObject);
	void BndEvt__BPC_ObjectLoader_K2Node_ComponentBoundEvent_0_OnLoadedClassDispatcher__DelegateSignature(const class FString& LoadId, class UClass* LoadObjClass);
	void RequestCharaSelectModel(int32 Index_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharaSelectModelLoader_C">();
	}
	static class ABP_CharaSelectModelLoader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharaSelectModelLoader_C>();
	}
};
static_assert(alignof(ABP_CharaSelectModelLoader_C) == 0x000008, "Wrong alignment on ABP_CharaSelectModelLoader_C");
static_assert(sizeof(ABP_CharaSelectModelLoader_C) == 0x000360, "Wrong size on ABP_CharaSelectModelLoader_C");
static_assert(offsetof(ABP_CharaSelectModelLoader_C, UberGraphFrame) == 0x000338, "Member 'ABP_CharaSelectModelLoader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CharaSelectModelLoader_C, OnLoadedMannequinClass) == 0x000340, "Member 'ABP_CharaSelectModelLoader_C::OnLoadedMannequinClass' has a wrong offset!");
static_assert(offsetof(ABP_CharaSelectModelLoader_C, OnLoadedCardTexture) == 0x000350, "Member 'ABP_CharaSelectModelLoader_C::OnLoadedCardTexture' has a wrong offset!");

}

