#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EchoStampGionSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.ExecuteUbergraph_BP_EchoStampGionSpawner
// 0x0178 (0x0178 - 0x0000)
struct BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBGameplayTagOwnerInterface_C> K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_TagContainerCopy;         // 0x0028(0x0020)()
	bool                                          CallFunc_CheckPassiveTagProhibition_bProhibitionTag; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue;     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character1;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLocalSharedController_ReturnValue1;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_Event_Operator;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                K2Node_Event_Timing;                               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOperatorIsEmpty;                     // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_GionSpawnWorldLocation1;        // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_GionSpawnWorldLocation;         // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue5;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_;      // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LastSurvivorIsDetermined_OnServer_ReturnValue; // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveBitesTheDust_ReturnValue;      // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_AkComponent__LocalOnly_1;     // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner) == 0x000008, "Wrong alignment on BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner");
static_assert(sizeof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner) == 0x000178, "Wrong size on BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, EntryPoint) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface) == 0x000010, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_AsBI_AJBGameplay_Tag_Owner_Interface' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetGameplayTags_TagContainerCopy) == 0x000028, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetGameplayTags_TagContainerCopy' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_CheckPassiveTagProhibition_bProhibitionTag) == 0x000048, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_CheckPassiveTagProhibition_bProhibitionTag' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue1) == 0x000050, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_float_Variable) == 0x000058, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_AsBP_AJBIn_Game_Character) == 0x000060, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_AsBP_AJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_HasLocalSharedController_ReturnValue) == 0x000069, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_HasLocalSharedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue2) == 0x000070, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_AsBP_AJBIn_Game_Character1) == 0x000078, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_AsBP_AJBIn_Game_Character1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_DynamicCast_bSuccess2) == 0x000080, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_HasLocalSharedController_ReturnValue1) == 0x000081, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_HasLocalSharedController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_RandomFloat_ReturnValue) == 0x000084, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_Lerp_ReturnValue) == 0x000088, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_EndPlayReason) == 0x0000A4, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_bool_Variable) == 0x0000B4, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsValid_ReturnValue) == 0x0000B5, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsValid_ReturnValue1) == 0x0000B6, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B7, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000B8, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B9, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_DeltaSeconds) == 0x0000BC, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_bool_Has_Been_Initd_Variable) == 0x0000C0, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_float_Variable1) == 0x0000C4, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_Operator) == 0x0000C8, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_Operator' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_Time) == 0x0000D0, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_Timing) == 0x0000D4, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_Timing' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_bEnable) == 0x0000D5, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Event_bOperatorIsEmpty) == 0x0000D6, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Event_bOperatorIsEmpty' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_Select_Default) == 0x0000D8, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsServer_ReturnValue) == 0x0000DC, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsValid_ReturnValue2) == 0x0000DD, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_bool_IsClosed_Variable) == 0x0000DE, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, Temp_delegate_Variable) == 0x0000E0, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0000F0, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0000F4, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000F8, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue3) == 0x000108, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000110, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue4) == 0x000120, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_CustomEvent_GionSpawnWorldLocation1) == 0x000128, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_CustomEvent_GionSpawnWorldLocation1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, K2Node_CustomEvent_GionSpawnWorldLocation) == 0x000134, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::K2Node_CustomEvent_GionSpawnWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GetOwner_ReturnValue5) == 0x000140, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GetOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_RequestGion_AkComponent__LocalOnly_) == 0x000148, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_RequestGion_AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_) == 0x000150, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_LastSurvivorIsDetermined_OnServer_ReturnValue) == 0x000151, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_LastSurvivorIsDetermined_OnServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_CheckActiveBitesTheDust_ReturnValue) == 0x000152, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_CheckActiveBitesTheDust_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x000153, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000154, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_BooleanOR_ReturnValue1) == 0x000155, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000156, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000158, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_RequestGion_AkComponent__LocalOnly_1) == 0x000168, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_RequestGion_AkComponent__LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1) == 0x000170, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_RequestGion_bFullfilDisplayCond_LocalOnly_1' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner, CallFunc_Add_FloatFloat_ReturnValue) == 0x000174, "Member 'BP_EchoStampGionSpawner_C_ExecuteUbergraph_BP_EchoStampGionSpawner::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.MC_RequestEchoGion
// 0x000C (0x000C - 0x0000)
struct BP_EchoStampGionSpawner_C_MC_RequestEchoGion final
{
public:
	struct FVector                                GionSpawnWorldLocation;                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_MC_RequestEchoGion) == 0x000004, "Wrong alignment on BP_EchoStampGionSpawner_C_MC_RequestEchoGion");
static_assert(sizeof(BP_EchoStampGionSpawner_C_MC_RequestEchoGion) == 0x00000C, "Wrong size on BP_EchoStampGionSpawner_C_MC_RequestEchoGion");
static_assert(offsetof(BP_EchoStampGionSpawner_C_MC_RequestEchoGion, GionSpawnWorldLocation) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_MC_RequestEchoGion::GionSpawnWorldLocation' has a wrong offset!");

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.ROS_RequestEchoGion
// 0x000C (0x000C - 0x0000)
struct BP_EchoStampGionSpawner_C_ROS_RequestEchoGion final
{
public:
	struct FVector                                GionSpawnWorldLocation;                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_ROS_RequestEchoGion) == 0x000004, "Wrong alignment on BP_EchoStampGionSpawner_C_ROS_RequestEchoGion");
static_assert(sizeof(BP_EchoStampGionSpawner_C_ROS_RequestEchoGion) == 0x00000C, "Wrong size on BP_EchoStampGionSpawner_C_ROS_RequestEchoGion");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ROS_RequestEchoGion, GionSpawnWorldLocation) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_ROS_RequestEchoGion::GionSpawnWorldLocation' has a wrong offset!");

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.NotifyTheWorld
// 0x0010 (0x0010 - 0x0000)
struct BP_EchoStampGionSpawner_C_NotifyTheWorld final
{
public:
	class AAJBInGameCharacter*                    Operator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGeneralTiming                                Timing;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOperatorIsEmpty;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_NotifyTheWorld) == 0x000008, "Wrong alignment on BP_EchoStampGionSpawner_C_NotifyTheWorld");
static_assert(sizeof(BP_EchoStampGionSpawner_C_NotifyTheWorld) == 0x000010, "Wrong size on BP_EchoStampGionSpawner_C_NotifyTheWorld");
static_assert(offsetof(BP_EchoStampGionSpawner_C_NotifyTheWorld, Operator) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_NotifyTheWorld::Operator' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_NotifyTheWorld, Time) == 0x000008, "Member 'BP_EchoStampGionSpawner_C_NotifyTheWorld::Time' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_NotifyTheWorld, Timing) == 0x00000C, "Member 'BP_EchoStampGionSpawner_C_NotifyTheWorld::Timing' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_NotifyTheWorld, bEnable) == 0x00000D, "Member 'BP_EchoStampGionSpawner_C_NotifyTheWorld::bEnable' has a wrong offset!");
static_assert(offsetof(BP_EchoStampGionSpawner_C_NotifyTheWorld, bOperatorIsEmpty) == 0x00000E, "Member 'BP_EchoStampGionSpawner_C_NotifyTheWorld::bOperatorIsEmpty' has a wrong offset!");

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EchoStampGionSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EchoStampGionSpawner_C_ReceiveTick");
static_assert(sizeof(BP_EchoStampGionSpawner_C_ReceiveTick) == 0x000004, "Wrong size on BP_EchoStampGionSpawner_C_ReceiveTick");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EchoStampGionSpawner.BP_EchoStampGionSpawner_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EchoStampGionSpawner_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EchoStampGionSpawner_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EchoStampGionSpawner_C_ReceiveEndPlay");
static_assert(sizeof(BP_EchoStampGionSpawner_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EchoStampGionSpawner_C_ReceiveEndPlay");
static_assert(offsetof(BP_EchoStampGionSpawner_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EchoStampGionSpawner_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

