#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectPool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectPool.BP_EffectPool_C
// 0x0038 (0x0128 - 0x00F0)
class UBP_EffectPool_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	int32                                         PoolSize;                                          // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAJBInGameEffectActor*>          PoolBuffer;                                        // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         CurrentIndex;                                      // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 EffectActorClass;                                  // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AdditionEffectNumWhenShort;                        // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EffectPool(int32 EntryPoint);
	void ResetEffectCustomTimeDilation();
	void ReceiveBeginPlay();
	void FindEffectActor(bool* bIsFound, class AAJBInGameEffectActor** UseEffectActor);
	void InitializePool();
	void CalcAvailableEffectActorNum(int32* AvailableNum);
	void AddEffectsInPool(int32 Num);
	void DoubleEffectsInPool();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EffectPool_C">();
	}
	static class UBP_EffectPool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EffectPool_C>();
	}
};
static_assert(alignof(UBP_EffectPool_C) == 0x000008, "Wrong alignment on UBP_EffectPool_C");
static_assert(sizeof(UBP_EffectPool_C) == 0x000128, "Wrong size on UBP_EffectPool_C");
static_assert(offsetof(UBP_EffectPool_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_EffectPool_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EffectPool_C, PoolSize) == 0x0000F8, "Member 'UBP_EffectPool_C::PoolSize' has a wrong offset!");
static_assert(offsetof(UBP_EffectPool_C, PoolBuffer) == 0x000100, "Member 'UBP_EffectPool_C::PoolBuffer' has a wrong offset!");
static_assert(offsetof(UBP_EffectPool_C, CurrentIndex) == 0x000110, "Member 'UBP_EffectPool_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UBP_EffectPool_C, EffectActorClass) == 0x000118, "Member 'UBP_EffectPool_C::EffectActorClass' has a wrong offset!");
static_assert(offsetof(UBP_EffectPool_C, AdditionEffectNumWhenShort) == 0x000120, "Member 'UBP_EffectPool_C::AdditionEffectNumWhenShort' has a wrong offset!");

}

