#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGameProp_TerraceArch_4Aarch

#include "Basic.hpp"

#include "BP_InGameProp_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InGameProp_TerraceArch_4Aarch.BP_InGameProp_TerraceArch_4Aarch_C
// 0x0040 (0x03B0 - 0x0370)
class ABP_InGameProp_TerraceArch_4Aarch_C final : public ABP_InGameProp_C
{
public:
	class UNavLinkComponent*                      NavLink2;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavLinkComponent*                      NavLink1;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavLinkComponent*                      NavLink;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InGameProp_TerraceArch_4Aarch_C">();
	}
	static class ABP_InGameProp_TerraceArch_4Aarch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InGameProp_TerraceArch_4Aarch_C>();
	}
};
static_assert(alignof(ABP_InGameProp_TerraceArch_4Aarch_C) == 0x000008, "Wrong alignment on ABP_InGameProp_TerraceArch_4Aarch_C");
static_assert(sizeof(ABP_InGameProp_TerraceArch_4Aarch_C) == 0x0003B0, "Wrong size on ABP_InGameProp_TerraceArch_4Aarch_C");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, NavLink2) == 0x000370, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::NavLink2' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, NavLink1) == 0x000378, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::NavLink1' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, NavLink) == 0x000380, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::NavLink' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, ChildActor) == 0x000388, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, StaticMesh3) == 0x000390, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, StaticMesh2) == 0x000398, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, StaticMesh1) == 0x0003A0, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_InGameProp_TerraceArch_4Aarch_C, StaticMesh) == 0x0003A8, "Member 'ABP_InGameProp_TerraceArch_4Aarch_C::StaticMesh' has a wrong offset!");

}

