#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LaunchPart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LaunchPart.BP_LaunchPart_C
// 0x0038 (0x0360 - 0x0328)
class ABP_LaunchPart_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UAJBInGameMovementComponent*            AJBInGameMovement;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       MiddleRange_Attack;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFollowingComponent;                             // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Rep_DestinationComponent;                          // 0x0350(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Rep_DestinationSocketName;                         // 0x0358(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LaunchPart(int32 EntryPoint);
	void OnReady();
	void FollowReliable();
	void Follow();
	void OnReturn();
	void OnLaunch();
	void ReceiveTick(float DeltaSeconds);
	void GetDamageActorTargetLocation(struct FVector* Location);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LaunchPart_C">();
	}
	static class ABP_LaunchPart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LaunchPart_C>();
	}
};
static_assert(alignof(ABP_LaunchPart_C) == 0x000008, "Wrong alignment on ABP_LaunchPart_C");
static_assert(sizeof(ABP_LaunchPart_C) == 0x000360, "Wrong size on ABP_LaunchPart_C");
static_assert(offsetof(ABP_LaunchPart_C, UberGraphFrame) == 0x000328, "Member 'ABP_LaunchPart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, AJBInGameMovement) == 0x000330, "Member 'ABP_LaunchPart_C::AJBInGameMovement' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, Capsule) == 0x000338, "Member 'ABP_LaunchPart_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, MiddleRange_Attack) == 0x000340, "Member 'ABP_LaunchPart_C::MiddleRange_Attack' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, bIsFollowingComponent) == 0x000348, "Member 'ABP_LaunchPart_C::bIsFollowingComponent' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, Rep_DestinationComponent) == 0x000350, "Member 'ABP_LaunchPart_C::Rep_DestinationComponent' has a wrong offset!");
static_assert(offsetof(ABP_LaunchPart_C, Rep_DestinationSocketName) == 0x000358, "Member 'ABP_LaunchPart_C::Rep_DestinationSocketName' has a wrong offset!");

}

