#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerPlayGion

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SequencerPlayGion.BP_SequencerPlayGion_C.ExecuteUbergraph_BP_SequencerPlayGion
// 0x0018 (0x0018 - 0x0000)
struct BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_OutGame__AkComponent__LocalOnly_; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_OutGame__bFullfilDisplayCond_LocalOnly_; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion) == 0x000008, "Wrong alignment on BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion");
static_assert(sizeof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion) == 0x000018, "Wrong size on BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion");
static_assert(offsetof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion, EntryPoint) == 0x000000, "Member 'BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion, CallFunc_RequestGion_OutGame__AkComponent__LocalOnly_) == 0x000008, "Member 'BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion::CallFunc_RequestGion_OutGame__AkComponent__LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion, CallFunc_RequestGion_OutGame__bFullfilDisplayCond_LocalOnly_) == 0x000010, "Member 'BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion::CallFunc_RequestGion_OutGame__bFullfilDisplayCond_LocalOnly_' has a wrong offset!");
static_assert(offsetof(BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

