#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StartPointChip

#include "Basic.hpp"

#include "ST_ChipData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StartPointChip.BP_StartPointChip_C.ExecuteUbergraph_BP_StartPointChip
// 0x00A0 (0x00A0 - 0x0000)
struct BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_New_Rotation_Z__Yaw_;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x000C(0x000C)(IsPlainOldData, NoDestructor)
	struct FST_ChipData                           K2Node_CustomEvent_Data;                           // 0x0018(0x0020)(HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RewardNo;                       // 0x0054(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_RandomDurationMin;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RandomDurationMax;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBAssetManager*                       CallFunc_Get_ReturnValue;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerIconIDByRewardNo_ReturnValue;    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_TryGetPlayerIcon_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip) == 0x000008, "Wrong alignment on BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip");
static_assert(sizeof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip) == 0x0000A0, "Wrong size on BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, EntryPoint) == 0x000000, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_CustomEvent_New_Rotation_Z__Yaw_) == 0x000008, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_CustomEvent_New_Rotation_Z__Yaw_' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00000C, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_CustomEvent_Data) == 0x000018, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_MakeRotator_ReturnValue) == 0x000044, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_IsValid_ReturnValue1) == 0x000050, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000051, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_SwitchName_CmpSuccess) == 0x000052, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_CustomEvent_RewardNo) == 0x000054, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_CustomEvent_RewardNo' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_GetAJBGameInstance_bSuccess) == 0x000058, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000060, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_IsPlaying_ReturnValue) == 0x000068, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_CustomEvent_RandomDurationMin) == 0x00006C, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_CustomEvent_RandomDurationMin' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, K2Node_CustomEvent_RandomDurationMax) == 0x000070, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::K2Node_CustomEvent_RandomDurationMax' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_RandomFloatInRange_ReturnValue) == 0x000074, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_Get_ReturnValue) == 0x000078, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_GetPlayerIconIDByRewardNo_ReturnValue) == 0x000080, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_GetPlayerIconIDByRewardNo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_TryGetPlayerIcon_ReturnValue) == 0x000088, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_TryGetPlayerIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_IsValid_ReturnValue2) == 0x000098, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip, CallFunc_SetStaticMesh_ReturnValue) == 0x000099, "Member 'BP_StartPointChip_C_ExecuteUbergraph_BP_StartPointChip::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_StartPointChip.BP_StartPointChip_C.PlayChipActionDrop
// 0x0008 (0x0008 - 0x0000)
struct BP_StartPointChip_C_PlayChipActionDrop final
{
public:
	float                                         RandomDurationMin;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomDurationMax;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartPointChip_C_PlayChipActionDrop) == 0x000004, "Wrong alignment on BP_StartPointChip_C_PlayChipActionDrop");
static_assert(sizeof(BP_StartPointChip_C_PlayChipActionDrop) == 0x000008, "Wrong size on BP_StartPointChip_C_PlayChipActionDrop");
static_assert(offsetof(BP_StartPointChip_C_PlayChipActionDrop, RandomDurationMin) == 0x000000, "Member 'BP_StartPointChip_C_PlayChipActionDrop::RandomDurationMin' has a wrong offset!");
static_assert(offsetof(BP_StartPointChip_C_PlayChipActionDrop, RandomDurationMax) == 0x000004, "Member 'BP_StartPointChip_C_PlayChipActionDrop::RandomDurationMax' has a wrong offset!");

// Function BP_StartPointChip.BP_StartPointChip_C.UpdateChipPlayerIcon
// 0x0004 (0x0004 - 0x0000)
struct BP_StartPointChip_C_UpdateChipPlayerIcon final
{
public:
	int32                                         RewardNo;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartPointChip_C_UpdateChipPlayerIcon) == 0x000004, "Wrong alignment on BP_StartPointChip_C_UpdateChipPlayerIcon");
static_assert(sizeof(BP_StartPointChip_C_UpdateChipPlayerIcon) == 0x000004, "Wrong size on BP_StartPointChip_C_UpdateChipPlayerIcon");
static_assert(offsetof(BP_StartPointChip_C_UpdateChipPlayerIcon, RewardNo) == 0x000000, "Member 'BP_StartPointChip_C_UpdateChipPlayerIcon::RewardNo' has a wrong offset!");

// Function BP_StartPointChip.BP_StartPointChip_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct BP_StartPointChip_C_Setup final
{
public:
	struct FST_ChipData                           Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartPointChip_C_Setup) == 0x000008, "Wrong alignment on BP_StartPointChip_C_Setup");
static_assert(sizeof(BP_StartPointChip_C_Setup) == 0x000020, "Wrong size on BP_StartPointChip_C_Setup");
static_assert(offsetof(BP_StartPointChip_C_Setup, Data) == 0x000000, "Member 'BP_StartPointChip_C_Setup::Data' has a wrong offset!");

// Function BP_StartPointChip.BP_StartPointChip_C.UpdateRotationYaw
// 0x0004 (0x0004 - 0x0000)
struct BP_StartPointChip_C_UpdateRotationYaw final
{
public:
	float                                         New_Rotation_Z__Yaw_;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartPointChip_C_UpdateRotationYaw) == 0x000004, "Wrong alignment on BP_StartPointChip_C_UpdateRotationYaw");
static_assert(sizeof(BP_StartPointChip_C_UpdateRotationYaw) == 0x000004, "Wrong size on BP_StartPointChip_C_UpdateRotationYaw");
static_assert(offsetof(BP_StartPointChip_C_UpdateRotationYaw, New_Rotation_Z__Yaw_) == 0x000000, "Member 'BP_StartPointChip_C_UpdateRotationYaw::New_Rotation_Z__Yaw_' has a wrong offset!");

}

