#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequenceTargetCharacterPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SequenceTargetCharacterPoint.BP_SequenceTargetCharacterPoint_C.ExecuteUbergraph_BP_SequenceTargetCharacterPoint
// 0x00B0 (0x00B0 - 0x0000)
struct BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetViewCharacterLocationAndRotation_Location; // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetViewCharacterLocationAndRotation_Rotation; // 0x0010(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint) == 0x000008, "Wrong alignment on BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint");
static_assert(sizeof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint) == 0x0000B0, "Wrong size on BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, EntryPoint) == 0x000000, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, CallFunc_GetViewCharacterLocationAndRotation_Location) == 0x000004, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::CallFunc_GetViewCharacterLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, CallFunc_GetViewCharacterLocationAndRotation_Rotation) == 0x000010, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::CallFunc_GetViewCharacterLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000020, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0000A8, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint, K2Node_Event_DeltaSeconds) == 0x0000AC, "Member 'BP_SequenceTargetCharacterPoint_C_ExecuteUbergraph_BP_SequenceTargetCharacterPoint::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_SequenceTargetCharacterPoint.BP_SequenceTargetCharacterPoint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SequenceTargetCharacterPoint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequenceTargetCharacterPoint_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SequenceTargetCharacterPoint_C_ReceiveTick");
static_assert(sizeof(BP_SequenceTargetCharacterPoint_C_ReceiveTick) == 0x000004, "Wrong size on BP_SequenceTargetCharacterPoint_C_ReceiveTick");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SequenceTargetCharacterPoint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SequenceTargetCharacterPoint.BP_SequenceTargetCharacterPoint_C.GetViewCharacterLocationAndRotation
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         LCameraOffsetZ;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             LCharacter;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_InGameCharacterSequencer_C> K2Node_DynamicCast_AsBI_in_Game_Character_Sequencer; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOpeningCharacterCameraOffsetZ_OffsetZ; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_DynamicCast_AsAJBIn_Game_Character;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0070(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation) == 0x000008, "Wrong alignment on BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation");
static_assert(sizeof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation) == 0x0000C8, "Wrong size on BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, Location) == 0x000000, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::Location' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, Rotation) == 0x00000C, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::Rotation' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, LCameraOffsetZ) == 0x000018, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::LCameraOffsetZ' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, LCharacter) == 0x000020, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::LCharacter' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, K2Node_DynamicCast_AsBI_in_Game_Character_Sequencer) == 0x000030, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::K2Node_DynamicCast_AsBI_in_Game_Character_Sequencer' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetViewTarget_ReturnValue) == 0x000048, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetOpeningCharacterCameraOffsetZ_OffsetZ) == 0x000050, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetOpeningCharacterCameraOffsetZ_OffsetZ' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, K2Node_DynamicCast_AsAJBIn_Game_Character) == 0x000058, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::K2Node_DynamicCast_AsAJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000070, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_BreakVector_X) == 0x00007C, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_BreakVector_Y) == 0x000080, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_BreakVector_Z) == 0x000084, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000088, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000090, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000098, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x0000A0, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000B0, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_MakeVector_ReturnValue) == 0x0000B4, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C0, "Member 'BP_SequenceTargetCharacterPoint_C_GetViewCharacterLocationAndRotation::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");

}

