#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_AJBTraceFunctions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_TraceInfo_structs.hpp"


namespace SDK::Params
{

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.TryGetTraceInfo
// 0x0048 (0x0048 - 0x0000)
struct BPF_AJBTraceFunctions_C_TryGetTraceInfo final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               DrawDebugTrace;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawTime;                                          // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TraceInfo                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0008)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGamePlayerController*             K2Node_DynamicCast_AsAJBIn_Game_Player_Controller; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_TryGetTraceInfo) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_TryGetTraceInfo");
static_assert(sizeof(BPF_AJBTraceFunctions_C_TryGetTraceInfo) == 0x000048, "Wrong size on BPF_AJBTraceFunctions_C_TryGetTraceInfo");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, __WorldContext) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, DrawDebugTrace) == 0x000010, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, DrawTime) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, CallFunc_GetTagName_ReturnValue) == 0x000018, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, K2Node_DynamicCast_AsAJBIn_Game_Player_Controller) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::K2Node_DynamicCast_AsAJBIn_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_TryGetTraceInfo, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'BPF_AJBTraceFunctions_C_TryGetTraceInfo::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBMultiSphereTraceForObjects
// 0x00B0 (0x00B0 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bTraceComplex;                                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x0054(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x0064(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     OutHits;                                           // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0098(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects) == 0x0000B0, "Wrong size on BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, Radius) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::Radius' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, ObjectTypes) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, bTraceComplex) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, ActorsToIgnore) == 0x000040, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, bIgnoreSelf) == 0x000050, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, TraceColor) == 0x000054, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, TraceHitColor) == 0x000064, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, __WorldContext) == 0x000078, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, OutHits) == 0x000080, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::OutHits' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, ReturnValue) == 0x000090, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x000091, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, CallFunc_TryGetTraceInfo_DrawTime) == 0x000094, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000098, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x0000A8, "Member 'BPF_AJBTraceFunctions_C_AJBMultiSphereTraceForObjects::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBLineTraceForObjects
// 0x0198 (0x0198 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBLineTraceForObjects final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bTraceComplex;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0038(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x004C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x005C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OutHit;                                            // 0x0078(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBLineTraceForObjects");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects) == 0x000198, "Wrong size on BPF_AJBTraceFunctions_C_AJBLineTraceForObjects");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, ObjectTypes) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, bTraceComplex) == 0x000030, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, ActorsToIgnore) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, bIgnoreSelf) == 0x000048, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, TraceColor) == 0x00004C, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, TraceHitColor) == 0x00005C, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, __WorldContext) == 0x000070, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, OutHit) == 0x000078, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, ReturnValue) == 0x000100, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x000101, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, CallFunc_TryGetTraceInfo_DrawTime) == 0x000104, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000108, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceForObjects, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000190, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceForObjects::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBSphereTraceForObjects
// 0x01A0 (0x01A0 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bTraceComplex;                                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x0054(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x0064(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OutHit;                                            // 0x0080(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects) == 0x0001A0, "Wrong size on BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, Radius) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::Radius' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, ObjectTypes) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, bTraceComplex) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, ActorsToIgnore) == 0x000040, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, bIgnoreSelf) == 0x000050, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, TraceColor) == 0x000054, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, TraceHitColor) == 0x000064, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, __WorldContext) == 0x000078, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, OutHit) == 0x000080, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, ReturnValue) == 0x000108, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x000109, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, CallFunc_TryGetTraceInfo_DrawTime) == 0x00010C, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000110, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000198, "Member 'BPF_AJBTraceFunctions_C_AJBSphereTraceForObjects::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBLineTraceByChannel
// 0x0188 (0x0188 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBLineTraceByChannel final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTraceComplex;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x003C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x004C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OutHit;                                            // 0x0068(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBLineTraceByChannel");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel) == 0x000188, "Wrong size on BPF_AJBTraceFunctions_C_AJBLineTraceByChannel");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, TraceChannel) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::TraceChannel' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, bTraceComplex) == 0x000021, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, ActorsToIgnore) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, bIgnoreSelf) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, TraceColor) == 0x00003C, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, TraceHitColor) == 0x00004C, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, __WorldContext) == 0x000060, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, OutHit) == 0x000068, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, ReturnValue) == 0x0000F0, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x0000F1, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, CallFunc_TryGetTraceInfo_DrawTime) == 0x0000F4, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, CallFunc_LineTraceSingle_OutHit) == 0x0000F8, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBLineTraceByChannel, CallFunc_LineTraceSingle_ReturnValue) == 0x000180, "Member 'BPF_AJBTraceFunctions_C_AJBLineTraceByChannel::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBCapsuleTraceByChannel
// 0x0190 (0x0190 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HalfHeight;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTraceComplex;                                     // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0030(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x0044(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x0054(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OutHit;                                            // 0x0070(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel) == 0x000190, "Wrong size on BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, Radius) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::Radius' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, HalfHeight) == 0x000024, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::HalfHeight' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, TraceChannel) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::TraceChannel' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, bTraceComplex) == 0x000029, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, ActorsToIgnore) == 0x000030, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, bIgnoreSelf) == 0x000040, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, TraceColor) == 0x000044, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, TraceHitColor) == 0x000054, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, __WorldContext) == 0x000068, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, OutHit) == 0x000070, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, ReturnValue) == 0x0000F8, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x0000F9, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, CallFunc_TryGetTraceInfo_DrawTime) == 0x0000FC, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, CallFunc_CapsuleTraceSingle_OutHit) == 0x000100, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::CallFunc_CapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel, CallFunc_CapsuleTraceSingle_ReturnValue) == 0x000188, "Member 'BPF_AJBTraceFunctions_C_AJBCapsuleTraceByChannel::CallFunc_CapsuleTraceSingle_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBMultiLineTraceForObjects
// 0x00A8 (0x00A8 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bTraceComplex;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0038(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x004C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x005C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     OutHits;                                           // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x0090(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects) == 0x0000A8, "Wrong size on BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, ObjectTypes) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, bTraceComplex) == 0x000030, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, ActorsToIgnore) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, bIgnoreSelf) == 0x000048, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::bIgnoreSelf' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, TraceColor) == 0x00004C, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::TraceColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, TraceHitColor) == 0x00005C, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::TraceHitColor' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, __WorldContext) == 0x000070, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, OutHits) == 0x000078, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::OutHits' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, ReturnValue) == 0x000088, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, CallFunc_TryGetTraceInfo_DrawDebugTrace) == 0x000089, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::CallFunc_TryGetTraceInfo_DrawDebugTrace' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, CallFunc_TryGetTraceInfo_DrawTime) == 0x00008C, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::CallFunc_TryGetTraceInfo_DrawTime' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, CallFunc_LineTraceMultiForObjects_OutHits) == 0x000090, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::CallFunc_LineTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects, CallFunc_LineTraceMultiForObjects_ReturnValue) == 0x0000A0, "Member 'BPF_AJBTraceFunctions_C_AJBMultiLineTraceForObjects::CallFunc_LineTraceMultiForObjects_ReturnValue' has a wrong offset!");

// Function BPF_AJBTraceFunctions.BPF_AJBTraceFunctions_C.AJBMultiCapsuleTraceForObjects
// 0x00B0 (0x00B0 - 0x0000)
struct BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects final
{
public:
	struct FGameplayTag                           TraceInfoTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HalfHeight;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bTraceComplex;                                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bIgnoreSelf;                                       // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x0054(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraceHitColor;                                     // 0x0064(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     OutHits;                                           // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               CallFunc_TryGetTraceInfo_DrawDebugTrace;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TryGetTraceInfo_DrawTime;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiForObjects_OutHits;      // 0x0098(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiForObjects_ReturnValue;  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects) == 0x000008, "Wrong alignment on BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects");
static_assert(sizeof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects) == 0x0000B0, "Wrong size on BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, TraceInfoTag) == 0x000000, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::TraceInfoTag' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, Start) == 0x000008, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::Start' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, End) == 0x000014, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::End' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, Radius) == 0x000020, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::Radius' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, HalfHeight) == 0x000024, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::HalfHeight' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, ObjectTypes) == 0x000028, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, bTraceComplex) == 0x000038, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::bTraceComplex' has a wrong offset!");
static_assert(offsetof(BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects, ActorsToIgnore) == 0x000040, "Member 'BPF_AJBTraceFunctions_C_AJBMultiCapsuleTraceForObjects::ActorsToIgnore' has a wrong offset!");
