#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBIfPairNeedRescue_Paramed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_AJBIfPairNeedRescue_Paramed.BTD_AJBIfPairNeedRescue_Paramed_C
// 0x0038 (0x00D8 - 0x00A0)
class UBTD_AJBIfPairNeedRescue_Paramed_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	float                                         DiffXYMaxSqParam;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DiffXYMax;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProbabilityToRescueNPCFlagOnParam;                 // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ProbabilityToRescueNPCFlagOn;                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealPairThreshHP;                                  // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPairMode;                                       // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BTD_AJBIfPairNeedRescue_Paramed(int32 EntryPoint);
	void Initialize(class AAIController* AI_Controller);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_AJBIfPairNeedRescue_Paramed_C">();
	}
	static class UBTD_AJBIfPairNeedRescue_Paramed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBIfPairNeedRescue_Paramed_C>();
	}
};
static_assert(alignof(UBTD_AJBIfPairNeedRescue_Paramed_C) == 0x000008, "Wrong alignment on UBTD_AJBIfPairNeedRescue_Paramed_C");
static_assert(sizeof(UBTD_AJBIfPairNeedRescue_Paramed_C) == 0x0000D8, "Wrong size on UBTD_AJBIfPairNeedRescue_Paramed_C");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, UberGraphFrame) == 0x0000A0, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, DiffXYMaxSqParam) == 0x0000A8, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::DiffXYMaxSqParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, DiffXYMax) == 0x0000B0, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::DiffXYMax' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, Recognition) == 0x0000B8, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::Recognition' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, ProbabilityToRescueNPCFlagOnParam) == 0x0000C0, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::ProbabilityToRescueNPCFlagOnParam' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, ProbabilityToRescueNPCFlagOn) == 0x0000C8, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::ProbabilityToRescueNPCFlagOn' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, HealPairThreshHP) == 0x0000D0, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::HealPairThreshHP' has a wrong offset!");
static_assert(offsetof(UBTD_AJBIfPairNeedRescue_Paramed_C, bIsPairMode) == 0x0000D4, "Member 'UBTD_AJBIfPairNeedRescue_Paramed_C::bIsPairMode' has a wrong offset!");

}

