#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBClearValuesOnExit

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTD_AJBClearValuesOnExit.BTD_AJBClearValuesOnExit_C.ExecuteUbergraph_BTD_AJBClearValuesOnExit
// 0x0020 (0x0020 - 0x0000)
struct BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_Event_NodeResult;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit) == 0x000008, "Wrong alignment on BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit");
static_assert(sizeof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit) == 0x000020, "Wrong size on BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit, EntryPoint) == 0x000000, "Member 'BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit, K2Node_Event_OwnerController) == 0x000008, "Member 'BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit, K2Node_Event_NodeResult) == 0x000018, "Member 'BTD_AJBClearValuesOnExit_C_ExecuteUbergraph_BTD_AJBClearValuesOnExit::K2Node_Event_NodeResult' has a wrong offset!");

// Function BTD_AJBClearValuesOnExit.BTD_AJBClearValuesOnExit_C.ReceiveExecutionFinishAI
// 0x0018 (0x0018 - 0x0000)
struct BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 NodeResult;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI) == 0x000008, "Wrong alignment on BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI");
static_assert(sizeof(BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI) == 0x000018, "Wrong size on BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI, OwnerController) == 0x000000, "Member 'BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI, NodeResult) == 0x000010, "Member 'BTD_AJBClearValuesOnExit_C_ReceiveExecutionFinishAI::NodeResult' has a wrong offset!");

// Function BTD_AJBClearValuesOnExit.BTD_AJBClearValuesOnExit_C.PerformConditionCheckAI
// 0x0018 (0x0018 - 0x0000)
struct BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI) == 0x000018, "Wrong size on BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBClearValuesOnExit_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");

}

