#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBInSaferAreaSmall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTD_AJBInSaferAreaSmall.BTD_AJBInSaferAreaSmall_C.PerformConditionCheckAI
// 0x0060 (0x0060 - 0x0000)
struct BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDamageAreaAvailable_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSafeArea_Location;                     // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeArea_Radius;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeXY_ReturnValue;                      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI) == 0x000060, "Wrong size on BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000018, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_GetRecognition_ReturnValue) == 0x000020, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_GetLocation_ReturnValue) == 0x000028, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_IsDamageAreaAvailable_ReturnValue) == 0x000034, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_IsDamageAreaAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_GetSafeArea_Location) == 0x000038, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_GetSafeArea_Location' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_GetSafeArea_Radius) == 0x000044, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_GetSafeArea_Radius' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_VSizeXY_ReturnValue) == 0x000054, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI, CallFunc_Less_FloatFloat_ReturnValue) == 0x000058, "Member 'BTD_AJBInSaferAreaSmall_C_PerformConditionCheckAI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

