#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBScopedPushContextTags

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_AJBScopedPushContextTags.BTD_AJBScopedPushContextTags_C
// 0x0018 (0x00B8 - 0x00A0)
class UBTD_AJBScopedPushContextTags_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           EventTagOnStart;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTagOnFinish;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTD_AJBScopedPushContextTags(int32 EntryPoint);
	void ReceiveExecutionFinishAI(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult);
	void ReceiveExecutionStartAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_AJBScopedPushContextTags_C">();
	}
	static class UBTD_AJBScopedPushContextTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBScopedPushContextTags_C>();
	}
};
static_assert(alignof(UBTD_AJBScopedPushContextTags_C) == 0x000008, "Wrong alignment on UBTD_AJBScopedPushContextTags_C");
static_assert(sizeof(UBTD_AJBScopedPushContextTags_C) == 0x0000B8, "Wrong size on UBTD_AJBScopedPushContextTags_C");
static_assert(offsetof(UBTD_AJBScopedPushContextTags_C, UberGraphFrame) == 0x0000A0, "Member 'UBTD_AJBScopedPushContextTags_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTD_AJBScopedPushContextTags_C, EventTagOnStart) == 0x0000A8, "Member 'UBTD_AJBScopedPushContextTags_C::EventTagOnStart' has a wrong offset!");
static_assert(offsetof(UBTD_AJBScopedPushContextTags_C, EventTagOnFinish) == 0x0000B0, "Member 'UBTD_AJBScopedPushContextTags_C::EventTagOnFinish' has a wrong offset!");

}

