#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfOnSlopeSHA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBJumpIfOnSlopeSHA.BTS_AJBJumpIfOnSlopeSHA_C.ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA
// 0x05B0 (0x05B0 - 0x0000)
struct BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x0018(0x0020)()
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable1;                             // 0x0070(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue1; // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x00A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x00E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue1;            // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x013C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_ReturnValue;              // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0160(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue2;            // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_ReturnValue1;             // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x019C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue3;            // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue2;                 // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumping_ReturnValue;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x01E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue1;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue2; // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue6;                  // 0x0208(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0218(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x02A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x02B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x032C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue7;                  // 0x0338(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x0344(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorNormalizeAndDot_ReturnValue;     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit1;        // 0x0358(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue1;   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x03E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x03EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x03F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x0404(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x0410(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x0448(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x0454(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorNormalizeAndDot_ReturnValue1;    // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_VectorNormalizeAndDot_ReturnValue2;    // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0470(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue3; // 0x0480(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit2;        // 0x0490(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue2;   // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit3;        // 0x0520(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue3;   // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA) == 0x000008, "Wrong alignment on BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA");
static_assert(sizeof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA) == 0x0005B0, "Wrong size on BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, EntryPoint) == 0x000000, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, Temp_object_Variable) == 0x000008, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetDebugTags_ReturnValue) == 0x000018, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue) == 0x000038, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x00004C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_IsValidAILocation_ReturnValue) == 0x000058, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_DegCos_ReturnValue) == 0x00005C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, Temp_object_Variable1) == 0x000070, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue1) == 0x000080, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue1) == 0x000090, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, Temp_object_Variable2) == 0x0000A0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, K2Node_Event_OwnerController) == 0x0000B0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, K2Node_Event_ControlledPawn) == 0x0000B8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, K2Node_Event_DeltaSeconds) == 0x0000C0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetInput_ReturnValue) == 0x0000C8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetRecognition_ReturnValue) == 0x0000D0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetFloatParam_ReturnValue) == 0x0000D8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetFloatParam_Found) == 0x0000DC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x0000E0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue2) == 0x0000E8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetForwardVector_ReturnValue) == 0x0000F4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetLocation_ReturnValue) == 0x000100, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00010C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetForwardVector_ReturnValue1) == 0x000118, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_X) == 0x000130, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_Y) == 0x000134, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_Z) == 0x000138, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue3) == 0x00013C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetFootLocation_ReturnValue) == 0x000148, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetFootLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000154, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue1) == 0x000160, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetForwardVector_ReturnValue2) == 0x00016C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetForwardVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue2) == 0x000178, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_X1) == 0x000184, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_Y1) == 0x000188, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakVector_Z1) == 0x00018C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetFootLocation_ReturnValue1) == 0x000190, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetFootLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue4) == 0x00019C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetForwardVector_ReturnValue3) == 0x0001A8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetForwardVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0001B4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetLocation_ReturnValue1) == 0x0001C0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_GetLocation_ReturnValue2) == 0x0001CC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_GetLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_IsJumping_ReturnValue) == 0x0001D8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_IsJumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue3) == 0x0001DC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue5) == 0x0001E8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_DegCos_ReturnValue1) == 0x0001F4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_DegCos_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue2) == 0x0001F8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue6) == 0x000208, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000218, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002A0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue4) == 0x0002A4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue5) == 0x0002B0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_bBlockingHit) == 0x0002BC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002BD, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Time) == 0x0002C0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Distance) == 0x0002C4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Location) == 0x0002C8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_ImpactPoint) == 0x0002D4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Normal) == 0x0002E0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_ImpactNormal) == 0x0002EC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_PhysMat) == 0x0002F8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitActor) == 0x000300, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitComponent) == 0x000308, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitBoneName) == 0x000310, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitItem) == 0x000318, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_FaceIndex) == 0x00031C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_TraceStart) == 0x000320, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_TraceEnd) == 0x00032C, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_MakeVector_ReturnValue7) == 0x000338, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_MakeVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Add_VectorVector_ReturnValue6) == 0x000344, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Add_VectorVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AI_VectorNormalizeAndDot_ReturnValue) == 0x000350, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AI_VectorNormalizeAndDot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_OutHit1) == 0x000358, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_OutHit1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_ReturnValue1) == 0x0003E0, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Less_FloatFloat_ReturnValue) == 0x0003E1, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_bBlockingHit1) == 0x0003E2, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_bInitialOverlap1) == 0x0003E3, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Time1) == 0x0003E4, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Distance1) == 0x0003E8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Location1) == 0x0003EC, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_ImpactPoint1) == 0x0003F8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_Normal1) == 0x000404, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_ImpactNormal1) == 0x000410, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_PhysMat1) == 0x000420, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitActor1) == 0x000428, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitComponent1) == 0x000430, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitBoneName1) == 0x000438, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_HitItem1) == 0x000440, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_FaceIndex1) == 0x000444, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_TraceStart1) == 0x000448, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BreakHitResult_TraceEnd1) == 0x000454, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AI_VectorNormalizeAndDot_ReturnValue1) == 0x000460, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AI_VectorNormalizeAndDot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AI_VectorNormalizeAndDot_ReturnValue2) == 0x000464, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AI_VectorNormalizeAndDot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000468, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000469, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_BooleanAND_ReturnValue) == 0x00046A, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, Temp_object_Variable3) == 0x000470, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue3) == 0x000480, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_AITraceObjectTypesWithoutPlayers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_OutHit2) == 0x000490, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_OutHit2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_ReturnValue2) == 0x000518, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_OutHit3) == 0x000520, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_OutHit3' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA, CallFunc_LineTraceSingleForObjects_ReturnValue3) == 0x0005A8, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA::CallFunc_LineTraceSingleForObjects_ReturnValue3' has a wrong offset!");

// Function BTS_AJBJumpIfOnSlopeSHA.BTS_AJBJumpIfOnSlopeSHA_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBJumpIfOnSlopeSHA_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

