#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpOverFenceOnPath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBJumpOverFenceOnPath.BTS_AJBJumpOverFenceOnPath_C.ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath
// 0x0258 (0x0258 - 0x0000)
struct BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidVectorValue_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumping_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue2; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Acos_ReturnValue;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue1;            // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_RadiansToDegrees_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00F8(0x0018)()
	bool                                          K2Node_MathExpression_ReturnValue1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	struct FGameplayTag                           CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetDebugTags_ReturnValue;                 // 0x01A8(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue1;  // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue2;  // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x0204(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x021C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue1;                      // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEventTagLocker*                        CallFunc_SpawnEventTagLocker_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath) == 0x000008, "Wrong alignment on BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath");
static_assert(sizeof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath) == 0x000258, "Wrong size on BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, EntryPoint) == 0x000000, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_Event_OwnerController1) == 0x000008, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_Event_ControlledPawn1) == 0x000010, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_IsValidVectorValue_ReturnValue) == 0x000028, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_IsValidVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x00002C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000038, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000040, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetLocation_ReturnValue) == 0x000048, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_IsJumping_ReturnValue) == 0x000054, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_IsJumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_X) == 0x000068, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_Y) == 0x00006C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_Z) == 0x000070, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetForwardVector_ReturnValue) == 0x000080, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_MathExpression_ReturnValue) == 0x00008C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetControllingImaginaryCharacter_ReturnValue2) == 0x000090, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetControllingImaginaryCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Acos_ReturnValue) == 0x000098, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Acos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetForwardVector_ReturnValue1) == 0x00009C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_RadiansToDegrees_ReturnValue) == 0x0000E8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_RadiansToDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetLocation_ReturnValue1) == 0x0000EC, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000F8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_MathExpression_ReturnValue1) == 0x000110, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_MathExpression_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_MakeStruct_FormatArgumentData1) == 0x000118, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_MakeArray_Array) == 0x000158, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Format_ReturnValue) == 0x000168, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty) == 0x000180, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_AI_CanSHAReachLocationIfJumpOver_JumpTypeOrEmpty' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000188, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, Temp_bool_Has_Been_Initd_Variable) == 0x000189, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_CustomEvent_AIController) == 0x000190, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetInput_ReturnValue) == 0x000198, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetRecognition_ReturnValue) == 0x0001A0, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetDebugTags_ReturnValue) == 0x0001A8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetDebugTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_HasTag_ReturnValue) == 0x0001C8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_Event_OwnerController) == 0x0001D0, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, K2Node_Event_ControlledPawn) == 0x0001D8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetBlackboardValueAsVector_ReturnValue1) == 0x0001E0, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetBlackboardValueAsVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, Temp_bool_Has_Been_Initd_Variable1) == 0x0001EC, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0001F0, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0001F4, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_GetBlackboardValueAsVector_ReturnValue2) == 0x0001F8, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_GetBlackboardValueAsVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x000204, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_X1) == 0x000210, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_Y1) == 0x000214, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_BreakVector_Z1) == 0x000218, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_MakeVector_ReturnValue1) == 0x00021C, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Normal_ReturnValue1) == 0x000228, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Normal_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, Temp_bool_IsClosed_Variable1) == 0x000234, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000238, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_Add_VectorVector_ReturnValue) == 0x000244, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath, CallFunc_SpawnEventTagLocker_ReturnValue) == 0x000250, "Member 'BTS_AJBJumpOverFenceOnPath_C_ExecuteUbergraph_BTS_AJBJumpOverFenceOnPath::CallFunc_SpawnEventTagLocker_ReturnValue' has a wrong offset!");

// Function BTS_AJBJumpOverFenceOnPath.BTS_AJBJumpOverFenceOnPath_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpOverFenceOnPath_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBJumpOverFenceOnPath.BTS_AJBJumpOverFenceOnPath_C.InitOnce
// 0x0008 (0x0008 - 0x0000)
struct BTS_AJBJumpOverFenceOnPath_C_InitOnce final
{
public:
	class AAIController*                          AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpOverFenceOnPath_C_InitOnce) == 0x000008, "Wrong alignment on BTS_AJBJumpOverFenceOnPath_C_InitOnce");
static_assert(sizeof(BTS_AJBJumpOverFenceOnPath_C_InitOnce) == 0x000008, "Wrong size on BTS_AJBJumpOverFenceOnPath_C_InitOnce");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_InitOnce, AIController) == 0x000000, "Member 'BTS_AJBJumpOverFenceOnPath_C_InitOnce::AIController' has a wrong offset!");

// Function BTS_AJBJumpOverFenceOnPath.BTS_AJBJumpOverFenceOnPath_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBJumpOverFenceOnPath_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

