#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBAttackRandomly_Paramed

#include "Basic.hpp"

#include "ST_AJBAICharacterSkillInfo_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBAttackRandomly_Paramed.BTS_AJBAttackRandomly_Paramed_C.ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed
// 0x00A0 (0x00A0 - 0x0000)
struct BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController2;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn2;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue;     // 0x0038(0x0020)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInvokeSkill_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue1;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressingR2_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed) == 0x000008, "Wrong alignment on BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed");
static_assert(sizeof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed) == 0x0000A0, "Wrong size on BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, EntryPoint) == 0x000000, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_OwnerController2) == 0x000008, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_OwnerController2' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_ControlledPawn2) == 0x000010, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_ControlledPawn2' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetInput_ReturnValue) == 0x000020, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetRecognition_ReturnValue) == 0x000028, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000030, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetNormalAttackSkillInfo_ReturnValue) == 0x000038, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetNormalAttackSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_CanInvokeSkill_ReturnValue) == 0x000059, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_CanInvokeSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_OwnerController1) == 0x000060, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_ControlledPawn1) == 0x000068, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetInput_ReturnValue1) == 0x000070, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetInput_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000078, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_IsPressingR2_ReturnValue) == 0x000079, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_IsPressingR2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_OwnerController) == 0x000080, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, K2Node_Event_ControlledPawn) == 0x000088, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetRecognition_ReturnValue1) == 0x000090, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetFloatParam_ReturnValue) == 0x000098, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed, CallFunc_GetFloatParam_Found) == 0x00009C, "Member 'BTS_AJBAttackRandomly_Paramed_C_ExecuteUbergraph_BTS_AJBAttackRandomly_Paramed::CallFunc_GetFloatParam_Found' has a wrong offset!");

// Function BTS_AJBAttackRandomly_Paramed.BTS_AJBAttackRandomly_Paramed_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI");
static_assert(sizeof(BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBAttackRandomly_Paramed.BTS_AJBAttackRandomly_Paramed_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI");
static_assert(sizeof(BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_AJBAttackRandomly_Paramed.BTS_AJBAttackRandomly_Paramed_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBAttackRandomly_Paramed_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

