#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBDebugDrawObservedCharacters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_AJBDebugDrawObservedCharacters.BTS_AJBDebugDrawObservedCharacters_C.ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters
// 0x0080 (0x0080 - 0x0000)
struct BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocation_ReturnValue;                  // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBInGameAIObservedCharacter_C*> CallFunc_GetObservedCharacters_Values;         // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIObservedCharacter_C*     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetImaginaryCharacter_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObservable_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_ReturnValue1;                 // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters) == 0x000008, "Wrong alignment on BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters");
static_assert(sizeof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters) == 0x000080, "Wrong size on BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, EntryPoint) == 0x000000, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_GetRecognition_ReturnValue) == 0x000020, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_GetLocation_ReturnValue) == 0x00002C, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_GetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_GetObservedCharacters_Values) == 0x000038, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_GetObservedCharacters_Values' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_Array_Get_Item) == 0x000058, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_GetImaginaryCharacter_ReturnValue) == 0x000060, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_GetImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_IsObservable_ReturnValue) == 0x000068, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_IsObservable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_GetLocation_ReturnValue1) == 0x00006C, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_GetLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ExecuteUbergraph_BTS_AJBDebugDrawObservedCharacters::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTS_AJBDebugDrawObservedCharacters.BTS_AJBDebugDrawObservedCharacters_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI");
static_assert(sizeof(BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_AJBDebugDrawObservedCharacters_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

