#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBNormalAttack_Paramed_Copied

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "ST_AJBAICharacterSkillInfo_structs.hpp"


namespace SDK::Params
{

// Function BTT_AJBNormalAttack_Paramed_Copied.BTT_AJBNormalAttack_Paramed_Copied_C.ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied
// 0x0188 (0x0188 - 0x0000)
struct BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBAISkillInputType                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController2;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn2;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressingR2_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue;     // 0x0038(0x0020)(HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue1;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn1;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatParam_ReturnValue;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue1;                    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressingR2_ReturnValue1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue1;    // 0x00A0(0x0020)(HasGetValueTypeHash)
	float                                         CallFunc_GetAttackRangeOfSkill_ReturnValue;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttackRangeOfSkill_Found;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBAISkillInputType                          Temp_byte_Variable1;                               // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue2;                    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           CallFunc_GetRecognition_ReturnValue2;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    CallFunc_GetControllingImaginaryCharacter_ReturnValue2; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AJBAICharacterSkillInfo            CallFunc_GetNormalAttackSkillInfo_ReturnValue2;    // 0x00F8(0x0020)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanInvokeSkill_ReturnValue;               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBInGameAIInputProxy_C*            CallFunc_GetInput_ReturnValue3;                    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressingR2_ReturnValue2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue3;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue4;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBlackboardKeyName_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameAIImaginaryCharacter_C*    K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue5;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found5;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue6;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found6;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue7;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found7;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParam_ReturnValue8;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatParam_Found8;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AI_GetFloatValueWithDeviation_ReturnValue; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied) == 0x000008, "Wrong alignment on BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied");
static_assert(sizeof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied) == 0x000188, "Wrong size on BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, EntryPoint) == 0x000000, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_byte_Variable) == 0x000004, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_bool_Has_Been_Initd_Variable1) == 0x000007, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_OwnerController2) == 0x000008, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_OwnerController2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_ControlledPawn2) == 0x000010, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_ControlledPawn2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetInput_ReturnValue) == 0x000018, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetRecognition_ReturnValue) == 0x000020, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetRecognition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetControllingImaginaryCharacter_ReturnValue) == 0x000028, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetControllingImaginaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_IsPressingR2_ReturnValue) == 0x000030, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_IsPressingR2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetNormalAttackSkillInfo_ReturnValue) == 0x000038, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetNormalAttackSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetRecognition_ReturnValue1) == 0x000058, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetRecognition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_OwnerController1) == 0x000060, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_OwnerController1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_ControlledPawn1) == 0x000068, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_ControlledPawn1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue) == 0x000070, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found) == 0x000074, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetInput_ReturnValue1) == 0x000078, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetInput_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_IsPressingR2_ReturnValue1) == 0x000080, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_IsPressingR2_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue1) == 0x000084, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found1) == 0x000088, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue2) == 0x00008C, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found2) == 0x000090, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetControllingImaginaryCharacter_ReturnValue1) == 0x000098, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetControllingImaginaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetNormalAttackSkillInfo_ReturnValue1) == 0x0000A0, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetNormalAttackSkillInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetAttackRangeOfSkill_ReturnValue) == 0x0000C0, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetAttackRangeOfSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetAttackRangeOfSkill_Found) == 0x0000C4, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetAttackRangeOfSkill_Found' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_bool_IsClosed_Variable1) == 0x0000C5, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, Temp_byte_Variable1) == 0x0000C6, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_OwnerController) == 0x0000C8, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_ControlledPawn) == 0x0000D0, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Event_DeltaSeconds) == 0x0000D8, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetInput_ReturnValue2) == 0x0000E0, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetInput_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetRecognition_ReturnValue2) == 0x0000E8, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetRecognition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetControllingImaginaryCharacter_ReturnValue2) == 0x0000F0, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetControllingImaginaryCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetNormalAttackSkillInfo_ReturnValue2) == 0x0000F8, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetNormalAttackSkillInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_CanInvokeSkill_ReturnValue) == 0x000119, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_CanInvokeSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetInput_ReturnValue3) == 0x000120, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetInput_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_IsPressingR2_ReturnValue2) == 0x000128, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_IsPressingR2_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue3) == 0x00012C, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found3) == 0x000130, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found3' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue4) == 0x000134, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found4) == 0x000138, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found4' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetBlackboardKeyName_ReturnValue) == 0x000140, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetBlackboardKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetValueAsObject_ReturnValue) == 0x000148, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character) == 0x000150, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_DynamicCast_AsBP_AJBIn_Game_AIImaginary_Character' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_IsAlive_ReturnValue) == 0x000159, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue5) == 0x00015C, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found5) == 0x000160, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found5' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue6) == 0x000164, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found6) == 0x000168, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found6' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue7) == 0x00016C, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found7) == 0x000170, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found7' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_ReturnValue8) == 0x000174, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_GetFloatParam_Found8) == 0x000178, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_GetFloatParam_Found8' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Select_Default) == 0x00017C, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, K2Node_Select1_Default) == 0x000180, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied, CallFunc_AI_GetFloatValueWithDeviation_ReturnValue) == 0x000184, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ExecuteUbergraph_BTT_AJBNormalAttack_Paramed_Copied::CallFunc_AI_GetFloatValueWithDeviation_ReturnValue' has a wrong offset!");

// Function BTT_AJBNormalAttack_Paramed_Copied.BTT_AJBNormalAttack_Paramed_Copied_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI");
static_assert(sizeof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_AJBNormalAttack_Paramed_Copied.BTT_AJBNormalAttack_Paramed_Copied_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI");
static_assert(sizeof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_AJBNormalAttack_Paramed_Copied.BTT_AJBNormalAttack_Paramed_Copied_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AJBNormalAttack_Paramed_Copied_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

