#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlowState

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum FlowState.ETransitionKind
// NumValues: 0x0004
enum class ETransitionKind : uint8
{
	NONE                                     = 0,
	TransitionIn                             = 1,
	TransitionOut                            = 2,
	ETransitionKind_MAX                      = 3,
};

// ScriptStruct FlowState.FlowStateHandler
// 0x0060 (0x0060 - 0x0000)
struct FFlowStateHandler final
{
public:
	TMap<struct FGameplayTag, class UStateObj*>   States;                                            // 0x0000(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CurrentStateTag;                                   // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStateObj*                              CurrentStateObj;                                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFlowStateHandler) == 0x000008, "Wrong alignment on FFlowStateHandler");
static_assert(sizeof(FFlowStateHandler) == 0x000060, "Wrong size on FFlowStateHandler");
static_assert(offsetof(FFlowStateHandler, States) == 0x000000, "Member 'FFlowStateHandler::States' has a wrong offset!");
static_assert(offsetof(FFlowStateHandler, CurrentStateTag) == 0x000050, "Member 'FFlowStateHandler::CurrentStateTag' has a wrong offset!");
static_assert(offsetof(FFlowStateHandler, CurrentStateObj) == 0x000058, "Member 'FFlowStateHandler::CurrentStateObj' has a wrong offset!");

}

