#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleStateMachineInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function SimpleStateMachineInterface.SimpleStateMachineInterface_C.State Begin
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) SimpleStateMachineInterface_C_State_Begin final
{
public:
	class FName                                   State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   State_Machine;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleStateMachineInterface_C_State_Begin) == 0x000008, "Wrong alignment on SimpleStateMachineInterface_C_State_Begin");
static_assert(sizeof(SimpleStateMachineInterface_C_State_Begin) == 0x000010, "Wrong size on SimpleStateMachineInterface_C_State_Begin");
static_assert(offsetof(SimpleStateMachineInterface_C_State_Begin, State) == 0x000000, "Member 'SimpleStateMachineInterface_C_State_Begin::State' has a wrong offset!");
static_assert(offsetof(SimpleStateMachineInterface_C_State_Begin, State_Machine) == 0x000008, "Member 'SimpleStateMachineInterface_C_State_Begin::State_Machine' has a wrong offset!");

// Function SimpleStateMachineInterface.SimpleStateMachineInterface_C.State Update
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) SimpleStateMachineInterface_C_State_Update final
{
public:
	class FName                                   State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   State_Machine;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleStateMachineInterface_C_State_Update) == 0x000008, "Wrong alignment on SimpleStateMachineInterface_C_State_Update");
static_assert(sizeof(SimpleStateMachineInterface_C_State_Update) == 0x000010, "Wrong size on SimpleStateMachineInterface_C_State_Update");
static_assert(offsetof(SimpleStateMachineInterface_C_State_Update, State) == 0x000000, "Member 'SimpleStateMachineInterface_C_State_Update::State' has a wrong offset!");
static_assert(offsetof(SimpleStateMachineInterface_C_State_Update, State_Machine) == 0x000008, "Member 'SimpleStateMachineInterface_C_State_Update::State_Machine' has a wrong offset!");

// Function SimpleStateMachineInterface.SimpleStateMachineInterface_C.State End
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) SimpleStateMachineInterface_C_State_End final
{
public:
	class FName                                   State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   State_Machine;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleStateMachineInterface_C_State_End) == 0x000008, "Wrong alignment on SimpleStateMachineInterface_C_State_End");
static_assert(sizeof(SimpleStateMachineInterface_C_State_End) == 0x000010, "Wrong size on SimpleStateMachineInterface_C_State_End");
static_assert(offsetof(SimpleStateMachineInterface_C_State_End, State) == 0x000000, "Member 'SimpleStateMachineInterface_C_State_End::State' has a wrong offset!");
static_assert(offsetof(SimpleStateMachineInterface_C_State_End, State_Machine) == 0x000008, "Member 'SimpleStateMachineInterface_C_State_End::State_Machine' has a wrong offset!");

}

