#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ChipData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_ChipData.ST_ChipData
// 0x0020 (0x0020 - 0x0000)
struct FST_ChipData final
{
public:
	class FName                                   Type_8_91AD11DE46826D2923E6558D46E1860D;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh_9_2846F4EE497C9BABFC2ED08E668AFD3A;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material1_10_FC43FB18418C3826FFBDF1916A172362;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material2_11_85CB4AE149F9E4D89046E7AFCFDD3C19;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_ChipData) == 0x000008, "Wrong alignment on FST_ChipData");
static_assert(sizeof(FST_ChipData) == 0x000020, "Wrong size on FST_ChipData");
static_assert(offsetof(FST_ChipData, Type_8_91AD11DE46826D2923E6558D46E1860D) == 0x000000, "Member 'FST_ChipData::Type_8_91AD11DE46826D2923E6558D46E1860D' has a wrong offset!");
static_assert(offsetof(FST_ChipData, Mesh_9_2846F4EE497C9BABFC2ED08E668AFD3A) == 0x000008, "Member 'FST_ChipData::Mesh_9_2846F4EE497C9BABFC2ED08E668AFD3A' has a wrong offset!");
static_assert(offsetof(FST_ChipData, Material1_10_FC43FB18418C3826FFBDF1916A172362) == 0x000010, "Member 'FST_ChipData::Material1_10_FC43FB18418C3826FFBDF1916A172362' has a wrong offset!");
static_assert(offsetof(FST_ChipData, Material2_11_85CB4AE149F9E4D89046E7AFCFDD3C19) == 0x000018, "Member 'FST_ChipData::Material2_11_85CB4AE149F9E4D89046E7AFCFDD3C19' has a wrong offset!");

}

