#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CollectMdTargetInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_CollectMdTargetInfo.ST_CollectMdTargetInfo
// 0x0018 (0x0018 - 0x0000)
struct FST_CollectMdTargetInfo final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP_8_B09E84A14343B633719610B865559CE7;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CharacterTag_5_9BAAFAD348C58278738611B6951E2C08;   // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          bKeep_10_907E35F34DAFB94E13E5B9B17CFE4E2E;         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_CollectMdTargetInfo) == 0x000008, "Wrong alignment on FST_CollectMdTargetInfo");
static_assert(sizeof(FST_CollectMdTargetInfo) == 0x000018, "Wrong size on FST_CollectMdTargetInfo");
static_assert(offsetof(FST_CollectMdTargetInfo, CharacterBP_8_B09E84A14343B633719610B865559CE7) == 0x000000, "Member 'FST_CollectMdTargetInfo::CharacterBP_8_B09E84A14343B633719610B865559CE7' has a wrong offset!");
static_assert(offsetof(FST_CollectMdTargetInfo, CharacterTag_5_9BAAFAD348C58278738611B6951E2C08) == 0x000008, "Member 'FST_CollectMdTargetInfo::CharacterTag_5_9BAAFAD348C58278738611B6951E2C08' has a wrong offset!");
static_assert(offsetof(FST_CollectMdTargetInfo, bKeep_10_907E35F34DAFB94E13E5B9B17CFE4E2E) == 0x000010, "Member 'FST_CollectMdTargetInfo::bKeep_10_907E35F34DAFB94E13E5B9B17CFE4E2E' has a wrong offset!");

}

