#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageAffecterInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DamageAffecterInfo.ST_DamageAffecterInfo
// 0x0018 (0x0018 - 0x0000)
struct FST_DamageAffecterInfo final
{
public:
	class AActor*                                 Actor_3_BC14E48346F08897AA6A6DB1B7F117A7;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CountupStart_9_ADB20ADC4E5BCE3092CDAABAF1ADAE5D;   // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          bNoDamage_15_57A2DB2D4D41B6254459649D91F06FF6;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AffecterIndex_20_692A20C2434C35D0A7E0CDB766CEAA47; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_DamageAffecterInfo) == 0x000008, "Wrong alignment on FST_DamageAffecterInfo");
static_assert(sizeof(FST_DamageAffecterInfo) == 0x000018, "Wrong size on FST_DamageAffecterInfo");
static_assert(offsetof(FST_DamageAffecterInfo, Actor_3_BC14E48346F08897AA6A6DB1B7F117A7) == 0x000000, "Member 'FST_DamageAffecterInfo::Actor_3_BC14E48346F08897AA6A6DB1B7F117A7' has a wrong offset!");
static_assert(offsetof(FST_DamageAffecterInfo, CountupStart_9_ADB20ADC4E5BCE3092CDAABAF1ADAE5D) == 0x000008, "Member 'FST_DamageAffecterInfo::CountupStart_9_ADB20ADC4E5BCE3092CDAABAF1ADAE5D' has a wrong offset!");
static_assert(offsetof(FST_DamageAffecterInfo, bNoDamage_15_57A2DB2D4D41B6254459649D91F06FF6) == 0x000010, "Member 'FST_DamageAffecterInfo::bNoDamage_15_57A2DB2D4D41B6254459649D91F06FF6' has a wrong offset!");
static_assert(offsetof(FST_DamageAffecterInfo, AffecterIndex_20_692A20C2434C35D0A7E0CDB766CEAA47) == 0x000014, "Member 'FST_DamageAffecterInfo::AffecterIndex_20_692A20C2434C35D0A7E0CDB766CEAA47' has a wrong offset!");

}

