#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_RecordingTargetInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_RecordingTargetInfo.ST_RecordingTargetInfo
// 0x0028 (0x0028 - 0x0000)
struct FST_RecordingTargetInfo final
{
public:
	class AAJBInGameCharacterBase*                TargetCharacter_2_E66221BB4447A6E63006E8AAB2612BF1; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  Valids_9_2FA5DFE0421A41FB2D6285B64CCE24ED;         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FVector>                        Locations_6_D6F9D3FC4736F0E8A573FB8722EE4434;      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
};
static_assert(alignof(FST_RecordingTargetInfo) == 0x000008, "Wrong alignment on FST_RecordingTargetInfo");
static_assert(sizeof(FST_RecordingTargetInfo) == 0x000028, "Wrong size on FST_RecordingTargetInfo");
static_assert(offsetof(FST_RecordingTargetInfo, TargetCharacter_2_E66221BB4447A6E63006E8AAB2612BF1) == 0x000000, "Member 'FST_RecordingTargetInfo::TargetCharacter_2_E66221BB4447A6E63006E8AAB2612BF1' has a wrong offset!");
static_assert(offsetof(FST_RecordingTargetInfo, Valids_9_2FA5DFE0421A41FB2D6285B64CCE24ED) == 0x000008, "Member 'FST_RecordingTargetInfo::Valids_9_2FA5DFE0421A41FB2D6285B64CCE24ED' has a wrong offset!");
static_assert(offsetof(FST_RecordingTargetInfo, Locations_6_D6F9D3FC4736F0E8A573FB8722EE4434) == 0x000018, "Member 'FST_RecordingTargetInfo::Locations_6_D6F9D3FC4736F0E8A573FB8722EE4434' has a wrong offset!");

}

