#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: test1_BTT_MoveTo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass test1_BTT_MoveTo.test1_BTT_MoveTo_C
// 0x0020 (0x00C0 - 0x00A0)
class Utest1_BTT_MoveTo_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	bool                                          bShouldMoveToEnemy;                                // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_TargetLocation;                               // 0x00AC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DashMotion;                                        // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EWalkingState                                 State;                                             // 0x00BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_test1_BTT_MoveTo(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnSuccess_BACE868144046606A3E61B94DD216BAB(EPathFollowingResult MovementResult);
	void OnFail_BACE868144046606A3E61B94DD216BAB(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"test1_BTT_MoveTo_C">();
	}
	static class Utest1_BTT_MoveTo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utest1_BTT_MoveTo_C>();
	}
};
static_assert(alignof(Utest1_BTT_MoveTo_C) == 0x000008, "Wrong alignment on Utest1_BTT_MoveTo_C");
static_assert(sizeof(Utest1_BTT_MoveTo_C) == 0x0000C0, "Wrong size on Utest1_BTT_MoveTo_C");
static_assert(offsetof(Utest1_BTT_MoveTo_C, UberGraphFrame) == 0x0000A0, "Member 'Utest1_BTT_MoveTo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Utest1_BTT_MoveTo_C, bShouldMoveToEnemy) == 0x0000A8, "Member 'Utest1_BTT_MoveTo_C::bShouldMoveToEnemy' has a wrong offset!");
static_assert(offsetof(Utest1_BTT_MoveTo_C, Temp_TargetLocation) == 0x0000AC, "Member 'Utest1_BTT_MoveTo_C::Temp_TargetLocation' has a wrong offset!");
static_assert(offsetof(Utest1_BTT_MoveTo_C, Speed) == 0x0000B8, "Member 'Utest1_BTT_MoveTo_C::Speed' has a wrong offset!");
static_assert(offsetof(Utest1_BTT_MoveTo_C, DashMotion) == 0x0000BC, "Member 'Utest1_BTT_MoveTo_C::DashMotion' has a wrong offset!");
static_assert(offsetof(Utest1_BTT_MoveTo_C, State) == 0x0000BD, "Member 'Utest1_BTT_MoveTo_C::State' has a wrong offset!");

}

