#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BG_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BG_Animation.WB_BG_Animation_C
// 0x0028 (0x0270 - 0x0248)
class UWB_BG_Animation_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Star_L1;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Star_L2;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Star_M;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_BG_Animation(int32 EntryPoint);
	void PlayBGAnimation();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BG_Animation_C">();
	}
	static class UWB_BG_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BG_Animation_C>();
	}
};
static_assert(alignof(UWB_BG_Animation_C) == 0x000008, "Wrong alignment on UWB_BG_Animation_C");
static_assert(sizeof(UWB_BG_Animation_C) == 0x000270, "Wrong size on UWB_BG_Animation_C");
static_assert(offsetof(UWB_BG_Animation_C, UberGraphFrame) == 0x000248, "Member 'UWB_BG_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BG_Animation_C, Loop) == 0x000250, "Member 'UWB_BG_Animation_C::Loop' has a wrong offset!");
static_assert(offsetof(UWB_BG_Animation_C, Img_Star_L1) == 0x000258, "Member 'UWB_BG_Animation_C::Img_Star_L1' has a wrong offset!");
static_assert(offsetof(UWB_BG_Animation_C, Img_Star_L2) == 0x000260, "Member 'UWB_BG_Animation_C::Img_Star_L2' has a wrong offset!");
static_assert(offsetof(UWB_BG_Animation_C, Img_Star_M) == 0x000268, "Member 'UWB_BG_Animation_C::Img_Star_M' has a wrong offset!");

}

