#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleRecord_Detail_Good

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleRecord_Detail_Good.WB_BattleRecord_Detail_Good_C
// 0x0038 (0x0280 - 0x0248)
class UWB_BattleRecord_Detail_Good_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_0;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnableAnimation;                                  // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnEndAnimDispatcher;                               // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Delay;                                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InvisibleType;                                     // 0x027C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Anim_Appear();
	void BndEvt__Appear_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ExecuteUbergraph_WB_BattleRecord_Detail_Good(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleRecord_Detail_Good_C">();
	}
	static class UWB_BattleRecord_Detail_Good_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleRecord_Detail_Good_C>();
	}
};
static_assert(alignof(UWB_BattleRecord_Detail_Good_C) == 0x000008, "Wrong alignment on UWB_BattleRecord_Detail_Good_C");
static_assert(sizeof(UWB_BattleRecord_Detail_Good_C) == 0x000280, "Wrong size on UWB_BattleRecord_Detail_Good_C");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, UberGraphFrame) == 0x000248, "Member 'UWB_BattleRecord_Detail_Good_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, Appear) == 0x000250, "Member 'UWB_BattleRecord_Detail_Good_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, AJBRetainerBox_0) == 0x000258, "Member 'UWB_BattleRecord_Detail_Good_C::AJBRetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, bEnableAnimation) == 0x000260, "Member 'UWB_BattleRecord_Detail_Good_C::bEnableAnimation' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, OnEndAnimDispatcher) == 0x000268, "Member 'UWB_BattleRecord_Detail_Good_C::OnEndAnimDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, Delay) == 0x000278, "Member 'UWB_BattleRecord_Detail_Good_C::Delay' has a wrong offset!");
static_assert(offsetof(UWB_BattleRecord_Detail_Good_C, InvisibleType) == 0x00027C, "Member 'UWB_BattleRecord_Detail_Good_C::InvisibleType' has a wrong offset!");

}

