#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Credit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Credit.WB_Credit_C
// 0x00A0 (0x02E8 - 0x0248)
class UWB_Credit_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_0;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_1;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_4;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_PPBuyButton_C*                      Button_PPBuy;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          CreditNumber;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_AllNetIcon;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PPNumber;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PPNumberRoot;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PPStop;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PPStopped;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EndGameButton_C*                    WB_EndGameButton;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_StoreCloseMessege_C*                WB_StoreCloseMessege;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TimeLimitCountDown_C*               WB_TimeLimitCountDown;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxDisplayCreditNum;                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAJBWindowWidget*>               StackWindow;                                       // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWB_PpBuyWindow_C*                      PPBuyWindow;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetHttp*                               RefNetHttp;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Fade_C*                             FadeWidget;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Credit(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateVisiblePPStop(bool bVisible);
	void BndEvt__WB_EndGameButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnClosedPPBuy(class UAJBWindowWidget* TargetWidget);
	void UpdateVisibleTimeCountDown(bool bVisible);
	void Construct();
	void BndEvt__Button_PPBuy_K2Node_ComponentBoundEvent_259_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void UpdateVisiblePPNum(bool bVisible);
	void UpdateVisibleGameEnd(bool bVisible);
	void UpdatePPBuyVisible(bool bVisible);
	void BindHUDEvents();
	void OnClosedWindow(class UAJBWindowWidget* TargetWidget);
	void OnOpeningWindow(class UAJBWindowWidget* TargetWidget);
	void UpdatePPAndCreditNumberDisplay();
	void ChangedIcon(EAJBCreditDisplayType InputPin);
	struct FSlateBrush Get_Img_AllNetIcon_Brush_0();
	void UpdateButtonAlpha();
	void UpdateStoreCloseMessege();
	void CanButton(bool* bCan);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Credit_C">();
	}
	static class UWB_Credit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Credit_C>();
	}
};
static_assert(alignof(UWB_Credit_C) == 0x000008, "Wrong alignment on UWB_Credit_C");
static_assert(sizeof(UWB_Credit_C) == 0x0002E8, "Wrong size on UWB_Credit_C");
static_assert(offsetof(UWB_Credit_C, UberGraphFrame) == 0x000248, "Member 'UWB_Credit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, AJBImage_0) == 0x000250, "Member 'UWB_Credit_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, AJBImage_1) == 0x000258, "Member 'UWB_Credit_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, AJBImage_4) == 0x000260, "Member 'UWB_Credit_C::AJBImage_4' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, Button_PPBuy) == 0x000268, "Member 'UWB_Credit_C::Button_PPBuy' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, CreditNumber) == 0x000270, "Member 'UWB_Credit_C::CreditNumber' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, Img_AllNetIcon) == 0x000278, "Member 'UWB_Credit_C::Img_AllNetIcon' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, PPNumber) == 0x000280, "Member 'UWB_Credit_C::PPNumber' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, PPNumberRoot) == 0x000288, "Member 'UWB_Credit_C::PPNumberRoot' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, PPStop) == 0x000290, "Member 'UWB_Credit_C::PPStop' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, PPStopped) == 0x000298, "Member 'UWB_Credit_C::PPStopped' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, WB_EndGameButton) == 0x0002A0, "Member 'UWB_Credit_C::WB_EndGameButton' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, WB_StoreCloseMessege) == 0x0002A8, "Member 'UWB_Credit_C::WB_StoreCloseMessege' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, WB_TimeLimitCountDown) == 0x0002B0, "Member 'UWB_Credit_C::WB_TimeLimitCountDown' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, MaxDisplayCreditNum) == 0x0002B8, "Member 'UWB_Credit_C::MaxDisplayCreditNum' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, StackWindow) == 0x0002C0, "Member 'UWB_Credit_C::StackWindow' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, PPBuyWindow) == 0x0002D0, "Member 'UWB_Credit_C::PPBuyWindow' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, RefNetHttp) == 0x0002D8, "Member 'UWB_Credit_C::RefNetHttp' has a wrong offset!");
static_assert(offsetof(UWB_Credit_C, FadeWidget) == 0x0002E0, "Member 'UWB_Credit_C::FadeWidget' has a wrong offset!");

}

