#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CommonTouchScrollBox

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CommonTouchScrollBox.WB_CommonTouchScrollBox_C
// 0x0770 (0x0978 - 0x0208)
class UWB_CommonTouchScrollBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                Border_TouchScroller;                              // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_OneContent;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_InputableArea;                             // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Main;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TotalMoveValue;                                    // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBoxStyle                        Style;                                             // 0x0238(0x0228)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScrollBarStyle                        BarStyle;                                          // 0x0460(0x04D0)(Edit, BlueprintVisible, BlueprintReadOnly)
	EOrientation                                  Orientation;                                       // 0x0930(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ScrollBarVisibility;                               // 0x0931(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_932[0x2];                                      // 0x0932(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScrollbarThickness;                                // 0x0934(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysShowScrollbar;                               // 0x093C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowOverscroll;                                   // 0x093D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93E[0x2];                                      // 0x093E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnScrollMoved;                                     // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ScrollInterpSpeed;                                 // 0x0950(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                NamedSlotPadding;                                  // 0x0954(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor)
	struct FMargin                                InputableMargin;                                   // 0x0964(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_CommonTouchScrollBox(int32 EntryPoint);
	void ScrollWidgetIntoView(class UWidget* WidgetToFind, EDescendantScrollDestination ScrollDestination);
	void SetScrollOffset(float NewScrollOffset);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void RemoveChildAt2(int32 Index_0);
	void RemoveChild2(class UWidget* Content);
	void ClearChildren();
	struct FEventReply OnMouseButtonDown_TouchScroll(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove_TouchScroll(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	class UPanelSlot* AddChild(class UWidget* Content);
	bool RemoveChild(class UWidget* Content);
	bool RemoveChildAt(int32 Index_0);

	float GetScrollMax() const;
	int32 GetChildrenCount() const;
	class UWidget* GetChildAt(int32 Index_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CommonTouchScrollBox_C">();
	}
	static class UWB_CommonTouchScrollBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CommonTouchScrollBox_C>();
	}
};
static_assert(alignof(UWB_CommonTouchScrollBox_C) == 0x000008, "Wrong alignment on UWB_CommonTouchScrollBox_C");
static_assert(sizeof(UWB_CommonTouchScrollBox_C) == 0x000978, "Wrong size on UWB_CommonTouchScrollBox_C");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, UberGraphFrame) == 0x000208, "Member 'UWB_CommonTouchScrollBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, Border_TouchScroller) == 0x000210, "Member 'UWB_CommonTouchScrollBox_C::Border_TouchScroller' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, NamedSlot_OneContent) == 0x000218, "Member 'UWB_CommonTouchScrollBox_C::NamedSlot_OneContent' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, Overlay_InputableArea) == 0x000220, "Member 'UWB_CommonTouchScrollBox_C::Overlay_InputableArea' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, ScrollBox_Main) == 0x000228, "Member 'UWB_CommonTouchScrollBox_C::ScrollBox_Main' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, TotalMoveValue) == 0x000230, "Member 'UWB_CommonTouchScrollBox_C::TotalMoveValue' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, Style) == 0x000238, "Member 'UWB_CommonTouchScrollBox_C::Style' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, BarStyle) == 0x000460, "Member 'UWB_CommonTouchScrollBox_C::BarStyle' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, Orientation) == 0x000930, "Member 'UWB_CommonTouchScrollBox_C::Orientation' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, ScrollBarVisibility) == 0x000931, "Member 'UWB_CommonTouchScrollBox_C::ScrollBarVisibility' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, ScrollbarThickness) == 0x000934, "Member 'UWB_CommonTouchScrollBox_C::ScrollbarThickness' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, AlwaysShowScrollbar) == 0x00093C, "Member 'UWB_CommonTouchScrollBox_C::AlwaysShowScrollbar' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, AllowOverscroll) == 0x00093D, "Member 'UWB_CommonTouchScrollBox_C::AllowOverscroll' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, OnScrollMoved) == 0x000940, "Member 'UWB_CommonTouchScrollBox_C::OnScrollMoved' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, ScrollInterpSpeed) == 0x000950, "Member 'UWB_CommonTouchScrollBox_C::ScrollInterpSpeed' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, NamedSlotPadding) == 0x000954, "Member 'UWB_CommonTouchScrollBox_C::NamedSlotPadding' has a wrong offset!");
static_assert(offsetof(UWB_CommonTouchScrollBox_C, InputableMargin) == 0x000964, "Member 'UWB_CommonTouchScrollBox_C::InputableMargin' has a wrong offset!");

}

