#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressFooter

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.ExecuteUbergraph_WB_ChallengeEventProgressFooter
// 0x0158 (0x0158 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBConvertedServerDateTimeStringToText_Result; // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetAJBConvertedServerDateTimeStringToText_Result1; // 0x0060(0x0018)()
	int32                                         K2Node_CustomEvent_RestExpToNextClass;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0080(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	struct FChallengeEventProgressContext         K2Node_CustomEvent_ProgressContext;                // 0x0100(0x0058)()
};
static_assert(alignof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter) == 0x000008, "Wrong alignment on WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter");
static_assert(sizeof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter) == 0x000158, "Wrong size on WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, EntryPoint) == 0x000000, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, CallFunc_GetAJBConvertedServerDateTimeStringToText_Result) == 0x000008, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::CallFunc_GetAJBConvertedServerDateTimeStringToText_Result' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, CallFunc_GetAJBConvertedServerDateTimeStringToText_Result1) == 0x000060, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::CallFunc_GetAJBConvertedServerDateTimeStringToText_Result1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, K2Node_CustomEvent_RestExpToNextClass) == 0x000078, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::K2Node_CustomEvent_RestExpToNextClass' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, K2Node_MakeStruct_FormatArgumentData1) == 0x000080, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C0, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter, K2Node_CustomEvent_ProgressContext) == 0x000100, "Member 'WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter::K2Node_CustomEvent_ProgressContext' has a wrong offset!");

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.Setup
// 0x0058 (0x0058 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_Setup final
{
public:
	struct FChallengeEventProgressContext         ProgressContext_0;                                 // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_ChallengeEventProgressFooter_C_Setup) == 0x000008, "Wrong alignment on WB_ChallengeEventProgressFooter_C_Setup");
static_assert(sizeof(WB_ChallengeEventProgressFooter_C_Setup) == 0x000058, "Wrong size on WB_ChallengeEventProgressFooter_C_Setup");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_Setup, ProgressContext_0) == 0x000000, "Member 'WB_ChallengeEventProgressFooter_C_Setup::ProgressContext_0' has a wrong offset!");

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.Start
// 0x0004 (0x0004 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_Start final
{
public:
	int32                                         RestExpToNextClass;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ChallengeEventProgressFooter_C_Start) == 0x000004, "Wrong alignment on WB_ChallengeEventProgressFooter_C_Start");
static_assert(sizeof(WB_ChallengeEventProgressFooter_C_Start) == 0x000004, "Wrong size on WB_ChallengeEventProgressFooter_C_Start");
static_assert(offsetof(WB_ChallengeEventProgressFooter_C_Start, RestExpToNextClass) == 0x000000, "Member 'WB_ChallengeEventProgressFooter_C_Start::RestExpToNextClass' has a wrong offset!");

}

