#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaSelectDetail

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_CharaSelectDetail.WB_CharaSelectDetail_C.ExecuteUbergraph_WB_CharaSelectDetail
// 0x0108 (0x0108 - 0x0000)
struct WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBCharacterInfo                      K2Node_CustomEvent_CharacterInfo;                  // 0x0008(0x00E8)(ConstParm)
	class FText                                   CallFunc_GetAJBBattleTypeString_Out;               // 0x00F0(0x0018)()
};
static_assert(alignof(WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail) == 0x000008, "Wrong alignment on WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail");
static_assert(sizeof(WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail) == 0x000108, "Wrong size on WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail");
static_assert(offsetof(WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail, EntryPoint) == 0x000000, "Member 'WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail, K2Node_CustomEvent_CharacterInfo) == 0x000008, "Member 'WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail::K2Node_CustomEvent_CharacterInfo' has a wrong offset!");
static_assert(offsetof(WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail, CallFunc_GetAJBBattleTypeString_Out) == 0x0000F0, "Member 'WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail::CallFunc_GetAJBBattleTypeString_Out' has a wrong offset!");

// Function WB_CharaSelectDetail.WB_CharaSelectDetail_C.UpdateDisplay
// 0x00E8 (0x00E8 - 0x0000)
struct WB_CharaSelectDetail_C_UpdateDisplay final
{
public:
	struct FAJBCharacterInfo                      CharacterInfo;                                     // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_CharaSelectDetail_C_UpdateDisplay) == 0x000008, "Wrong alignment on WB_CharaSelectDetail_C_UpdateDisplay");
static_assert(sizeof(WB_CharaSelectDetail_C_UpdateDisplay) == 0x0000E8, "Wrong size on WB_CharaSelectDetail_C_UpdateDisplay");
static_assert(offsetof(WB_CharaSelectDetail_C_UpdateDisplay, CharacterInfo) == 0x000000, "Member 'WB_CharaSelectDetail_C_UpdateDisplay::CharacterInfo' has a wrong offset!");

}

