#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmoteTextLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_EmoteTextLabel.WB_EmoteTextLabel_C
// 0x0018 (0x0220 - 0x0208)
class UWB_EmoteTextLabel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_0;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_0;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_EmoteTextLabel(int32 EntryPoint);
	void UpdateText(const class FString& VoiceText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_EmoteTextLabel_C">();
	}
	static class UWB_EmoteTextLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_EmoteTextLabel_C>();
	}
};
static_assert(alignof(UWB_EmoteTextLabel_C) == 0x000008, "Wrong alignment on UWB_EmoteTextLabel_C");
static_assert(sizeof(UWB_EmoteTextLabel_C) == 0x000220, "Wrong size on UWB_EmoteTextLabel_C");
static_assert(offsetof(UWB_EmoteTextLabel_C, UberGraphFrame) == 0x000208, "Member 'UWB_EmoteTextLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_EmoteTextLabel_C, AJBImage_0) == 0x000210, "Member 'UWB_EmoteTextLabel_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_EmoteTextLabel_C, AJBTextBlock_0) == 0x000218, "Member 'UWB_EmoteTextLabel_C::AJBTextBlock_0' has a wrong offset!");

}

