#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Emoney_CreditButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_Emoney_CreditButton.WB_Emoney_CreditButton_C.ExecuteUbergraph_WB_Emoney_CreditButton
// 0x0028 (0x0028 - 0x0000)
struct WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton) == 0x000008, "Wrong alignment on WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton");
static_assert(sizeof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton) == 0x000028, "Wrong size on WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton");
static_assert(offsetof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton, EntryPoint) == 0x000000, "Member 'WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'WB_Emoney_CreditButton_C_ExecuteUbergraph_WB_Emoney_CreditButton::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Emoney_CreditButton.WB_Emoney_CreditButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Emoney_CreditButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Emoney_CreditButton_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Emoney_CreditButton_C_PreConstruct");
static_assert(sizeof(WB_Emoney_CreditButton_C_PreConstruct) == 0x000001, "Wrong size on WB_Emoney_CreditButton_C_PreConstruct");
static_assert(offsetof(WB_Emoney_CreditButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Emoney_CreditButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Emoney_CreditButton.WB_Emoney_CreditButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_Emoney_CreditButton_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Emoney_CreditButton_C_GetButton) == 0x000008, "Wrong alignment on WB_Emoney_CreditButton_C_GetButton");
static_assert(sizeof(WB_Emoney_CreditButton_C_GetButton) == 0x000008, "Wrong size on WB_Emoney_CreditButton_C_GetButton");
static_assert(offsetof(WB_Emoney_CreditButton_C_GetButton, ReturnValue) == 0x000000, "Member 'WB_Emoney_CreditButton_C_GetButton::ReturnValue' has a wrong offset!");

// Function WB_Emoney_CreditButton.WB_Emoney_CreditButton_C.SetEnableButton
// 0x0009 (0x0009 - 0x0000)
struct WB_Emoney_CreditButton_C_SetEnableButton final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Emoney_CreditButton_C_SetEnableButton) == 0x000001, "Wrong alignment on WB_Emoney_CreditButton_C_SetEnableButton");
static_assert(sizeof(WB_Emoney_CreditButton_C_SetEnableButton) == 0x000009, "Wrong size on WB_Emoney_CreditButton_C_SetEnableButton");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, bEnable) == 0x000000, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::bEnable' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_bool_Variable) == 0x000001, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_byte_Variable) == 0x000002, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_byte_Variable1) == 0x000003, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_bool_Variable1) == 0x000004, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, K2Node_Select_Default) == 0x000005, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_byte_Variable2) == 0x000006, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, Temp_byte_Variable3) == 0x000007, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Emoney_CreditButton_C_SetEnableButton, K2Node_Select1_Default) == 0x000008, "Member 'WB_Emoney_CreditButton_C_SetEnableButton::K2Node_Select1_Default' has a wrong offset!");

}

