#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmptyStar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_EmptyStar.WB_EmptyStar_C.ExecuteUbergraph_WB_EmptyStar
// 0x0008 (0x0008 - 0x0000)
struct WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFill;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar) == 0x000004, "Wrong alignment on WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar");
static_assert(sizeof(WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar) == 0x000008, "Wrong size on WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar");
static_assert(offsetof(WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar, EntryPoint) == 0x000000, "Member 'WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar, K2Node_CustomEvent_IsFill) == 0x000004, "Member 'WB_EmptyStar_C_ExecuteUbergraph_WB_EmptyStar::K2Node_CustomEvent_IsFill' has a wrong offset!");

// Function WB_EmptyStar.WB_EmptyStar_C.UpdateFill
// 0x0001 (0x0001 - 0x0000)
struct WB_EmptyStar_C_UpdateFill final
{
public:
	bool                                          IsFill;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_EmptyStar_C_UpdateFill) == 0x000001, "Wrong alignment on WB_EmptyStar_C_UpdateFill");
static_assert(sizeof(WB_EmptyStar_C_UpdateFill) == 0x000001, "Wrong size on WB_EmptyStar_C_UpdateFill");
static_assert(offsetof(WB_EmptyStar_C_UpdateFill, IsFill) == 0x000000, "Member 'WB_EmptyStar_C_UpdateFill::IsFill' has a wrong offset!");

}

