#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FocusLine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_FocusLine.WB_FocusLine_C.ExecuteUbergraph_WB_FocusLine
// 0x0040 (0x0040 - 0x0000)
struct WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine) == 0x000008, "Wrong alignment on WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine");
static_assert(sizeof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine) == 0x000040, "Wrong size on WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, EntryPoint) == 0x000000, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_FClamp_ReturnValue1) == 0x00001C, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_FClamp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine, CallFunc_MakeColor_ReturnValue) == 0x000030, "Member 'WB_FocusLine_C_ExecuteUbergraph_WB_FocusLine::CallFunc_MakeColor_ReturnValue' has a wrong offset!");

}

