#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FullMap_Skill

#include "Basic.hpp"

#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FullMap_Skill.WB_FullMap_Skill_C
// 0x0038 (0x0280 - 0x0248)
class UWB_FullMap_Skill_C final : public UAJBUserWidget
{
public:
	class UAJBImage*                              Img_buttonIcon;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Over_Lock;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_ButtonDetail;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_LockNum;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_SkillDetail;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_SkillName;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SkillIcon_C*                        WB_SkillIcon;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FullMap_Skill_C">();
	}
	static class UWB_FullMap_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FullMap_Skill_C>();
	}
};
static_assert(alignof(UWB_FullMap_Skill_C) == 0x000008, "Wrong alignment on UWB_FullMap_Skill_C");
static_assert(sizeof(UWB_FullMap_Skill_C) == 0x000280, "Wrong size on UWB_FullMap_Skill_C");
static_assert(offsetof(UWB_FullMap_Skill_C, Img_buttonIcon) == 0x000248, "Member 'UWB_FullMap_Skill_C::Img_buttonIcon' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, Over_Lock) == 0x000250, "Member 'UWB_FullMap_Skill_C::Over_Lock' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, Txt_ButtonDetail) == 0x000258, "Member 'UWB_FullMap_Skill_C::Txt_ButtonDetail' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, Txt_LockNum) == 0x000260, "Member 'UWB_FullMap_Skill_C::Txt_LockNum' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, Txt_SkillDetail) == 0x000268, "Member 'UWB_FullMap_Skill_C::Txt_SkillDetail' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, Txt_SkillName) == 0x000270, "Member 'UWB_FullMap_Skill_C::Txt_SkillName' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_Skill_C, WB_SkillIcon) == 0x000278, "Member 'UWB_FullMap_Skill_C::WB_SkillIcon' has a wrong offset!");

}

