#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FullMap_TutorialWindow

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FullMap_TutorialWindow.WB_FullMap_TutorialWindow_C
// 0x0030 (0x0238 - 0x0208)
class UWB_FullMap_TutorialWindow_C final : public UUserWidget
{
public:
	class UAJBImage*                              AJBImage_2;                                        // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              CircleBG_Danger;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Safe_CircleBG;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Texts_DangerArea;                                  // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Texts_SafeArea;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              WIndowBG;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FullMap_TutorialWindow_C">();
	}
	static class UWB_FullMap_TutorialWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FullMap_TutorialWindow_C>();
	}
};
static_assert(alignof(UWB_FullMap_TutorialWindow_C) == 0x000008, "Wrong alignment on UWB_FullMap_TutorialWindow_C");
static_assert(sizeof(UWB_FullMap_TutorialWindow_C) == 0x000238, "Wrong size on UWB_FullMap_TutorialWindow_C");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, AJBImage_2) == 0x000208, "Member 'UWB_FullMap_TutorialWindow_C::AJBImage_2' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, CircleBG_Danger) == 0x000210, "Member 'UWB_FullMap_TutorialWindow_C::CircleBG_Danger' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, Safe_CircleBG) == 0x000218, "Member 'UWB_FullMap_TutorialWindow_C::Safe_CircleBG' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, Texts_DangerArea) == 0x000220, "Member 'UWB_FullMap_TutorialWindow_C::Texts_DangerArea' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, Texts_SafeArea) == 0x000228, "Member 'UWB_FullMap_TutorialWindow_C::Texts_SafeArea' has a wrong offset!");
static_assert(offsetof(UWB_FullMap_TutorialWindow_C, WIndowBG) == 0x000230, "Member 'UWB_FullMap_TutorialWindow_C::WIndowBG' has a wrong offset!");

}

