#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameResultTicket_Detail

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_GameResultTicket_Detail.WB_GameResultTicket_Detail_C.ExecuteUbergraph_WB_GameResultTicket_Detail
// 0x0088 (0x0088 - 0x0000)
struct WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBLimitedBounusSign                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0038(0x0018)()
	EAJBLimitedBounusSign                         K2Node_CustomEvent_Sign;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0058(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0018)()
};
static_assert(alignof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail) == 0x000008, "Wrong alignment on WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail");
static_assert(sizeof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail) == 0x000088, "Wrong size on WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, EntryPoint) == 0x000000, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, Temp_byte_Variable) == 0x000004, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, Temp_text_Variable) == 0x000008, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, Temp_text_Variable1) == 0x000020, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, K2Node_CustomEvent_InText) == 0x000038, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, K2Node_CustomEvent_Sign) == 0x000050, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::K2Node_CustomEvent_Sign' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, K2Node_CustomEvent_Value) == 0x000054, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, CallFunc_Conv_FloatToText_ReturnValue) == 0x000058, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail, K2Node_Select_Default) == 0x000070, "Member 'WB_GameResultTicket_Detail_C_ExecuteUbergraph_WB_GameResultTicket_Detail::K2Node_Select_Default' has a wrong offset!");

// Function WB_GameResultTicket_Detail.WB_GameResultTicket_Detail_C.SetupDisplay
// 0x0020 (0x0020 - 0x0000)
struct WB_GameResultTicket_Detail_C_SetupDisplay final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EAJBLimitedBounusSign                         Sign_0;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GameResultTicket_Detail_C_SetupDisplay) == 0x000008, "Wrong alignment on WB_GameResultTicket_Detail_C_SetupDisplay");
static_assert(sizeof(WB_GameResultTicket_Detail_C_SetupDisplay) == 0x000020, "Wrong size on WB_GameResultTicket_Detail_C_SetupDisplay");
static_assert(offsetof(WB_GameResultTicket_Detail_C_SetupDisplay, InText) == 0x000000, "Member 'WB_GameResultTicket_Detail_C_SetupDisplay::InText' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_SetupDisplay, Sign_0) == 0x000018, "Member 'WB_GameResultTicket_Detail_C_SetupDisplay::Sign_0' has a wrong offset!");
static_assert(offsetof(WB_GameResultTicket_Detail_C_SetupDisplay, Value) == 0x00001C, "Member 'WB_GameResultTicket_Detail_C_SetupDisplay::Value' has a wrong offset!");

}

