#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Highlight_LoadingWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Highlight_LoadingWindow.WB_Highlight_LoadingWindow_C
// 0x0018 (0x02D8 - 0x02C0)
class UWB_Highlight_LoadingWindow_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWB_HighlightProgressBar_C*             WB_HighlightProgressBar;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_WindowFrame_C*                      WB_WindowFrame;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Highlight_LoadingWindow(int32 EntryPoint);
	void UpdateProgressBar(float Value);
	void Construct();
	void OnClosingWindow();
	void OnFinishedOpenCurveAnim();
	void OnOpeningWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Highlight_LoadingWindow_C">();
	}
	static class UWB_Highlight_LoadingWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Highlight_LoadingWindow_C>();
	}
};
static_assert(alignof(UWB_Highlight_LoadingWindow_C) == 0x000008, "Wrong alignment on UWB_Highlight_LoadingWindow_C");
static_assert(sizeof(UWB_Highlight_LoadingWindow_C) == 0x0002D8, "Wrong size on UWB_Highlight_LoadingWindow_C");
static_assert(offsetof(UWB_Highlight_LoadingWindow_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_Highlight_LoadingWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Highlight_LoadingWindow_C, WB_HighlightProgressBar) == 0x0002C8, "Member 'UWB_Highlight_LoadingWindow_C::WB_HighlightProgressBar' has a wrong offset!");
static_assert(offsetof(UWB_Highlight_LoadingWindow_C, WB_WindowFrame) == 0x0002D0, "Member 'UWB_Highlight_LoadingWindow_C::WB_WindowFrame' has a wrong offset!");

}

