#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameOpening

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function WB_InGameOpening.WB_InGameOpening_C.ExecuteUbergraph_WB_InGameOpening
// 0x00D0 (0x00D0 - 0x0000)
struct WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0068(0x0040)()
	bool                                          CallFunc_PlaySequence_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AAJBLevelSequenceActor*                 CallFunc_CreateAJBLevelSequencePlayer_OutActor;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateAJBLevelSequencePlayer_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening) == 0x000008, "Wrong alignment on WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening");
static_assert(sizeof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening) == 0x0000D0, "Wrong size on WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, EntryPoint) == 0x000000, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, Temp_int_Variable) == 0x000008, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000028, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_IsEditor_ReturnValue) == 0x000031, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000058, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000068, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_PlaySequence_ReturnValue) == 0x0000A8, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_PlaySequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_IsValid_ReturnValue1) == 0x0000A9, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, K2Node_CreateDelegate_OutputDelegate1) == 0x0000B0, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_CreateAJBLevelSequencePlayer_OutActor) == 0x0000C0, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_CreateAJBLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening, CallFunc_CreateAJBLevelSequencePlayer_ReturnValue) == 0x0000C8, "Member 'WB_InGameOpening_C_ExecuteUbergraph_WB_InGameOpening::CallFunc_CreateAJBLevelSequencePlayer_ReturnValue' has a wrong offset!");

}

