#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkPair

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_LandmarkPair.WB_LandmarkPair_C.ExecuteUbergraph_WB_LandmarkPair
// 0x0080 (0x0080 - 0x0000)
struct WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InnerScale;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnableBlink;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairHP;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair) == 0x000008, "Wrong alignment on WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair");
static_assert(sizeof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair) == 0x000080, "Wrong size on WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, EntryPoint) == 0x000000, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, Temp_bool_Variable) == 0x000004, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, Temp_object_Variable) == 0x000008, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, Temp_object_Variable1) == 0x000010, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_Event_InnerScale) == 0x000018, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_Event_InnerScale' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_Event_MyGeometry) == 0x000020, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_Event_bEnableBlink) == 0x00005C, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_Event_bEnableBlink' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000060, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_CustomEvent_PairHP) == 0x000070, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_CustomEvent_PairHP' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair, K2Node_Select_Default) == 0x000078, "Member 'WB_LandmarkPair_C_ExecuteUbergraph_WB_LandmarkPair::K2Node_Select_Default' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.ChangeIconMaterial
// 0x0004 (0x0004 - 0x0000)
struct WB_LandmarkPair_C_ChangeIconMaterial final
{
public:
	int32                                         PairHP;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_ChangeIconMaterial) == 0x000004, "Wrong alignment on WB_LandmarkPair_C_ChangeIconMaterial");
static_assert(sizeof(WB_LandmarkPair_C_ChangeIconMaterial) == 0x000004, "Wrong size on WB_LandmarkPair_C_ChangeIconMaterial");
static_assert(offsetof(WB_LandmarkPair_C_ChangeIconMaterial, PairHP) == 0x000000, "Member 'WB_LandmarkPair_C_ChangeIconMaterial::PairHP' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.SetupBlink
// 0x0001 (0x0001 - 0x0000)
struct WB_LandmarkPair_C_SetupBlink final
{
public:
	bool                                          bEnableBlink;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_LandmarkPair_C_SetupBlink) == 0x000001, "Wrong alignment on WB_LandmarkPair_C_SetupBlink");
static_assert(sizeof(WB_LandmarkPair_C_SetupBlink) == 0x000001, "Wrong size on WB_LandmarkPair_C_SetupBlink");
static_assert(offsetof(WB_LandmarkPair_C_SetupBlink, bEnableBlink) == 0x000000, "Member 'WB_LandmarkPair_C_SetupBlink::bEnableBlink' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_LandmarkPair_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_Tick) == 0x000004, "Wrong alignment on WB_LandmarkPair_C_Tick");
static_assert(sizeof(WB_LandmarkPair_C_Tick) == 0x00003C, "Wrong size on WB_LandmarkPair_C_Tick");
static_assert(offsetof(WB_LandmarkPair_C_Tick, MyGeometry) == 0x000000, "Member 'WB_LandmarkPair_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_LandmarkPair_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_LandmarkPair_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.SetInnerScale
// 0x0004 (0x0004 - 0x0000)
struct WB_LandmarkPair_C_SetInnerScale final
{
public:
	float                                         InnerScale_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_SetInnerScale) == 0x000004, "Wrong alignment on WB_LandmarkPair_C_SetInnerScale");
static_assert(sizeof(WB_LandmarkPair_C_SetInnerScale) == 0x000004, "Wrong size on WB_LandmarkPair_C_SetInnerScale");
static_assert(offsetof(WB_LandmarkPair_C_SetInnerScale, InnerScale_0) == 0x000000, "Member 'WB_LandmarkPair_C_SetInnerScale::InnerScale_0' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.GetContentWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPair_C_GetContentWidget final
{
public:
	class UWidget*                                ContentWidget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_GetContentWidget) == 0x000008, "Wrong alignment on WB_LandmarkPair_C_GetContentWidget");
static_assert(sizeof(WB_LandmarkPair_C_GetContentWidget) == 0x000008, "Wrong size on WB_LandmarkPair_C_GetContentWidget");
static_assert(offsetof(WB_LandmarkPair_C_GetContentWidget, ContentWidget) == 0x000000, "Member 'WB_LandmarkPair_C_GetContentWidget::ContentWidget' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.GetResizerWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPair_C_GetResizerWidget final
{
public:
	class USizeBox*                               SizeBox;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_GetResizerWidget) == 0x000008, "Wrong alignment on WB_LandmarkPair_C_GetResizerWidget");
static_assert(sizeof(WB_LandmarkPair_C_GetResizerWidget) == 0x000008, "Wrong size on WB_LandmarkPair_C_GetResizerWidget");
static_assert(offsetof(WB_LandmarkPair_C_GetResizerWidget, SizeBox) == 0x000000, "Member 'WB_LandmarkPair_C_GetResizerWidget::SizeBox' has a wrong offset!");

// Function WB_LandmarkPair.WB_LandmarkPair_C.GetRetainerBoxWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPair_C_GetRetainerBoxWidget final
{
public:
	class URetainerBox*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LandmarkPair_C_GetRetainerBoxWidget) == 0x000008, "Wrong alignment on WB_LandmarkPair_C_GetRetainerBoxWidget");
static_assert(sizeof(WB_LandmarkPair_C_GetRetainerBoxWidget) == 0x000008, "Wrong size on WB_LandmarkPair_C_GetRetainerBoxWidget");
static_assert(offsetof(WB_LandmarkPair_C_GetRetainerBoxWidget, ReturnValue) == 0x000000, "Member 'WB_LandmarkPair_C_GetRetainerBoxWidget::ReturnValue' has a wrong offset!");

}

