#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LivingPlayerCountMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LivingPlayerCountMessage.WB_LivingPlayerCountMessage_C
// 0x00A0 (0x02A8 - 0x0208)
class UWB_LivingPlayerCountMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear_Boss;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear_Last;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Belt;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Belt_Last;                                // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Flare01;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Flare04;                                  // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_FlareL;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_LastNum;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_LastNum_Effect;                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_1;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LastMessageRoot;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MessageRoot;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerNumberText;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PreMessage;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowMessageHalf;                                  // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowMessageOneThird;                              // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowMessageTwo;                                   // 0x028A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_LastNum;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_LastNum_Effect;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldShowingBossMessage;                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_LivingPlayerCountMessage(int32 EntryPoint);
	void OnBossSpawned();
	void Construct();
	void ResetFlag();
	void ShowMessageText(int32 PlayerCount, float LivingPlayerRate, int32 PairCount);
	void CanShowMessage(int32 PlayerCount, float Rate, int32 PairCount, bool* bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LivingPlayerCountMessage_C">();
	}
	static class UWB_LivingPlayerCountMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LivingPlayerCountMessage_C>();
	}
};
static_assert(alignof(UWB_LivingPlayerCountMessage_C) == 0x000008, "Wrong alignment on UWB_LivingPlayerCountMessage_C");
static_assert(sizeof(UWB_LivingPlayerCountMessage_C) == 0x0002A8, "Wrong size on UWB_LivingPlayerCountMessage_C");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, UberGraphFrame) == 0x000208, "Member 'UWB_LivingPlayerCountMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, Appear_Boss) == 0x000210, "Member 'UWB_LivingPlayerCountMessage_C::Appear_Boss' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, Appear_Last) == 0x000218, "Member 'UWB_LivingPlayerCountMessage_C::Appear_Last' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, Appear) == 0x000220, "Member 'UWB_LivingPlayerCountMessage_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_Belt) == 0x000228, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_Belt' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_Belt_Last) == 0x000230, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_Belt_Last' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_Flare01) == 0x000238, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_Flare01' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_Flare04) == 0x000240, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_Flare04' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_FlareL) == 0x000248, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_FlareL' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_LastNum) == 0x000250, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_LastNum' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBImage_LastNum_Effect) == 0x000258, "Member 'UWB_LivingPlayerCountMessage_C::AJBImage_LastNum_Effect' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, AJBTextBlock_1) == 0x000260, "Member 'UWB_LivingPlayerCountMessage_C::AJBTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, LastMessageRoot) == 0x000268, "Member 'UWB_LivingPlayerCountMessage_C::LastMessageRoot' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, MessageRoot) == 0x000270, "Member 'UWB_LivingPlayerCountMessage_C::MessageRoot' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, PlayerNumberText) == 0x000278, "Member 'UWB_LivingPlayerCountMessage_C::PlayerNumberText' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, PreMessage) == 0x000280, "Member 'UWB_LivingPlayerCountMessage_C::PreMessage' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, bShowMessageHalf) == 0x000288, "Member 'UWB_LivingPlayerCountMessage_C::bShowMessageHalf' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, bShowMessageOneThird) == 0x000289, "Member 'UWB_LivingPlayerCountMessage_C::bShowMessageOneThird' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, bShowMessageTwo) == 0x00028A, "Member 'UWB_LivingPlayerCountMessage_C::bShowMessageTwo' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, DMI_LastNum) == 0x000290, "Member 'UWB_LivingPlayerCountMessage_C::DMI_LastNum' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, DMI_LastNum_Effect) == 0x000298, "Member 'UWB_LivingPlayerCountMessage_C::DMI_LastNum_Effect' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCountMessage_C, ShouldShowingBossMessage) == 0x0002A0, "Member 'UWB_LivingPlayerCountMessage_C::ShouldShowingBossMessage' has a wrong offset!");

}

