#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LastSurvivorDirection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LastSurvivorDirection.WB_LastSurvivorDirection_C
// 0x0050 (0x0310 - 0x02C0)
class UWB_LastSurvivorDirection_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_1;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_126;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerName;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerRankLabel;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          PlayerRankNum;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RankRoot;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TitleLabel;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerID;                                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LastSurvivorDirection(int32 EntryPoint);
	void OnClosingWindow();
	void OnOpeningWindow();
	void SetupPlayerID(int32 NewPlayerID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LastSurvivorDirection_C">();
	}
	static class UWB_LastSurvivorDirection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LastSurvivorDirection_C>();
	}
};
static_assert(alignof(UWB_LastSurvivorDirection_C) == 0x000008, "Wrong alignment on UWB_LastSurvivorDirection_C");
static_assert(sizeof(UWB_LastSurvivorDirection_C) == 0x000310, "Wrong size on UWB_LastSurvivorDirection_C");
static_assert(offsetof(UWB_LastSurvivorDirection_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_LastSurvivorDirection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, Anim_Appear) == 0x0002C8, "Member 'UWB_LastSurvivorDirection_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, AJBImage_1) == 0x0002D0, "Member 'UWB_LastSurvivorDirection_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, AJBImage_126) == 0x0002D8, "Member 'UWB_LastSurvivorDirection_C::AJBImage_126' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, PlayerName) == 0x0002E0, "Member 'UWB_LastSurvivorDirection_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, PlayerRankLabel) == 0x0002E8, "Member 'UWB_LastSurvivorDirection_C::PlayerRankLabel' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, PlayerRankNum) == 0x0002F0, "Member 'UWB_LastSurvivorDirection_C::PlayerRankNum' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, RankRoot) == 0x0002F8, "Member 'UWB_LastSurvivorDirection_C::RankRoot' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, TitleLabel) == 0x000300, "Member 'UWB_LastSurvivorDirection_C::TitleLabel' has a wrong offset!");
static_assert(offsetof(UWB_LastSurvivorDirection_C, PlayerID) == 0x000308, "Member 'UWB_LastSurvivorDirection_C::PlayerID' has a wrong offset!");

}

