#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LoadingScreenFade

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_LoadingScreenFade.WB_LoadingScreenFade_C.ExecuteUbergraph_WB_LoadingScreenFade
// 0x0004 (0x0004 - 0x0000)
struct WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade) == 0x000004, "Wrong alignment on WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade");
static_assert(sizeof(WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade) == 0x000004, "Wrong size on WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade");
static_assert(offsetof(WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade, EntryPoint) == 0x000000, "Member 'WB_LoadingScreenFade_C_ExecuteUbergraph_WB_LoadingScreenFade::EntryPoint' has a wrong offset!");

// Function WB_LoadingScreenFade.WB_LoadingScreenFade_C.UpdateCredit
// 0x00E8 (0x00E8 - 0x0000)
struct WB_LoadingScreenFade_C_UpdateCredit final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	int32                                         CallFunc_GetCacheInteger_OutValue1;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue1;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue2;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue2;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0018)()
};
static_assert(alignof(WB_LoadingScreenFade_C_UpdateCredit) == 0x000008, "Wrong alignment on WB_LoadingScreenFade_C_UpdateCredit");
static_assert(sizeof(WB_LoadingScreenFade_C_UpdateCredit) == 0x0000E8, "Wrong size on WB_LoadingScreenFade_C_UpdateCredit");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, Temp_bool_Variable) == 0x000001, "Member 'WB_LoadingScreenFade_C_UpdateCredit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, Temp_text_Variable) == 0x000008, "Member 'WB_LoadingScreenFade_C_UpdateCredit::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_OutValue) == 0x000024, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_ReturnValue) == 0x000028, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000029, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WB_LoadingScreenFade_C_UpdateCredit::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, K2Node_MakeArray_Array) == 0x000070, "Member 'WB_LoadingScreenFade_C_UpdateCredit::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Conv_ByteToInt_ReturnValue1) == 0x000080, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Conv_ByteToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_OutValue1) == 0x0000A0, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_OutValue1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_ReturnValue1) == 0x0000A4, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_MakeLiteralByte_ReturnValue2) == 0x0000A5, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x0000C0, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_OutValue2) == 0x0000C4, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_OutValue2' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_GetCacheInteger_ReturnValue2) == 0x0000C8, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_GetCacheInteger_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000C9, "Member 'WB_LoadingScreenFade_C_UpdateCredit::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCredit, K2Node_Select_Default) == 0x0000D0, "Member 'WB_LoadingScreenFade_C_UpdateCredit::K2Node_Select_Default' has a wrong offset!");

// Function WB_LoadingScreenFade.WB_LoadingScreenFade_C.UpdateAllNetIcon
// 0x0010 (0x0010 - 0x0000)
struct WB_LoadingScreenFade_C_UpdateAllNetIcon final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_LoadingScreenFade_C_UpdateAllNetIcon) == 0x000004, "Wrong alignment on WB_LoadingScreenFade_C_UpdateAllNetIcon");
static_assert(sizeof(WB_LoadingScreenFade_C_UpdateAllNetIcon) == 0x000010, "Wrong size on WB_LoadingScreenFade_C_UpdateAllNetIcon");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateAllNetIcon, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WB_LoadingScreenFade_C_UpdateAllNetIcon::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateAllNetIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_LoadingScreenFade_C_UpdateAllNetIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateAllNetIcon, CallFunc_GetCacheInteger_OutValue) == 0x000008, "Member 'WB_LoadingScreenFade_C_UpdateAllNetIcon::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateAllNetIcon, CallFunc_GetCacheInteger_ReturnValue) == 0x00000C, "Member 'WB_LoadingScreenFade_C_UpdateAllNetIcon::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateAllNetIcon, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'WB_LoadingScreenFade_C_UpdateAllNetIcon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_LoadingScreenFade.WB_LoadingScreenFade_C.UpdateCreditColor
// 0x0088 (0x0088 - 0x0000)
struct WB_LoadingScreenFade_C_UpdateCreditColor final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue1;                   // 0x004C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0060(0x0028)()
};
static_assert(alignof(WB_LoadingScreenFade_C_UpdateCreditColor) == 0x000008, "Wrong alignment on WB_LoadingScreenFade_C_UpdateCreditColor");
static_assert(sizeof(WB_LoadingScreenFade_C_UpdateCreditColor) == 0x000088, "Wrong size on WB_LoadingScreenFade_C_UpdateCreditColor");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_MakeColor_ReturnValue) == 0x000004, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_GetCacheInteger_OutValue) == 0x000044, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_GetCacheInteger_ReturnValue) == 0x000048, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000049, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, CallFunc_MakeColor_ReturnValue1) == 0x00004C, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::CallFunc_MakeColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateCreditColor, K2Node_MakeStruct_SlateColor1) == 0x000060, "Member 'WB_LoadingScreenFade_C_UpdateCreditColor::K2Node_MakeStruct_SlateColor1' has a wrong offset!");

// Function WB_LoadingScreenFade.WB_LoadingScreenFade_C.UpdateStoreCloseMessege
// 0x0010 (0x0010 - 0x0000)
struct WB_LoadingScreenFade_C_UpdateStoreCloseMessege final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege) == 0x000004, "Wrong alignment on WB_LoadingScreenFade_C_UpdateStoreCloseMessege");
static_assert(sizeof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege) == 0x000010, "Wrong size on WB_LoadingScreenFade_C_UpdateStoreCloseMessege");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, Temp_bool_Variable) == 0x000000, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, Temp_byte_Variable) == 0x000001, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, Temp_byte_Variable1) == 0x000002, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, CallFunc_MakeLiteralByte_ReturnValue) == 0x000003, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, CallFunc_GetCacheInteger_OutValue) == 0x000008, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, CallFunc_GetCacheInteger_ReturnValue) == 0x00000C, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_LoadingScreenFade_C_UpdateStoreCloseMessege, K2Node_Select_Default) == 0x00000E, "Member 'WB_LoadingScreenFade_C_UpdateStoreCloseMessege::K2Node_Select_Default' has a wrong offset!");

}

