#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LivingPlayerCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LivingPlayerCount.WB_LivingPlayerCount_C
// 0x00B0 (0x02B8 - 0x0208)
class UWB_LivingPlayerCount_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_PraiseText;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flash;                                             // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_1;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_Question;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Num1_1;                                            // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Num1Root;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Num2_1;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Num2_10;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Num2Root;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlayerCount;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Question;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Num_2_1;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Num_2_10;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Num_1_1;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabledCentering;                                 // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDisplayPlayerNumText;                             // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnabledChangeColorNumber;                         // 0x0282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverdideMaterial;                                  // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseQuestionIcon;                                  // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CachedNum;                                         // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabledPraiseText;                                // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnFinishedAnimPraiseText;                          // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabledChageEdgeColor;                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_LivingPlayerCount(int32 EntryPoint);
	void BndEvt__Anim_PraiseText_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__Flash_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateLivingPlayerNum(int32 NewNum);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LivingPlayerCount_C">();
	}
	static class UWB_LivingPlayerCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LivingPlayerCount_C>();
	}
};
static_assert(alignof(UWB_LivingPlayerCount_C) == 0x000008, "Wrong alignment on UWB_LivingPlayerCount_C");
static_assert(sizeof(UWB_LivingPlayerCount_C) == 0x0002B8, "Wrong size on UWB_LivingPlayerCount_C");
static_assert(offsetof(UWB_LivingPlayerCount_C, UberGraphFrame) == 0x000208, "Member 'UWB_LivingPlayerCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Anim_PraiseText) == 0x000210, "Member 'UWB_LivingPlayerCount_C::Anim_PraiseText' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Flash) == 0x000218, "Member 'UWB_LivingPlayerCount_C::Flash' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, AJBImage_1) == 0x000220, "Member 'UWB_LivingPlayerCount_C::AJBImage_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, AJBImage_Question) == 0x000228, "Member 'UWB_LivingPlayerCount_C::AJBImage_Question' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Num1_1) == 0x000230, "Member 'UWB_LivingPlayerCount_C::Num1_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Num1Root) == 0x000238, "Member 'UWB_LivingPlayerCount_C::Num1Root' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Num2_1) == 0x000240, "Member 'UWB_LivingPlayerCount_C::Num2_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Num2_10) == 0x000248, "Member 'UWB_LivingPlayerCount_C::Num2_10' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Num2Root) == 0x000250, "Member 'UWB_LivingPlayerCount_C::Num2Root' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, PlayerCount) == 0x000258, "Member 'UWB_LivingPlayerCount_C::PlayerCount' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, Question) == 0x000260, "Member 'UWB_LivingPlayerCount_C::Question' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, DMI_Num_2_1) == 0x000268, "Member 'UWB_LivingPlayerCount_C::DMI_Num_2_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, DMI_Num_2_10) == 0x000270, "Member 'UWB_LivingPlayerCount_C::DMI_Num_2_10' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, DMI_Num_1_1) == 0x000278, "Member 'UWB_LivingPlayerCount_C::DMI_Num_1_1' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bEnabledCentering) == 0x000280, "Member 'UWB_LivingPlayerCount_C::bEnabledCentering' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bDisplayPlayerNumText) == 0x000281, "Member 'UWB_LivingPlayerCount_C::bDisplayPlayerNumText' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bEnabledChangeColorNumber) == 0x000282, "Member 'UWB_LivingPlayerCount_C::bEnabledChangeColorNumber' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, OverdideMaterial) == 0x000288, "Member 'UWB_LivingPlayerCount_C::OverdideMaterial' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bUseQuestionIcon) == 0x000290, "Member 'UWB_LivingPlayerCount_C::bUseQuestionIcon' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, CachedNum) == 0x000294, "Member 'UWB_LivingPlayerCount_C::CachedNum' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bEnabledPraiseText) == 0x000298, "Member 'UWB_LivingPlayerCount_C::bEnabledPraiseText' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, OnFinishedAnimPraiseText) == 0x0002A0, "Member 'UWB_LivingPlayerCount_C::OnFinishedAnimPraiseText' has a wrong offset!");
static_assert(offsetof(UWB_LivingPlayerCount_C, bEnabledChageEdgeColor) == 0x0002B0, "Member 'UWB_LivingPlayerCount_C::bEnabledChageEdgeColor' has a wrong offset!");

}

