#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapGuideLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapGuideLine.WB_MapGuideLine_C
// 0x0040 (0x0248 - 0x0208)
class UWB_MapGuideLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_Line;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_LineWriter;                                    // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ToPosition;                                        // 0x0220(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FromPosition;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OuterMapSize;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OuterPositionOffset;                               // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OuterScale;                                        // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVisible;                                        // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_MapGuideLine(int32 EntryPoint);
	void Update(const struct FVector2D& OuterPositionOffset_0, float OuterScale_0);
	void Setup(const struct FVector2D& OuterMapSize_0, bool bIsVisible_0);
	void Construct();
	void SetPosition(const struct FVector2D& ToPosition_0, const struct FVector2D& FromPosition_0);
	void SetCircleIntersectPosition(const struct FVector2D& FromPosition_0, const struct FVector2D& NormalizedCircleCenter, float NormalizedRadius);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapGuideLine_C">();
	}
	static class UWB_MapGuideLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapGuideLine_C>();
	}
};
static_assert(alignof(UWB_MapGuideLine_C) == 0x000008, "Wrong alignment on UWB_MapGuideLine_C");
static_assert(sizeof(UWB_MapGuideLine_C) == 0x000248, "Wrong size on UWB_MapGuideLine_C");
static_assert(offsetof(UWB_MapGuideLine_C, UberGraphFrame) == 0x000208, "Member 'UWB_MapGuideLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, AJBImage_Line) == 0x000210, "Member 'UWB_MapGuideLine_C::AJBImage_Line' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, DMI_LineWriter) == 0x000218, "Member 'UWB_MapGuideLine_C::DMI_LineWriter' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, ToPosition) == 0x000220, "Member 'UWB_MapGuideLine_C::ToPosition' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, FromPosition) == 0x000228, "Member 'UWB_MapGuideLine_C::FromPosition' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, OuterMapSize) == 0x000230, "Member 'UWB_MapGuideLine_C::OuterMapSize' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, OuterPositionOffset) == 0x000238, "Member 'UWB_MapGuideLine_C::OuterPositionOffset' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, OuterScale) == 0x000240, "Member 'UWB_MapGuideLine_C::OuterScale' has a wrong offset!");
static_assert(offsetof(UWB_MapGuideLine_C, bIsVisible) == 0x000244, "Member 'UWB_MapGuideLine_C::bIsVisible' has a wrong offset!");

}

