#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_EndTheGame

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.ExecuteUbergraph_WB_ModeSelect_EndTheGame
// 0x0410 (0x0410 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;     // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue1;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable1;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Temp_struct_Variable;                              // 0x0060(0x00A0)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result2;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       K2Node_CustomEvent_Reward;                         // 0x0108(0x00A0)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result3;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       K2Node_CustomEvent_Reward1;                        // 0x01B0(0x00A0)()
	TDelegate<void(EAJBNetAPIResult Result, const struct FAJBLogoutReward& Reward)> K2Node_CreateDelegate_OutputDelegate3; // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result, const struct FAJBLogoutReward& Reward)> K2Node_CreateDelegate_OutputDelegate4; // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBConfirmResult                             CallFunc_GetButtonResult_Result;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPP_PP;                                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExpNum_Num;                            // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02A8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x02C0(0x0018)()
	bool                                          CallFunc_GetAJBOutGamePlayerController_BP_bSuccess; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGamePlayerController_C*       CallFunc_GetAJBOutGamePlayerController_BP_Out_Game_Player_Controller; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBOutGameProxyInterface_C> CallFunc_GetAJBOutGameProxy_self_CastInput; // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBOutGameProxy_C*                  CallFunc_GetAJBOutGameProxy_Object;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI_Logout*                      CallFunc_Request_UserLogout_ReturnValue;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI*                             CallFunc_Request_SysServeralive_ReturnValue;       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBArcadeTerminateGame_ReturnValue;     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate5;     // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBArcadeTerminateGame_ReturnValue1;    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGuestPlaying_ReturnValue;               // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue2;                      // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetArcadeTerminateText_ReturnValue;       // 0x0370(0x0018)()
	class FText                                   CallFunc_GetArcadeTerminateText_ReturnValue1;      // 0x0388(0x0018)()
	bool                                          K2Node_CustomEvent_bRetry;                         // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue1;             // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue2;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue3;             // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue5;             // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame) == 0x000410, "Wrong size on WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, EntryPoint) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Result1) == 0x000005, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Result) == 0x000018, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate1) == 0x000020, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, Temp_byte_Variable) == 0x000030, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000031, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Create_ReturnValue1) == 0x000050, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, Temp_byte_Variable1) == 0x000058, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, Temp_struct_Variable) == 0x000060, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Result2) == 0x000100, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Reward) == 0x000108, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Reward' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Result3) == 0x0001A8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Result3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_Reward1) == 0x0001B0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_Reward1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate3) == 0x000250, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue2) == 0x000260, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate4) == 0x000268, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetButtonResult_Result) == 0x000279, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetButtonResult_Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00027A, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x000280, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_ComponentBoundEvent_TargetButton1) == 0x000288, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000290, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_ComponentBoundEvent_TargetButton) == 0x000298, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetPP_PP) == 0x0002A0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetPP_PP' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetExpNum_Num) == 0x0002A4, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetExpNum_Num' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Conv_IntToText_ReturnValue) == 0x0002A8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Conv_IntToText_ReturnValue1) == 0x0002C0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBOutGamePlayerController_BP_bSuccess) == 0x0002D8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBOutGamePlayerController_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBOutGamePlayerController_BP_Out_Game_Player_Controller) == 0x0002E0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBOutGamePlayerController_BP_Out_Game_Player_Controller' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBOutGameProxy_self_CastInput) == 0x0002E8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBOutGameProxy_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBOutGameProxy_Object) == 0x0002F8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBOutGameProxy_Object' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Request_UserLogout_ReturnValue) == 0x000300, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Request_UserLogout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Request_SysServeralive_ReturnValue) == 0x000308, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Request_SysServeralive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsValid_ReturnValue1) == 0x000310, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsValid_ReturnValue2) == 0x000311, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000318, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsAJBArcadeTerminateGame_ReturnValue) == 0x000320, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsAJBArcadeTerminateGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate5) == 0x000328, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000338, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsAJBOfflineMode_ReturnValue) == 0x000339, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsAJBOfflineMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BooleanOR_ReturnValue) == 0x00033A, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsValid_ReturnValue3) == 0x00033B, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBGameInstance_bSuccess) == 0x00033C, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000340, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsAJBArcadeTerminateGame_ReturnValue1) == 0x000348, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsAJBArcadeTerminateGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsFreePlay_ReturnValue) == 0x000349, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsFreePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_IsGuestPlaying_ReturnValue) == 0x00034A, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_IsGuestPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue3) == 0x00034B, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BooleanOR_ReturnValue1) == 0x00034C, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BooleanOR_ReturnValue2) == 0x00034D, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_TargetWidget1) == 0x000350, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_TargetWidget1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BooleanOR_ReturnValue3) == 0x000358, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Create_ReturnValue2) == 0x000360, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_Greater_IntInt_ReturnValue) == 0x000368, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetArcadeTerminateText_ReturnValue) == 0x000370, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetArcadeTerminateText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_GetArcadeTerminateText_ReturnValue1) == 0x000388, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_GetArcadeTerminateText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_bRetry) == 0x0003A0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_bRetry' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BuildString_Int_ReturnValue) == 0x0003A8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BuildString_Int_ReturnValue1) == 0x0003B8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BuildString_Int_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BuildString_Int_ReturnValue2) == 0x0003C8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BuildString_Int_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_BuildString_Int_ReturnValue3) == 0x0003D8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_BuildString_Int_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue4) == 0x0003E8, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CreateDelegate_OutputDelegate6) == 0x0003F0, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, CallFunc_MakeLiteralByte_ReturnValue5) == 0x000400, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::CallFunc_MakeLiteralByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame, K2Node_CustomEvent_TargetWidget) == 0x000408, "Member 'WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame::K2Node_CustomEvent_TargetWidget' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnClosedNetworkErrorWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow) == 0x000008, "Wrong size on WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow, TargetWidget) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow::TargetWidget' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.DisplayPpExpExchangingResult
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult final
{
public:
	bool                                          bRetry;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult, bRetry) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult::bRetry' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnClosedConfirm
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnClosedConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnClosedConfirm) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnClosedConfirm");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnClosedConfirm) == 0x000008, "Wrong size on WB_ModeSelect_EndTheGame_C_OnClosedConfirm");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnClosedConfirm, TargetWidget) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnClosedConfirm::TargetWidget' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnSuccess_B2798BC646B804B1DF62CBB4676388AD
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD, Result) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD::Result' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnFailed_B2798BC646B804B1DF62CBB4676388AD
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD, Result) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD::Result' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnSuccess_A50BF3104A67040AAFB1E5809807835F
// 0x00A8 (0x00A8 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Reward;                                            // 0x0008(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F) == 0x0000A8, "Wrong size on WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F, Result) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F::Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F, Reward) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F::Reward' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnFailed_A50BF3104A67040AAFB1E5809807835F
// 0x00A8 (0x00A8 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Reward;                                            // 0x0008(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F) == 0x0000A8, "Wrong size on WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F, Result) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F::Result' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F, Reward) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F::Reward' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetPP
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetPP final
{
public:
	int32                                         PP;                                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_GetPP) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_GetPP");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_GetPP) == 0x000010, "Wrong size on WB_ModeSelect_EndTheGame_C_GetPP");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetPP, PP) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_GetPP::PP' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetPP, CallFunc_GetAJBGameInstance_bSuccess) == 0x000004, "Member 'WB_ModeSelect_EndTheGame_C_GetPP::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetPP, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_GetPP::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetExpNum
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetExpNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_GetExpNum) == 0x000004, "Wrong alignment on WB_ModeSelect_EndTheGame_C_GetExpNum");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_GetExpNum) == 0x00000C, "Wrong size on WB_ModeSelect_EndTheGame_C_GetExpNum");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetExpNum, Num) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_GetExpNum::Num' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetExpNum, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_ModeSelect_EndTheGame_C_GetExpNum::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetExpNum, CallFunc_Max_ReturnValue) == 0x000008, "Member 'WB_ModeSelect_EndTheGame_C_GetExpNum::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetArcadeTerminateText
// 0x0078 (0x0078 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0038(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText) == 0x000008, "Wrong alignment on WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText) == 0x000078, "Wrong size on WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, Temp_bool_Variable) == 0x000018, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, Temp_text_Variable) == 0x000020, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, Temp_text_Variable1) == 0x000038, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, CallFunc_MakeLiteralByte_ReturnValue) == 0x000050, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000054, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, CallFunc_GetCacheInteger_OutValue) == 0x000058, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::CallFunc_GetCacheInteger_OutValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, CallFunc_GetCacheInteger_ReturnValue) == 0x00005C, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::CallFunc_GetCacheInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00005D, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText, K2Node_Select_Default) == 0x000060, "Member 'WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText::K2Node_Select_Default' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnInputTurnRate) == 0x000004, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnInputTurnRate");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnInputTurnRate) == 0x000008, "Wrong size on WB_ModeSelect_EndTheGame_C_OnInputTurnRate");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputTurnRate, Value) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnInputTurnRate::Value' has a wrong offset!");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputTurnRate, ReturnValue) == 0x000004, "Member 'WB_ModeSelect_EndTheGame_C_OnInputTurnRate::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnInputReleasedUp) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnInputReleasedUp");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnInputReleasedUp) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnInputReleasedUp");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputReleasedUp, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnInputReleasedUp::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnInputReleasedRight) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnInputReleasedRight");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnInputReleasedRight) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnInputReleasedRight");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputReleasedRight, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnInputReleasedRight::ReturnValue' has a wrong offset!");

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft) == 0x000001, "Wrong alignment on WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft");
static_assert(sizeof(WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft) == 0x000001, "Wrong size on WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft");
static_assert(offsetof(WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft, ReturnValue) == 0x000000, "Member 'WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft::ReturnValue' has a wrong offset!");

