#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PairAlertConfirm

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.ExecuteUbergraph_WB_PairAlertConfirm
// 0x0050 (0x0050 - 0x0000)
struct WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPlayDecisionSE;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCancelSE;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayOpenSE;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCloseSE;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm) == 0x000008, "Wrong alignment on WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm");
static_assert(sizeof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm) == 0x000050, "Wrong size on WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, EntryPoint) == 0x000000, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000018, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, CallFunc_RequestWwiseEventOnLocal_AkComponent1) == 0x000020, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::CallFunc_RequestWwiseEventOnLocal_AkComponent1' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_CustomEvent_bIsPlayDecisionSE) == 0x000028, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_CustomEvent_bIsPlayDecisionSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_CustomEvent_bIsPlayCancelSE) == 0x000029, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_CustomEvent_bIsPlayCancelSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_CustomEvent_bIsPlayOpenSE) == 0x00002A, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_CustomEvent_bIsPlayOpenSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_CustomEvent_bIsPlayCloseSE) == 0x00002B, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_CustomEvent_bIsPlayCloseSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000030, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_ComponentBoundEvent_TargetButton) == 0x000038, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x000040, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm, K2Node_ComponentBoundEvent_TargetButton1) == 0x000048, "Member 'WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.SetIsPlaySE
// 0x0004 (0x0004 - 0x0000)
struct WB_PairAlertConfirm_C_SetIsPlaySE final
{
public:
	bool                                          bIsPlayDecisionSE;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCancelSE;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayOpenSE_0;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCloseSE_0;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_SetIsPlaySE) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_SetIsPlaySE");
static_assert(sizeof(WB_PairAlertConfirm_C_SetIsPlaySE) == 0x000004, "Wrong size on WB_PairAlertConfirm_C_SetIsPlaySE");
static_assert(offsetof(WB_PairAlertConfirm_C_SetIsPlaySE, bIsPlayDecisionSE) == 0x000000, "Member 'WB_PairAlertConfirm_C_SetIsPlaySE::bIsPlayDecisionSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_SetIsPlaySE, bIsPlayCancelSE) == 0x000001, "Member 'WB_PairAlertConfirm_C_SetIsPlaySE::bIsPlayCancelSE' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_SetIsPlaySE, bIsPlayOpenSE_0) == 0x000002, "Member 'WB_PairAlertConfirm_C_SetIsPlaySE::bIsPlayOpenSE_0' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_SetIsPlaySE, bIsPlayCloseSE_0) == 0x000003, "Member 'WB_PairAlertConfirm_C_SetIsPlaySE::bIsPlayCloseSE_0' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.GetButtonResult
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_GetButtonResult final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PairAlertConfirm_C_GetButtonResult) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_GetButtonResult");
static_assert(sizeof(WB_PairAlertConfirm_C_GetButtonResult) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_GetButtonResult");
static_assert(offsetof(WB_PairAlertConfirm_C_GetButtonResult, Result) == 0x000000, "Member 'WB_PairAlertConfirm_C_GetButtonResult::Result' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedUp) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedUp");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedUp) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedUp");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedUp, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedUp::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedRight) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedRight");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedRight) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedRight");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedRight, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedRight::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedLeft) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedLeft");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedLeft) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedLeft");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedLeft, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedLeft::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedDown) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedDown");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedDown) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedDown");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedDown, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedDown::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedDecide) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedDecide");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedDecide) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedDecide");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedDecide, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedDecide::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedCancel) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedCancel");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedCancel) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedCancel");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedCancel, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedCancel::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedUp) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedUp");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedUp) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedUp");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedUp, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedUp::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedRight) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedRight");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedRight) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedRight");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedRight, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedRight::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedLeft) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedLeft");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedLeft) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedLeft");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedLeft, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedLeft::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedDown) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedDown");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedDown) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedDown");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedDown, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedDown::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedDecide) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedDecide");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedDecide) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedDecide");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedDecide, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedDecide::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedCancel) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedCancel");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedCancel) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedCancel");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedCancel, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedCancel::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputTurnRate) == 0x000004, "Wrong alignment on WB_PairAlertConfirm_C_OnInputTurnRate");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputTurnRate) == 0x000008, "Wrong size on WB_PairAlertConfirm_C_OnInputTurnRate");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputTurnRate, Value) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputTurnRate::Value' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputTurnRate, ReturnValue) == 0x000004, "Member 'WB_PairAlertConfirm_C_OnInputTurnRate::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedTouch) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedTouch");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedTouch) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedTouch");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedTouch, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedTouch::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedTouch) == 0x000004, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedTouch");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedTouch) == 0x00000C, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedTouch");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedTouch, LocationX) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedTouch::LocationX' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedTouch, LocationY) == 0x000004, "Member 'WB_PairAlertConfirm_C_OnInputPressedTouch::LocationY' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedTouch, ReturnValue) == 0x000008, "Member 'WB_PairAlertConfirm_C_OnInputPressedTouch::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputMoveRight) == 0x000004, "Wrong alignment on WB_PairAlertConfirm_C_OnInputMoveRight");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputMoveRight) == 0x000008, "Wrong size on WB_PairAlertConfirm_C_OnInputMoveRight");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputMoveRight, Value) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputMoveRight::Value' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputMoveRight, ReturnValue) == 0x000004, "Member 'WB_PairAlertConfirm_C_OnInputMoveRight::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputMoveForward) == 0x000004, "Wrong alignment on WB_PairAlertConfirm_C_OnInputMoveForward");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputMoveForward) == 0x000008, "Wrong size on WB_PairAlertConfirm_C_OnInputMoveForward");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputMoveForward, Value) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputMoveForward::Value' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputMoveForward, ReturnValue) == 0x000004, "Member 'WB_PairAlertConfirm_C_OnInputMoveForward::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputLookupRate) == 0x000004, "Wrong alignment on WB_PairAlertConfirm_C_OnInputLookupRate");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputLookupRate) == 0x000008, "Wrong size on WB_PairAlertConfirm_C_OnInputLookupRate");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputLookupRate, Value) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputLookupRate::Value' has a wrong offset!");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputLookupRate, ReturnValue) == 0x000004, "Member 'WB_PairAlertConfirm_C_OnInputLookupRate::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_IsModeless) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_IsModeless");
static_assert(sizeof(WB_PairAlertConfirm_C_IsModeless) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_IsModeless");
static_assert(offsetof(WB_PairAlertConfirm_C_IsModeless, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_IsModeless::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedR2) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedR2");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedR2) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedR2");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedR2, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedR2::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedR1) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedR1");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedR1) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedR1");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedR1, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedR1::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedL2) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedL2");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedL2) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedL2");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedL2, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedL2::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedL1) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedL1");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedL1) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedL1");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedL1, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedL1::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedR2) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedR2");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedR2) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedR2");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedR2, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedR2::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedR1) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedR1");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedR1) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedR1");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedR1, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedR1::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedL2) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedL2");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedL2) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedL2");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedL2, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedL2::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedL1) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedL1");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedL1) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedL1");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedL1, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedL1::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputReleasedL3) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputReleasedL3");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputReleasedL3) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputReleasedL3");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputReleasedL3, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputReleasedL3::ReturnValue' has a wrong offset!");

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PairAlertConfirm_C_OnInputPressedL3) == 0x000001, "Wrong alignment on WB_PairAlertConfirm_C_OnInputPressedL3");
static_assert(sizeof(WB_PairAlertConfirm_C_OnInputPressedL3) == 0x000001, "Wrong size on WB_PairAlertConfirm_C_OnInputPressedL3");
static_assert(offsetof(WB_PairAlertConfirm_C_OnInputPressedL3, ReturnValue) == 0x000000, "Member 'WB_PairAlertConfirm_C_OnInputPressedL3::ReturnValue' has a wrong offset!");

}

