#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PlayerWatching

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_PlayerWatching.WB_PlayerWatching_C.ExecuteUbergraph_WB_PlayerWatching
// 0x02F0 (0x02F0 - 0x0000)
struct WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAutoPlayTestMode_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAJBConfirmResult Result)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EAJBConfirmResult                             K2Node_CustomEvent_Result1;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_PpBuyWindow_C*                      CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfo_Out;             // 0x00D8(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfo_ReturnValue;     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess1;   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_WinEffect_C*                        CallFunc_FindAJBViewportWidgetOfClass_OutWidget1;  // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBConfirmResult                             CallFunc_GetButtonResult_Result;                   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTimer_bTimeZero;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;     // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess2;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_PpBuyWindow_C*                      CallFunc_FindAJBViewportWidgetOfClass_OutWidget2;  // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess4;             // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess5;             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTimer_bTimeZero1;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateTimer_bTimeZero2;                   // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess6;             // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PairAlertConfirm_C*                 CallFunc_Create_ReturnValue1;                      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue2;                      // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0230(0x0018)()
	TDelegate<void(EAJBConfirmResult Result)>     K2Node_CreateDelegate_OutputDelegate3;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsMyPairCharacterActive_bActive;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBConfirmResult                             K2Node_CustomEvent_Result;                         // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x025F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess7;             // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_293[0x5];                                      // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue5;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult1;                  // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess8;             // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsShopCompetition_ReturnValue;    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue3;                      // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02E0(0x0008)(NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult2;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult3;                  // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching) == 0x000008, "Wrong alignment on WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching");
static_assert(sizeof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching) == 0x0002F0, "Wrong size on WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, EntryPoint) == 0x000000, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAutoPlayTestMode_ReturnValue) == 0x000004, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAutoPlayTestMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000010, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_ComponentBoundEvent_TargetButton) == 0x000018, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CustomEvent_Result1) == 0x000030, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, Temp_bool_Has_Been_Initd_Variable) == 0x000032, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_Event_MyGeometry) == 0x000034, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000070, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000078, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000080, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CreateDelegate_OutputDelegate1) == 0x000088, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum1_CmpSuccess) == 0x000098, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum2_CmpSuccess) == 0x000099, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Create_ReturnValue) == 0x0000A0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x0000A8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x0000B0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x0000B8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x0000C0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x0000C8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue1) == 0x0000D1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_TryGetMatchingPlayerInfo_Out) == 0x0000D8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_TryGetMatchingPlayerInfo_Out' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_TryGetMatchingPlayerInfo_ReturnValue) == 0x000160, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_TryGetMatchingPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x000180, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x000188, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_bSuccess1) == 0x000190, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_OutWidget1) == 0x000198, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum3_CmpSuccess) == 0x0001A0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_bSuccess) == 0x0001A1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0001A8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x0001B0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x0001B8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FCeil_ReturnValue) == 0x0001C0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Add_IntInt_ReturnValue) == 0x0001C4, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, Temp_bool_IsClosed_Variable) == 0x0001C8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue2) == 0x0001C9, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetButtonResult_Result) == 0x0001CA, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetButtonResult_Result' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum4_CmpSuccess) == 0x0001CB, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001CC, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_UpdateTimer_bTimeZero) == 0x0001CD, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_UpdateTimer_bTimeZero' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CreateDelegate_OutputDelegate2) == 0x0001D0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_bSuccess2) == 0x0001E0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_FindAJBViewportWidgetOfClass_OutWidget2) == 0x0001E8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_FindAJBViewportWidgetOfClass_OutWidget2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue1) == 0x0001F0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue2) == 0x0001F1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess4) == 0x0001F2, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4) == 0x0001F8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue3) == 0x000200, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue3) == 0x000201, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue4) == 0x000202, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchInteger1_CmpSuccess) == 0x000203, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess5) == 0x000204, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess5' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5) == 0x000208, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_UpdateTimer_bTimeZero1) == 0x000210, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_UpdateTimer_bTimeZero1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Not_PreBool_ReturnValue) == 0x000211, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_UpdateTimer_bTimeZero2) == 0x000212, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_UpdateTimer_bTimeZero2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Not_PreBool_ReturnValue1) == 0x000213, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess6) == 0x000214, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess6' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6) == 0x000218, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Create_ReturnValue1) == 0x000220, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Create_ReturnValue2) == 0x000228, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralText_ReturnValue) == 0x000230, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CreateDelegate_OutputDelegate3) == 0x000248, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsMyPairCharacterActive_bActive) == 0x000258, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsMyPairCharacterActive_bActive' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CustomEvent_Result) == 0x000259, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum5_CmpSuccess) == 0x00025A, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue5) == 0x00025B, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue6) == 0x00025C, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue7) == 0x00025D, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue4) == 0x00025E, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_SwitchEnum6_CmpSuccess) == 0x00025F, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000260, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000268, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000270, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess7) == 0x000271, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess7' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7) == 0x000278, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000280, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000288, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsFreePlay_ReturnValue) == 0x000290, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsFreePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000291, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_PlayModeEquals_bResult) == 0x000292, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CustomEvent_TargetWidget) == 0x000298, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_MakeLiteralByte_ReturnValue5) == 0x0002A0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_MakeLiteralByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Not_PreBool_ReturnValue2) == 0x0002A1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_PlayModeEquals_bResult1) == 0x0002A2, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_PlayModeEquals_bResult1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_bSuccess8) == 0x0002A3, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_bSuccess8' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8) == 0x0002A8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Not_PreBool_ReturnValue3) == 0x0002B0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_PlayModeIsShopCompetition_ReturnValue) == 0x0002B1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_PlayModeIsShopCompetition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_Create_ReturnValue3) == 0x0002B8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_BooleanOR_ReturnValue) == 0x0002C0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_BooleanOR_ReturnValue1) == 0x0002C1, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, K2Node_CreateDelegate_OutputDelegate4) == 0x0002C8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue8) == 0x0002D8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002E0, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_PlayModeEquals_bResult2) == 0x0002E8, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_PlayModeEquals_bResult2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_PlayModeEquals_bResult3) == 0x0002E9, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_PlayModeEquals_bResult3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_BooleanOR_ReturnValue2) == 0x0002EA, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_BooleanOR_ReturnValue3) == 0x0002EB, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsShipping_ReturnValue) == 0x0002EC, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching, CallFunc_IsValid_ReturnValue9) == 0x0002ED, "Member 'WB_PlayerWatching_C_ExecuteUbergraph_WB_PlayerWatching::CallFunc_IsValid_ReturnValue9' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.OnClosedPPCheckConfim
// 0x0008 (0x0008 - 0x0000)
struct WB_PlayerWatching_C_OnClosedPPCheckConfim final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_OnClosedPPCheckConfim) == 0x000008, "Wrong alignment on WB_PlayerWatching_C_OnClosedPPCheckConfim");
static_assert(sizeof(WB_PlayerWatching_C_OnClosedPPCheckConfim) == 0x000008, "Wrong size on WB_PlayerWatching_C_OnClosedPPCheckConfim");
static_assert(offsetof(WB_PlayerWatching_C_OnClosedPPCheckConfim, TargetWidget) == 0x000000, "Member 'WB_PlayerWatching_C_OnClosedPPCheckConfim::TargetWidget' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.OnFinishedConfirmPair
// 0x0001 (0x0001 - 0x0000)
struct WB_PlayerWatching_C_OnFinishedConfirmPair final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_OnFinishedConfirmPair) == 0x000001, "Wrong alignment on WB_PlayerWatching_C_OnFinishedConfirmPair");
static_assert(sizeof(WB_PlayerWatching_C_OnFinishedConfirmPair) == 0x000001, "Wrong size on WB_PlayerWatching_C_OnFinishedConfirmPair");
static_assert(offsetof(WB_PlayerWatching_C_OnFinishedConfirmPair, Result) == 0x000000, "Member 'WB_PlayerWatching_C_OnFinishedConfirmPair::Result' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_PlayerWatching_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_Tick) == 0x000004, "Wrong alignment on WB_PlayerWatching_C_Tick");
static_assert(sizeof(WB_PlayerWatching_C_Tick) == 0x00003C, "Wrong size on WB_PlayerWatching_C_Tick");
static_assert(offsetof(WB_PlayerWatching_C_Tick, MyGeometry) == 0x000000, "Member 'WB_PlayerWatching_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_PlayerWatching_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.OnFinishedConfirm
// 0x0001 (0x0001 - 0x0000)
struct WB_PlayerWatching_C_OnFinishedConfirm final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_OnFinishedConfirm) == 0x000001, "Wrong alignment on WB_PlayerWatching_C_OnFinishedConfirm");
static_assert(sizeof(WB_PlayerWatching_C_OnFinishedConfirm) == 0x000001, "Wrong size on WB_PlayerWatching_C_OnFinishedConfirm");
static_assert(offsetof(WB_PlayerWatching_C_OnFinishedConfirm, Result) == 0x000000, "Member 'WB_PlayerWatching_C_OnFinishedConfirm::Result' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_PlayerWatching_C_BndEvt__WatchingEndButton_K2Node_ComponentBoundEvent_30_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.UpdateTimer
// 0x0028 (0x0028 - 0x0000)
struct WB_PlayerWatching_C_UpdateTimer final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTime;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTimeZero;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PlayerWatching_C_UpdateTimer) == 0x000008, "Wrong alignment on WB_PlayerWatching_C_UpdateTimer");
static_assert(sizeof(WB_PlayerWatching_C_UpdateTimer) == 0x000028, "Wrong size on WB_PlayerWatching_C_UpdateTimer");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, DeltaTime) == 0x000000, "Member 'WB_PlayerWatching_C_UpdateTimer::DeltaTime' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, MaxTime) == 0x000004, "Member 'WB_PlayerWatching_C_UpdateTimer::MaxTime' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, bTimeZero) == 0x000008, "Member 'WB_PlayerWatching_C_UpdateTimer::bTimeZero' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000009, "Member 'WB_PlayerWatching_C_UpdateTimer::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000010, "Member 'WB_PlayerWatching_C_UpdateTimer::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'WB_PlayerWatching_C_UpdateTimer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'WB_PlayerWatching_C_UpdateTimer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PlayerWatching_C_UpdateTimer, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'WB_PlayerWatching_C_UpdateTimer::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function WB_PlayerWatching.WB_PlayerWatching_C.IsFreePP
// 0x0018 (0x0018 - 0x0000)
struct WB_PlayerWatching_C_IsFreePP final
{
public:
	bool                                          bFree;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
