#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PvE_ScoreWindow_Detail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AJB_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_PvE_ScoreWindow_Detail.WB_PvE_ScoreWindow_Detail_C
// 0x0020 (0x0228 - 0x0208)
class UWB_PvE_ScoreWindow_Detail_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          Detail_Num;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Detail_Title;                                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Sign;                                              // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_PvE_ScoreWindow_Detail(int32 EntryPoint);
	void SetupDisplay(const class FText& InText, EAJBLimitedBounusSign Sign_0, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_PvE_ScoreWindow_Detail_C">();
	}
	static class UWB_PvE_ScoreWindow_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PvE_ScoreWindow_Detail_C>();
	}
};
static_assert(alignof(UWB_PvE_ScoreWindow_Detail_C) == 0x000008, "Wrong alignment on UWB_PvE_ScoreWindow_Detail_C");
static_assert(sizeof(UWB_PvE_ScoreWindow_Detail_C) == 0x000228, "Wrong size on UWB_PvE_ScoreWindow_Detail_C");
static_assert(offsetof(UWB_PvE_ScoreWindow_Detail_C, UberGraphFrame) == 0x000208, "Member 'UWB_PvE_ScoreWindow_Detail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_PvE_ScoreWindow_Detail_C, Detail_Num) == 0x000210, "Member 'UWB_PvE_ScoreWindow_Detail_C::Detail_Num' has a wrong offset!");
static_assert(offsetof(UWB_PvE_ScoreWindow_Detail_C, Detail_Title) == 0x000218, "Member 'UWB_PvE_ScoreWindow_Detail_C::Detail_Title' has a wrong offset!");
static_assert(offsetof(UWB_PvE_ScoreWindow_Detail_C, Sign) == 0x000220, "Member 'UWB_PvE_ScoreWindow_Detail_C::Sign' has a wrong offset!");

}

