#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Passive_InvincibleGEXRequiem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Passive_InvincibleGEXRequiem.WB_Passive_InvincibleGEXRequiem_C.ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem
// 0x00A0 (0x00A0 - 0x0000)
struct WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess1;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SkillPartsTimer_C*                  CallFunc_RegisterSkillTimer_ReturValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBPassiveSkillBase_C*              CallFunc_GetPassiveSkill_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBPassiveSkillBase_C*              CallFunc_GetPassiveSkill_ReturnValue1;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInvincibleGEXRequiem_C*          K2Node_DynamicCast_AsBP_AJBInvincible_GEXRequiem;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime1;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem) == 0x000008, "Wrong alignment on WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem");
static_assert(sizeof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem) == 0x0000A0, "Wrong size on WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, EntryPoint) == 0x000000, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x000004, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x000008, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_FindAJBViewportWidgetOfClass_bSuccess1) == 0x000010, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_FindAJBViewportWidgetOfClass_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_FindAJBViewportWidgetOfClass_OutWidget1) == 0x000018, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_FindAJBViewportWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_RegisterSkillTimer_ReturValue) == 0x000020, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_RegisterSkillTimer_ReturValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_GetPassiveSkill_ReturnValue) == 0x000028, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_GetPassiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_GetPassiveSkill_ReturnValue1) == 0x000030, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_GetPassiveSkill_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, K2Node_DynamicCast_AsBP_AJBInvincible_GEXRequiem) == 0x000038, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::K2Node_DynamicCast_AsBP_AJBInvincible_GEXRequiem' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000041, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000043, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_GetAJBGameInstance_bSuccess) == 0x000044, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000048, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_IsPlayingReplay_ReturnValue) == 0x000054, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, K2Node_Event_MyGeometry) == 0x000058, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, K2Node_Event_InDeltaTime1) == 0x000090, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::K2Node_Event_InDeltaTime1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_IsValid_ReturnValue1) == 0x000095, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_Not_PreBool_ReturnValue1) == 0x000096, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_IsVisible_ReturnValue) == 0x000097, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_Not_PreBool_ReturnValue2) == 0x000098, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem, CallFunc_BooleanOR_ReturnValue) == 0x000099, "Member 'WB_Passive_InvincibleGEXRequiem_C_ExecuteUbergraph_WB_Passive_InvincibleGEXRequiem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_Passive_InvincibleGEXRequiem.WB_Passive_InvincibleGEXRequiem_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Passive_InvincibleGEXRequiem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Passive_InvincibleGEXRequiem_C_Tick) == 0x000004, "Wrong alignment on WB_Passive_InvincibleGEXRequiem_C_Tick");
static_assert(sizeof(WB_Passive_InvincibleGEXRequiem_C_Tick) == 0x00003C, "Wrong size on WB_Passive_InvincibleGEXRequiem_C_Tick");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Passive_InvincibleGEXRequiem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Passive_InvincibleGEXRequiem_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Passive_InvincibleGEXRequiem.WB_Passive_InvincibleGEXRequiem_C.OnOutsideComponentUpdate
// 0x0004 (0x0004 - 0x0000)
struct WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate) == 0x000004, "Wrong alignment on WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate");
static_assert(sizeof(WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate) == 0x000004, "Wrong size on WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate");
static_assert(offsetof(WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate, InDeltaTime) == 0x000000, "Member 'WB_Passive_InvincibleGEXRequiem_C_OnOutsideComponentUpdate::InDeltaTime' has a wrong offset!");

}

