#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChatButton

#include "Basic.hpp"

#include "ST_RadioChatInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_RadioChatButton.WB_RadioChatButton_C.ExecuteUbergraph_WB_RadioChatButton
// 0x0080 (0x0080 - 0x0000)
struct WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RadioChatInfo                      K2Node_CustomEvent_ChatInfo;                       // 0x0008(0x0028)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressableButton_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton) == 0x000008, "Wrong alignment on WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton");
static_assert(sizeof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton) == 0x000080, "Wrong size on WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, EntryPoint) == 0x000000, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, K2Node_CustomEvent_ChatInfo) == 0x000008, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::K2Node_CustomEvent_ChatInfo' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, K2Node_Event_MyGeometry) == 0x000034, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, CallFunc_IsPressableButton_ReturnValue) == 0x000070, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::CallFunc_IsPressableButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, CallFunc_MakeVector2D_ReturnValue) == 0x000074, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00007C, "Member 'WB_RadioChatButton_C_ExecuteUbergraph_WB_RadioChatButton::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function WB_RadioChatButton.WB_RadioChatButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_RadioChatButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChatButton_C_Tick) == 0x000004, "Wrong alignment on WB_RadioChatButton_C_Tick");
static_assert(sizeof(WB_RadioChatButton_C_Tick) == 0x00003C, "Wrong size on WB_RadioChatButton_C_Tick");
static_assert(offsetof(WB_RadioChatButton_C_Tick, MyGeometry) == 0x000000, "Member 'WB_RadioChatButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_RadioChatButton_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_RadioChatButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_RadioChatButton.WB_RadioChatButton_C.SetupChatInfo
// 0x0028 (0x0028 - 0x0000)
struct WB_RadioChatButton_C_SetupChatInfo final
{
public:
	struct FST_RadioChatInfo                      ChatInfo_0;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WB_RadioChatButton_C_SetupChatInfo) == 0x000008, "Wrong alignment on WB_RadioChatButton_C_SetupChatInfo");
static_assert(sizeof(WB_RadioChatButton_C_SetupChatInfo) == 0x000028, "Wrong size on WB_RadioChatButton_C_SetupChatInfo");
static_assert(offsetof(WB_RadioChatButton_C_SetupChatInfo, ChatInfo_0) == 0x000000, "Member 'WB_RadioChatButton_C_SetupChatInfo::ChatInfo_0' has a wrong offset!");

}

