#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Rarity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Rarity.WB_Rarity_C
// 0x0038 (0x0240 - 0x0208)
class UWB_Rarity_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWB_EmptyStar_C*                        WB_Rare_1;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_2;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_3;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_4;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_EmptyStar_C*>                RareWidgets;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_Rarity(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateRera(int32 Rare);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Rarity_C">();
	}
	static class UWB_Rarity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Rarity_C>();
	}
};
static_assert(alignof(UWB_Rarity_C) == 0x000008, "Wrong alignment on UWB_Rarity_C");
static_assert(sizeof(UWB_Rarity_C) == 0x000240, "Wrong size on UWB_Rarity_C");
static_assert(offsetof(UWB_Rarity_C, UberGraphFrame) == 0x000208, "Member 'UWB_Rarity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Rarity_C, WB_Rare_1) == 0x000210, "Member 'UWB_Rarity_C::WB_Rare_1' has a wrong offset!");
static_assert(offsetof(UWB_Rarity_C, WB_Rare_2) == 0x000218, "Member 'UWB_Rarity_C::WB_Rare_2' has a wrong offset!");
static_assert(offsetof(UWB_Rarity_C, WB_Rare_3) == 0x000220, "Member 'UWB_Rarity_C::WB_Rare_3' has a wrong offset!");
static_assert(offsetof(UWB_Rarity_C, WB_Rare_4) == 0x000228, "Member 'UWB_Rarity_C::WB_Rare_4' has a wrong offset!");
static_assert(offsetof(UWB_Rarity_C, RareWidgets) == 0x000230, "Member 'UWB_Rarity_C::RareWidgets' has a wrong offset!");

}

