#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_AssaultDive

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Skill_AssaultDive.WB_Skill_AssaultDive_C.ExecuteUbergraph_WB_Skill_AssaultDive
// 0x02C8 (0x02C8 - 0x0000)
struct WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess2;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance2;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue2;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess3;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance3;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue3;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue2;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter2;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess4;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance4;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue4;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue3;        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter3;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess4;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue4;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter4;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess5;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance5;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess6;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance6;    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue5;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue6;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0114(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAssaultDiveSkill_C*              K2Node_DynamicCast_AsBP_AJBAssault_Dive_Skill;     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess1;   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget1;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess5;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue5;        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter5;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess2;   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_InGameMain_C*                       CallFunc_FindAJBViewportWidgetOfClass_OutWidget2;  // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SkillPartsTimer_C*                  CallFunc_RegisterSkillTimer_ReturValue;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess6;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHighlightPlayBegin_ReturnValue6;        // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    CallFunc_Get_UI_TargetCharacter_TargetCharacter6;  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue1;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue2;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess7;             // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess8;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue3;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue4;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBSkillGuideInfo                     K2Node_CustomEvent_AdditionalGuide;                // 0x0238(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBSkillGuideInfo                     CallFunc_GetGuideInfo_FinalyGuideInfo;             // 0x0268(0x0028)()
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess9;             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD9;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue5;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue5;     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess10;            // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD10;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue6;           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue6;     // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive) == 0x000008, "Wrong alignment on WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive");
static_assert(sizeof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive) == 0x0002C8, "Wrong size on WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, EntryPoint) == 0x000000, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess) == 0x000004, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000008, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue) == 0x000010, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess1) == 0x000012, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000018, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue1) == 0x000020, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000021, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000028, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue1) == 0x000030, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue) == 0x000031, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter) == 0x000038, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000040, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000048, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess2) == 0x000050, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance2) == 0x000058, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue1) == 0x000060, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue2) == 0x000061, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue2) == 0x000062, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter1) == 0x000068, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess3) == 0x000070, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance3) == 0x000078, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x000080, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x000088, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue3) == 0x000090, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue2) == 0x000091, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue3) == 0x000092, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter2) == 0x000098, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess4) == 0x0000A0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance4) == 0x0000A8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue4) == 0x0000B0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x0000B1, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x0000B8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue4) == 0x0000C0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue3) == 0x0000C1, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter3) == 0x0000C8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess4) == 0x0000D0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4) == 0x0000D8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue4) == 0x0000E0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter4) == 0x0000E8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess5) == 0x0000F0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance5) == 0x0000F8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_bSuccess6) == 0x000100, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_bSuccess6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBGameInstance_AJB_Game_Instance6) == 0x000108, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBGameInstance_AJB_Game_Instance6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue5) == 0x000110, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsPlayingReplay_ReturnValue6) == 0x000111, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsPlayingReplay_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue5) == 0x000112, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Not_PreBool_ReturnValue6) == 0x000113, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_Event_MyGeometry) == 0x000114, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_Event_InDeltaTime) == 0x00014C, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_DynamicCast_AsBP_AJBAssault_Dive_Skill) == 0x000150, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_DynamicCast_AsBP_AJBAssault_Dive_Skill' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00015C, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetValidValue_ReturnValue) == 0x000160, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess) == 0x000161, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget) == 0x000168, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_SwitchEnum_CmpSuccess) == 0x000170, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess1) == 0x000171, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget1) == 0x000178, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess5) == 0x000180, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5) == 0x000188, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue5) == 0x000190, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter5) == 0x000198, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_bSuccess2) == 0x0001A0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_FindAJBViewportWidgetOfClass_OutWidget2) == 0x0001A8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_FindAJBViewportWidgetOfClass_OutWidget2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_RegisterSkillTimer_ReturValue) == 0x0001B0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_RegisterSkillTimer_ReturValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0001B8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess6) == 0x0001C0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6) == 0x0001C8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsHighlightPlayBegin_ReturnValue6) == 0x0001D1, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsHighlightPlayBegin_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_Get_UI_TargetCharacter_TargetCharacter6) == 0x0001D8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_Get_UI_TargetCharacter_TargetCharacter6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001E0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue1) == 0x0001E8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue1) == 0x0001F0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue2) == 0x0001F8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue2) == 0x000200, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000201, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000202, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess7) == 0x000203, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess7' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7) == 0x000208, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD7' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess8) == 0x000210, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess8' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8) == 0x000218, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD8' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue3) == 0x000220, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue4) == 0x000228, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue3) == 0x000230, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue4) == 0x000231, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000232, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x000233, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, K2Node_CustomEvent_AdditionalGuide) == 0x000238, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::K2Node_CustomEvent_AdditionalGuide' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue5) == 0x000260, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetGuideInfo_FinalyGuideInfo) == 0x000268, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetGuideInfo_FinalyGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess9) == 0x000290, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess9' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD9) == 0x000298, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD9' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue5) == 0x0002A0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue6) == 0x0002A8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue5) == 0x0002A9, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_bSuccess10) == 0x0002AA, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_bSuccess10' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD10) == 0x0002B0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD10' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_GetOwnerCharacter_ReturnValue6) == 0x0002B8, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_GetOwnerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_IsValid_ReturnValue7) == 0x0002C0, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive, CallFunc_EqualEqual_ObjectObject_ReturnValue6) == 0x0002C1, "Member 'WB_Skill_AssaultDive_C_ExecuteUbergraph_WB_Skill_AssaultDive::CallFunc_EqualEqual_ObjectObject_ReturnValue6' has a wrong offset!");

// Function WB_Skill_AssaultDive.WB_Skill_AssaultDive_C.ShowAdditionalAssaultDiveGuide
// 0x0028 (0x0028 - 0x0000)
struct WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide final
{
public:
	struct FAJBSkillGuideInfo                     AdditionalGuide;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide) == 0x000008, "Wrong alignment on WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide");
static_assert(sizeof(WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide) == 0x000028, "Wrong size on WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide");
static_assert(offsetof(WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide, AdditionalGuide) == 0x000000, "Member 'WB_Skill_AssaultDive_C_ShowAdditionalAssaultDiveGuide::AdditionalGuide' has a wrong offset!");

// Function WB_Skill_AssaultDive.WB_Skill_AssaultDive_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Skill_AssaultDive_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_AssaultDive_C_Tick) == 0x000004, "Wrong alignment on WB_Skill_AssaultDive_C_Tick");
static_assert(sizeof(WB_Skill_AssaultDive_C_Tick) == 0x00003C, "Wrong size on WB_Skill_AssaultDive_C_Tick");
static_assert(offsetof(WB_Skill_AssaultDive_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Skill_AssaultDive_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Skill_AssaultDive_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Skill_AssaultDive.WB_Skill_AssaultDive_C.GetSXPCharacter
// 0x0028 (0x0028 - 0x0000)
struct WB_Skill_AssaultDive_C_GetSXPCharacter final
{
public:
	class ABP_AJBInGameMovableStand_SXP_C*        SXP;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameMovableStand*                 CallFunc_GetOwnerMovableStand_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameMovableStand_SXP_C*        K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand_SXP; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_AssaultDive_C_GetSXPCharacter) == 0x000008, "Wrong alignment on WB_Skill_AssaultDive_C_GetSXPCharacter");
static_assert(sizeof(WB_Skill_AssaultDive_C_GetSXPCharacter) == 0x000028, "Wrong size on WB_Skill_AssaultDive_C_GetSXPCharacter");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetSXPCharacter, SXP) == 0x000000, "Member 'WB_Skill_AssaultDive_C_GetSXPCharacter::SXP' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetSXPCharacter, bSuccess) == 0x000008, "Member 'WB_Skill_AssaultDive_C_GetSXPCharacter::bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetSXPCharacter, CallFunc_GetOwnerMovableStand_ReturnValue) == 0x000010, "Member 'WB_Skill_AssaultDive_C_GetSXPCharacter::CallFunc_GetOwnerMovableStand_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetSXPCharacter, K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand_SXP) == 0x000018, "Member 'WB_Skill_AssaultDive_C_GetSXPCharacter::K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand_SXP' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetSXPCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_Skill_AssaultDive_C_GetSXPCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WB_Skill_AssaultDive.WB_Skill_AssaultDive_C.GetGuideInfo
// 0x00B8 (0x00B8 - 0x0000)
struct WB_Skill_AssaultDive_C_GetGuideInfo final
{
public:
	struct FAJBSkillGuideInfo                     AdditionalGuideInfo;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAJBSkillGuideInfo                     FinalyGuideInfo;                                   // 0x0028(0x0028)(Parm, OutParm)
	struct FAJBSkillGuideInfo                     TempGuideInfo;                                     // 0x0050(0x0028)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBSkillGuidePairInfo                 CallFunc_Array_Get_Item;                           // 0x0088(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_AssaultDive_C_GetGuideInfo) == 0x000008, "Wrong alignment on WB_Skill_AssaultDive_C_GetGuideInfo");
static_assert(sizeof(WB_Skill_AssaultDive_C_GetGuideInfo) == 0x0000B8, "Wrong size on WB_Skill_AssaultDive_C_GetGuideInfo");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetGuideInfo, AdditionalGuideInfo) == 0x000000, "Member 'WB_Skill_AssaultDive_C_GetGuideInfo::AdditionalGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetGuideInfo, FinalyGuideInfo) == 0x000028, "Member 'WB_Skill_AssaultDive_C_GetGuideInfo::FinalyGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_AssaultDive_C_GetGuideInfo, TempGuideInfo) == 0x000050, "Member 'WB_Skill_AssaultDive_C_GetGuideInfo::TempGuideInfo' has a wrong offset!");
