#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StoreCloseMessege

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_StoreCloseMessege.WB_StoreCloseMessege_C.ExecuteUbergraph_WB_StoreCloseMessege
// 0x0040 (0x0040 - 0x0000)
struct WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege) == 0x000004, "Wrong alignment on WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege");
static_assert(sizeof(WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege) == 0x000040, "Wrong size on WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege");
static_assert(offsetof(WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege, EntryPoint) == 0x000000, "Member 'WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_StoreCloseMessege_C_ExecuteUbergraph_WB_StoreCloseMessege::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_StoreCloseMessege.WB_StoreCloseMessege_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_StoreCloseMessege_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_StoreCloseMessege_C_Tick) == 0x000004, "Wrong alignment on WB_StoreCloseMessege_C_Tick");
static_assert(sizeof(WB_StoreCloseMessege_C_Tick) == 0x00003C, "Wrong size on WB_StoreCloseMessege_C_Tick");
static_assert(offsetof(WB_StoreCloseMessege_C_Tick, MyGeometry) == 0x000000, "Member 'WB_StoreCloseMessege_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_StoreCloseMessege_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_StoreCloseMessege_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_StoreCloseMessege.WB_StoreCloseMessege_C.UpdateDisplay
// 0x0558 (0x0558 - 0x0000)
struct WB_StoreCloseMessege_C_UpdateDisplay final
{
public:
	class FText                                   MessageMode;                                       // 0x0000(0x0018)(Edit, BlueprintVisible)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCacheInteger_OutValue1;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue3;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue2;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCacheInteger_OutValue3;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue3;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0178(0x0040)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue5;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue4;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue5;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue4;                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue4;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCacheInteger_OutValue5;                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue5;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x01D8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0218(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue6;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0238(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0278(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue6;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue6;                // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue6;             // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x02A0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x02C0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData8;             // 0x0300(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0340(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0350(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0360(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0378(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData9;             // 0x0390(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData10;            // 0x03D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0410(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData11;            // 0x0420(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0460(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData12;            // 0x0478(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x04C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x04D0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x04E8(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0500(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0518(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue7;             // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue7;              // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue7;                // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue7;             // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x053D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53E[0x2];                                      // 0x053E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0540(0x0018)()
};
static_assert(alignof(WB_StoreCloseMessege_C_UpdateDisplay) == 0x000008, "Wrong alignment on WB_StoreCloseMessege_C_UpdateDisplay");
static_assert(sizeof(WB_StoreCloseMessege_C_UpdateDisplay) == 0x000558, "Wrong size on WB_StoreCloseMessege_C_UpdateDisplay");
static_assert(offsetof(WB_StoreCloseMessege_C_UpdateDisplay, MessageMode) == 0x000000, "Member 'WB_StoreCloseMessege_C_UpdateDisplay::MessageMode' has a wrong offset!");
static_assert(offsetof(WB_StoreCloseMessege_C_UpdateDisplay, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WB_StoreCloseMessege_C_UpdateDisplay::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_StoreCloseMessege_C_UpdateDisplay, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000019, "Member 'WB_StoreCloseMessege_C_UpdateDisplay::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
