#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillIcon

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SkillIcon.WB_SkillIcon_C
// 0x00A0 (0x02E8 - 0x0248)
class UWB_SkillIcon_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnLock;                                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnlockUlt;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Ban;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Button;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_CountBG;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Flame;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Flame_MapSkillList;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_FlameFlare1;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_FlameFlare2;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_FlameFlash;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_FlameGlow;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_Lock;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_SkillImage;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              img_UltAura;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Over_Active;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Over_Lock;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_CountNum;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_LockNum;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAJBPadIconType                               PadIcon;                                           // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUltimateSkill;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_SkillIcon(int32 EntryPoint);
	void SetupVisiblePadIcon(bool bVisible);
	void OnChangedPadicon();
	void PreConstruct(bool IsDesignTime);
	void PrePlaySkillUnlockAnimation();
	void SetupUltimateSkill(bool bUltimateSkill_0);
	void SetupVisibleLockMode(int32 LockNum);
	void ResetIconAnimation();
	void PlaySkillUnlockAnimation();
	void SetupAura(bool Condition);
	void SetupInvisibleMode();
	void SetupVisibleSkillLock(bool bVisible);
	void SetupVisibleActiveCount(bool bVisible);
	void RequestSkillIcon(TSoftObjectPtr<class UObject> IconAsset);
	void SetupVisibleInactiveMode();
	void SetupVisibleActiveMode();
	void UpdateActiveSkillCount(int32 Value);
	void OnLoaded_0BA6160B4B14A3AA6AEFB6BC1B7CA943(class UObject* Loaded);
	void ChangeButtonTexture();
	void IsUltimateSkill(bool* bUltimateSkill_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SkillIcon_C">();
	}
	static class UWB_SkillIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillIcon_C>();
	}
};
static_assert(alignof(UWB_SkillIcon_C) == 0x000008, "Wrong alignment on UWB_SkillIcon_C");
static_assert(sizeof(UWB_SkillIcon_C) == 0x0002E8, "Wrong size on UWB_SkillIcon_C");
static_assert(offsetof(UWB_SkillIcon_C, UberGraphFrame) == 0x000248, "Member 'UWB_SkillIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, UnLock) == 0x000250, "Member 'UWB_SkillIcon_C::UnLock' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, UnlockUlt) == 0x000258, "Member 'UWB_SkillIcon_C::UnlockUlt' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_Ban) == 0x000260, "Member 'UWB_SkillIcon_C::Img_Ban' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_Button) == 0x000268, "Member 'UWB_SkillIcon_C::Img_Button' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_CountBG) == 0x000270, "Member 'UWB_SkillIcon_C::Img_CountBG' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_Flame) == 0x000278, "Member 'UWB_SkillIcon_C::Img_Flame' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_Flame_MapSkillList) == 0x000280, "Member 'UWB_SkillIcon_C::Img_Flame_MapSkillList' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_FlameFlare1) == 0x000288, "Member 'UWB_SkillIcon_C::Img_FlameFlare1' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_FlameFlare2) == 0x000290, "Member 'UWB_SkillIcon_C::Img_FlameFlare2' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_FlameFlash) == 0x000298, "Member 'UWB_SkillIcon_C::Img_FlameFlash' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_FlameGlow) == 0x0002A0, "Member 'UWB_SkillIcon_C::Img_FlameGlow' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_Lock) == 0x0002A8, "Member 'UWB_SkillIcon_C::Img_Lock' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Img_SkillImage) == 0x0002B0, "Member 'UWB_SkillIcon_C::Img_SkillImage' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, img_UltAura) == 0x0002B8, "Member 'UWB_SkillIcon_C::img_UltAura' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Over_Active) == 0x0002C0, "Member 'UWB_SkillIcon_C::Over_Active' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Over_Lock) == 0x0002C8, "Member 'UWB_SkillIcon_C::Over_Lock' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Txt_CountNum) == 0x0002D0, "Member 'UWB_SkillIcon_C::Txt_CountNum' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, Txt_LockNum) == 0x0002D8, "Member 'UWB_SkillIcon_C::Txt_LockNum' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, PadIcon) == 0x0002E0, "Member 'UWB_SkillIcon_C::PadIcon' has a wrong offset!");
static_assert(offsetof(UWB_SkillIcon_C, bUltimateSkill) == 0x0002E1, "Member 'UWB_SkillIcon_C::bUltimateSkill' has a wrong offset!");

}

