#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StartPointChipAlert

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_StartPointChipAlert.WB_StartPointChipAlert_C
// 0x0028 (0x02E8 - 0x02C0)
class UWB_StartPointChipAlert_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_70;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_51;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           AutoCloseTimer;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WB_StartPointChipAlert(int32 EntryPoint);
	void BndEvt__Appear_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void OnCloseAlert();
	void OnClosingWindow();
	void OnOpeningWindow();
	void ShowChipAlert();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_StartPointChipAlert_C">();
	}
	static class UWB_StartPointChipAlert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_StartPointChipAlert_C>();
	}
};
static_assert(alignof(UWB_StartPointChipAlert_C) == 0x000008, "Wrong alignment on UWB_StartPointChipAlert_C");
static_assert(sizeof(UWB_StartPointChipAlert_C) == 0x0002E8, "Wrong size on UWB_StartPointChipAlert_C");
static_assert(offsetof(UWB_StartPointChipAlert_C, UberGraphFrame) == 0x0002C0, "Member 'UWB_StartPointChipAlert_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_StartPointChipAlert_C, Appear) == 0x0002C8, "Member 'UWB_StartPointChipAlert_C::Appear' has a wrong offset!");
static_assert(offsetof(UWB_StartPointChipAlert_C, AJBImage_70) == 0x0002D0, "Member 'UWB_StartPointChipAlert_C::AJBImage_70' has a wrong offset!");
static_assert(offsetof(UWB_StartPointChipAlert_C, AJBTextBlock_51) == 0x0002D8, "Member 'UWB_StartPointChipAlert_C::AJBTextBlock_51' has a wrong offset!");
static_assert(offsetof(UWB_StartPointChipAlert_C, AutoCloseTimer) == 0x0002E0, "Member 'UWB_StartPointChipAlert_C::AutoCloseTimer' has a wrong offset!");

}

