#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_MD_Dsc

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.ExecuteUbergraph_WB_Skill_MD_Dsc
// 0x0130 (0x0130 - 0x0000)
struct WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableButton_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x006C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x007C(0x001C)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue1;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_CustomEvent_CharaIcon;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Type;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bKeep;                          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x00C4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue1;               // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTargetActor_ViewTargetActor;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x00E8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacterFromActor_CharacterBP;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacterFromActor_bSuccess;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0104(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               CallFunc_GetAJBCharacter_CharacterBP;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBCharacter_bSuccess;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc) == 0x000008, "Wrong alignment on WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc");
static_assert(sizeof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc) == 0x000130, "Wrong size on WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, EntryPoint) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_IsPressableButton_ReturnValue) == 0x000005, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_IsPressableButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_Event_MyGeometry) == 0x000008, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_int_Variable) == 0x000044, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_struct_Variable) == 0x000048, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_IsValid_ReturnValue1) == 0x000058, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_struct_Variable1) == 0x00005C, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_struct_Variable2) == 0x00006C, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_MakeStruct_WidgetTransform) == 0x00007C, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000098, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_SlotAsCanvasSlot_ReturnValue1) == 0x0000A0, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_SlotAsCanvasSlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_CustomEvent_CharaIcon) == 0x0000A8, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_CustomEvent_CharaIcon' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_CustomEvent_Type) == 0x0000B0, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_CustomEvent_bKeep) == 0x0000B4, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_CustomEvent_bKeep' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetVisibility_ReturnValue) == 0x0000C0, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_struct_Variable3) == 0x0000C4, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D4, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetVisibility_ReturnValue1) == 0x0000D5, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetVisibility_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_CustomEvent_bEnable) == 0x0000D6, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000D7, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000D8, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetViewTargetActor_ViewTargetActor) == 0x0000E0, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetViewTargetActor_ViewTargetActor' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, Temp_struct_Variable4) == 0x0000E8, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetAJBCharacterFromActor_CharacterBP) == 0x0000F8, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetAJBCharacterFromActor_CharacterBP' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetAJBCharacterFromActor_bSuccess) == 0x000100, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetAJBCharacterFromActor_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, K2Node_Select_Default) == 0x000104, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetPlayerController_ReturnValue) == 0x000118, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetAJBCharacter_CharacterBP) == 0x000120, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetAJBCharacter_CharacterBP' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_GetAJBCharacter_bSuccess) == 0x000128, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_GetAJBCharacter_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000129, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc, CallFunc_Not_PreBool_ReturnValue) == 0x00012A, "Member 'WB_Skill_MD_Dsc_C_ExecuteUbergraph_WB_Skill_MD_Dsc::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.TryToggleEnableKeep
// 0x0001 (0x0001 - 0x0000)
struct WB_Skill_MD_Dsc_C_TryToggleEnableKeep final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_TryToggleEnableKeep) == 0x000001, "Wrong alignment on WB_Skill_MD_Dsc_C_TryToggleEnableKeep");
static_assert(sizeof(WB_Skill_MD_Dsc_C_TryToggleEnableKeep) == 0x000001, "Wrong size on WB_Skill_MD_Dsc_C_TryToggleEnableKeep");
static_assert(offsetof(WB_Skill_MD_Dsc_C_TryToggleEnableKeep, bEnable) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_TryToggleEnableKeep::bEnable' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.UpdateCharaIcon
// 0x0010 (0x0010 - 0x0000)
struct WB_Skill_MD_Dsc_C_UpdateCharaIcon final
{
public:
	class UTexture*                               CharaIcon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKeep_0;                                           // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_UpdateCharaIcon) == 0x000008, "Wrong alignment on WB_Skill_MD_Dsc_C_UpdateCharaIcon");
static_assert(sizeof(WB_Skill_MD_Dsc_C_UpdateCharaIcon) == 0x000010, "Wrong size on WB_Skill_MD_Dsc_C_UpdateCharaIcon");
static_assert(offsetof(WB_Skill_MD_Dsc_C_UpdateCharaIcon, CharaIcon) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_UpdateCharaIcon::CharaIcon' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_UpdateCharaIcon, Type) == 0x000008, "Member 'WB_Skill_MD_Dsc_C_UpdateCharaIcon::Type' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_UpdateCharaIcon, bKeep_0) == 0x00000C, "Member 'WB_Skill_MD_Dsc_C_UpdateCharaIcon::bKeep_0' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Skill_MD_Dsc_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_Tick) == 0x000004, "Wrong alignment on WB_Skill_MD_Dsc_C_Tick");
static_assert(sizeof(WB_Skill_MD_Dsc_C_Tick) == 0x00003C, "Wrong size on WB_Skill_MD_Dsc_C_Tick");
static_assert(offsetof(WB_Skill_MD_Dsc_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Skill_MD_Dsc_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.ToggleEnableKeep
// 0x0038 (0x0038 - 0x0000)
struct WB_Skill_MD_Dsc_C_ToggleEnableKeep final
{
public:
	bool                                          bNotify;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable1;                             // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_ToggleEnableKeep) == 0x000008, "Wrong alignment on WB_Skill_MD_Dsc_C_ToggleEnableKeep");
static_assert(sizeof(WB_Skill_MD_Dsc_C_ToggleEnableKeep) == 0x000038, "Wrong size on WB_Skill_MD_Dsc_C_ToggleEnableKeep");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, bNotify) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::bNotify' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, Temp_struct_Variable) == 0x000008, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, Temp_struct_Variable1) == 0x000010, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, Temp_bool_Variable) == 0x000018, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, K2Node_Select_Default) == 0x000020, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ToggleEnableKeep, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000030, "Member 'WB_Skill_MD_Dsc_C_ToggleEnableKeep::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.ChangeEnable
// 0x0005 (0x0005 - 0x0000)
struct WB_Skill_MD_Dsc_C_ChangeEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_ChangeEnable) == 0x000001, "Wrong alignment on WB_Skill_MD_Dsc_C_ChangeEnable");
static_assert(sizeof(WB_Skill_MD_Dsc_C_ChangeEnable) == 0x000005, "Wrong size on WB_Skill_MD_Dsc_C_ChangeEnable");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ChangeEnable, bEnable) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_ChangeEnable::bEnable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ChangeEnable, Temp_bool_Variable) == 0x000001, "Member 'WB_Skill_MD_Dsc_C_ChangeEnable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ChangeEnable, Temp_byte_Variable) == 0x000002, "Member 'WB_Skill_MD_Dsc_C_ChangeEnable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ChangeEnable, Temp_byte_Variable1) == 0x000003, "Member 'WB_Skill_MD_Dsc_C_ChangeEnable::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ChangeEnable, K2Node_Select_Default) == 0x000004, "Member 'WB_Skill_MD_Dsc_C_ChangeEnable::K2Node_Select_Default' has a wrong offset!");

// Function WB_Skill_MD_Dsc.WB_Skill_MD_Dsc_C.ApplyKeep
// 0x0003 (0x0003 - 0x0000)
struct WB_Skill_MD_Dsc_C_ApplyKeep final
{
public:
	bool                                          bInKeep;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimation;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNotify;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_MD_Dsc_C_ApplyKeep) == 0x000001, "Wrong alignment on WB_Skill_MD_Dsc_C_ApplyKeep");
static_assert(sizeof(WB_Skill_MD_Dsc_C_ApplyKeep) == 0x000003, "Wrong size on WB_Skill_MD_Dsc_C_ApplyKeep");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ApplyKeep, bInKeep) == 0x000000, "Member 'WB_Skill_MD_Dsc_C_ApplyKeep::bInKeep' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ApplyKeep, bAnimation) == 0x000001, "Member 'WB_Skill_MD_Dsc_C_ApplyKeep::bAnimation' has a wrong offset!");
static_assert(offsetof(WB_Skill_MD_Dsc_C_ApplyKeep, bNotify) == 0x000002, "Member 'WB_Skill_MD_Dsc_C_ApplyKeep::bNotify' has a wrong offset!");

}

