#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ScoreBoardTitle

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ScoreBoardTitle.WB_ScoreBoardTitle_C
// 0x0018 (0x0220 - 0x0208)
class UWB_ScoreBoardTitle_C final : public UUserWidget
{
public:
	class UAJBImage*                              AJBImage_0;                                        // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_1;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TotalDamage;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ScoreBoardTitle_C">();
	}
	static class UWB_ScoreBoardTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ScoreBoardTitle_C>();
	}
};
static_assert(alignof(UWB_ScoreBoardTitle_C) == 0x000008, "Wrong alignment on UWB_ScoreBoardTitle_C");
static_assert(sizeof(UWB_ScoreBoardTitle_C) == 0x000220, "Wrong size on UWB_ScoreBoardTitle_C");
static_assert(offsetof(UWB_ScoreBoardTitle_C, AJBImage_0) == 0x000208, "Member 'UWB_ScoreBoardTitle_C::AJBImage_0' has a wrong offset!");
static_assert(offsetof(UWB_ScoreBoardTitle_C, AJBTextBlock_1) == 0x000210, "Member 'UWB_ScoreBoardTitle_C::AJBTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWB_ScoreBoardTitle_C, TotalDamage) == 0x000218, "Member 'UWB_ScoreBoardTitle_C::TotalDamage' has a wrong offset!");

}

