#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_LockOn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Skill_LockOn.WB_Skill_LockOn_C
// 0x0070 (0x0278 - 0x0208)
class UWB_Skill_LockOn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Attack;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreLockOn_Cancel;                                  // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LockOn_Cancel;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SWITCH;                                            // 0x0228(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreLockOn_Start;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LockOn_Start;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Glow;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Bottom;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Left;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Right;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Top;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FTimerHandle>                   HidingAnimFinishedTimerHandler;                    // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, AdvancedDisplay)

public:
	void ExecuteUbergraph_WB_Skill_LockOn(int32 EntryPoint);
	void HideWidget();
	void OnHidingAnimFinished();
	void PlayHidingAnimation(class UWidgetAnimation* InAnimation);
	void PlayShowingAnimation(class UWidgetAnimation* InAnimation);
	void Unbind_AllHidingAnimationCallback();
	void AttackLockedOn();
	void SwitchPreLockOnToLockOn();
	void CancelPreLockOn();
	void CancelLockOn();
	void Construct();
	void PreLockOn();
	void LockOn();
	void GetAllShowingAnimations(TArray<class UWidgetAnimation*>* ShowingAnimations);
	void GetAllHidingAnimations(TArray<class UWidgetAnimation*>* HidingAnimations);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Skill_LockOn_C">();
	}
	static class UWB_Skill_LockOn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Skill_LockOn_C>();
	}
};
static_assert(alignof(UWB_Skill_LockOn_C) == 0x000008, "Wrong alignment on UWB_Skill_LockOn_C");
static_assert(sizeof(UWB_Skill_LockOn_C) == 0x000278, "Wrong size on UWB_Skill_LockOn_C");
static_assert(offsetof(UWB_Skill_LockOn_C, UberGraphFrame) == 0x000208, "Member 'UWB_Skill_LockOn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Attack) == 0x000210, "Member 'UWB_Skill_LockOn_C::Attack' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, PreLockOn_Cancel) == 0x000218, "Member 'UWB_Skill_LockOn_C::PreLockOn_Cancel' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, LockOn_Cancel) == 0x000220, "Member 'UWB_Skill_LockOn_C::LockOn_Cancel' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, SWITCH) == 0x000228, "Member 'UWB_Skill_LockOn_C::SWITCH' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, PreLockOn_Start) == 0x000230, "Member 'UWB_Skill_LockOn_C::PreLockOn_Start' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, LockOn_Start) == 0x000238, "Member 'UWB_Skill_LockOn_C::LockOn_Start' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Effect_Glow) == 0x000240, "Member 'UWB_Skill_LockOn_C::Effect_Glow' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Lock_Bottom) == 0x000248, "Member 'UWB_Skill_LockOn_C::Lock_Bottom' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Lock_Left) == 0x000250, "Member 'UWB_Skill_LockOn_C::Lock_Left' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Lock_Right) == 0x000258, "Member 'UWB_Skill_LockOn_C::Lock_Right' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, Lock_Top) == 0x000260, "Member 'UWB_Skill_LockOn_C::Lock_Top' has a wrong offset!");
static_assert(offsetof(UWB_Skill_LockOn_C, HidingAnimFinishedTimerHandler) == 0x000268, "Member 'UWB_Skill_LockOn_C::HidingAnimFinishedTimerHandler' has a wrong offset!");

}

