#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Skill_Separate

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_Skill_Separate.WB_Skill_Separate_C.ExecuteUbergraph_WB_Skill_Separate
// 0x0118 (0x0118 - 0x0000)
struct WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacterBase*                CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    K2Node_DynamicCast_AsAJBIn_Game_Character;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameMovableStand_C*            K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBSkillBase_C*                     K2Node_DynamicCast_AsBP_AJBSkill_Base;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_NewState;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PreState;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue1;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBSkillGuideInfo                     K2Node_CustomEvent_AdditionalGuideInfo;            // 0x00A0(0x0028)()
	struct FAJBSkillGuideInfo                     CallFunc_GetGuideInfo_FinalyGuideInfo;             // 0x00C8(0x0028)()
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate) == 0x000008, "Wrong alignment on WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate");
static_assert(sizeof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate) == 0x000118, "Wrong size on WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, EntryPoint) == 0x000000, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_IsValid_ReturnValue1) == 0x000005, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000008, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_AsAJBIn_Game_Character) == 0x000010, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_AsAJBIn_Game_Character' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand) == 0x000020, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_AsBP_AJBIn_Game_Movable_Stand' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_AsBP_AJBSkill_Base) == 0x000030, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_AsBP_AJBSkill_Base' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetValidValue_ReturnValue) == 0x000039, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_Event_MyGeometry) == 0x00003C, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_Event_InDeltaTime) == 0x000074, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_Event_NewState) == 0x000078, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_Event_PreState) == 0x000079, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_Event_PreState' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x00007A, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000080, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetValidValue_ReturnValue1) == 0x000088, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetValidValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x000089, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000090, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, Temp_byte_Variable) == 0x000099, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_CustomEvent_AdditionalGuideInfo) == 0x0000A0, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_CustomEvent_AdditionalGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetGuideInfo_FinalyGuideInfo) == 0x0000C8, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetGuideInfo_FinalyGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x0000F0, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x0000F8, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x000100, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x000108, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, Temp_byte_Variable1) == 0x000110, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, Temp_bool_Variable) == 0x000111, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate, K2Node_Select_Default) == 0x000112, "Member 'WB_Skill_Separate_C_ExecuteUbergraph_WB_Skill_Separate::K2Node_Select_Default' has a wrong offset!");

// Function WB_Skill_Separate.WB_Skill_Separate_C.ShowAdditionalGudie
// 0x0028 (0x0028 - 0x0000)
struct WB_Skill_Separate_C_ShowAdditionalGudie final
{
public:
	struct FAJBSkillGuideInfo                     AdditionalGuideInfo;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_Skill_Separate_C_ShowAdditionalGudie) == 0x000008, "Wrong alignment on WB_Skill_Separate_C_ShowAdditionalGudie");
static_assert(sizeof(WB_Skill_Separate_C_ShowAdditionalGudie) == 0x000028, "Wrong size on WB_Skill_Separate_C_ShowAdditionalGudie");
static_assert(offsetof(WB_Skill_Separate_C_ShowAdditionalGudie, AdditionalGuideInfo) == 0x000000, "Member 'WB_Skill_Separate_C_ShowAdditionalGudie::AdditionalGuideInfo' has a wrong offset!");

// Function WB_Skill_Separate.WB_Skill_Separate_C.OnOwnerSkillStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WB_Skill_Separate_C_OnOwnerSkillStateChanged final
{
public:
	uint8                                         NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_Separate_C_OnOwnerSkillStateChanged) == 0x000001, "Wrong alignment on WB_Skill_Separate_C_OnOwnerSkillStateChanged");
static_assert(sizeof(WB_Skill_Separate_C_OnOwnerSkillStateChanged) == 0x000002, "Wrong size on WB_Skill_Separate_C_OnOwnerSkillStateChanged");
static_assert(offsetof(WB_Skill_Separate_C_OnOwnerSkillStateChanged, NewState) == 0x000000, "Member 'WB_Skill_Separate_C_OnOwnerSkillStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_OnOwnerSkillStateChanged, PreState) == 0x000001, "Member 'WB_Skill_Separate_C_OnOwnerSkillStateChanged::PreState' has a wrong offset!");

// Function WB_Skill_Separate.WB_Skill_Separate_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Skill_Separate_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Skill_Separate_C_Tick) == 0x000004, "Wrong alignment on WB_Skill_Separate_C_Tick");
static_assert(sizeof(WB_Skill_Separate_C_Tick) == 0x00003C, "Wrong size on WB_Skill_Separate_C_Tick");
static_assert(offsetof(WB_Skill_Separate_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Skill_Separate_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Skill_Separate_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Skill_Separate.WB_Skill_Separate_C.GetGuideInfo
// 0x00B8 (0x00B8 - 0x0000)
struct WB_Skill_Separate_C_GetGuideInfo final
{
public:
	struct FAJBSkillGuideInfo                     AdditionalGuideInfo;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAJBSkillGuideInfo                     FinalyGuideInfo;                                   // 0x0028(0x0028)(Parm, OutParm)
	struct FAJBSkillGuideInfo                     TempGuideInfo;                                     // 0x0050(0x0028)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBSkillGuidePairInfo                 CallFunc_Array_Get_Item;                           // 0x0088(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Skill_Separate_C_GetGuideInfo) == 0x000008, "Wrong alignment on WB_Skill_Separate_C_GetGuideInfo");
static_assert(sizeof(WB_Skill_Separate_C_GetGuideInfo) == 0x0000B8, "Wrong size on WB_Skill_Separate_C_GetGuideInfo");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, AdditionalGuideInfo) == 0x000000, "Member 'WB_Skill_Separate_C_GetGuideInfo::AdditionalGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, FinalyGuideInfo) == 0x000028, "Member 'WB_Skill_Separate_C_GetGuideInfo::FinalyGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, TempGuideInfo) == 0x000050, "Member 'WB_Skill_Separate_C_GetGuideInfo::TempGuideInfo' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, Temp_int_Array_Index_Variable) == 0x000078, "Member 'WB_Skill_Separate_C_GetGuideInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WB_Skill_Separate_C_GetGuideInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WB_Skill_Separate_C_GetGuideInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, CallFunc_Array_Get_Item) == 0x000088, "Member 'WB_Skill_Separate_C_GetGuideInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WB_Skill_Separate_C_GetGuideInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, CallFunc_Array_AddUnique_ReturnValue) == 0x0000AC, "Member 'WB_Skill_Separate_C_GetGuideInfo::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Skill_Separate_C_GetGuideInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WB_Skill_Separate_C_GetGuideInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

