#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItem_StatusLockButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton
// 0x00B8 (0x00B8 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          CallFunc_IsLock_result;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor)
	class UTextBlock*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0088(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton) == 0x000008, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton) == 0x0000B8, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, EntryPoint) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, Temp_bool_Variable) == 0x000004, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_IsLock_result) == 0x000030, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_IsLock_result' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_SpawnObject_ReturnValue) == 0x000058, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_AddChildToCanvas_ReturnValue) == 0x000070, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, K2Node_Select_Default) == 0x000078, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, K2Node_MakeStruct_SlateColor1) == 0x000088, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton, CallFunc_Not_PreBool_ReturnValue1) == 0x0000B0, "Member 'WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.SetStatusText
// 0x0018 (0x0018 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_SetStatusText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusText) == 0x000008, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_SetStatusText");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusText) == 0x000018, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_SetStatusText");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusText, Text) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_SetStatusText::Text' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.SetStatusColor
// 0x0048 (0x0048 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor final
{
public:
	struct FLinearColor                           BaseColor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor) == 0x000008, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor) == 0x000048, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor, BaseColor) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor::BaseColor' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor, DarkColor) == 0x000010, "Member 'WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor::DarkColor' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.StartStatusBlink
// 0x0018 (0x0018 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink) == 0x000008, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink) == 0x000018, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.StopStatusBlink
// 0x0028 (0x0028 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink) == 0x000008, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink) == 0x000028, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_PreConstruct) == 0x000001, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_PreConstruct");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_PreConstruct) == 0x000001, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_PreConstruct");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.IsLock
// 0x0002 (0x0002 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_IsLock final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLock_result;                            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TestModeMenuItem_StatusLockButton_C_IsLock) == 0x000001, "Wrong alignment on WB_TestModeMenuItem_StatusLockButton_C_IsLock");
static_assert(sizeof(WB_TestModeMenuItem_StatusLockButton_C_IsLock) == 0x000002, "Wrong size on WB_TestModeMenuItem_StatusLockButton_C_IsLock");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_IsLock, Result) == 0x000000, "Member 'WB_TestModeMenuItem_StatusLockButton_C_IsLock::Result' has a wrong offset!");
static_assert(offsetof(WB_TestModeMenuItem_StatusLockButton_C_IsLock, CallFunc_IsLock_result) == 0x000001, "Member 'WB_TestModeMenuItem_StatusLockButton_C_IsLock::CallFunc_IsLock_result' has a wrong offset!");

}

