#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TournamentModeText

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TournamentModeText.WB_TournamentModeText_C
// 0x0020 (0x0228 - 0x0208)
class UWB_TournamentModeText_C final : public UUserWidget
{
public:
	class UWB_TournamentModeTextButtonGuide_C*    WB_TournamentModeTextButtonGuide;                  // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentModeTextButtonGuide_C*    WB_TournamentModeTextButtonGuide_C_0;              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentModeTextButtonGuide_C*    WB_TournamentModeTextButtonGuide_C_1;              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentModeTextButtonGuide_C*    WB_TournamentModeTextButtonGuide_C_2;              // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TournamentModeText_C">();
	}
	static class UWB_TournamentModeText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TournamentModeText_C>();
	}
};
static_assert(alignof(UWB_TournamentModeText_C) == 0x000008, "Wrong alignment on UWB_TournamentModeText_C");
static_assert(sizeof(UWB_TournamentModeText_C) == 0x000228, "Wrong size on UWB_TournamentModeText_C");
static_assert(offsetof(UWB_TournamentModeText_C, WB_TournamentModeTextButtonGuide) == 0x000208, "Member 'UWB_TournamentModeText_C::WB_TournamentModeTextButtonGuide' has a wrong offset!");
static_assert(offsetof(UWB_TournamentModeText_C, WB_TournamentModeTextButtonGuide_C_0) == 0x000210, "Member 'UWB_TournamentModeText_C::WB_TournamentModeTextButtonGuide_C_0' has a wrong offset!");
static_assert(offsetof(UWB_TournamentModeText_C, WB_TournamentModeTextButtonGuide_C_1) == 0x000218, "Member 'UWB_TournamentModeText_C::WB_TournamentModeTextButtonGuide_C_1' has a wrong offset!");
static_assert(offsetof(UWB_TournamentModeText_C, WB_TournamentModeTextButtonGuide_C_2) == 0x000220, "Member 'UWB_TournamentModeText_C::WB_TournamentModeTextButtonGuide_C_2' has a wrong offset!");

}

