#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VictoryShotCameraGuide

#include "Basic.hpp"

#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_VictoryShotCameraGuide.WB_VictoryShotCameraGuide_C.UpdateShotPadType
// 0x0005 (0x0005 - 0x0000)
struct WB_VictoryShotCameraGuide_C_UpdateShotPadType final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBPadIconType                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBPadIconType                               Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseYButtonAsVictoryShot_ReturnValue;   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBPadIconType                               K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_VictoryShotCameraGuide_C_UpdateShotPadType) == 0x000001, "Wrong alignment on WB_VictoryShotCameraGuide_C_UpdateShotPadType");
static_assert(sizeof(WB_VictoryShotCameraGuide_C_UpdateShotPadType) == 0x000005, "Wrong size on WB_VictoryShotCameraGuide_C_UpdateShotPadType");
static_assert(offsetof(WB_VictoryShotCameraGuide_C_UpdateShotPadType, Temp_bool_Variable) == 0x000000, "Member 'WB_VictoryShotCameraGuide_C_UpdateShotPadType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_VictoryShotCameraGuide_C_UpdateShotPadType, Temp_byte_Variable) == 0x000001, "Member 'WB_VictoryShotCameraGuide_C_UpdateShotPadType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_VictoryShotCameraGuide_C_UpdateShotPadType, Temp_byte_Variable1) == 0x000002, "Member 'WB_VictoryShotCameraGuide_C_UpdateShotPadType::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_VictoryShotCameraGuide_C_UpdateShotPadType, CallFunc_GetUseYButtonAsVictoryShot_ReturnValue) == 0x000003, "Member 'WB_VictoryShotCameraGuide_C_UpdateShotPadType::CallFunc_GetUseYButtonAsVictoryShot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_VictoryShotCameraGuide_C_UpdateShotPadType, K2Node_Select_Default) == 0x000004, "Member 'WB_VictoryShotCameraGuide_C_UpdateShotPadType::K2Node_Select_Default' has a wrong offset!");

}

