#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VictoryShotCameraflash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_VictoryShotCameraflash.WB_VictoryShotCameraFlash_C
// 0x0048 (0x0250 - 0x0208)
class UWB_VictoryShotCameraFlash_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FlashFadeIn;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flash;                                             // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Fade_Add;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Fade_Translucent;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnFlashDispatcher;                                 // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnFinishedFlashAnimationDispatcher;                // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Flash_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__FlashFadeIn_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ExecuteUbergraph_WB_VictoryShotCameraFlash(int32 EntryPoint);
	void PlayFadeIn();
	void PlayFlash();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_VictoryShotCameraFlash_C">();
	}
	static class UWB_VictoryShotCameraFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_VictoryShotCameraFlash_C>();
	}
};
static_assert(alignof(UWB_VictoryShotCameraFlash_C) == 0x000008, "Wrong alignment on UWB_VictoryShotCameraFlash_C");
static_assert(sizeof(UWB_VictoryShotCameraFlash_C) == 0x000250, "Wrong size on UWB_VictoryShotCameraFlash_C");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, UberGraphFrame) == 0x000208, "Member 'UWB_VictoryShotCameraFlash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, FlashFadeIn) == 0x000210, "Member 'UWB_VictoryShotCameraFlash_C::FlashFadeIn' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, Flash) == 0x000218, "Member 'UWB_VictoryShotCameraFlash_C::Flash' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, Fade_Add) == 0x000220, "Member 'UWB_VictoryShotCameraFlash_C::Fade_Add' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, Fade_Translucent) == 0x000228, "Member 'UWB_VictoryShotCameraFlash_C::Fade_Translucent' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, OnFlashDispatcher) == 0x000230, "Member 'UWB_VictoryShotCameraFlash_C::OnFlashDispatcher' has a wrong offset!");
static_assert(offsetof(UWB_VictoryShotCameraFlash_C, OnFinishedFlashAnimationDispatcher) == 0x000240, "Member 'UWB_VictoryShotCameraFlash_C::OnFinishedFlashAnimationDispatcher' has a wrong offset!");

}

