#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VirusCapsule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_VirusCapsule.WB_VirusCapsule_C
// 0x0020 (0x0228 - 0x0208)
class UWB_VirusCapsule_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       ActiveAnim;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Capsule;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Capsule;                                       // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_VirusCapsule(int32 EntryPoint);
	void Update_CapsuleFill(bool IsFill);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_VirusCapsule_C">();
	}
	static class UWB_VirusCapsule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_VirusCapsule_C>();
	}
};
static_assert(alignof(UWB_VirusCapsule_C) == 0x000008, "Wrong alignment on UWB_VirusCapsule_C");
static_assert(sizeof(UWB_VirusCapsule_C) == 0x000228, "Wrong size on UWB_VirusCapsule_C");
static_assert(offsetof(UWB_VirusCapsule_C, UberGraphFrame) == 0x000208, "Member 'UWB_VirusCapsule_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_VirusCapsule_C, ActiveAnim) == 0x000210, "Member 'UWB_VirusCapsule_C::ActiveAnim' has a wrong offset!");
static_assert(offsetof(UWB_VirusCapsule_C, Capsule) == 0x000218, "Member 'UWB_VirusCapsule_C::Capsule' has a wrong offset!");
static_assert(offsetof(UWB_VirusCapsule_C, DMI_Capsule) == 0x000220, "Member 'UWB_VirusCapsule_C::DMI_Capsule' has a wrong offset!");

}

