#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Window_SelectOperationType

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.ExecuteUbergraph_WB_Window_SelectOperationType
// 0x0108 (0x0108 - 0x0000)
struct WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess2;             // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess3;             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess4;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess5;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess6;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGamePlayerController_C*        CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType) == 0x000008, "Wrong alignment on WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType");
static_assert(sizeof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType) == 0x000108, "Wrong size on WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, EntryPoint) == 0x000000, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess) == 0x000005, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD) == 0x000008, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_ComponentBoundEvent_OwnerWidget) == 0x000010, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_ComponentBoundEvent_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_ComponentBoundEvent_TargetButton) == 0x000018, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_ComponentBoundEvent_TargetButton' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_ComponentBoundEvent_OwnerWidget1) == 0x000020, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_ComponentBoundEvent_OwnerWidget1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_ComponentBoundEvent_TargetButton1) == 0x000028, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_ComponentBoundEvent_TargetButton1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_Event_MyGeometry) == 0x000030, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess1) == 0x00006C, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1) == 0x000070, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000078, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_FMax_ReturnValue) == 0x000080, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000084, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000085, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess2) == 0x000086, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess2' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2) == 0x000088, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD2' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x0000A0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_Greater_FloatFloat_ReturnValue4) == 0x0000A1, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_Greater_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess3) == 0x0000A2, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess3' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3) == 0x0000A8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD3' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000B0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess4) == 0x0000B1, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess4' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4) == 0x0000B8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD4' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x0000C0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess5) == 0x0000C8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess5' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5) == 0x0000D0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD5' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_bSuccess6) == 0x0000D8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_bSuccess6' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6) == 0x0000E0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGameHUD_BP_In_Game_HUD6' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess) == 0x0000E8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP) == 0x0000F0, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1) == 0x0000F8, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGamePlayerControllerBP_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType, CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1) == 0x000100, "Member 'WB_Window_SelectOperationType_C_ExecuteUbergraph_WB_Window_SelectOperationType::CallFunc_GetAJBInGamePlayerControllerBP_In_Game_Player_Controller_BP1' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Window_SelectOperationType_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Window_SelectOperationType_C_Tick) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_Tick");
static_assert(sizeof(WB_Window_SelectOperationType_C_Tick) == 0x00003C, "Wrong size on WB_Window_SelectOperationType_C_Tick");
static_assert(offsetof(WB_Window_SelectOperationType_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Window_SelectOperationType_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Window_SelectOperationType_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_C_3_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(sizeof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature) == 0x000010, "Wrong size on WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature");
static_assert(offsetof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, OwnerWidget) == 0x000000, "Member 'WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature, TargetButton) == 0x000008, "Member 'WB_Window_SelectOperationType_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature::TargetButton' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.GetButtonResult
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_GetButtonResult final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Window_SelectOperationType_C_GetButtonResult) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_GetButtonResult");
static_assert(sizeof(WB_Window_SelectOperationType_C_GetButtonResult) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_GetButtonResult");
static_assert(offsetof(WB_Window_SelectOperationType_C_GetButtonResult, Result) == 0x000000, "Member 'WB_Window_SelectOperationType_C_GetButtonResult::Result' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedUp) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedUp");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedUp) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedUp");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedUp, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedUp::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedRight) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedRight");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedRight) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedRight");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedRight, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedRight::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedLeft) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedLeft");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedLeft) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedLeft");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedLeft, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedLeft::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedDown) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedDown");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedDown) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedDown");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedDown, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedDown::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedDecide) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedDecide");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedDecide) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedDecide");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedDecide, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedDecide::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedCancel) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedCancel");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedCancel) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedCancel");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedCancel, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedCancel::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedUp) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedUp");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedUp) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedUp");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedUp, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedUp::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedRight) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedRight");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedRight) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedRight");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedRight, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedRight::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedLeft) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedLeft");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedLeft) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedLeft");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedLeft, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedLeft::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedDown) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedDown");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedDown) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedDown");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedDown, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedDown::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedDecide) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedDecide");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedDecide) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedDecide");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedDecide, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedDecide::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedCancel) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedCancel");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedCancel) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedCancel");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedCancel, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedCancel::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputTurnRate) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputTurnRate");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputTurnRate) == 0x000008, "Wrong size on WB_Window_SelectOperationType_C_OnInputTurnRate");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputTurnRate, Value) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputTurnRate::Value' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputTurnRate, ReturnValue) == 0x000004, "Member 'WB_Window_SelectOperationType_C_OnInputTurnRate::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedTouch) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedTouch");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedTouch) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedTouch");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedTouch, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedTouch::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedTouch) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedTouch");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedTouch) == 0x00000C, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedTouch");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedTouch, LocationX) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedTouch::LocationX' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedTouch, LocationY) == 0x000004, "Member 'WB_Window_SelectOperationType_C_OnInputPressedTouch::LocationY' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedTouch, ReturnValue) == 0x000008, "Member 'WB_Window_SelectOperationType_C_OnInputPressedTouch::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputMoveRight) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputMoveRight");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputMoveRight) == 0x000008, "Wrong size on WB_Window_SelectOperationType_C_OnInputMoveRight");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputMoveRight, Value) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputMoveRight::Value' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputMoveRight, ReturnValue) == 0x000004, "Member 'WB_Window_SelectOperationType_C_OnInputMoveRight::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputMoveForward) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputMoveForward");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputMoveForward) == 0x000008, "Wrong size on WB_Window_SelectOperationType_C_OnInputMoveForward");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputMoveForward, Value) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputMoveForward::Value' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputMoveForward, ReturnValue) == 0x000004, "Member 'WB_Window_SelectOperationType_C_OnInputMoveForward::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputLookupRate) == 0x000004, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputLookupRate");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputLookupRate) == 0x000008, "Wrong size on WB_Window_SelectOperationType_C_OnInputLookupRate");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputLookupRate, Value) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputLookupRate::Value' has a wrong offset!");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputLookupRate, ReturnValue) == 0x000004, "Member 'WB_Window_SelectOperationType_C_OnInputLookupRate::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_IsModeless) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_IsModeless");
static_assert(sizeof(WB_Window_SelectOperationType_C_IsModeless) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_IsModeless");
static_assert(offsetof(WB_Window_SelectOperationType_C_IsModeless, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_IsModeless::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedR2) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedR2");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedR2) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedR2");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedR2, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedR2::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedR1) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedR1");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedR1) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedR1");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedR1, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedR1::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedL3) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedL3");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedL3) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedL3");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedL3, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedL3::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedL2) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedL2");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedL2) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedL2");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedL2, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedL2::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputReleasedL1) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputReleasedL1");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputReleasedL1) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputReleasedL1");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputReleasedL1, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputReleasedL1::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedR2) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedR2");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedR2) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedR2");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedR2, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedR2::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedR1) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedR1");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedR1) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedR1");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedR1, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedR1::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedL3) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedL3");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedL3) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedL3");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedL3, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedL3::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedL2) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedL2");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedL2) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedL2");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedL2, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedL2::ReturnValue' has a wrong offset!");

// Function WB_Window_SelectOperationType.WB_Window_SelectOperationType_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Window_SelectOperationType_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Window_SelectOperationType_C_OnInputPressedL1) == 0x000001, "Wrong alignment on WB_Window_SelectOperationType_C_OnInputPressedL1");
static_assert(sizeof(WB_Window_SelectOperationType_C_OnInputPressedL1) == 0x000001, "Wrong size on WB_Window_SelectOperationType_C_OnInputPressedL1");
static_assert(offsetof(WB_Window_SelectOperationType_C_OnInputPressedL1, ReturnValue) == 0x000000, "Member 'WB_Window_SelectOperationType_C_OnInputPressedL1::ReturnValue' has a wrong offset!");

}

