#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_WinEffect

#include "Basic.hpp"

#include "ETrainingCPUStrength_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


namespace SDK::Params
{

// Function WB_WinEffect.WB_WinEffect_C.ExecuteUbergraph_WB_WinEffect
// 0x01F0 (0x01F0 - 0x0000)
struct WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETrainingCPUStrength                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0050(0x0018)()
	ETrainingCPUStrength                          Temp_byte_Variable1;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate;      // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable1;                             // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable3;                             // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BMax_ReturnValue;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
	struct FGameplayTag                           K2Node_Select1_Default;                            // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerID;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess1;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance1;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchingPlayerInfo                    CallFunc_TryGetMatchingPlayerInfoByPlayerID_Out;   // 0x0138(0x0088)()
	bool                                          CallFunc_TryGetMatchingPlayerInfoByPlayerID_ReturnValue; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect) == 0x000008, "Wrong alignment on WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect");
static_assert(sizeof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect) == 0x0001F0, "Wrong size on WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, EntryPoint) == 0x000000, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_byte_Variable) == 0x000004, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_text_Variable) == 0x000008, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_text_Variable1) == 0x000020, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_text_Variable2) == 0x000038, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_text_Variable3) == 0x000050, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_byte_Variable1) == 0x000068, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_struct_Variable) == 0x000080, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_struct_Variable1) == 0x000088, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_struct_Variable2) == 0x000090, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, Temp_struct_Variable3) == 0x000098, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A0, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_CreateDelegate_OutputDelegate1) == 0x0000B8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_PlayModeEquals_bResult) == 0x0000D8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_PlayModeEquals_bResult' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_GetAJBGameInstance_bSuccess) == 0x0000D9, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x0000E0, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_Subtract_ByteByte_ReturnValue) == 0x0000E9, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_CustomEvent_TargetWidget) == 0x0000F0, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_BMax_ReturnValue) == 0x0000F8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_BMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_GetValidValue_ReturnValue) == 0x0000F9, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_MakeLiteralByte_ReturnValue1) == 0x0000FA, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_Select_Default) == 0x000100, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_Select1_Default) == 0x000118, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000120, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_CustomEvent_PlayerID) == 0x000128, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_CustomEvent_PlayerID' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_GetAJBGameInstance_bSuccess1) == 0x00012C, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_GetAJBGameInstance_bSuccess1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_GetAJBGameInstance_AJB_Game_Instance1) == 0x000130, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_GetAJBGameInstance_AJB_Game_Instance1' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_TryGetMatchingPlayerInfoByPlayerID_Out) == 0x000138, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_TryGetMatchingPlayerInfoByPlayerID_Out' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_TryGetMatchingPlayerInfoByPlayerID_ReturnValue) == 0x0001C0, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_TryGetMatchingPlayerInfoByPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_Create_ReturnValue) == 0x0001C8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect, K2Node_SwitchEnum_CmpSuccess) == 0x0001E8, "Member 'WB_WinEffect_C_ExecuteUbergraph_WB_WinEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_WinEffect.WB_WinEffect_C.SetupPlayerID
// 0x0004 (0x0004 - 0x0000)
struct WB_WinEffect_C_SetupPlayerID final
{
public:
	int32                                         PlayerID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_WinEffect_C_SetupPlayerID) == 0x000004, "Wrong alignment on WB_WinEffect_C_SetupPlayerID");
static_assert(sizeof(WB_WinEffect_C_SetupPlayerID) == 0x000004, "Wrong size on WB_WinEffect_C_SetupPlayerID");
static_assert(offsetof(WB_WinEffect_C_SetupPlayerID, PlayerID) == 0x000000, "Member 'WB_WinEffect_C_SetupPlayerID::PlayerID' has a wrong offset!");

// Function WB_WinEffect.WB_WinEffect_C.OnClosedTrainingClear
// 0x0008 (0x0008 - 0x0000)
struct WB_WinEffect_C_OnClosedTrainingClear final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_WinEffect_C_OnClosedTrainingClear) == 0x000008, "Wrong alignment on WB_WinEffect_C_OnClosedTrainingClear");
static_assert(sizeof(WB_WinEffect_C_OnClosedTrainingClear) == 0x000008, "Wrong size on WB_WinEffect_C_OnClosedTrainingClear");
static_assert(offsetof(WB_WinEffect_C_OnClosedTrainingClear, TargetWidget) == 0x000000, "Member 'WB_WinEffect_C_OnClosedTrainingClear::TargetWidget' has a wrong offset!");

// Function WB_WinEffect.WB_WinEffect_C.RequestSound
// 0x0028 (0x0028 - 0x0000)
struct WB_WinEffect_C_RequestSound final
{
public:
	struct FGameplayTag                           SoundTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutedReplay_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_WinEffect_C_RequestSound) == 0x000008, "Wrong alignment on WB_WinEffect_C_RequestSound");
static_assert(sizeof(WB_WinEffect_C_RequestSound) == 0x000028, "Wrong size on WB_WinEffect_C_RequestSound");
static_assert(offsetof(WB_WinEffect_C_RequestSound, SoundTag) == 0x000000, "Member 'WB_WinEffect_C_RequestSound::SoundTag' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_RequestSound, CallFunc_GetAJBGameInstance_bSuccess) == 0x000008, "Member 'WB_WinEffect_C_RequestSound::CallFunc_GetAJBGameInstance_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_RequestSound, CallFunc_GetAJBGameInstance_AJB_Game_Instance) == 0x000010, "Member 'WB_WinEffect_C_RequestSound::CallFunc_GetAJBGameInstance_AJB_Game_Instance' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_RequestSound, CallFunc_RequestWwiseEventOnLocal_AkComponent) == 0x000018, "Member 'WB_WinEffect_C_RequestSound::CallFunc_RequestWwiseEventOnLocal_AkComponent' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_RequestSound, CallFunc_IsExecutedReplay_ReturnValue) == 0x000020, "Member 'WB_WinEffect_C_RequestSound::CallFunc_IsExecutedReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_WinEffect_C_RequestSound, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'WB_WinEffect_C_RequestSound::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

